; ModuleID = 'cmdLineParser.c'
source_filename = "cmdLineParser.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MyOptionSt = type { i8*, i8*, [2 x i8], i32, i8, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }

@myargs = internal unnamed_addr global %struct.MyOptionSt* null, align 8, !dbg !0
@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [20 x i8] c"\0A  Arguments are: \0A\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"   --%%-%ds\00", align 1
@longest = internal unnamed_addr global i32 1, align 4, !dbg !68
@.str.3 = private unnamed_addr constant [27 x i8] c" -%c  arg=%1d type=%c  %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [42 x i8] c"\0A\0A    invalid switch : -%c in getopt()\0A\0A\0A\00", align 1
@optarg = external dso_local local_unnamed_addr global i8*, align 8
@.str.7 = private unnamed_addr constant [3 x i8] c"%d\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "myargs", scope: !2, file: !3, line: 34, type: !9, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !53, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "cmdLineParser.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!4 = !{}
!5 = !{!6, !7, !9, !14, !27, !38, !36, !45, !47, !49, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyOption", file: !3, line: 31, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MyOptionSt", file: !3, line: 21, size: 384, elements: !12)
!12 = !{!13, !16, !17, !21, !23, !24, !25, !26}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !11, file: !3, line: 23, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "longArg", scope: !11, file: !3, line: 24, baseType: !14, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "shortArg", scope: !11, file: !3, line: 25, baseType: !18, size: 16, offset: 128)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 2)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "argFlag", scope: !11, file: !3, line: 26, baseType: !22, size: 32, offset: 160)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !11, file: !3, line: 27, baseType: !15, size: 8, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !11, file: !3, line: 28, baseType: !22, size: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, file: !3, line: 29, baseType: !6, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !3, line: 30, baseType: !6, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !29, line: 50, size: 256, elements: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!30 = !{!31, !34, !35, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !29, line: 52, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !28, file: !29, line: 55, baseType: !22, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !28, file: !29, line: 56, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !28, file: !29, line: 57, baseType: !22, size: 32, offset: 192)
!38 = !DISubprogram(name: "getopt_long", scope: !29, file: !29, line: 66, type: !39, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!39 = !DISubroutineType(types: !40)
!40 = !{!22, !22, !41, !32, !43, !36}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!49 = !DISubprogram(name: "free", scope: !50, file: !50, line: 565, type: !51, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!50 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !6}
!53 = !{!54, !0, !68}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "iBase", scope: !56, file: !3, line: 49, type: !22, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "myOptionAlloc", scope: !3, file: !3, line: 45, type: !57, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!9, !32, !33, !22, !33, !6, !22, !32}
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67}
!60 = !DILocalVariable(name: "longOption", arg: 1, scope: !56, file: !3, line: 46, type: !32)
!61 = !DILocalVariable(name: "shortOption", arg: 2, scope: !56, file: !3, line: 46, type: !33)
!62 = !DILocalVariable(name: "has_arg", arg: 3, scope: !56, file: !3, line: 47, type: !22)
!63 = !DILocalVariable(name: "type", arg: 4, scope: !56, file: !3, line: 47, type: !33)
!64 = !DILocalVariable(name: "dataPtr", arg: 5, scope: !56, file: !3, line: 47, type: !6)
!65 = !DILocalVariable(name: "dataSize", arg: 6, scope: !56, file: !3, line: 47, type: !22)
!66 = !DILocalVariable(name: "help", arg: 7, scope: !56, file: !3, line: 47, type: !32)
!67 = !DILocalVariable(name: "o", scope: !56, file: !3, line: 50, type: !9)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "longest", scope: !2, file: !3, line: 33, type: !22, isLocal: true, isDefinition: true)
!70 = !{i32 7, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{i32 1, !"wchar_size", i32 4}
!73 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!74 = distinct !DISubprogram(name: "addArg", scope: !3, file: !3, line: 96, type: !75, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !77)
!75 = !DISubroutineType(types: !76)
!76 = !{!22, !32, !33, !22, !33, !6, !22, !32}
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DILocalVariable(name: "longOption", arg: 1, scope: !74, file: !3, line: 96, type: !32)
!79 = !DILocalVariable(name: "shortOption", arg: 2, scope: !74, file: !3, line: 96, type: !33)
!80 = !DILocalVariable(name: "has_arg", arg: 3, scope: !74, file: !3, line: 97, type: !22)
!81 = !DILocalVariable(name: "type", arg: 4, scope: !74, file: !3, line: 97, type: !33)
!82 = !DILocalVariable(name: "dataPtr", arg: 5, scope: !74, file: !3, line: 97, type: !6)
!83 = !DILocalVariable(name: "dataSize", arg: 6, scope: !74, file: !3, line: 97, type: !22)
!84 = !DILocalVariable(name: "help", arg: 7, scope: !74, file: !3, line: 98, type: !32)
