; ModuleID = 'CoMD.c'
source_filename = "CoMD.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BasePotentialSt = type { double, double, double, [8 x i8], [3 x i8], i32, i32 (%struct.SimFlatSt*)*, void (%struct._IO_FILE*, %struct.BasePotentialSt*)*, void (%struct.BasePotentialSt**)* }
%struct.SimFlatSt = type { i32, i32, double, %struct.DomainSt*, %struct.LinkCellSt*, %struct.AtomsSt*, %struct.SpeciesDataSt*, double, double, %struct.BasePotentialSt*, %struct.HaloExchangeSt* }
%struct.DomainSt = type { [3 x i32], [3 x i32], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }
%struct.LinkCellSt = type { [3 x i32], i32, i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], i32* }
%struct.AtomsSt = type { i32, i32, i32*, i32*, [3 x double]*, [3 x double]*, [3 x double]*, double* }
%struct.SpeciesDataSt = type { [3 x i8], i32, double }
%struct.HaloExchangeSt = type { [6 x i32], i32, i32 (i8*, i8*, i32, i8*)*, void (i8*, i8*, i32, i32, i8*)*, void (i8*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "iStepPrev", scope: !2, file: !3, line: 347, type: !12, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "printThings", scope: !3, file: !3, line: 344, type: !4, scopeLine: 345, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !357)
!3 = !DIFile(filename: "CoMD.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !12, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "SimFlat", file: !8, line: 83, baseType: !9)
!8 = !DIFile(filename: "./CoMDTypes.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimFlatSt", file: !8, line: 62, size: 640, elements: !10)
!10 = !{!11, !13, !14, !16, !37, !53, !69, !79, !80, !81, !171}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !9, file: !8, line: 64, baseType: !12, size: 32)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !9, file: !8, line: 65, baseType: !12, size: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !9, file: !8, line: 66, baseType: !15, size: 64, offset: 64)
!15 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !9, file: !8, line: 68, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Domain", file: !19, line: 25, baseType: !20)
!19 = !DIFile(filename: "./decomposition.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DomainSt", file: !19, line: 10, size: 1344, elements: !21)
!21 = !{!22, !26, !27, !32, !33, !34, !35, !36}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "procGrid", scope: !20, file: !19, line: 13, baseType: !23, size: 96)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 3)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "procCoord", scope: !20, file: !19, line: 14, baseType: !23, size: 96, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "globalMin", scope: !20, file: !19, line: 17, baseType: !28, size: 192, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "real3", file: !29, line: 18, baseType: !30)
!29 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, elements: !24)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !29, line: 13, baseType: !15)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "globalMax", scope: !20, file: !19, line: 18, baseType: !28, size: 192, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "globalExtent", scope: !20, file: !19, line: 19, baseType: !28, size: 192, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !20, file: !19, line: 22, baseType: !28, size: 192, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !20, file: !19, line: 23, baseType: !28, size: 192, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "localExtent", scope: !20, file: !19, line: 24, baseType: !28, size: 192, offset: 1152)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !9, file: !8, line: 70, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkCell", file: !40, line: 30, baseType: !41)
!40 = !DIFile(filename: "./linkCells.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkCellSt", file: !40, line: 17, size: 1024, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "gridSize", scope: !41, file: !40, line: 19, baseType: !23, size: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nLocalBoxes", scope: !41, file: !40, line: 20, baseType: !12, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nHaloBoxes", scope: !41, file: !40, line: 21, baseType: !12, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nTotalBoxes", scope: !41, file: !40, line: 22, baseType: !12, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !41, file: !40, line: 24, baseType: !28, size: 192, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !41, file: !40, line: 25, baseType: !28, size: 192, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "boxSize", scope: !41, file: !40, line: 26, baseType: !28, size: 192, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "invBoxSize", scope: !41, file: !40, line: 27, baseType: !28, size: 192, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms", scope: !41, file: !40, line: 29, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !9, file: !8, line: 72, baseType: !54, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atoms", file: !56, line: 26, baseType: !57)
!56 = !DIFile(filename: "./initAtoms.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomsSt", file: !56, line: 13, size: 448, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !65, !66, !67}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nLocal", scope: !57, file: !56, line: 16, baseType: !12, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nGlobal", scope: !57, file: !56, line: 17, baseType: !12, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !57, file: !56, line: 19, baseType: !52, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "iSpecies", scope: !57, file: !56, line: 20, baseType: !52, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !57, file: !56, line: 22, baseType: !64, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !57, file: !56, line: 23, baseType: !64, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !57, file: !56, line: 24, baseType: !64, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !57, file: !56, line: 25, baseType: !68, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "species", scope: !9, file: !8, line: 74, baseType: !70, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeciesData", file: !8, line: 48, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeciesDataSt", file: !8, line: 43, size: 128, elements: !73)
!73 = !{!74, !77, !78}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !8, line: 45, baseType: !75, size: 24)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, elements: !24)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !72, file: !8, line: 46, baseType: !12, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !72, file: !8, line: 47, baseType: !31, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ePotential", scope: !9, file: !8, line: 76, baseType: !31, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "eKinetic", scope: !9, file: !8, line: 77, baseType: !31, size: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pot", scope: !9, file: !8, line: 79, baseType: !82, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BasePotential", file: !8, line: 39, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BasePotentialSt", file: !8, line: 28, size: 512, elements: !85)
!85 = !{!86, !87, !88, !89, !93, !94, !95, !100, !166}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !84, file: !8, line: 30, baseType: !31, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !84, file: !8, line: 31, baseType: !31, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !84, file: !8, line: 32, baseType: !31, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !84, file: !8, line: 33, baseType: !90, size: 64, offset: 192)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !8, line: 34, baseType: !75, size: 24, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !84, file: !8, line: 35, baseType: !12, size: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !84, file: !8, line: 36, baseType: !96, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!12, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !84, file: !8, line: 37, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104, !165}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !106, line: 7, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !108, line: 49, size: 1728, elements: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!109 = !{!110, !111, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !126, !128, !129, !130, !134, !136, !138, !142, !145, !147, !150, !153, !154, !156, !160, !161}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !107, file: !108, line: 51, baseType: !12, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !107, file: !108, line: 54, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !107, file: !108, line: 55, baseType: !112, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !107, file: !108, line: 56, baseType: !112, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !107, file: !108, line: 57, baseType: !112, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !107, file: !108, line: 58, baseType: !112, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !107, file: !108, line: 59, baseType: !112, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !107, file: !108, line: 60, baseType: !112, size: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !107, file: !108, line: 61, baseType: !112, size: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !107, file: !108, line: 64, baseType: !112, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !107, file: !108, line: 65, baseType: !112, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !107, file: !108, line: 66, baseType: !112, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !107, file: !108, line: 68, baseType: !124, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !108, line: 36, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !107, file: !108, line: 70, baseType: !127, size: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !107, file: !108, line: 72, baseType: !12, size: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !107, file: !108, line: 73, baseType: !12, size: 32, offset: 928)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !107, file: !108, line: 74, baseType: !131, size: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !132, line: 152, baseType: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!133 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !107, file: !108, line: 77, baseType: !135, size: 16, offset: 1024)
!135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !107, file: !108, line: 78, baseType: !137, size: 8, offset: 1040)
!137 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !107, file: !108, line: 79, baseType: !139, size: 8, offset: 1048)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !107, file: !108, line: 81, baseType: !143, size: 64, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !108, line: 43, baseType: null)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !107, file: !108, line: 89, baseType: !146, size: 64, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !132, line: 153, baseType: !133)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !107, file: !108, line: 91, baseType: !148, size: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !108, line: 37, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !107, file: !108, line: 92, baseType: !151, size: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !108, line: 38, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !107, file: !108, line: 93, baseType: !127, size: 64, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !107, file: !108, line: 94, baseType: !155, size: 64, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !107, file: !108, line: 95, baseType: !157, size: 64, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 46, baseType: !159)
!158 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!159 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !107, file: !108, line: 96, baseType: !12, size: 32, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !107, file: !108, line: 98, baseType: !162, size: 160, offset: 1568)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 20)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !84, file: !8, line: 38, baseType: !167, size: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "atomExchange", scope: !9, file: !8, line: 81, baseType: !172, size: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloExchange", file: !174, line: 69, baseType: !175)
!174 = !DIFile(filename: "./haloExchange.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloExchangeSt", file: !174, line: 26, size: 512, elements: !176)
!176 = !{!177, !181, !182, !186, !190, !194}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nbrRank", scope: !175, file: !174, line: 30, baseType: !178, size: 192)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 6)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bufCapacity", scope: !175, file: !174, line: 33, baseType: !12, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "loadBuffer", scope: !175, file: !174, line: 47, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!12, !155, !155, !12, !112}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "unloadBuffer", scope: !175, file: !174, line: 61, baseType: !187, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !155, !155, !12, !12, !112}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !175, file: !174, line: 64, baseType: !191, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !155}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !175, file: !174, line: 67, baseType: !155, size: 64, offset: 448)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !196, retainedTypes: !213, globals: !350, splitDebugInlining: false, nameTableKind: None)
!196 = !{!197}
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimerHandle", file: !198, line: 9, baseType: !199, size: 32, elements: !200)
!198 = !DIFile(filename: "./performanceTimers.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!199 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!201 = !DIEnumerator(name: "totalTimer", value: 0, isUnsigned: true)
!202 = !DIEnumerator(name: "loopTimer", value: 1, isUnsigned: true)
!203 = !DIEnumerator(name: "timestepTimer", value: 2, isUnsigned: true)
!204 = !DIEnumerator(name: "positionTimer", value: 3, isUnsigned: true)
!205 = !DIEnumerator(name: "velocityTimer", value: 4, isUnsigned: true)
!206 = !DIEnumerator(name: "redistributeTimer", value: 5, isUnsigned: true)
!207 = !DIEnumerator(name: "atomHaloTimer", value: 6, isUnsigned: true)
!208 = !DIEnumerator(name: "computeForceTimer", value: 7, isUnsigned: true)
!209 = !DIEnumerator(name: "eamHaloTimer", value: 8, isUnsigned: true)
!210 = !DIEnumerator(name: "commHaloTimer", value: 9, isUnsigned: true)
!211 = !DIEnumerator(name: "commReduceTimer", value: 10, isUnsigned: true)
!212 = !DIEnumerator(name: "numberOfTimers", value: 11, isUnsigned: true)
!213 = !{!214, !221, !224, !229, !233, !258, !262, !263, !266, !270, !273, !274, !277, !279, !284, !290, !294, !297, !300, !301, !305, !308, !309, !310, !314, !318, !321, !322, !325, !329, !332, !336, !337, !338, !339, !342, !15, !346, !349}
!214 = !DISubprogram(name: "initParallel", scope: !215, file: !215, line: 29, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!215 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!216 = !DISubroutineType(types: !217)
!217 = !{null, !52, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!220 = !{}
!221 = !DISubprogram(name: "profileStart", scope: !198, file: !198, line: 57, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !197}
!224 = !DISubprogram(name: "timestampBarrier", scope: !215, file: !215, line: 26, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!229 = !DISubprogram(name: "yamlAppInfo", scope: !230, file: !230, line: 15, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!230 = !DIFile(filename: "./yamlOutput.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!231 = !DISubroutineType(types: !232)
!232 = !{null, !127}
!233 = !DISubprogram(name: "parseCommandLine", scope: !234, file: !234, line: 32, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!234 = !DIFile(filename: "./mycommand.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !12, !219}
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CommandSt", file: !234, line: 11, size: 25152, elements: !238)
!238 = !{!239, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "potDir", scope: !237, file: !234, line: 13, baseType: !240, size: 8192)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "potName", scope: !237, file: !234, line: 14, baseType: !240, size: 8192, offset: 8192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "potType", scope: !237, file: !234, line: 15, baseType: !240, size: 8192, offset: 16384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "doeam", scope: !237, file: !234, line: 16, baseType: !12, size: 32, offset: 24576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !237, file: !234, line: 17, baseType: !12, size: 32, offset: 24608)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !237, file: !234, line: 18, baseType: !12, size: 32, offset: 24640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !237, file: !234, line: 19, baseType: !12, size: 32, offset: 24672)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xproc", scope: !237, file: !234, line: 20, baseType: !12, size: 32, offset: 24704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "yproc", scope: !237, file: !234, line: 21, baseType: !12, size: 32, offset: 24736)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "zproc", scope: !237, file: !234, line: 22, baseType: !12, size: 32, offset: 24768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !237, file: !234, line: 23, baseType: !12, size: 32, offset: 24800)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !237, file: !234, line: 24, baseType: !12, size: 32, offset: 24832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !237, file: !234, line: 25, baseType: !15, size: 64, offset: 24896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !237, file: !234, line: 26, baseType: !15, size: 64, offset: 24960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "temperature", scope: !237, file: !234, line: 27, baseType: !15, size: 64, offset: 25024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "initialDelta", scope: !237, file: !234, line: 28, baseType: !15, size: 64, offset: 25088)
!258 = !DISubprogram(name: "printCmdYaml", scope: !234, file: !234, line: 35, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !127, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!262 = !DISubprogram(name: "profileStop", scope: !198, file: !198, line: 58, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!263 = !DISubprogram(name: "getElapsedTime", scope: !198, file: !198, line: 61, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!264 = !DISubroutineType(types: !265)
!265 = !{!15, !197}
!266 = !DISubprogram(name: "timestep", scope: !267, file: !267, line: 9, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!267 = !DIFile(filename: "./timestep.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!268 = !DISubroutineType(types: !269)
!269 = !{!15, !99, !12, !15}
!270 = !DISubprogram(name: "printPerformanceResults", scope: !198, file: !198, line: 64, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !12, !12}
!273 = !DISubprogram(name: "printPerformanceResultsYaml", scope: !198, file: !198, line: 67, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!274 = !DISubprogram(name: "destroyParallel", scope: !215, file: !215, line: 32, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!275 = !DISubroutineType(types: !276)
!276 = !{null}
!277 = !DISubprogram(name: "free", scope: !278, file: !278, line: 565, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!278 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!279 = !DISubprogram(name: "initDecomposition", scope: !19, file: !19, line: 27, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !12, !12, !12, !283}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!284 = !DISubprogram(name: "initLinkCells", scope: !40, file: !40, line: 32, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !288, !15}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!290 = !DISubprogram(name: "initAtoms", scope: !56, file: !56, line: 30, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !287}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!294 = !DISubprogram(name: "createFccLattice", scope: !56, file: !56, line: 33, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !12, !12, !12, !15, !99}
!297 = !DISubprogram(name: "setTemperature", scope: !56, file: !56, line: 36, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !99, !15}
!300 = !DISubprogram(name: "randomDisplacements", scope: !56, file: !56, line: 37, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!301 = !DISubprogram(name: "initAtomHaloExchange", scope: !174, file: !174, line: 72, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !282, !287}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!305 = !DISubprogram(name: "redistributeAtoms", scope: !267, file: !267, line: 14, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !99}
!308 = !DISubprogram(name: "computeForce", scope: !267, file: !267, line: 10, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!309 = !DISubprogram(name: "kineticEnergy", scope: !267, file: !267, line: 11, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!310 = !DISubprogram(name: "initEamPot", scope: !311, file: !311, line: 22, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!311 = !DIFile(filename: "./eam.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!312 = !DISubroutineType(types: !313)
!313 = !{!165, !227, !227, !227}
!314 = !DISubprogram(name: "initLjPot", scope: !315, file: !315, line: 8, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!315 = !DIFile(filename: "./ljForce.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!316 = !DISubroutineType(types: !317)
!317 = !{!165}
!318 = !DISubprogram(name: "getNRanks", scope: !215, file: !215, line: 17, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!319 = !DISubroutineType(types: !320)
!320 = !{!12}
!321 = !DISubprogram(name: "printRank", scope: !215, file: !215, line: 23, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!322 = !DISubprogram(name: "bcastParallel", scope: !215, file: !215, line: 60, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !155, !12, !12}
!325 = !DISubprogram(name: "destroyLinkCells", scope: !40, file: !40, line: 33, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!329 = !DISubprogram(name: "destroyAtoms", scope: !56, file: !56, line: 31, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !293}
!332 = !DISubprogram(name: "destroyHaloExchange", scope: !174, file: !174, line: 78, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!336 = !DISubprogram(name: "yamlBegin", scope: !230, file: !230, line: 12, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!337 = !DISubprogram(name: "yamlEnd", scope: !230, file: !230, line: 13, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!338 = !DISubprogram(name: "printSeparator", scope: !230, file: !230, line: 17, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!339 = !DISubprogram(name: "addIntParallel", scope: !215, file: !215, line: 42, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !52, !52, !12}
!342 = !DISubprogram(name: "fflush", scope: !343, file: !343, line: 218, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!343 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!344 = !DISubroutineType(types: !345)
!345 = !{!12, !127}
!346 = !DISubprogram(name: "maxOccupancy", scope: !40, file: !40, line: 47, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !220)
!347 = !DISubroutineType(types: !348)
!348 = !{!12, !287}
!349 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!350 = !{!0, !351, !353}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "firstCall", scope: !2, file: !3, line: 348, type: !12, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression(DW_OP_constu, 4545986893404695380, DW_OP_stack_value))
!354 = distinct !DIGlobalVariable(name: "kB_eV", scope: !195, file: !355, line: 33, type: !356, isLocal: true, isDefinition: true)
!355 = !DIFile(filename: "./constants.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DILocalVariable(name: "s", arg: 1, scope: !2, file: !3, line: 344, type: !6)
!359 = !DILocalVariable(name: "iStep", arg: 2, scope: !2, file: !3, line: 344, type: !12)
!360 = !DILocalVariable(name: "elapsedTime", arg: 3, scope: !2, file: !3, line: 344, type: !15)
!361 = !DILocalVariable(name: "nEval", scope: !2, file: !3, line: 350, type: !12)
!362 = !DILocalVariable(name: "time", scope: !2, file: !3, line: 365, type: !31)
!363 = !DILocalVariable(name: "eTotal", scope: !2, file: !3, line: 366, type: !31)
!364 = !DILocalVariable(name: "eK", scope: !2, file: !3, line: 367, type: !31)
!365 = !DILocalVariable(name: "eU", scope: !2, file: !3, line: 368, type: !31)
!366 = !DILocalVariable(name: "Temp", scope: !2, file: !3, line: 369, type: !31)
!367 = !DILocalVariable(name: "timePerAtom", scope: !2, file: !3, line: 371, type: !15)
!368 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!369 = !{i32 7, !"Dwarf Version", i32 4}
!370 = !{i32 2, !"Debug Info Version", i32 3}
!371 = !{i32 1, !"wchar_size", i32 4}
!372 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!373 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 84, type: !374, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !376)
!374 = !DISubroutineType(types: !375)
!375 = !{!12, !12, !219}
!376 = !{!377, !378, !379, !381, !382, !389, !391, !392}
!377 = !DILocalVariable(name: "argc", arg: 1, scope: !373, file: !3, line: 84, type: !12)
!378 = !DILocalVariable(name: "argv", arg: 2, scope: !373, file: !3, line: 84, type: !219)
!379 = !DILocalVariable(name: "cmd", scope: !373, file: !3, line: 95, type: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Command", file: !234, line: 29, baseType: !237)
!381 = !DILocalVariable(name: "sim", scope: !373, file: !3, line: 99, type: !6)
!382 = !DILocalVariable(name: "validate", scope: !373, file: !3, line: 103, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "Validate", file: !8, line: 56, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ValidateSt", file: !8, line: 52, size: 128, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "eTot0", scope: !385, file: !8, line: 54, baseType: !15, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms0", scope: !385, file: !8, line: 55, baseType: !12, size: 32, offset: 64)
!389 = !DILocalVariable(name: "nSteps", scope: !373, file: !3, line: 109, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!391 = !DILocalVariable(name: "printRate", scope: !373, file: !3, line: 110, type: !390)
!392 = !DILocalVariable(name: "iStep", scope: !373, file: !3, line: 111, type: !12)
!393 = !DILocalVariable(name: "globalExtent", scope: !394, file: !3, line: 184, type: !28)
!394 = distinct !DISubprogram(name: "initSimulation", scope: !3, file: !3, line: 161, type: !395, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!6, !380}
!397 = !{!398, !399, !400, !393}
!398 = !DILocalVariable(name: "cmd", arg: 1, scope: !394, file: !3, line: 161, type: !380)
!399 = !DILocalVariable(name: "sim", scope: !394, file: !3, line: 163, type: !6)
!400 = !DILocalVariable(name: "latticeConstant", scope: !394, file: !3, line: 175, type: !31)
!401 = !DILocation(line: 184, column: 10, scope: !394, inlinedAt: !402)
!402 = distinct !DILocation(line: 99, column: 19, scope: !373)
!403 = !DILocation(line: 161, column: 33, scope: !394, inlinedAt: !402)
!404 = !DILocation(line: 0, scope: !373)
!405 = !{!406, !406, i64 0}
!406 = !{!"int", !407, i64 0}
!407 = !{!"omnipotent char", !408, i64 0}
!408 = !{!"Simple C/C++ TBAA"}
!409 = !{!410, !410, i64 0}
!410 = !{!"any pointer", !407, i64 0}
!411 = !DILocation(line: 87, column: 4, scope: !373)
!412 = !DILocation(line: 88, column: 4, scope: !373)
!413 = !DILocation(line: 243, column: 4, scope: !414, inlinedAt: !415)
!414 = distinct !DISubprogram(name: "initSubsystems", scope: !3, file: !3, line: 237, type: !275, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !220)
!415 = distinct !DILocation(line: 89, column: 4, scope: !373)
!416 = !DILocation(line: 90, column: 4, scope: !373)
!417 = !DILocation(line: 92, column: 16, scope: !373)
!418 = !DILocation(line: 92, column: 4, scope: !373)
!419 = !DILocation(line: 93, column: 16, scope: !373)
!420 = !DILocation(line: 93, column: 4, scope: !373)
!421 = !DILocation(line: 95, column: 4, scope: !373)
!422 = !DILocation(line: 95, column: 12, scope: !373)
!423 = !DILocation(line: 95, column: 35, scope: !373)
!424 = !DILocation(line: 95, column: 41, scope: !373)
!425 = !DILocation(line: 95, column: 18, scope: !373)
!426 = !DILocation(line: 96, column: 17, scope: !373)
!427 = !DILocation(line: 96, column: 4, scope: !373)
!428 = !DILocation(line: 97, column: 17, scope: !373)
!429 = !DILocation(line: 97, column: 4, scope: !373)
!430 = !DILocalVariable(name: "iSize", arg: 1, scope: !431, file: !432, line: 11, type: !157)
!431 = distinct !DISubprogram(name: "comdMalloc", scope: !432, file: !432, line: 11, type: !433, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !195, retainedNodes: !435)
!432 = !DIFile(filename: "./memUtils.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!433 = !DISubroutineType(types: !434)
!434 = !{!155, !157}
!435 = !{!430}
!436 = !DILocation(line: 0, scope: !431, inlinedAt: !437)
!437 = distinct !DILocation(line: 163, column: 19, scope: !394, inlinedAt: !402)
!438 = !DILocation(line: 13, column: 11, scope: !431, inlinedAt: !437)
!439 = !DILocation(line: 163, column: 19, scope: !394, inlinedAt: !402)
!440 = !DILocation(line: 0, scope: !394, inlinedAt: !402)
!441 = !DILocation(line: 164, column: 22, scope: !394, inlinedAt: !402)
!442 = !{!443, !406, i64 3100}
