; ModuleID = 'haloExchange.c'
source_filename = "haloExchange.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HaloExchangeSt = type { [6 x i32], i32, i32 (i8*, i8*, i32, i8*)*, void (i8*, i8*, i32, i32, i8*)*, void (i8*)*, i8* }
%struct.DomainSt = type { [3 x i32], [3 x i32], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }
%struct.LinkCellSt = type { [3 x i32], i32, i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], i32* }
%struct.AtomMsgSt = type { i32, i32, double, double, double, double, double, double }
%struct.AtomsSt = type { i32, i32, i32*, i32*, [3 x double]*, [3 x double]*, [3 x double]*, double* }
%struct.ForceMsgSt = type { double }

@.str = private unnamed_addr constant [16 x i8] c"count == nCells\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"haloExchange.c\00", align 1
@__PRETTY_FUNCTION__.mkAtomCellList = private unnamed_addr constant [63 x i8] c"int *mkAtomCellList(LinkCell *, enum HaloFaceOrder, const int)\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"bufSize % sizeof(AtomMsg) == 0\00", align 1
@__PRETTY_FUNCTION__.unloadAtomsBuffer = private unnamed_addr constant [57 x i8] c"void unloadAtomsBuffer(void *, void *, int, int, char *)\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"1==0\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "haloExchange.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{!3, !12, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HaloFaceOrder", file: !1, line: 46, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "HALO_X_MINUS", value: 0, isUnsigned: true)
!7 = !DIEnumerator(name: "HALO_X_PLUS", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "HALO_Y_MINUS", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "HALO_Y_PLUS", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "HALO_Z_MINUS", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "HALO_Z_PLUS", value: 5, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HaloAxisOrder", file: !1, line: 51, baseType: !4, size: 32, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "HALO_X_AXIS", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "HALO_Y_AXIS", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "HALO_Z_AXIS", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimerHandle", file: !18, line: 9, baseType: !4, size: 32, elements: !19)
!18 = !DIFile(filename: "./performanceTimers.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "totalTimer", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "loopTimer", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "timestepTimer", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "positionTimer", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "velocityTimer", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "redistributeTimer", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "atomHaloTimer", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "computeForceTimer", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "eamHaloTimer", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "commHaloTimer", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "commReduceTimer", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "numberOfTimers", value: 11, isUnsigned: true)
!32 = !{!33, !46, !49, !72, !75, !79, !80, !97, !110, !258, !270, !274, !281, !288}
!33 = !DISubprogram(name: "qsort", scope: !34, file: !34, line: 830, type: !35, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!34 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !38, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !43}
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!45 = !{}
!46 = !DISubprogram(name: "free", scope: !34, file: !34, line: 565, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !37}
!49 = !DISubprogram(name: "processorNum", scope: !50, file: !50, line: 31, type: !51, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!50 = !DIFile(filename: "./decomposition.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!51 = !DISubroutineType(types: !52)
!52 = !{!42, !53, !42, !42, !42}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DomainSt", file: !50, line: 10, size: 1344, elements: !55)
!55 = !{!56, !60, !61, !67, !68, !69, !70, !71}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "procGrid", scope: !54, file: !50, line: 13, baseType: !57, size: 96)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 3)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "procCoord", scope: !54, file: !50, line: 14, baseType: !57, size: 96, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "globalMin", scope: !54, file: !50, line: 17, baseType: !62, size: 192, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "real3", file: !63, line: 18, baseType: !64)
!63 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !58)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !63, line: 13, baseType: !66)
!66 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "globalMax", scope: !54, file: !50, line: 18, baseType: !62, size: 192, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "globalExtent", scope: !54, file: !50, line: 19, baseType: !62, size: 192, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !54, file: !50, line: 22, baseType: !62, size: 192, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !54, file: !50, line: 23, baseType: !62, size: 192, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "localExtent", scope: !54, file: !50, line: 24, baseType: !62, size: 192, offset: 1152)
!72 = !DISubprogram(name: "profileStart", scope: !18, file: !18, line: 57, type: !73, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !17}
!75 = !DISubprogram(name: "sendReceiveParallel", scope: !76, file: !76, line: 38, type: !77, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!76 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!77 = !DISubroutineType(types: !78)
!78 = !{!42, !37, !42, !42, !37, !42, !42}
!79 = !DISubprogram(name: "profileStop", scope: !18, file: !18, line: 58, type: !73, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!80 = !DISubprogram(name: "getBoxFromTuple", scope: !81, file: !81, line: 40, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!81 = !DIFile(filename: "./linkCells.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!82 = !DISubroutineType(types: !83)
!83 = !{!42, !84, !42, !42, !42}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkCellSt", file: !81, line: 17, size: 1024, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "gridSize", scope: !85, file: !81, line: 19, baseType: !57, size: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nLocalBoxes", scope: !85, file: !81, line: 20, baseType: !42, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nHaloBoxes", scope: !85, file: !81, line: 21, baseType: !42, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nTotalBoxes", scope: !85, file: !81, line: 22, baseType: !42, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !85, file: !81, line: 24, baseType: !62, size: 192, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !85, file: !81, line: 25, baseType: !62, size: 192, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "boxSize", scope: !85, file: !81, line: 26, baseType: !62, size: 192, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "invBoxSize", scope: !85, file: !81, line: 27, baseType: !62, size: 192, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms", scope: !85, file: !81, line: 29, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomExchangeParms", file: !1, line: 62, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomExchangeParmsSt", file: !1, line: 56, size: 960, elements: !100)
!100 = !{!101, !105, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nCells", scope: !99, file: !1, line: 58, baseType: !102, size: 192)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 192, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 6)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cellList", scope: !99, file: !1, line: 59, baseType: !106, size: 384, offset: 192)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 384, elements: !103)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pbcFactor", scope: !99, file: !1, line: 60, baseType: !108, size: 384, offset: 576)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 384, elements: !103)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "SimFlat", file: !112, line: 83, baseType: !113)
!112 = !DIFile(filename: "./CoMDTypes.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimFlatSt", file: !112, line: 62, size: 640, elements: !114)
!114 = !{!115, !116, !117, !118, !121, !124, !139, !149, !150, !151, !239}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !113, file: !112, line: 64, baseType: !42, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !113, file: !112, line: 65, baseType: !42, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !113, file: !112, line: 66, baseType: !66, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !113, file: !112, line: 68, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Domain", file: !50, line: 25, baseType: !54)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !113, file: !112, line: 70, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkCell", file: !81, line: 30, baseType: !85)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !113, file: !112, line: 72, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atoms", file: !127, line: 26, baseType: !128)
!127 = !DIFile(filename: "./initAtoms.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomsSt", file: !127, line: 13, size: 448, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !136, !137, !138}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nLocal", scope: !128, file: !127, line: 16, baseType: !42, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nGlobal", scope: !128, file: !127, line: 17, baseType: !42, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !128, file: !127, line: 19, baseType: !96, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "iSpecies", scope: !128, file: !127, line: 20, baseType: !96, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !128, file: !127, line: 22, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !128, file: !127, line: 23, baseType: !135, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !128, file: !127, line: 24, baseType: !135, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !128, file: !127, line: 25, baseType: !109, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "species", scope: !113, file: !112, line: 74, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeciesData", file: !112, line: 48, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeciesDataSt", file: !112, line: 43, size: 128, elements: !143)
!143 = !{!144, !147, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !112, line: 45, baseType: !145, size: 24)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 24, elements: !58)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !142, file: !112, line: 46, baseType: !42, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !142, file: !112, line: 47, baseType: !65, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ePotential", scope: !113, file: !112, line: 76, baseType: !65, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "eKinetic", scope: !113, file: !112, line: 77, baseType: !65, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pot", scope: !113, file: !112, line: 79, baseType: !152, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BasePotential", file: !112, line: 39, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BasePotentialSt", file: !112, line: 28, size: 512, elements: !155)
!155 = !{!156, !157, !158, !159, !163, !164, !165, !170, !234}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !154, file: !112, line: 30, baseType: !65, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !154, file: !112, line: 31, baseType: !65, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !154, file: !112, line: 32, baseType: !65, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !154, file: !112, line: 33, baseType: !160, size: 64, offset: 192)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !112, line: 34, baseType: !145, size: 24, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !154, file: !112, line: 35, baseType: !42, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !154, file: !112, line: 36, baseType: !166, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!42, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !154, file: !112, line: 37, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174, !233}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!179 = !{!180, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !196, !198, !199, !200, !204, !206, !208, !212, !215, !217, !220, !223, !224, !225, !228, !229}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !42, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !182, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !182, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !182, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !182, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !182, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !182, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !182, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !182, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !182, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !182, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !194, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !197, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !42, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !42, size: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !202, line: 152, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !205, size: 16, offset: 1024)
!205 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !207, size: 8, offset: 1040)
!207 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !209, size: 8, offset: 1048)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !216, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !202, line: 153, baseType: !203)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !218, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !221, size: 64, offset: 1280)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !197, size: 64, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !37, size: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !226, size: 64, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !227, line: 46, baseType: !38)
!227 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !42, size: 32, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !230, size: 160, offset: 1568)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 160, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 20)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !154, file: !112, line: 38, baseType: !235, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "atomExchange", scope: !113, file: !112, line: 81, baseType: !240, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloExchange", file: !242, line: 69, baseType: !243)
!242 = !DIFile(filename: "./haloExchange.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloExchangeSt", file: !242, line: 26, size: 512, elements: !244)
!244 = !{!245, !246, !247, !251, !255, !257}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nbrRank", scope: !243, file: !242, line: 30, baseType: !102, size: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bufCapacity", scope: !243, file: !242, line: 33, baseType: !42, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "loadBuffer", scope: !243, file: !242, line: 47, baseType: !248, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!42, !37, !37, !42, !182}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "unloadBuffer", scope: !243, file: !242, line: 61, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !37, !37, !42, !42, !182}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !243, file: !242, line: 64, baseType: !256, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !243, file: !242, line: 67, baseType: !37, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "AtomMsg", file: !1, line: 84, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomMsgSt", file: !1, line: 77, size: 448, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !260, file: !1, line: 79, baseType: !42, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !1, line: 80, baseType: !42, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !260, file: !1, line: 81, baseType: !65, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !260, file: !1, line: 81, baseType: !65, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rz", scope: !260, file: !1, line: 81, baseType: !65, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "px", scope: !260, file: !1, line: 82, baseType: !65, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "py", scope: !260, file: !1, line: 82, baseType: !65, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pz", scope: !260, file: !1, line: 82, baseType: !65, size: 64, offset: 384)
!270 = !DISubprogram(name: "putAtomInBox", scope: !81, file: !81, line: 36, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !84, !273, !42, !42, !66, !66, !66, !66, !66, !66}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ForceExchangeParms", file: !1, line: 73, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ForceExchangeParmsSt", file: !1, line: 67, size: 960, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nCells", scope: !276, file: !1, line: 69, baseType: !102, size: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sendCells", scope: !276, file: !1, line: 70, baseType: !106, size: 384, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recvCells", scope: !276, file: !1, line: 71, baseType: !106, size: 384, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ForceExchangeData", file: !283, line: 20, baseType: !284)
!283 = !DIFile(filename: "./eam.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ForceExchangeDataSt", file: !283, line: 16, size: 128, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dfEmbed", scope: !284, file: !283, line: 18, baseType: !109, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !284, file: !283, line: 19, baseType: !84, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ForceMsg", file: !1, line: 91, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ForceMsgSt", file: !1, line: 87, size: 64, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dfEmbed", scope: !290, file: !1, line: 89, baseType: !65, size: 64)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!297 = distinct !DISubprogram(name: "initAtomHaloExchange", scope: !1, file: !1, line: 144, type: !298, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!240, !119, !122}
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !311, !313, !317, !318}
!301 = !DILocalVariable(name: "domain", arg: 1, scope: !297, file: !1, line: 144, type: !119)
!302 = !DILocalVariable(name: "boxes", arg: 2, scope: !297, file: !1, line: 144, type: !122)
!303 = !DILocalVariable(name: "hh", scope: !297, file: !1, line: 146, type: !240)
!304 = !DILocalVariable(name: "size0", scope: !297, file: !1, line: 148, type: !42)
!305 = !DILocalVariable(name: "size1", scope: !297, file: !1, line: 149, type: !42)
!306 = !DILocalVariable(name: "size2", scope: !297, file: !1, line: 150, type: !42)
!307 = !DILocalVariable(name: "maxSize", scope: !297, file: !1, line: 151, type: !42)
!308 = !DILocalVariable(name: "parms", scope: !297, file: !1, line: 159, type: !97)
!309 = !DILocalVariable(name: "ii", scope: !310, file: !1, line: 168, type: !42)
!310 = distinct !DILexicalBlock(scope: !297, file: !1, line: 168, column: 4)
!311 = !DILocalVariable(name: "ii", scope: !312, file: !1, line: 171, type: !42)
!312 = distinct !DILexicalBlock(scope: !297, file: !1, line: 171, column: 4)
!313 = !DILocalVariable(name: "jj", scope: !314, file: !1, line: 174, type: !42)
!314 = distinct !DILexicalBlock(scope: !315, file: !1, line: 174, column: 7)
!315 = distinct !DILexicalBlock(scope: !316, file: !1, line: 172, column: 4)
!316 = distinct !DILexicalBlock(scope: !312, file: !1, line: 171, column: 4)
!317 = !DILocalVariable(name: "procCoord", scope: !297, file: !1, line: 177, type: !96)
!318 = !DILocalVariable(name: "procGrid", scope: !297, file: !1, line: 178, type: !96)
!319 = !DILocation(line: 0, scope: !297)
!320 = !DILocalVariable(name: "domain", arg: 1, scope: !321, file: !1, line: 254, type: !119)
!321 = distinct !DISubprogram(name: "initHaloExchange", scope: !1, file: !1, line: 254, type: !322, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!240, !119}
!324 = !{!320, !325}
!325 = !DILocalVariable(name: "hh", scope: !321, file: !1, line: 256, type: !240)
!326 = !DILocation(line: 0, scope: !321, inlinedAt: !327)
!327 = distinct !DILocation(line: 146, column: 23, scope: !297)
!328 = !DILocalVariable(name: "iSize", arg: 1, scope: !329, file: !330, line: 11, type: !226)
!329 = distinct !DISubprogram(name: "comdMalloc", scope: !330, file: !330, line: 11, type: !331, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !333)
!330 = !DIFile(filename: "./memUtils.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!331 = !DISubroutineType(types: !332)
!332 = !{!37, !226}
!333 = !{!328}
!334 = !DILocation(line: 0, scope: !329, inlinedAt: !335)
