; ModuleID = 'initAtoms.c'
source_filename = "initAtoms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AtomsSt = type { i32, i32, i32*, i32*, [3 x double]*, [3 x double]*, [3 x double]*, double* }
%struct.LinkCellSt = type { [3 x i32], i32, i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], i32* }
%struct.SimFlatSt = type { i32, i32, double, %struct.DomainSt*, %struct.LinkCellSt*, %struct.AtomsSt*, %struct.SpeciesDataSt*, double, double, %struct.BasePotentialSt*, %struct.HaloExchangeSt* }
%struct.DomainSt = type { [3 x i32], [3 x i32], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }
%struct.SpeciesDataSt = type { [3 x i8], i32, double }
%struct.BasePotentialSt = type { double, double, double, [8 x i8], [3 x i8], i32, i32 (%struct.SimFlatSt*)*, void (%struct._IO_FILE*, %struct.BasePotentialSt*)*, void (%struct.BasePotentialSt**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.HaloExchangeSt = type { [6 x i32], i32, i32 (i8*, i8*, i32, i8*)*, void (i8*, i8*, i32, i32, i8*)*, void (i8*)*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, globals: !240, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "initAtoms.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimerHandle", file: !4, line: 9, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./performanceTimers.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "totalTimer", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "loopTimer", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "timestepTimer", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "positionTimer", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "velocityTimer", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "redistributeTimer", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "atomHaloTimer", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "computeForceTimer", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "eamHaloTimer", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "commHaloTimer", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "commReduceTimer", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "numberOfTimers", value: 11, isUnsigned: true)
!19 = !{!20, !22, !30, !31, !61, !64, !68, !69, !74, !78, !233, !234, !236}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "real3", file: !24, line: 18, baseType: !25)
!24 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !28)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !24, line: 13, baseType: !27)
!27 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!28 = !{!29}
!29 = !DISubrange(count: 3)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!31 = !DISubprogram(name: "putAtomInBox", scope: !32, file: !32, line: 36, type: !33, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!32 = !DIFile(filename: "./linkCells.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !48, !21, !21, !27, !27, !27, !27, !27, !27}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkCellSt", file: !32, line: 17, size: 1024, elements: !37)
!37 = !{!38, !40, !41, !42, !43, !44, !45, !46, !47}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "gridSize", scope: !36, file: !32, line: 19, baseType: !39, size: 96)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, elements: !28)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "nLocalBoxes", scope: !36, file: !32, line: 20, baseType: !21, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nHaloBoxes", scope: !36, file: !32, line: 21, baseType: !21, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nTotalBoxes", scope: !36, file: !32, line: 22, baseType: !21, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !36, file: !32, line: 24, baseType: !23, size: 192, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !36, file: !32, line: 25, baseType: !23, size: 192, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "boxSize", scope: !36, file: !32, line: 26, baseType: !23, size: 192, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "invBoxSize", scope: !36, file: !32, line: 27, baseType: !23, size: 192, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms", scope: !36, file: !32, line: 29, baseType: !20, size: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomsSt", file: !50, line: 13, size: 448, elements: !51)
!50 = !DIFile(filename: "./initAtoms.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nLocal", scope: !49, file: !50, line: 16, baseType: !21, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nGlobal", scope: !49, file: !50, line: 17, baseType: !21, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !49, file: !50, line: 19, baseType: !20, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "iSpecies", scope: !49, file: !50, line: 20, baseType: !20, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !49, file: !50, line: 22, baseType: !22, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !49, file: !50, line: 23, baseType: !22, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !49, file: !50, line: 24, baseType: !22, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !49, file: !50, line: 25, baseType: !30, size: 64, offset: 384)
!60 = !{}
!61 = !DISubprogram(name: "profileStart", scope: !4, file: !4, line: 57, type: !62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !3}
!64 = !DISubprogram(name: "addIntParallel", scope: !65, file: !65, line: 42, type: !66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!65 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !20, !20, !21}
!68 = !DISubprogram(name: "profileStop", scope: !4, file: !4, line: 58, type: !62, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!69 = !DISubprogram(name: "mkSeed", scope: !70, file: !70, line: 18, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!70 = !DIFile(filename: "./random.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !5, !5}
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DISubprogram(name: "gasdev", scope: !70, file: !70, line: 12, type: !75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!75 = !DISubroutineType(types: !76)
!76 = !{!27, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!78 = !DISubprogram(name: "kineticEnergy", scope: !79, file: !79, line: 11, type: !80, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!79 = !DIFile(filename: "./timestep.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimFlatSt", file: !84, line: 62, size: 640, elements: !85)
!84 = !DIFile(filename: "./CoMDTypes.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!85 = !{!86, !87, !88, !89, !103, !106, !109, !119, !120, !121, !209}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !83, file: !84, line: 64, baseType: !21, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !83, file: !84, line: 65, baseType: !21, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !83, file: !84, line: 66, baseType: !27, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !83, file: !84, line: 68, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Domain", file: !92, line: 25, baseType: !93)
!92 = !DIFile(filename: "./decomposition.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DomainSt", file: !92, line: 10, size: 1344, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "procGrid", scope: !93, file: !92, line: 13, baseType: !39, size: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "procCoord", scope: !93, file: !92, line: 14, baseType: !39, size: 96, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "globalMin", scope: !93, file: !92, line: 17, baseType: !23, size: 192, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "globalMax", scope: !93, file: !92, line: 18, baseType: !23, size: 192, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "globalExtent", scope: !93, file: !92, line: 19, baseType: !23, size: 192, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !93, file: !92, line: 22, baseType: !23, size: 192, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !93, file: !92, line: 23, baseType: !23, size: 192, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "localExtent", scope: !93, file: !92, line: 24, baseType: !23, size: 192, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !83, file: !84, line: 70, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkCell", file: !32, line: 30, baseType: !36)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !83, file: !84, line: 72, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atoms", file: !50, line: 26, baseType: !49)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "species", scope: !83, file: !84, line: 74, baseType: !110, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeciesData", file: !84, line: 48, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeciesDataSt", file: !84, line: 43, size: 128, elements: !113)
!113 = !{!114, !117, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !84, line: 45, baseType: !115, size: 24)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 24, elements: !28)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !112, file: !84, line: 46, baseType: !21, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !112, file: !84, line: 47, baseType: !26, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ePotential", scope: !83, file: !84, line: 76, baseType: !26, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "eKinetic", scope: !83, file: !84, line: 77, baseType: !26, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pot", scope: !83, file: !84, line: 79, baseType: !122, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "BasePotential", file: !84, line: 39, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BasePotentialSt", file: !84, line: 28, size: 512, elements: !125)
!125 = !{!126, !127, !128, !129, !133, !134, !135, !139, !204}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !124, file: !84, line: 30, baseType: !26, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !124, file: !84, line: 31, baseType: !26, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !124, file: !84, line: 32, baseType: !26, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !124, file: !84, line: 33, baseType: !130, size: 64, offset: 192)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !84, line: 34, baseType: !115, size: 24, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !124, file: !84, line: 35, baseType: !21, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !124, file: !84, line: 36, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!21, !82}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !124, file: !84, line: 37, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !143, !203}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !145, line: 7, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !147, line: 49, size: 1728, elements: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!148 = !{!149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !165, !167, !168, !169, !173, !175, !177, !181, !184, !186, !189, !192, !193, !195, !198, !199}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !146, file: !147, line: 51, baseType: !21, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !146, file: !147, line: 54, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !146, file: !147, line: 55, baseType: !151, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !146, file: !147, line: 56, baseType: !151, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !146, file: !147, line: 57, baseType: !151, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !146, file: !147, line: 58, baseType: !151, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !146, file: !147, line: 59, baseType: !151, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !146, file: !147, line: 60, baseType: !151, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !146, file: !147, line: 61, baseType: !151, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !146, file: !147, line: 64, baseType: !151, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !146, file: !147, line: 65, baseType: !151, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !146, file: !147, line: 66, baseType: !151, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !146, file: !147, line: 68, baseType: !163, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !147, line: 36, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !146, file: !147, line: 70, baseType: !166, size: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !146, file: !147, line: 72, baseType: !21, size: 32, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !146, file: !147, line: 73, baseType: !21, size: 32, offset: 928)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !146, file: !147, line: 74, baseType: !170, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !171, line: 152, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !146, file: !147, line: 77, baseType: !174, size: 16, offset: 1024)
!174 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !146, file: !147, line: 78, baseType: !176, size: 8, offset: 1040)
!176 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !146, file: !147, line: 79, baseType: !178, size: 8, offset: 1048)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !146, file: !147, line: 81, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !147, line: 43, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !146, file: !147, line: 89, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !171, line: 153, baseType: !172)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !146, file: !147, line: 91, baseType: !187, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !147, line: 37, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !146, file: !147, line: 92, baseType: !190, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !147, line: 38, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !146, file: !147, line: 93, baseType: !166, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !146, file: !147, line: 94, baseType: !194, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !146, file: !147, line: 95, baseType: !196, size: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 46, baseType: !73)
!197 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !146, file: !147, line: 96, baseType: !21, size: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !146, file: !147, line: 98, baseType: !200, size: 160, offset: 1568)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 160, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 20)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !124, file: !84, line: 38, baseType: !205, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "atomExchange", scope: !83, file: !84, line: 81, baseType: !210, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloExchange", file: !212, line: 69, baseType: !213)
!212 = !DIFile(filename: "./haloExchange.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloExchangeSt", file: !212, line: 26, size: 512, elements: !214)
!214 = !{!215, !219, !220, !224, !228, !232}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nbrRank", scope: !213, file: !212, line: 30, baseType: !216, size: 192)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 6)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bufCapacity", scope: !213, file: !212, line: 33, baseType: !21, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "loadBuffer", scope: !213, file: !212, line: 47, baseType: !221, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!21, !194, !194, !21, !151}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "unloadBuffer", scope: !213, file: !212, line: 61, baseType: !225, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !194, !194, !21, !21, !151}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !213, file: !212, line: 64, baseType: !229, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !194}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !213, file: !212, line: 67, baseType: !194, size: 64, offset: 448)
!233 = !DISubprogram(name: "lcg61", scope: !70, file: !70, line: 15, type: !75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!234 = !DISubprogram(name: "free", scope: !235, file: !235, line: 565, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!235 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!236 = !DISubprogram(name: "addRealParallel", scope: !65, file: !65, line: 45, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !60)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !239, !239, !21}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!240 = !{!241}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression(DW_OP_constu, 4545986893404695380, DW_OP_stack_value))
!242 = distinct !DIGlobalVariable(name: "kB_eV", scope: !0, file: !243, line: 33, type: !244, isLocal: true, isDefinition: true)
!243 = !DIFile(filename: "./constants.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!245 = !{i32 7, !"Dwarf Version", i32 4}
!246 = !{i32 2, !"Debug Info Version", i32 3}
!247 = !{i32 1, !"wchar_size", i32 4}
!248 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!249 = distinct !DISubprogram(name: "initAtoms", scope: !1, file: !1, line: 23, type: !250, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{!107, !104}
!252 = !{!253, !254, !255, !256}
!253 = !DILocalVariable(name: "boxes", arg: 1, scope: !249, file: !1, line: 23, type: !104)
!254 = !DILocalVariable(name: "atoms", scope: !249, file: !1, line: 25, type: !107)
!255 = !DILocalVariable(name: "maxTotalAtoms", scope: !249, file: !1, line: 27, type: !21)
!256 = !DILocalVariable(name: "iOff", scope: !257, file: !1, line: 39, type: !21)
!257 = distinct !DILexicalBlock(scope: !249, file: !1, line: 39, column: 4)
!258 = !DILocation(line: 0, scope: !249)
!259 = !DILocalVariable(name: "iSize", arg: 1, scope: !260, file: !261, line: 11, type: !196)
!260 = distinct !DISubprogram(name: "comdMalloc", scope: !261, file: !261, line: 11, type: !262, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !264)
!261 = !DIFile(filename: "./memUtils.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!262 = !DISubroutineType(types: !263)
!263 = !{!194, !196}
!264 = !{!259}
!265 = !DILocation(line: 0, scope: !260, inlinedAt: !266)
!266 = distinct !DILocation(line: 25, column: 19, scope: !249)
!267 = !DILocation(line: 13, column: 11, scope: !260, inlinedAt: !266)
!268 = !DILocation(line: 25, column: 19, scope: !249)
!269 = !DILocation(line: 27, column: 40, scope: !249)
!270 = !{!271, !274, i64 20}
!271 = !{!"LinkCellSt", !272, i64 0, !274, i64 12, !274, i64 16, !274, i64 20, !272, i64 24, !272, i64 48, !272, i64 72, !272, i64 96, !275, i64 120}
!272 = !{!"omnipotent char", !273, i64 0}
!273 = !{!"Simple C/C++ TBAA"}
!274 = !{!"int", !272, i64 0}
!275 = !{!"any pointer", !272, i64 0}
!276 = !DILocation(line: 27, column: 32, scope: !249)
!277 = !DILocation(line: 29, column: 42, scope: !249)
!278 = !DILocation(line: 29, column: 55, scope: !249)
!279 = !DILocation(line: 0, scope: !260, inlinedAt: !280)
!280 = distinct !DILocation(line: 29, column: 31, scope: !249)
!281 = !DILocation(line: 13, column: 11, scope: !260, inlinedAt: !280)
!282 = !DILocation(line: 29, column: 11, scope: !249)
!283 = !DILocation(line: 29, column: 15, scope: !249)
!284 = !{!285, !275, i64 8}
