; ModuleID = 'ljForce.c'
source_filename = "ljForce.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BasePotentialSt = type { double, double, double, [8 x i8], [3 x i8], i32, i32 (%struct.SimFlatSt*)*, void (%struct._IO_FILE*, %struct.BasePotentialSt*)*, {}* }
%struct.SimFlatSt = type { i32, i32, double, %struct.DomainSt*, %struct.LinkCellSt*, %struct.AtomsSt*, %struct.SpeciesDataSt*, double, double, %struct.BasePotentialSt*, %struct.HaloExchangeSt* }
%struct.DomainSt = type { [3 x i32], [3 x i32], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }
%struct.LinkCellSt = type { [3 x i32], i32, i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], i32* }
%struct.AtomsSt = type { i32, i32, i32*, i32*, [3 x double]*, [3 x double]*, [3 x double]*, double* }
%struct.SpeciesDataSt = type { [3 x i8], i32, double }
%struct.HaloExchangeSt = type { [6 x i32], i32, i32 (i8*, i8*, i32, i8*)*, void (i8*, i8*, i32, i32, i8*)*, void (i8*)*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !224, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "ljForce.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{}
!3 = !{!4, !97, !218, !220}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "LjPotential", file: !1, line: 93, baseType: !6)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LjPotentialSt", file: !1, line: 80, size: 640, elements: !7)
!7 = !{!8, !12, !13, !14, !19, !23, !25, !207, !211, !216, !217}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !6, file: !1, line: 82, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !10, line: 13, baseType: !11)
!10 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!11 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !6, file: !1, line: 83, baseType: !9, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !6, file: !1, line: 84, baseType: !9, size: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !6, file: !1, line: 85, baseType: !15, size: 64, offset: 192)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 8)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !6, file: !1, line: 86, baseType: !20, size: 24, offset: 256)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 3)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !6, file: !1, line: 87, baseType: !24, size: 32, offset: 288)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !6, file: !1, line: 88, baseType: !26, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!24, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "SimFlat", file: !31, line: 83, baseType: !32)
!31 = !DIFile(filename: "./CoMDTypes.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimFlatSt", file: !31, line: 62, size: 640, elements: !33)
!33 = !{!34, !35, !36, !37, !54, !70, !86, !94, !95, !96, !183}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !32, file: !31, line: 64, baseType: !24, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !32, file: !31, line: 65, baseType: !24, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !32, file: !31, line: 66, baseType: !11, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !32, file: !31, line: 68, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Domain", file: !40, line: 25, baseType: !41)
!40 = !DIFile(filename: "./decomposition.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DomainSt", file: !40, line: 10, size: 1344, elements: !42)
!42 = !{!43, !45, !46, !49, !50, !51, !52, !53}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "procGrid", scope: !41, file: !40, line: 13, baseType: !44, size: 96)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 96, elements: !21)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "procCoord", scope: !41, file: !40, line: 14, baseType: !44, size: 96, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "globalMin", scope: !41, file: !40, line: 17, baseType: !47, size: 192, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "real3", file: !10, line: 18, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !21)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "globalMax", scope: !41, file: !40, line: 18, baseType: !47, size: 192, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "globalExtent", scope: !41, file: !40, line: 19, baseType: !47, size: 192, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !41, file: !40, line: 22, baseType: !47, size: 192, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !41, file: !40, line: 23, baseType: !47, size: 192, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "localExtent", scope: !41, file: !40, line: 24, baseType: !47, size: 192, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !32, file: !31, line: 70, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkCell", file: !57, line: 30, baseType: !58)
!57 = !DIFile(filename: "./linkCells.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkCellSt", file: !57, line: 17, size: 1024, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "gridSize", scope: !58, file: !57, line: 19, baseType: !44, size: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nLocalBoxes", scope: !58, file: !57, line: 20, baseType: !24, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nHaloBoxes", scope: !58, file: !57, line: 21, baseType: !24, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nTotalBoxes", scope: !58, file: !57, line: 22, baseType: !24, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !58, file: !57, line: 24, baseType: !47, size: 192, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !58, file: !57, line: 25, baseType: !47, size: 192, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "boxSize", scope: !58, file: !57, line: 26, baseType: !47, size: 192, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "invBoxSize", scope: !58, file: !57, line: 27, baseType: !47, size: 192, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms", scope: !58, file: !57, line: 29, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !32, file: !31, line: 72, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atoms", file: !73, line: 26, baseType: !74)
!73 = !DIFile(filename: "./initAtoms.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomsSt", file: !73, line: 13, size: 448, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !82, !83, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nLocal", scope: !74, file: !73, line: 16, baseType: !24, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nGlobal", scope: !74, file: !73, line: 17, baseType: !24, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !74, file: !73, line: 19, baseType: !69, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "iSpecies", scope: !74, file: !73, line: 20, baseType: !69, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !74, file: !73, line: 22, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !74, file: !73, line: 23, baseType: !81, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !74, file: !73, line: 24, baseType: !81, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !74, file: !73, line: 25, baseType: !85, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "species", scope: !32, file: !31, line: 74, baseType: !87, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeciesData", file: !31, line: 48, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeciesDataSt", file: !31, line: 43, size: 128, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !31, line: 45, baseType: !20, size: 24)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !89, file: !31, line: 46, baseType: !24, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !89, file: !31, line: 47, baseType: !9, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ePotential", scope: !32, file: !31, line: 76, baseType: !9, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "eKinetic", scope: !32, file: !31, line: 77, baseType: !9, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pot", scope: !32, file: !31, line: 79, baseType: !97, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BasePotential", file: !31, line: 39, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BasePotentialSt", file: !31, line: 28, size: 512, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !112, !178}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !99, file: !31, line: 30, baseType: !9, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !99, file: !31, line: 31, baseType: !9, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !99, file: !31, line: 32, baseType: !9, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !99, file: !31, line: 33, baseType: !15, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !31, line: 34, baseType: !20, size: 24, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !99, file: !31, line: 35, baseType: !24, size: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !99, file: !31, line: 36, baseType: !108, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!24, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !99, file: !31, line: 37, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !116, !177}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !118, line: 7, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 49, size: 1728, elements: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!121 = !{!122, !123, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !140, !141, !142, !146, !148, !150, !154, !157, !159, !162, !165, !166, !168, !172, !173}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 51, baseType: !24, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 54, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 55, baseType: !124, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 56, baseType: !124, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 57, baseType: !124, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 58, baseType: !124, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 59, baseType: !124, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 60, baseType: !124, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 61, baseType: !124, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 64, baseType: !124, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 65, baseType: !124, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 66, baseType: !124, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 68, baseType: !136, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 36, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 70, baseType: !139, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 72, baseType: !24, size: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 73, baseType: !24, size: 32, offset: 928)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 74, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !144, line: 152, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!145 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 77, baseType: !147, size: 16, offset: 1024)
!147 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 78, baseType: !149, size: 8, offset: 1040)
!149 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 79, baseType: !151, size: 8, offset: 1048)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 81, baseType: !155, size: 64, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 43, baseType: null)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 89, baseType: !158, size: 64, offset: 1152)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !144, line: 153, baseType: !145)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !119, file: !120, line: 91, baseType: !160, size: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !120, line: 37, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !119, file: !120, line: 92, baseType: !163, size: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !120, line: 38, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !119, file: !120, line: 93, baseType: !139, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !119, file: !120, line: 94, baseType: !167, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 95, baseType: !169, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !170, line: 46, baseType: !171)
!170 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!171 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 96, baseType: !24, size: 32, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 98, baseType: !174, size: 160, offset: 1568)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 20)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !99, file: !31, line: 38, baseType: !179, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "atomExchange", scope: !32, file: !31, line: 81, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloExchange", file: !186, line: 69, baseType: !187)
!186 = !DIFile(filename: "./haloExchange.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloExchangeSt", file: !186, line: 26, size: 512, elements: !188)
!188 = !{!189, !193, !194, !198, !202, !206}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nbrRank", scope: !187, file: !186, line: 30, baseType: !190, size: 192)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 6)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bufCapacity", scope: !187, file: !186, line: 33, baseType: !24, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "loadBuffer", scope: !187, file: !186, line: 47, baseType: !195, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!24, !167, !167, !24, !124}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "unloadBuffer", scope: !187, file: !186, line: 61, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !167, !167, !24, !24, !124}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !187, file: !186, line: 64, baseType: !203, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !167}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !187, file: !186, line: 67, baseType: !167, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !6, file: !1, line: 89, baseType: !208, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !116, !97}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !6, file: !1, line: 90, baseType: !212, size: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !6, file: !1, line: 91, baseType: !9, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !6, file: !1, line: 92, baseType: !9, size: 64, offset: 576)
!218 = !DISubprogram(name: "free", scope: !219, file: !219, line: 565, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!219 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!220 = !DISubprogram(name: "getNeighborBoxes", scope: !57, file: !57, line: 35, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!221 = !DISubroutineType(types: !222)
!222 = !{!24, !223, !24, !69}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!224 = !{!225}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression(DW_OP_constu, 4636993623009254501, DW_OP_stack_value))
!226 = distinct !DIGlobalVariable(name: "amuToInternalMass", scope: !0, file: !227, line: 28, type: !228, isLocal: true, isDefinition: true)
!227 = !DIFile(filename: "./constants.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!229 = !{i32 7, !"Dwarf Version", i32 4}
!230 = !{i32 2, !"Debug Info Version", i32 3}
!231 = !{i32 1, !"wchar_size", i32 4}
!232 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!233 = distinct !DISubprogram(name: "ljDestroy", scope: !1, file: !1, line: 98, type: !213, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !234)
!234 = !{!235, !236}
!235 = !DILocalVariable(name: "inppot", arg: 1, scope: !233, file: !1, line: 98, type: !215)
!236 = !DILocalVariable(name: "pot", scope: !233, file: !1, line: 101, type: !4)
!237 = !DILocation(line: 0, scope: !233)
!238 = !DILocation(line: 100, column: 11, scope: !239)
!239 = distinct !DILexicalBlock(scope: !233, file: !1, line: 100, column: 9)
!240 = !DILocation(line: 100, column: 9, scope: !233)
!241 = !DILocation(line: 101, column: 38, scope: !233)
!242 = !{!243, !243, i64 0}
!243 = !{!"any pointer", !244, i64 0}
!244 = !{!"omnipotent char", !245, i64 0}
!245 = !{!"Simple C/C++ TBAA"}
!246 = !DILocation(line: 102, column: 11, scope: !247)
!247 = distinct !DILexicalBlock(scope: !233, file: !1, line: 102, column: 9)
!248 = !DILocation(line: 102, column: 9, scope: !233)
!249 = !DILocation(line: 103, column: 13, scope: !233)
!250 = !DILocalVariable(name: "ptr", arg: 1, scope: !251, file: !252, line: 26, type: !167)
!251 = distinct !DISubprogram(name: "comdFree", scope: !252, file: !252, line: 26, type: !204, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !253)
!252 = !DIFile(filename: "./memUtils.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!253 = !{!250}
!254 = !DILocation(line: 0, scope: !251, inlinedAt: !255)
!255 = distinct !DILocation(line: 103, column: 4, scope: !233)
!256 = !DILocation(line: 28, column: 4, scope: !251, inlinedAt: !255)
!257 = !DILocation(line: 104, column: 12, scope: !233)
!258 = !DILocation(line: 106, column: 4, scope: !233)
!259 = !DILocation(line: 107, column: 1, scope: !233)
!260 = distinct !DISubprogram(name: "initLjPot", scope: !1, file: !1, line: 110, type: !261, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{!177}
!263 = !{!264}
!264 = !DILocalVariable(name: "pot", scope: !260, file: !1, line: 112, type: !4)
!265 = !DILocalVariable(name: "iSize", arg: 1, scope: !266, file: !252, line: 11, type: !169)
