; ModuleID = 'mycommand.c'
source_filename = "mycommand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CommandSt = type { [1024 x i8], [1024 x i8], [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, double, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [5 x i8] c"pots\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"funcfl\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"help\00", align 1
@.str.4 = private unnamed_addr constant [19 x i8] c"print this message\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"potDir\00", align 1
@.str.6 = private unnamed_addr constant [20 x i8] c"potential directory\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"potName\00", align 1
@.str.8 = private unnamed_addr constant [15 x i8] c"potential name\00", align 1
@.str.9 = private unnamed_addr constant [8 x i8] c"potType\00", align 1
@.str.10 = private unnamed_addr constant [33 x i8] c"potential type (funcfl or setfl)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "mycommand.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{}
!3 = !{!4, !13, !18, !21, !22, !26}
!4 = !DISubprogram(name: "addArg", scope: !5, file: !5, line: 28, type: !6, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!5 = !DIFile(filename: "./cmdLineParser.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !9, !11, !8, !11, !12, !8, !9}
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DISubprogram(name: "processArgs", scope: !5, file: !5, line: 33, type: !14, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !8, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!18 = !DISubprogram(name: "printArgs", scope: !5, file: !5, line: 36, type: !19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{null}
!21 = !DISubprogram(name: "freeArgs", scope: !5, file: !5, line: 38, type: !19, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!22 = !DISubprogram(name: "printRank", scope: !23, file: !23, line: 23, type: !24, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!23 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!24 = !DISubroutineType(types: !25)
!25 = !{!8}
!26 = !DISubprogram(name: "fflush", scope: !27, file: !27, line: 218, type: !28, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!8, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !32, line: 49, size: 1728, elements: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !49, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !77, !81, !82}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !32, line: 51, baseType: !8, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !31, file: !32, line: 54, baseType: !17, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !31, file: !32, line: 55, baseType: !17, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !31, file: !32, line: 56, baseType: !17, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !31, file: !32, line: 57, baseType: !17, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !31, file: !32, line: 58, baseType: !17, size: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !31, file: !32, line: 59, baseType: !17, size: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !31, file: !32, line: 60, baseType: !17, size: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !31, file: !32, line: 61, baseType: !17, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !31, file: !32, line: 64, baseType: !17, size: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !31, file: !32, line: 65, baseType: !17, size: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !31, file: !32, line: 66, baseType: !17, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !31, file: !32, line: 68, baseType: !47, size: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !32, line: 36, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !31, file: !32, line: 70, baseType: !30, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !31, file: !32, line: 72, baseType: !8, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !31, file: !32, line: 73, baseType: !8, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !31, file: !32, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !31, file: !32, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !31, file: !32, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !31, file: !32, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !31, file: !32, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !32, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !32, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !31, file: !32, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !32, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !31, file: !32, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !32, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !31, file: !32, line: 93, baseType: !30, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !31, file: !32, line: 94, baseType: !12, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !31, file: !32, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !31, file: !32, line: 96, baseType: !8, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !31, file: !32, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !{i32 7, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!90 = distinct !DISubprogram(name: "parseCommandLine", scope: !1, file: !1, line: 186, type: !91, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !117)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !8, !16}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Command", file: !94, line: 29, baseType: !95)
!94 = !DIFile(filename: "./mycommand.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CommandSt", file: !94, line: 11, size: 25152, elements: !96)
!96 = !{!97, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !114, !115, !116}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "potDir", scope: !95, file: !94, line: 13, baseType: !98, size: 8192)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8192, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "potName", scope: !95, file: !94, line: 14, baseType: !98, size: 8192, offset: 8192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "potType", scope: !95, file: !94, line: 15, baseType: !98, size: 8192, offset: 16384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "doeam", scope: !95, file: !94, line: 16, baseType: !8, size: 32, offset: 24576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !95, file: !94, line: 17, baseType: !8, size: 32, offset: 24608)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !95, file: !94, line: 18, baseType: !8, size: 32, offset: 24640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !95, file: !94, line: 19, baseType: !8, size: 32, offset: 24672)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xproc", scope: !95, file: !94, line: 20, baseType: !8, size: 32, offset: 24704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "yproc", scope: !95, file: !94, line: 21, baseType: !8, size: 32, offset: 24736)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "zproc", scope: !95, file: !94, line: 22, baseType: !8, size: 32, offset: 24768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !95, file: !94, line: 23, baseType: !8, size: 32, offset: 24800)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !95, file: !94, line: 24, baseType: !8, size: 32, offset: 24832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !95, file: !94, line: 25, baseType: !113, size: 64, offset: 24896)
!113 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !95, file: !94, line: 26, baseType: !113, size: 64, offset: 24960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "temperature", scope: !95, file: !94, line: 27, baseType: !113, size: 64, offset: 25024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "initialDelta", scope: !95, file: !94, line: 28, baseType: !113, size: 64, offset: 25088)
!117 = !{!118, !119, !120, !121}
!118 = !DILocalVariable(name: "argc", arg: 1, scope: !90, file: !1, line: 186, type: !8)
!119 = !DILocalVariable(name: "argv", arg: 2, scope: !90, file: !1, line: 186, type: !16)
!120 = !DILocalVariable(name: "cmd", scope: !90, file: !1, line: 188, type: !93)
!121 = !DILocalVariable(name: "help", scope: !90, file: !1, line: 210, type: !8)
!122 = !DILocation(line: 0, scope: !90)
!123 = !DILocation(line: 188, column: 12, scope: !90)
!124 = !DILocation(line: 190, column: 4, scope: !90)
!125 = !DILocation(line: 191, column: 4, scope: !90)
!126 = !DILocation(line: 192, column: 4, scope: !90)
!127 = !DILocation(line: 193, column: 4, scope: !90)
!128 = !DILocation(line: 194, column: 4, scope: !90)
!129 = !DILocation(line: 195, column: 4, scope: !90)
!130 = !DILocation(line: 196, column: 8, scope: !90)
!131 = !DILocation(line: 197, column: 8, scope: !90)
!132 = !DILocation(line: 198, column: 8, scope: !90)
!133 = !DILocation(line: 199, column: 8, scope: !90)
!134 = !DILocation(line: 200, column: 8, scope: !90)
!135 = !DILocation(line: 201, column: 8, scope: !90)
!136 = !DILocation(line: 202, column: 8, scope: !90)
!137 = !DILocation(line: 203, column: 8, scope: !90)
!138 = !DILocation(line: 196, column: 14, scope: !90)
!139 = !{!140, !140, i64 0}
!140 = !{!"int", !141, i64 0}
!141 = !{!"omnipotent char", !142, i64 0}
!142 = !{!"Simple C/C++ TBAA"}
!143 = !DILocation(line: 204, column: 8, scope: !90)
!144 = !DILocation(line: 204, column: 18, scope: !90)
!145 = !{!146, !140, i64 3104}
!146 = !{!"CommandSt", !141, i64 0, !141, i64 1024, !141, i64 2048, !140, i64 3072, !140, i64 3076, !140, i64 3080, !140, i64 3084, !140, i64 3088, !140, i64 3092, !140, i64 3096, !140, i64 3100, !140, i64 3104, !147, i64 3112, !147, i64 3120, !147, i64 3128, !147, i64 3136}
!147 = !{!"double", !141, i64 0}
!148 = !DILocation(line: 205, column: 8, scope: !90)
!149 = !DILocation(line: 206, column: 8, scope: !90)
!150 = !DILocation(line: 207, column: 8, scope: !90)
!151 = !DILocation(line: 208, column: 8, scope: !90)
!152 = !DILocation(line: 205, column: 11, scope: !90)
!153 = !{!147, !147, i64 0}
!154 = !DILocation(line: 210, column: 4, scope: !90)
!155 = !DILocation(line: 210, column: 8, scope: !90)
!156 = !DILocation(line: 212, column: 4, scope: !90)
!157 = !DILocation(line: 213, column: 4, scope: !90)
!158 = !DILocation(line: 214, column: 4, scope: !90)
!159 = !DILocation(line: 215, column: 4, scope: !90)
!160 = !DILocation(line: 216, column: 39, scope: !90)
!161 = !DILocation(line: 216, column: 4, scope: !90)
!162 = !DILocation(line: 217, column: 39, scope: !90)
!163 = !DILocation(line: 217, column: 4, scope: !90)
!164 = !DILocation(line: 218, column: 39, scope: !90)
!165 = !DILocation(line: 218, column: 4, scope: !90)
!166 = !DILocation(line: 219, column: 39, scope: !90)
!167 = !DILocation(line: 219, column: 4, scope: !90)
!168 = !DILocation(line: 220, column: 39, scope: !90)
!169 = !DILocation(line: 220, column: 4, scope: !90)
!170 = !DILocation(line: 221, column: 39, scope: !90)
!171 = !DILocation(line: 221, column: 4, scope: !90)
!172 = !DILocation(line: 222, column: 39, scope: !90)
!173 = !DILocation(line: 222, column: 4, scope: !90)
!174 = !DILocation(line: 223, column: 39, scope: !90)
!175 = !DILocation(line: 223, column: 4, scope: !90)
!176 = !DILocation(line: 224, column: 39, scope: !90)
!177 = !DILocation(line: 224, column: 4, scope: !90)
!178 = !DILocation(line: 225, column: 39, scope: !90)
!179 = !DILocation(line: 225, column: 4, scope: !90)
!180 = !DILocation(line: 226, column: 39, scope: !90)
!181 = !DILocation(line: 226, column: 4, scope: !90)
!182 = !DILocation(line: 227, column: 39, scope: !90)
!183 = !DILocation(line: 227, column: 4, scope: !90)
!184 = !DILocation(line: 228, column: 39, scope: !90)
!185 = !DILocation(line: 228, column: 4, scope: !90)
