; ModuleID = 'parallel.c'
source_filename = "parallel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.RankReduceDataSt = type { double, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [8 x i8] c"%s: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"source == dest\00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"parallel.c\00", align 1
@__PRETTY_FUNCTION__.sendReceiveParallel = private unnamed_addr constant [60 x i8] c"int sendReceiveParallel(void *, int, int, void *, int, int)\00", align 1

; Function Attrs: norecurse nounwind readnone uwtable
define dso_local i32 @getNRanks() local_unnamed_addr #0 !dbg !91 {
entry:
  ret i32 1, !dbg !94
}

; Function Attrs: norecurse nounwind readnone uwtable
define dso_local i32 @getMyRank() local_unnamed_addr #0 !dbg !95 {
entry:
  ret i32 0, !dbg !96
}

; Function Attrs: norecurse nounwind readnone uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !82, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "parallel.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{}
!3 = !{!4, !8, !14, !21}
!4 = !DISubprogram(name: "barrierParallel", scope: !5, file: !5, line: 35, type: !6, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!5 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!6 = !DISubroutineType(types: !7)
!7 = !{null}
!8 = !DISubprogram(name: "time", scope: !9, file: !9, line: 75, type: !10, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!9 = !DIFile(filename: "/usr/include/time.h", directory: "")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13}
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!14 = !DISubprogram(name: "ctime", scope: !9, file: !9, line: 142, type: !15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!21 = !DISubprogram(name: "fflush", scope: !22, file: !22, line: 218, type: !23, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!22 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !26}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !45, !46, !47, !48, !51, !53, !55, !59, !62, !64, !67, !70, !71, !73, !77, !78}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !25, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !17, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !17, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !17, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !17, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !17, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !17, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !17, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !17, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !17, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !17, size: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !17, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !26, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !25, size: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !25, size: 32, offset: 928)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !49, size: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !12)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !52, size: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !54, size: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !56, size: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !60, size: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !63, size: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !12)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !65, size: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !68, size: 64, offset: 1280)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !26, size: 64, offset: 1344)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !72, size: 64, offset: 1408)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !74, size: 64, offset: 1472)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !25, size: 32, offset: 1536)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !79, size: 160, offset: 1568)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 20)
!82 = !{!83, !85}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "nRanks", scope: !0, file: !1, line: 20, type: !25, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "myRank", scope: !0, file: !1, line: 19, type: !25, isLocal: true, isDefinition: true)
!87 = !{i32 7, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{i32 1, !"wchar_size", i32 4}
!90 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!91 = distinct !DISubprogram(name: "getNRanks", scope: !1, file: !1, line: 31, type: !92, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!92 = !DISubroutineType(types: !93)
!93 = !{!25}
!94 = !DILocation(line: 33, column: 4, scope: !91)
!95 = distinct !DISubprogram(name: "getMyRank", scope: !1, file: !1, line: 36, type: !92, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!96 = !DILocation(line: 38, column: 4, scope: !95)
!97 = distinct !DISubprogram(name: "printRank", scope: !1, file: !1, line: 45, type: !92, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!98 = !DILocation(line: 49, column: 1, scope: !97)
!99 = distinct !DISubprogram(name: "timestampBarrier", scope: !1, file: !1, line: 51, type: !100, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !104)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!104 = !{!105, !106, !110}
!105 = !DILocalVariable(name: "msg", arg: 1, scope: !99, file: !1, line: 51, type: !102)
!106 = !DILocalVariable(name: "t", scope: !99, file: !1, line: 56, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !108, line: 7, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 160, baseType: !12)
!110 = !DILocalVariable(name: "timeString", scope: !99, file: !1, line: 57, type: !17)
!111 = !DILocation(line: 0, scope: !99)
!112 = !DILocation(line: 56, column: 4, scope: !99)
!113 = !DILocation(line: 56, column: 14, scope: !99)
!114 = !DILocation(line: 56, column: 11, scope: !99)
!115 = !{!116, !116, i64 0}
!116 = !{!"long", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !DILocation(line: 57, column: 23, scope: !99)
!120 = !DILocation(line: 58, column: 4, scope: !99)
!121 = !DILocation(line: 58, column: 19, scope: !99)
!122 = !{!117, !117, i64 0}
!123 = !DILocation(line: 59, column: 12, scope: !99)
!124 = !{!125, !125, i64 0}
!125 = !{!"any pointer", !117, i64 0}
!126 = !DILocation(line: 59, column: 4, scope: !99)
!127 = !DILocation(line: 60, column: 11, scope: !99)
!128 = !DILocation(line: 60, column: 4, scope: !99)
!129 = !DILocation(line: 61, column: 1, scope: !99)
!130 = distinct !DISubprogram(name: "barrierParallel", scope: !1, file: !1, line: 79, type: !6, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!131 = !DILocation(line: 84, column: 1, scope: !130)
!132 = distinct !DISubprogram(name: "initParallel", scope: !1, file: !1, line: 63, type: !133, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !138)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135, !136}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!138 = !{!139, !140}
!139 = !DILocalVariable(name: "argc", arg: 1, scope: !132, file: !1, line: 63, type: !135)
!140 = !DILocalVariable(name: "argv", arg: 2, scope: !132, file: !1, line: 63, type: !136)
!141 = !DILocation(line: 0, scope: !132)
!142 = !DILocation(line: 70, column: 1, scope: !132)
!143 = distinct !DISubprogram(name: "destroyParallel", scope: !1, file: !1, line: 72, type: !6, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!144 = !DILocation(line: 77, column: 1, scope: !143)
!145 = distinct !DISubprogram(name: "sendReceiveParallel", scope: !1, file: !1, line: 93, type: !146, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{!25, !72, !25, !25, !72, !25, !25}
!148 = !{!149, !150, !151, !152, !153, !154}
!149 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !145, file: !1, line: 93, type: !72)
!150 = !DILocalVariable(name: "sendLen", arg: 2, scope: !145, file: !1, line: 93, type: !25)
!151 = !DILocalVariable(name: "dest", arg: 3, scope: !145, file: !1, line: 93, type: !25)
!152 = !DILocalVariable(name: "recvBuf", arg: 4, scope: !145, file: !1, line: 94, type: !72)
!153 = !DILocalVariable(name: "recvLen", arg: 5, scope: !145, file: !1, line: 94, type: !25)
!154 = !DILocalVariable(name: "source", arg: 6, scope: !145, file: !1, line: 94, type: !25)
!155 = !DILocation(line: 0, scope: !145)
!156 = !DILocation(line: 106, column: 4, scope: !157)
!157 = distinct !DILexicalBlock(scope: !158, file: !1, line: 106, column: 4)
!158 = distinct !DILexicalBlock(scope: !145, file: !1, line: 106, column: 4)
!159 = !DILocation(line: 106, column: 4, scope: !158)
!160 = !DILocation(line: 107, column: 29, scope: !145)
!161 = !DILocation(line: 107, column: 4, scope: !145)
!162 = !DILocation(line: 109, column: 4, scope: !145)
!163 = distinct !DISubprogram(name: "addIntParallel", scope: !1, file: !1, line: 113, type: !164, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !135, !135, !25}
!166 = !{!167, !168, !169, !170}
!167 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !163, file: !1, line: 113, type: !135)
!168 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !163, file: !1, line: 113, type: !135)
!169 = !DILocalVariable(name: "count", arg: 3, scope: !163, file: !1, line: 113, type: !25)
!170 = !DILocalVariable(name: "ii", scope: !171, file: !1, line: 118, type: !25)
!171 = distinct !DILexicalBlock(scope: !163, file: !1, line: 118, column: 4)
!172 = !DILocation(line: 0, scope: !163)
!173 = !DILocation(line: 0, scope: !171)
!174 = !DILocation(line: 118, column: 21, scope: !175)
!175 = distinct !DILexicalBlock(scope: !171, file: !1, line: 118, column: 4)
!176 = !DILocation(line: 118, column: 4, scope: !171)
!177 = !DILocation(line: 118, column: 29, scope: !175)
!178 = !DILocation(line: 119, column: 21, scope: !175)
!179 = !{!180, !180, i64 0}
!180 = !{!"int", !117, i64 0}
!181 = !DILocation(line: 119, column: 7, scope: !175)
!182 = !DILocation(line: 119, column: 19, scope: !175)
!183 = distinct !{!183, !176, !184, !185}
!184 = !DILocation(line: 119, column: 31, scope: !171)
!185 = !{!"llvm.loop.isvectorized", i32 1}
!186 = !{i64 1}
!187 = !{i64 4}
!188 = distinct !{!188, !189}
!189 = !{!"llvm.loop.unroll.disable"}
!190 = !DILocation(line: 121, column: 1, scope: !163)
!191 = distinct !{!191, !176, !184, !192, !185}
!192 = !{!"llvm.loop.unroll.runtime.disable"}
!193 = !{i64 2}
!194 = !{i64 1000}
!195 = distinct !DISubprogram(name: "addRealParallel", scope: !1, file: !1, line: 123, type: !196, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !202)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !25}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !200, line: 13, baseType: !201)
!200 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!201 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!202 = !{!203, !204, !205, !206}
!203 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !195, file: !1, line: 123, type: !198)
!204 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !195, file: !1, line: 123, type: !198)
!205 = !DILocalVariable(name: "count", arg: 3, scope: !195, file: !1, line: 123, type: !25)
!206 = !DILocalVariable(name: "ii", scope: !207, file: !1, line: 128, type: !25)
!207 = distinct !DILexicalBlock(scope: !195, file: !1, line: 128, column: 4)
!208 = !DILocation(line: 0, scope: !195)
!209 = !DILocation(line: 0, scope: !207)
!210 = !DILocation(line: 128, column: 21, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !1, line: 128, column: 4)
!212 = !DILocation(line: 128, column: 4, scope: !207)
!213 = !DILocation(line: 128, column: 29, scope: !211)
!214 = !DILocation(line: 129, column: 21, scope: !211)
!215 = !{!216, !216, i64 0}
!216 = !{!"double", !117, i64 0}
!217 = !DILocation(line: 129, column: 7, scope: !211)
!218 = !DILocation(line: 129, column: 19, scope: !211)
!219 = distinct !{!219, !212, !220, !185}
!220 = !DILocation(line: 129, column: 31, scope: !207)
!221 = distinct !{!221, !189}
!222 = !DILocation(line: 131, column: 1, scope: !195)
!223 = distinct !{!223, !212, !220, !192, !185}
!224 = distinct !DISubprogram(name: "addDoubleParallel", scope: !1, file: !1, line: 133, type: !225, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !228)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !227, !227, !25}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!228 = !{!229, !230, !231, !232}
!229 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !224, file: !1, line: 133, type: !227)
!230 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !224, file: !1, line: 133, type: !227)
!231 = !DILocalVariable(name: "count", arg: 3, scope: !224, file: !1, line: 133, type: !25)
!232 = !DILocalVariable(name: "ii", scope: !233, file: !1, line: 138, type: !25)
!233 = distinct !DILexicalBlock(scope: !224, file: !1, line: 138, column: 4)
!234 = !DILocation(line: 0, scope: !224)
!235 = !DILocation(line: 0, scope: !233)
!236 = !DILocation(line: 138, column: 21, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !1, line: 138, column: 4)
!238 = !DILocation(line: 138, column: 4, scope: !233)
!239 = !DILocation(line: 138, column: 29, scope: !237)
!240 = !DILocation(line: 139, column: 21, scope: !237)
!241 = !DILocation(line: 139, column: 7, scope: !237)
!242 = !DILocation(line: 139, column: 19, scope: !237)
!243 = distinct !{!243, !238, !244, !185}
!244 = !DILocation(line: 139, column: 31, scope: !233)
!245 = distinct !{!245, !189}
!246 = !DILocation(line: 141, column: 1, scope: !224)
!247 = distinct !{!247, !238, !244, !192, !185}
!248 = distinct !DISubprogram(name: "maxIntParallel", scope: !1, file: !1, line: 143, type: !164, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !248, file: !1, line: 143, type: !135)
!251 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !248, file: !1, line: 143, type: !135)
!252 = !DILocalVariable(name: "count", arg: 3, scope: !248, file: !1, line: 143, type: !25)
!253 = !DILocalVariable(name: "ii", scope: !254, file: !1, line: 148, type: !25)
!254 = distinct !DILexicalBlock(scope: !248, file: !1, line: 148, column: 4)
!255 = !DILocation(line: 0, scope: !248)
!256 = !DILocation(line: 0, scope: !254)
!257 = !DILocation(line: 148, column: 21, scope: !258)
!258 = distinct !DILexicalBlock(scope: !254, file: !1, line: 148, column: 4)
!259 = !DILocation(line: 148, column: 4, scope: !254)
!260 = !DILocation(line: 148, column: 29, scope: !258)
!261 = !DILocation(line: 149, column: 21, scope: !258)
!262 = !DILocation(line: 149, column: 7, scope: !258)
!263 = !DILocation(line: 149, column: 19, scope: !258)
!264 = distinct !{!264, !259, !265, !185}
!265 = !DILocation(line: 149, column: 31, scope: !254)
!266 = distinct !{!266, !189}
!267 = !DILocation(line: 151, column: 1, scope: !248)
!268 = distinct !{!268, !259, !265, !192, !185}
!269 = distinct !DISubprogram(name: "minRankDoubleParallel", scope: !1, file: !1, line: 154, type: !270, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !278)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !272, !272, !25}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "RankReduceData", file: !5, line: 14, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RankReduceDataSt", file: !5, line: 10, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !274, file: !5, line: 12, baseType: !201, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !274, file: !5, line: 13, baseType: !25, size: 32, offset: 64)
!278 = !{!279, !280, !281, !282}
!279 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !269, file: !1, line: 154, type: !272)
!280 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !269, file: !1, line: 154, type: !272)
!281 = !DILocalVariable(name: "count", arg: 3, scope: !269, file: !1, line: 154, type: !25)
!282 = !DILocalVariable(name: "ii", scope: !283, file: !1, line: 159, type: !25)
!283 = distinct !DILexicalBlock(scope: !269, file: !1, line: 159, column: 4)
!284 = !DILocation(line: 0, scope: !269)
!285 = !DILocation(line: 0, scope: !283)
!286 = !DILocation(line: 159, column: 21, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !1, line: 159, column: 4)
!288 = !DILocation(line: 159, column: 4, scope: !283)
!289 = !DILocation(line: 161, column: 25, scope: !290)
!290 = distinct !DILexicalBlock(scope: !287, file: !1, line: 160, column: 4)
!291 = !DILocation(line: 161, column: 37, scope: !290)
!292 = !{!293, !216, i64 0}
!293 = !{!"RankReduceDataSt", !216, i64 0, !180, i64 8}
!294 = !DILocation(line: 161, column: 7, scope: !290)
!295 = !DILocation(line: 161, column: 23, scope: !290)
!296 = !DILocation(line: 162, column: 38, scope: !290)
!297 = !{!293, !180, i64 8}
!298 = !DILocation(line: 162, column: 19, scope: !290)
!299 = !DILocation(line: 162, column: 24, scope: !290)
!300 = !DILocation(line: 165, column: 1, scope: !269)
!301 = !DILocation(line: 159, column: 29, scope: !287)
!302 = distinct !{!302, !288, !303}
!303 = !DILocation(line: 163, column: 4, scope: !283)
!304 = distinct !DISubprogram(name: "maxRankDoubleParallel", scope: !1, file: !1, line: 167, type: !270, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DILocalVariable(name: "sendBuf", arg: 1, scope: !304, file: !1, line: 167, type: !272)
!307 = !DILocalVariable(name: "recvBuf", arg: 2, scope: !304, file: !1, line: 167, type: !272)
!308 = !DILocalVariable(name: "count", arg: 3, scope: !304, file: !1, line: 167, type: !25)
!309 = !DILocalVariable(name: "ii", scope: !310, file: !1, line: 172, type: !25)
!310 = distinct !DILexicalBlock(scope: !304, file: !1, line: 172, column: 4)
!311 = !DILocation(line: 0, scope: !304)
!312 = !DILocation(line: 0, scope: !310)
!313 = !DILocation(line: 172, column: 21, scope: !314)
!314 = distinct !DILexicalBlock(scope: !310, file: !1, line: 172, column: 4)
!315 = !DILocation(line: 172, column: 4, scope: !310)
!316 = !DILocation(line: 174, column: 25, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !1, line: 173, column: 4)
!318 = !DILocation(line: 174, column: 37, scope: !317)
!319 = !DILocation(line: 174, column: 7, scope: !317)
!320 = !DILocation(line: 174, column: 23, scope: !317)
!321 = !DILocation(line: 175, column: 38, scope: !317)
!322 = !DILocation(line: 175, column: 19, scope: !317)
!323 = !DILocation(line: 175, column: 24, scope: !317)
!324 = !DILocation(line: 178, column: 1, scope: !304)
!325 = !DILocation(line: 172, column: 29, scope: !314)
!326 = distinct !{!326, !315, !327}
!327 = !DILocation(line: 176, column: 4, scope: !310)
!328 = distinct !DISubprogram(name: "bcastParallel", scope: !1, file: !1, line: 181, type: !329, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !72, !25, !25}
!331 = !{!332, !333, !334}
!332 = !DILocalVariable(name: "buf", arg: 1, scope: !328, file: !1, line: 181, type: !72)
!333 = !DILocalVariable(name: "count", arg: 2, scope: !328, file: !1, line: 181, type: !25)
!334 = !DILocalVariable(name: "root", arg: 3, scope: !328, file: !1, line: 181, type: !25)
!335 = !DILocation(line: 0, scope: !328)
!336 = !DILocation(line: 186, column: 1, scope: !328)
