; ModuleID = 'timestep.c'
source_filename = "timestep.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SimFlatSt = type { i32, i32, double, %struct.DomainSt*, %struct.LinkCellSt*, %struct.AtomsSt*, %struct.SpeciesDataSt*, double, double, %struct.BasePotentialSt*, %struct.HaloExchangeSt* }
%struct.DomainSt = type { [3 x i32], [3 x i32], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double] }
%struct.LinkCellSt = type { [3 x i32], i32, i32, i32, [3 x double], [3 x double], [3 x double], [3 x double], i32* }
%struct.AtomsSt = type { i32, i32, i32*, i32*, [3 x double]*, [3 x double]*, [3 x double]*, double* }
%struct.SpeciesDataSt = type { [3 x i8], i32, double }
%struct.BasePotentialSt = type { double, double, double, [8 x i8], [3 x i8], i32, i32 (%struct.SimFlatSt*)*, void (%struct._IO_FILE*, %struct.BasePotentialSt*)*, void (%struct.BasePotentialSt**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.HaloExchangeSt = type { [6 x i32], i32, i32 (i8*, i8*, i32, i8*)*, void (i8*, i8*, i32, i32, i8*)*, void (i8*)*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "timestep.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimerHandle", file: !4, line: 9, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./performanceTimers.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "totalTimer", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "loopTimer", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "timestepTimer", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "positionTimer", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "velocityTimer", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "redistributeTimer", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "atomHaloTimer", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "computeForceTimer", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "eamHaloTimer", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "commHaloTimer", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "commReduceTimer", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "numberOfTimers", value: 11, isUnsigned: true)
!19 = !{!20, !24, !25, !216, !217, !218, !223, !228, !232}
!20 = !DISubprogram(name: "profileStart", scope: !4, file: !4, line: 57, type: !21, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!21 = !DISubroutineType(types: !22)
!22 = !{null, !3}
!23 = !{}
!24 = !DISubprogram(name: "profileStop", scope: !4, file: !4, line: 58, type: !21, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!25 = !DISubprogram(name: "redistributeAtoms", scope: !26, file: !26, line: 14, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!26 = !DIFile(filename: "./timestep.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimFlatSt", file: !31, line: 62, size: 640, elements: !32)
!31 = !DIFile(filename: "./CoMDTypes.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!32 = !{!33, !35, !36, !38, !59, !75, !91, !101, !102, !103, !192}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nSteps", scope: !30, file: !31, line: 64, baseType: !34, size: 32)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "printRate", scope: !30, file: !31, line: 65, baseType: !34, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !30, file: !31, line: 66, baseType: !37, size: 64, offset: 64)
!37 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !30, file: !31, line: 68, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "Domain", file: !41, line: 25, baseType: !42)
!41 = !DIFile(filename: "./decomposition.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DomainSt", file: !41, line: 10, size: 1344, elements: !43)
!43 = !{!44, !48, !49, !54, !55, !56, !57, !58}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "procGrid", scope: !42, file: !41, line: 13, baseType: !45, size: 96)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 96, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "procCoord", scope: !42, file: !41, line: 14, baseType: !45, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "globalMin", scope: !42, file: !41, line: 17, baseType: !50, size: 192, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "real3", file: !51, line: 18, baseType: !52)
!51 = !DIFile(filename: "./mytype.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 192, elements: !46)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_t", file: !51, line: 13, baseType: !37)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "globalMax", scope: !42, file: !41, line: 18, baseType: !50, size: 192, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "globalExtent", scope: !42, file: !41, line: 19, baseType: !50, size: 192, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !42, file: !41, line: 22, baseType: !50, size: 192, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !42, file: !41, line: 23, baseType: !50, size: 192, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "localExtent", scope: !42, file: !41, line: 24, baseType: !50, size: 192, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "boxes", scope: !30, file: !31, line: 70, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkCell", file: !62, line: 30, baseType: !63)
!62 = !DIFile(filename: "./linkCells.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkCellSt", file: !62, line: 17, size: 1024, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "gridSize", scope: !63, file: !62, line: 19, baseType: !45, size: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nLocalBoxes", scope: !63, file: !62, line: 20, baseType: !34, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nHaloBoxes", scope: !63, file: !62, line: 21, baseType: !34, size: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nTotalBoxes", scope: !63, file: !62, line: 22, baseType: !34, size: 32, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "localMin", scope: !63, file: !62, line: 24, baseType: !50, size: 192, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "localMax", scope: !63, file: !62, line: 25, baseType: !50, size: 192, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "boxSize", scope: !63, file: !62, line: 26, baseType: !50, size: 192, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "invBoxSize", scope: !63, file: !62, line: 27, baseType: !50, size: 192, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nAtoms", scope: !63, file: !62, line: 29, baseType: !74, size: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !30, file: !31, line: 72, baseType: !76, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atoms", file: !78, line: 26, baseType: !79)
!78 = !DIFile(filename: "./initAtoms.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomsSt", file: !78, line: 13, size: 448, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !87, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nLocal", scope: !79, file: !78, line: 16, baseType: !34, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nGlobal", scope: !79, file: !78, line: 17, baseType: !34, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !79, file: !78, line: 19, baseType: !74, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "iSpecies", scope: !79, file: !78, line: 20, baseType: !74, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !79, file: !78, line: 22, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !79, file: !78, line: 23, baseType: !86, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !79, file: !78, line: 24, baseType: !86, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !79, file: !78, line: 25, baseType: !90, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "species", scope: !30, file: !31, line: 74, baseType: !92, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpeciesData", file: !31, line: 48, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpeciesDataSt", file: !31, line: 43, size: 128, elements: !95)
!95 = !{!96, !99, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !31, line: 45, baseType: !97, size: 24)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 24, elements: !46)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !94, file: !31, line: 46, baseType: !34, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !94, file: !31, line: 47, baseType: !53, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ePotential", scope: !30, file: !31, line: 76, baseType: !53, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "eKinetic", scope: !30, file: !31, line: 77, baseType: !53, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pot", scope: !30, file: !31, line: 79, baseType: !104, size: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "BasePotential", file: !31, line: 39, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BasePotentialSt", file: !31, line: 28, size: 512, elements: !107)
!107 = !{!108, !109, !110, !111, !115, !116, !117, !121, !187}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !106, file: !31, line: 30, baseType: !53, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !106, file: !31, line: 31, baseType: !53, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lat", scope: !106, file: !31, line: 32, baseType: !53, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "latticeType", scope: !106, file: !31, line: 33, baseType: !112, size: 64, offset: 192)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !31, line: 34, baseType: !97, size: 24, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "atomicNo", scope: !106, file: !31, line: 35, baseType: !34, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !106, file: !31, line: 36, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!34, !29}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !106, file: !31, line: 37, baseType: !122, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125, !186}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !127, line: 7, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !129, line: 49, size: 1728, elements: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!130 = !{!131, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !147, !149, !150, !151, !155, !157, !159, !163, !166, !168, !171, !174, !175, !177, !181, !182}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !128, file: !129, line: 51, baseType: !34, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !128, file: !129, line: 54, baseType: !133, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !128, file: !129, line: 55, baseType: !133, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !128, file: !129, line: 56, baseType: !133, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !128, file: !129, line: 57, baseType: !133, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !128, file: !129, line: 58, baseType: !133, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !128, file: !129, line: 59, baseType: !133, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !128, file: !129, line: 60, baseType: !133, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !128, file: !129, line: 61, baseType: !133, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !128, file: !129, line: 64, baseType: !133, size: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !128, file: !129, line: 65, baseType: !133, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !128, file: !129, line: 66, baseType: !133, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !128, file: !129, line: 68, baseType: !145, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !129, line: 36, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !128, file: !129, line: 70, baseType: !148, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !128, file: !129, line: 72, baseType: !34, size: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !128, file: !129, line: 73, baseType: !34, size: 32, offset: 928)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !128, file: !129, line: 74, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !153, line: 152, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!154 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !128, file: !129, line: 77, baseType: !156, size: 16, offset: 1024)
!156 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !128, file: !129, line: 78, baseType: !158, size: 8, offset: 1040)
!158 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !128, file: !129, line: 79, baseType: !160, size: 8, offset: 1048)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !128, file: !129, line: 81, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !129, line: 43, baseType: null)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !128, file: !129, line: 89, baseType: !167, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !153, line: 153, baseType: !154)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !128, file: !129, line: 91, baseType: !169, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !129, line: 37, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !128, file: !129, line: 92, baseType: !172, size: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !129, line: 38, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !128, file: !129, line: 93, baseType: !148, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !128, file: !129, line: 94, baseType: !176, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !128, file: !129, line: 95, baseType: !178, size: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 46, baseType: !180)
!179 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!180 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !128, file: !129, line: 96, baseType: !34, size: 32, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !128, file: !129, line: 98, baseType: !183, size: 160, offset: 1568)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 160, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 20)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !106, file: !31, line: 38, baseType: !188, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "atomExchange", scope: !30, file: !31, line: 81, baseType: !193, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "HaloExchange", file: !195, line: 69, baseType: !196)
!195 = !DIFile(filename: "./haloExchange.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HaloExchangeSt", file: !195, line: 26, size: 512, elements: !197)
!197 = !{!198, !202, !203, !207, !211, !215}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nbrRank", scope: !196, file: !195, line: 30, baseType: !199, size: 192)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 192, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 6)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "bufCapacity", scope: !196, file: !195, line: 33, baseType: !34, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "loadBuffer", scope: !196, file: !195, line: 47, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!34, !176, !176, !34, !133}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "unloadBuffer", scope: !196, file: !195, line: 61, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !176, !176, !34, !34, !133}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !196, file: !195, line: 64, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !176}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parms", scope: !196, file: !195, line: 67, baseType: !176, size: 64, offset: 448)
!216 = !DISubprogram(name: "computeForce", scope: !26, file: !26, line: 10, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!217 = !DISubprogram(name: "kineticEnergy", scope: !26, file: !26, line: 11, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!218 = !DISubprogram(name: "addRealParallel", scope: !219, file: !219, line: 45, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!219 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !222, !34}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!223 = !DISubprogram(name: "updateLinkCells", scope: !62, file: !62, line: 45, type: !224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !227}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!228 = !DISubprogram(name: "haloExchange", scope: !195, file: !195, line: 81, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !176}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!232 = !DISubprogram(name: "sortAtomsInCell", scope: !195, file: !195, line: 84, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !23)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !227, !226, !34}
!235 = !{i32 7, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{i32 1, !"wchar_size", i32 4}
!238 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!239 = distinct !DISubprogram(name: "timestep", scope: !1, file: !1, line: 31, type: !240, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!240 = !DISubroutineType(types: !241)
!241 = !{!37, !242, !34, !53}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "SimFlat", file: !31, line: 83, baseType: !30)
!244 = !{!245, !246, !247, !248}
!245 = !DILocalVariable(name: "s", arg: 1, scope: !239, file: !1, line: 31, type: !242)
!246 = !DILocalVariable(name: "nSteps", arg: 2, scope: !239, file: !1, line: 31, type: !34)
!247 = !DILocalVariable(name: "dt", arg: 3, scope: !239, file: !1, line: 31, type: !53)
!248 = !DILocalVariable(name: "ii", scope: !249, file: !1, line: 33, type: !34)
!249 = distinct !DILexicalBlock(scope: !239, file: !1, line: 33, column: 4)
!250 = !DILocation(line: 0, scope: !239)
!251 = !DILocation(line: 0, scope: !249)
!252 = !DILocation(line: 33, column: 21, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !1, line: 33, column: 4)
!254 = !DILocation(line: 33, column: 4, scope: !249)
!255 = !DILocation(line: 0, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !1, line: 34, column: 4)
!257 = !DILocation(line: 0, scope: !258, inlinedAt: !274)
!258 = distinct !DILexicalBlock(scope: !259, file: !1, line: 72, column: 7)
!259 = distinct !DILexicalBlock(scope: !260, file: !1, line: 71, column: 7)
!260 = distinct !DILexicalBlock(scope: !261, file: !1, line: 71, column: 7)
!261 = distinct !DILexicalBlock(scope: !262, file: !1, line: 70, column: 4)
!262 = distinct !DILexicalBlock(scope: !263, file: !1, line: 69, column: 4)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 69, column: 4)
