; ModuleID = 'yamlOutput.c'
source_filename = "yamlOutput.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@yamlFile = dso_local local_unnamed_addr global %struct._IO_FILE* null, align 8, !dbg !0
@.str = private unnamed_addr constant [30 x i8] c"%04d:%02d:%02d-%02d:%02d:%02d\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"%s.%s.yaml\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.3 = private unnamed_addr constant [31 x i8] c"Mini-Application Name    : %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [31 x i8] c"Mini-Application Version : %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"Platform:\0A\00", align 1
@.str.6 = private unnamed_addr constant [16 x i8] c"  hostname: %s\0A\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"Barak\00", align 1
@.str.8 = private unnamed_addr constant [19 x i8] c"  kernel name: %s\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "yamlFile", scope: !2, file: !3, line: 23, type: !112, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !107, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "yamlOutput.c", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!4 = !{}
!5 = !{!6, !11, !17, !40, !101, !102, !106}
!6 = !DISubprogram(name: "printRank", scope: !7, file: !7, line: 23, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "./parallel.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!8 = !DISubroutineType(types: !9)
!9 = !{!10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DISubprogram(name: "time", scope: !12, file: !12, line: 75, type: !13, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!12 = !DIFile(filename: "/usr/include/time.h", directory: "")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16}
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!17 = !DISubprogram(name: "localtime", scope: !12, file: !12, line: 123, type: !18, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !38}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !22, line: 7, size: 448, elements: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !21, file: !22, line: 9, baseType: !10, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !21, file: !22, line: 10, baseType: !10, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !21, file: !22, line: 11, baseType: !10, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !21, file: !22, line: 12, baseType: !10, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !21, file: !22, line: 13, baseType: !10, size: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !21, file: !22, line: 14, baseType: !10, size: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !21, file: !22, line: 15, baseType: !10, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !21, file: !22, line: 16, baseType: !10, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !21, file: !22, line: 17, baseType: !10, size: 32, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !21, file: !22, line: 20, baseType: !15, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !21, file: !22, line: 21, baseType: !35, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!40 = !DISubprogram(name: "printSeparator", scope: !41, file: !41, line: 17, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!41 = !DIFile(filename: "./yamlOutput.h", directory: "/home/shalini/LOF_test/benchmarks/CoMD/src-mpi")
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !64, !65, !66, !67, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !10, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !50, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !50, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !50, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !50, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !50, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !50, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !50, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !50, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !50, size: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !50, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !10, size: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !10, size: 32, offset: 928)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !15)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !15)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "IR2Vec-LoopOptimizationFramework/build_release/lib/clang/10.0.1/include/stddef.h", directory: "/home/shalini/LOF_test")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !10, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "builtWithMpi", scope: !7, file: !7, line: 63, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!102 = !DISubprogram(name: "fflush", scope: !103, file: !103, line: 218, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!103 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!104 = !DISubroutineType(types: !105)
!105 = !{!10, !44}
!106 = !DISubprogram(name: "fclose", scope: !103, file: !103, line: 213, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!107 = !{!0, !108, !110}
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "CoMDVariant", scope: !2, file: !3, line: 26, type: !35, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "CoMDVersion", scope: !2, file: !3, line: 25, type: !35, isLocal: true, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !114, line: 7, baseType: !45)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!115 = !{i32 7, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 77d87a2c1b1d9e703bd2005dd0dcfd5b44bf6da7)"}
!119 = distinct !DISubprogram(name: "yamlBegin", scope: !3, file: !3, line: 45, type: !120, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !{!123, !127, !131, !132}
!123 = !DILocalVariable(name: "filename", scope: !119, file: !3, line: 50, type: !124)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 64)
!127 = !DILocalVariable(name: "rawtime", scope: !119, file: !3, line: 51, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !129, line: 7, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 160, baseType: !15)
!131 = !DILocalVariable(name: "ptm", scope: !119, file: !3, line: 53, type: !20)
!132 = !DILocalVariable(name: "sdate", scope: !119, file: !3, line: 54, type: !133)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 200, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 25)
!136 = !DILocation(line: 47, column: 10, scope: !137)
!137 = distinct !DILexicalBlock(scope: !119, file: !3, line: 47, column: 8)
!138 = !DILocation(line: 47, column: 8, scope: !119)
!139 = !DILocation(line: 50, column: 4, scope: !119)
!140 = !DILocation(line: 50, column: 9, scope: !119)
!141 = !DILocation(line: 51, column: 4, scope: !119)
!142 = !DILocation(line: 0, scope: !119)
!143 = !DILocation(line: 52, column: 4, scope: !119)
!144 = !DILocation(line: 53, column: 21, scope: !119)
!145 = !DILocation(line: 54, column: 4, scope: !119)
!146 = !DILocation(line: 54, column: 9, scope: !119)
!147 = !DILocation(line: 57, column: 18, scope: !119)
!148 = !{!149, !150, i64 20}
!149 = !{!"tm", !150, i64 0, !150, i64 4, !150, i64 8, !150, i64 12, !150, i64 16, !150, i64 20, !150, i64 24, !150, i64 28, !150, i64 32, !153, i64 40, !154, i64 48}
!150 = !{!"int", !151, i64 0}
!151 = !{!"omnipotent char", !152, i64 0}
!152 = !{!"Simple C/C++ TBAA"}
!153 = !{!"long", !151, i64 0}
