; ModuleID = 'integrate.c'
source_filename = "integrate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!1015 = !DIEnumerator(name: "gt_ggc_e_9cpp_macro", value: 168, isUnsigned: true)
!1016 = !DIEnumerator(name: "gt_ggc_e_9cpp_token", value: 169, isUnsigned: true)
!1017 = !DIEnumerator(name: "gt_ggc_e_9line_maps", value: 170, isUnsigned: true)
!1018 = !DIEnumerator(name: "gt_e_II17splay_tree_node_s", value: 171, isUnsigned: true)
!1019 = !DIEnumerator(name: "gt_e_SP9tree_node17splay_tree_node_s", value: 172, isUnsigned: true)
!1020 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node17splay_tree_node_s", value: 173, isUnsigned: true)
!1021 = !DIEnumerator(name: "gt_e_IP9tree_node17splay_tree_node_s", value: 174, isUnsigned: true)
!1022 = !DIEnumerator(name: "gt_e_P15interface_tuple4htab", value: 175, isUnsigned: true)
!1023 = !DIEnumerator(name: "gt_e_P16volatilized_type4htab", value: 176, isUnsigned: true)
!1024 = !DIEnumerator(name: "gt_e_P17string_descriptor4htab", value: 177, isUnsigned: true)
!1025 = !DIEnumerator(name: "gt_e_P14type_assertion4htab", value: 178, isUnsigned: true)
!1026 = !DIEnumerator(name: "gt_e_P18treetreehash_entry4htab", value: 179, isUnsigned: true)
!1027 = !DIEnumerator(name: "gt_e_P17module_htab_entry4htab", value: 180, isUnsigned: true)
!1028 = !DIEnumerator(name: "gt_e_P21pending_abstract_type4htab", value: 181, isUnsigned: true)
!1029 = !DIEnumerator(name: "gt_e_P10spec_entry4htab", value: 182, isUnsigned: true)
!1030 = !DIEnumerator(name: "gt_e_P16cxx_int_tree_map4htab", value: 183, isUnsigned: true)
!1031 = !DIEnumerator(name: "gt_e_P17named_label_entry4htab", value: 184, isUnsigned: true)
!1032 = !DIEnumerator(name: "gt_e_P12tree_int_map4htab", value: 185, isUnsigned: true)
!1033 = !DIEnumerator(name: "gt_e_P20lto_symtab_entry_def4htab", value: 186, isUnsigned: true)
!1034 = !DIEnumerator(name: "gt_e_IP9tree_node12splay_tree_s", value: 187, isUnsigned: true)
!1035 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node12splay_tree_s", value: 188, isUnsigned: true)
!1036 = !DIEnumerator(name: "gt_e_P12varpool_node4htab", value: 189, isUnsigned: true)
!1037 = !DIEnumerator(name: "gt_e_P13scev_info_str4htab", value: 190, isUnsigned: true)
!1038 = !DIEnumerator(name: "gt_e_P23constant_descriptor_rtx4htab", value: 191, isUnsigned: true)
!1039 = !DIEnumerator(name: "gt_e_P24constant_descriptor_tree4htab", value: 192, isUnsigned: true)
!1040 = !DIEnumerator(name: "gt_e_P12object_block4htab", value: 193, isUnsigned: true)
!1041 = !DIEnumerator(name: "gt_e_P7section4htab", value: 194, isUnsigned: true)
!1042 = !DIEnumerator(name: "gt_e_P17tree_priority_map4htab", value: 195, isUnsigned: true)
!1043 = !DIEnumerator(name: "gt_e_P8tree_map4htab", value: 196, isUnsigned: true)
!1044 = !DIEnumerator(name: "gt_e_P9type_hash4htab", value: 197, isUnsigned: true)
!1045 = !DIEnumerator(name: "gt_e_P13libfunc_entry4htab", value: 198, isUnsigned: true)
!1046 = !DIEnumerator(name: "gt_e_P23temp_slot_address_entry4htab", value: 199, isUnsigned: true)
!1047 = !DIEnumerator(name: "gt_e_P15throw_stmt_node4htab", value: 200, isUnsigned: true)
!1048 = !DIEnumerator(name: "gt_e_P9reg_attrs4htab", value: 201, isUnsigned: true)
!1049 = !DIEnumerator(name: "gt_e_P9mem_attrs4htab", value: 202, isUnsigned: true)
!1050 = !DIEnumerator(name: "gt_e_P7rtx_def4htab", value: 203, isUnsigned: true)
!1051 = !DIEnumerator(name: "gt_e_SP9tree_node12splay_tree_s", value: 204, isUnsigned: true)
!1052 = !DIEnumerator(name: "gt_e_P10vcall_insn4htab", value: 205, isUnsigned: true)
!1053 = !DIEnumerator(name: "gt_e_P16var_loc_list_def4htab", value: 206, isUnsigned: true)
!1054 = !DIEnumerator(name: "gt_e_P10die_struct4htab", value: 207, isUnsigned: true)
!1055 = !DIEnumerator(name: "gt_e_P15dwarf_file_data4htab", value: 208, isUnsigned: true)
!1056 = !DIEnumerator(name: "gt_e_P20indirect_string_node4htab", value: 209, isUnsigned: true)
!1057 = !DIEnumerator(name: "gt_e_P11cgraph_node4htab", value: 210, isUnsigned: true)
!1058 = !DIEnumerator(name: "gt_e_II12splay_tree_s", value: 211, isUnsigned: true)
!1059 = !DIEnumerator(name: "gt_e_P27cgraph_node_set_element_def4htab", value: 212, isUnsigned: true)
!1060 = !DIEnumerator(name: "gt_e_P11cgraph_edge4htab", value: 213, isUnsigned: true)
!1061 = !DIEnumerator(name: "gt_e_P9loop_exit4htab", value: 214, isUnsigned: true)
!1062 = !DIEnumerator(name: "gt_e_P24types_used_by_vars_entry4htab", value: 215, isUnsigned: true)
!1063 = !DIEnumerator(name: "gt_e_P9tree_node4htab", value: 216, isUnsigned: true)
!1064 = !DIEnumerator(name: "gt_types_enum_last", value: 217, isUnsigned: true)
!1065 = !{!1066, !1067, !190, !1245, !2241, !2248, !5, !701, !2254, !1707}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1068, line: 56, baseType: !1069)
!1068 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !1071)
!1071 = !{!1072, !1105, !1111, !1124, !1143, !1154, !1159, !1170, !1176, !1190, !1202, !1240, !1523, !1551, !1559, !1560, !1565, !1574, !1580, !1585, !1589, !1593, !1879, !1926, !1932, !1938, !1945, !1971, !1985, !2002, !2014, !2036, !2051, !2223}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1070, file: !158, line: 3372, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1073, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1073, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1073, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1073, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1073, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1073, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1073, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1073, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1073, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1073, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1073, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1073, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1073, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1073, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1073, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1073, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1073, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1073, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1073, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1073, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1073, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1073, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1073, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1073, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1073, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1073, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1073, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1073, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1073, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1073, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !158, line: 3373, baseType: !1106, size: 192)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1106, file: !158, line: 403, baseType: !1073, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1106, file: !158, line: 404, baseType: !1067, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !158, line: 405, baseType: !1067, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1070, file: !158, line: 3374, baseType: !1112, size: 320)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !158, line: 1385, baseType: !1106, size: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1112, file: !158, line: 1386, baseType: !1116, size: 128, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1117, line: 58, baseType: !1118)
!1117 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1117, line: 54, size: 128, elements: !1119)
!1119 = !{!1120, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1118, file: !1117, line: 56, baseType: !1121, size: 64)
!1121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1118, file: !1117, line: 57, baseType: !1123, size: 64, offset: 64)
!1123 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1070, file: !158, line: 3375, baseType: !1125, size: 256)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !158, line: 1398, baseType: !1106, size: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1125, file: !158, line: 1399, baseType: !1129, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1131, line: 52, size: 256, elements: !1132)
!1131 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1130, file: !1131, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1130, file: !1131, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1130, file: !1131, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1130, file: !1131, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1130, file: !1131, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1130, file: !1131, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1130, file: !1131, line: 62, baseType: !1140, size: 192, offset: 64)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 192, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 3)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1070, file: !158, line: 3376, baseType: !1144, size: 256)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1144, file: !158, line: 1409, baseType: !1106, size: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1144, file: !158, line: 1410, baseType: !1148, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1150, line: 27, size: 192, elements: !1151)
!1150 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1149, file: !1150, line: 29, baseType: !1116, size: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1149, file: !1150, line: 30, baseType: !5, size: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1070, file: !158, line: 3377, baseType: !1155, size: 256)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1155, file: !158, line: 1438, baseType: !1106, size: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1155, file: !158, line: 1439, baseType: !1067, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1070, file: !158, line: 3378, baseType: !1160, size: 256)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !1161)
!1161 = !{!1162, !1163, !1165}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !158, line: 1419, baseType: !1106, size: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1160, file: !158, line: 1420, baseType: !1164, size: 32, offset: 192)
!1164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1160, file: !158, line: 1421, baseType: !1166, size: 8, offset: 224)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 8, elements: !1168)
!1167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1168 = !{!1169}
!1169 = !DISubrange(count: 1)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1070, file: !158, line: 3379, baseType: !1171, size: 320)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !158, line: 1429, baseType: !1106, size: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1171, file: !158, line: 1430, baseType: !1067, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1171, file: !158, line: 1431, baseType: !1067, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1070, file: !158, line: 3380, baseType: !1177, size: 320)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !1178)
!1178 = !{!1179, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1177, file: !158, line: 1461, baseType: !1106, size: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1177, file: !158, line: 1462, baseType: !1181, size: 128, offset: 192)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1182, line: 31, size: 128, elements: !1183)
!1182 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1183 = !{!1184, !1188, !1189}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1181, file: !1182, line: 32, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1187 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1181, file: !1182, line: 33, baseType: !7, size: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1181, file: !1182, line: 34, baseType: !7, size: 32, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1070, file: !158, line: 3381, baseType: !1191, size: 384)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !1192)
!1192 = !{!1193, !1194, !1199, !1200, !1201}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1191, file: !158, line: 2508, baseType: !1106, size: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1191, file: !158, line: 2509, baseType: !1195, size: 32, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1196, line: 58, baseType: !1197)
!1196 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1198, line: 44, baseType: !7)
!1198 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1191, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1191, file: !158, line: 2511, baseType: !1067, size: 64, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1191, file: !158, line: 2512, baseType: !1067, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1070, file: !158, line: 3382, baseType: !1203, size: 896)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1203, file: !158, line: 2653, baseType: !1191, size: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !158, line: 2654, baseType: !1067, size: 64, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1203, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1203, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1203, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1203, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1203, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1203, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1203, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1203, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1203, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1203, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1203, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1203, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1203, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1203, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1203, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1203, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1203, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1203, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1203, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1203, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1203, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1203, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1203, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1203, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1203, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1203, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1203, file: !158, line: 2705, baseType: !1067, size: 64, offset: 576)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1203, file: !158, line: 2706, baseType: !1067, size: 64, offset: 640)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1203, file: !158, line: 2707, baseType: !1067, size: 64, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1203, file: !158, line: 2708, baseType: !1067, size: 64, offset: 768)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1203, file: !158, line: 2711, baseType: !1238, size: 64, offset: 832)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1070, file: !158, line: 3383, baseType: !1241, size: 960)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1242)
!1242 = !{!1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !158, line: 2757, baseType: !1203, size: 896)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1241, file: !158, line: 2758, baseType: !1245, size: 64, offset: 896)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1068, line: 50, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !702, line: 240, size: 384, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1247, file: !702, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1247, file: !702, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1247, file: !702, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1247, file: !702, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1247, file: !702, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1247, file: !702, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1247, file: !702, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1247, file: !702, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1247, file: !702, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1247, file: !702, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1247, file: !702, line: 321, baseType: !1260, size: 320, offset: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !702, line: 315, size: 320, elements: !1261)
!1261 = !{!1262, !1456, !1458, !1521, !1522}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1260, file: !702, line: 316, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 64, elements: !1168)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !702, line: 183, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !702, line: 166, size: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1272, !1273, !1281, !1282, !1294, !1297, !1358, !1359, !1433, !1446, !1453}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1265, file: !702, line: 168, baseType: !1164, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1265, file: !702, line: 169, baseType: !7, size: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1265, file: !702, line: 170, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1265, file: !702, line: 171, baseType: !1245, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1265, file: !702, line: 172, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1068, line: 53, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !702, line: 359, size: 128, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1276, file: !702, line: 360, baseType: !1164, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1276, file: !702, line: 361, baseType: !1280, size: 64, offset: 64)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1245, size: 64, elements: !1168)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1265, file: !702, line: 173, baseType: !5, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1265, file: !702, line: 174, baseType: !1283, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !702, line: 133, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 115, size: 32, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1284, file: !702, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1284, file: !702, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1284, file: !702, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1284, file: !702, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1284, file: !702, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1284, file: !702, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1284, file: !702, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1284, file: !702, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1265, file: !702, line: 175, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !702, line: 175, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1265, file: !702, line: 176, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1300, line: 75, size: 256, elements: !1301)
!1300 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1301 = !{!1302, !1316, !1317, !1318}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1299, file: !1300, line: 76, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1300, line: 68, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1300, line: 63, size: 320, elements: !1306)
!1306 = !{!1307, !1309, !1310, !1311}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1305, file: !1300, line: 64, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1305, file: !1300, line: 65, baseType: !1308, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1305, file: !1300, line: 66, baseType: !7, size: 32, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1305, file: !1300, line: 67, baseType: !1312, size: 128, offset: 192)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1313, size: 128, elements: !1314)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1300, line: 29, baseType: !1121)
!1314 = !{!1315}
!1315 = !DISubrange(count: 2)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1299, file: !1300, line: 77, baseType: !1303, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1299, file: !1300, line: 78, baseType: !7, size: 32, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1299, file: !1300, line: 79, baseType: !1319, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1300, line: 49, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1300, line: 45, size: 832, elements: !1322)
!1322 = !{!1323, !1324, !1325}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1321, file: !1300, line: 46, baseType: !1308, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1321, file: !1300, line: 47, baseType: !1298, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1321, file: !1300, line: 48, baseType: !1326, size: 704, offset: 128)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1327, line: 164, size: 704, elements: !1328)
!1327 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1328 = !{!1329, !1330, !1341, !1342, !1343, !1344, !1345, !1346, !1350, !1354, !1355, !1356, !1357}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1326, file: !1327, line: 166, baseType: !1123, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1326, file: !1327, line: 167, baseType: !1331, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1327, line: 157, size: 192, elements: !1333)
!1333 = !{!1334, !1336, !1337}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1332, file: !1327, line: 159, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1332, file: !1327, line: 160, baseType: !1331, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1332, file: !1327, line: 161, baseType: !1338, size: 32, offset: 128)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 32, elements: !1339)
!1339 = !{!1340}
!1340 = !DISubrange(count: 4)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1326, file: !1327, line: 168, baseType: !1335, size: 64, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1326, file: !1327, line: 169, baseType: !1335, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1326, file: !1327, line: 170, baseType: !1335, size: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1326, file: !1327, line: 171, baseType: !1123, size: 64, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1326, file: !1327, line: 172, baseType: !1164, size: 32, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1326, file: !1327, line: 176, baseType: !1347, size: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!1331, !1066, !1123}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1326, file: !1327, line: 177, baseType: !1351, size: 64, offset: 512)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1066, !1331}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1326, file: !1327, line: 178, baseType: !1066, size: 64, offset: 576)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1326, file: !1327, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1326, file: !1327, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1326, file: !1327, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1265, file: !702, line: 177, baseType: !1067, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1265, file: !702, line: 178, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1362)
!1362 = !{!1363, !1398, !1399, !1400, !1403, !1407, !1408, !1409, !1427, !1428, !1429, !1430, !1431, !1432}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1361, file: !142, line: 219, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1367)
!1367 = !{!1368}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1366, file: !142, line: 151, baseType: !1369, size: 128)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1371)
!1371 = !{!1372, !1373, !1374}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1370, file: !142, line: 150, baseType: !7, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1370, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1370, file: !142, line: 150, baseType: !1375, size: 64, offset: 64)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1376, size: 64, elements: !1168)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1068, line: 108, baseType: !1377)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1390, !1391, !1392, !1393, !1394, !1395, !1396}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1378, file: !142, line: 124, baseType: !1360, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1378, file: !142, line: 125, baseType: !1360, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1378, file: !142, line: 131, baseType: !1383, size: 64, offset: 128)
!1383 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1384)
!1384 = !{!1385, !1389}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1383, file: !142, line: 129, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1068, line: 66, baseType: !1387)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1068, line: 65, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1383, file: !142, line: 130, baseType: !1245, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1378, file: !142, line: 134, baseType: !1066, size: 64, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1378, file: !142, line: 137, baseType: !1067, size: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1378, file: !142, line: 138, baseType: !1195, size: 32, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1378, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !142, line: 144, baseType: !1164, size: 32, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1378, file: !142, line: 145, baseType: !1164, size: 32, offset: 416)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1378, file: !142, line: 146, baseType: !1397, size: 64, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !1123)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1361, file: !142, line: 220, baseType: !1364, size: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1361, file: !142, line: 223, baseType: !1066, size: 64, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1361, file: !142, line: 226, baseType: !1401, size: 64, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1361, file: !142, line: 229, baseType: !1404, size: 128, offset: 256)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1405, size: 128, elements: !1314)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1361, file: !142, line: 232, baseType: !1360, size: 64, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1361, file: !142, line: 233, baseType: !1360, size: 64, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1361, file: !142, line: 238, baseType: !1410, size: 64, offset: 512)
!1410 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1411)
!1411 = !{!1412, !1418}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1410, file: !142, line: 236, baseType: !1413, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1414, file: !142, line: 275, baseType: !1386, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1414, file: !142, line: 278, baseType: !1386, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1410, file: !142, line: 237, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1420, file: !142, line: 261, baseType: !1245, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1420, file: !142, line: 262, baseType: !1245, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1420, file: !142, line: 266, baseType: !1245, size: 64, offset: 128)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1420, file: !142, line: 267, baseType: !1245, size: 64, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1420, file: !142, line: 270, baseType: !1164, size: 32, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1361, file: !142, line: 241, baseType: !1397, size: 64, offset: 576)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1361, file: !142, line: 244, baseType: !1164, size: 32, offset: 640)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1361, file: !142, line: 247, baseType: !1164, size: 32, offset: 672)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1361, file: !142, line: 250, baseType: !1164, size: 32, offset: 704)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1361, file: !142, line: 253, baseType: !1164, size: 32, offset: 736)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1361, file: !142, line: 256, baseType: !1164, size: 32, offset: 768)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1265, file: !702, line: 179, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !702, line: 150, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !702, line: 142, size: 320, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1444, !1445}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1436, file: !702, line: 144, baseType: !1067, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1436, file: !702, line: 145, baseType: !1245, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1436, file: !702, line: 146, baseType: !1245, size: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1436, file: !702, line: 147, baseType: !1442, size: 32, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1443, line: 31, baseType: !1164)
!1443 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1436, file: !702, line: 148, baseType: !7, size: 32, offset: 224)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1436, file: !702, line: 149, baseType: !1187, size: 8, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1265, file: !702, line: 180, baseType: !1447, size: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !702, line: 162, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !702, line: 159, size: 128, elements: !1450)
!1450 = !{!1451, !1452}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1449, file: !702, line: 160, baseType: !1067, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1449, file: !702, line: 161, baseType: !1123, size: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1265, file: !702, line: 181, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !702, line: 181, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1260, file: !702, line: 317, baseType: !1457, size: 64)
!1457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 64, elements: !1168)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1260, file: !702, line: 318, baseType: !1459, size: 320)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !702, line: 188, size: 320, elements: !1460)
!1460 = !{!1461, !1463, !1520}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1459, file: !702, line: 190, baseType: !1462, size: 192)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 192, elements: !1141)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1459, file: !702, line: 193, baseType: !1464, size: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !702, line: 206, size: 320, elements: !1466)
!1466 = !{!1467, !1505, !1506, !1507, !1519}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1465, file: !702, line: 208, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1068, line: 62, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1471, line: 538, size: 256, elements: !1472)
!1471 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1472 = !{!1473, !1477, !1483, !1496}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1470, file: !1471, line: 539, baseType: !1474, size: 32)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1471, line: 482, size: 32, elements: !1475)
!1475 = !{!1476}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1474, file: !1471, line: 484, baseType: !7, size: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1470, file: !1471, line: 540, baseType: !1478, size: 192)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1471, line: 488, size: 192, elements: !1479)
!1479 = !{!1480, !1481, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1478, file: !1471, line: 489, baseType: !1474, size: 32)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1478, file: !1471, line: 492, baseType: !1270, size: 64, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1478, file: !1471, line: 496, baseType: !1067, size: 64, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1470, file: !1471, line: 541, baseType: !1484, size: 256)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1471, line: 504, size: 256, elements: !1485)
!1485 = !{!1486, !1487, !1494, !1495}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1484, file: !1471, line: 505, baseType: !1474, size: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1484, file: !1471, line: 509, baseType: !1488, size: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1471, line: 501, baseType: !1489)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !1492}
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !1471, line: 510, baseType: !1492, size: 64, offset: 128)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1484, file: !1471, line: 513, baseType: !1468, size: 64, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1470, file: !1471, line: 542, baseType: !1497, size: 128)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1471, line: 530, size: 128, elements: !1498)
!1498 = !{!1499, !1500}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !1471, line: 531, baseType: !1474, size: 32)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1497, file: !1471, line: 534, baseType: !1501, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1471, line: 525, baseType: !1502)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!1187, !1067, !1270, !1121, !1121}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1465, file: !702, line: 211, baseType: !7, size: 32, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1465, file: !702, line: 214, baseType: !1123, size: 64, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1465, file: !702, line: 224, baseType: !1508, size: 64, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !702, line: 202, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !702, line: 202, size: 128, elements: !1511)
!1511 = !{!1512}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1510, file: !702, line: 202, baseType: !1513, size: 128)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !702, line: 200, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !702, line: 200, size: 128, elements: !1515)
!1515 = !{!1516, !1517, !1518}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1514, file: !702, line: 200, baseType: !7, size: 32)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1514, file: !702, line: 200, baseType: !7, size: 32, offset: 32)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1514, file: !702, line: 200, baseType: !1280, size: 64, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1465, file: !702, line: 234, baseType: !1508, size: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1459, file: !702, line: 197, baseType: !1123, size: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1260, file: !702, line: 319, baseType: !1130, size: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1260, file: !702, line: 320, baseType: !1149, size: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1070, file: !158, line: 3384, baseType: !1524, size: 1472)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1525)
!1525 = !{!1526, !1547, !1548, !1549, !1550}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1524, file: !158, line: 3115, baseType: !1527, size: 1216)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1527, file: !158, line: 2985, baseType: !1241, size: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1527, file: !158, line: 2986, baseType: !1067, size: 64, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1527, file: !158, line: 2987, baseType: !1067, size: 64, offset: 1024)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1527, file: !158, line: 2988, baseType: !1067, size: 64, offset: 1088)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1527, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1527, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1527, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1527, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1527, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1527, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1527, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1527, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1527, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1527, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1527, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1527, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1527, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1527, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1524, file: !158, line: 3117, baseType: !1067, size: 64, offset: 1216)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1524, file: !158, line: 3119, baseType: !1067, size: 64, offset: 1280)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1524, file: !158, line: 3121, baseType: !1067, size: 64, offset: 1344)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1524, file: !158, line: 3123, baseType: !1067, size: 64, offset: 1408)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1070, file: !158, line: 3385, baseType: !1552, size: 1088)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1553)
!1553 = !{!1554, !1555, !1556}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1552, file: !158, line: 2875, baseType: !1241, size: 960)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1552, file: !158, line: 2876, baseType: !1245, size: 64, offset: 960)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1552, file: !158, line: 2877, baseType: !1557, size: 64, offset: 1024)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1070, file: !158, line: 3386, baseType: !1527, size: 1216)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1070, file: !158, line: 3387, baseType: !1561, size: 1280)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1562)
!1562 = !{!1563, !1564}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1561, file: !158, line: 3094, baseType: !1527, size: 1216)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1561, file: !158, line: 3095, baseType: !1557, size: 64, offset: 1216)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1070, file: !158, line: 3388, baseType: !1566, size: 1216)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1573}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1566, file: !158, line: 2825, baseType: !1203, size: 896)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1566, file: !158, line: 2827, baseType: !1067, size: 64, offset: 896)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1566, file: !158, line: 2828, baseType: !1067, size: 64, offset: 960)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1566, file: !158, line: 2829, baseType: !1067, size: 64, offset: 1024)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1566, file: !158, line: 2830, baseType: !1067, size: 64, offset: 1088)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1566, file: !158, line: 2831, baseType: !1067, size: 64, offset: 1152)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1070, file: !158, line: 3389, baseType: !1575, size: 1024)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1576)
!1576 = !{!1577, !1578, !1579}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1575, file: !158, line: 2851, baseType: !1241, size: 960)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1575, file: !158, line: 2852, baseType: !1164, size: 32, offset: 960)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1575, file: !158, line: 2853, baseType: !1164, size: 32, offset: 992)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1070, file: !158, line: 3390, baseType: !1581, size: 1024)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1582)
!1582 = !{!1583, !1584}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1581, file: !158, line: 2858, baseType: !1241, size: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1581, file: !158, line: 2859, baseType: !1557, size: 64, offset: 960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1070, file: !158, line: 3391, baseType: !1586, size: 960)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1587)
!1587 = !{!1588}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1586, file: !158, line: 2863, baseType: !1241, size: 960)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1070, file: !158, line: 3392, baseType: !1590, size: 1472)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1591)
!1591 = !{!1592}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1590, file: !158, line: 3305, baseType: !1524, size: 1472)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1070, file: !158, line: 3393, baseType: !1594, size: 1792)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1595)
!1595 = !{!1596, !1597, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1594, file: !158, line: 3249, baseType: !1524, size: 1472)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1594, file: !158, line: 3251, baseType: !1598, size: 64, offset: 1472)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1600, line: 463, size: 1152, elements: !1601)
!1600 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1601 = !{!1602, !1764, !1795, !1796, !1799, !1802, !1803, !1804, !1805, !1806, !1807, !1831, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1599, file: !1600, line: 464, baseType: !1603, size: 64)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1605)
!1605 = !{!1606, !1655, !1668, !1682, !1732, !1745}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1604, file: !135, line: 197, baseType: !1607, size: 64)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1608)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1616, !1643, !1652, !1653, !1654}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1609, file: !135, line: 119, baseType: !1608, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1609, file: !135, line: 122, baseType: !1608, size: 64, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1609, file: !135, line: 123, baseType: !1608, size: 64, offset: 128)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1609, file: !135, line: 126, baseType: !1164, size: 32, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1609, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1609, file: !135, line: 165, baseType: !1617, size: 192, offset: 256)
!1617 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1618)
!1618 = !{!1619, !1632, !1638}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1617, file: !135, line: 137, baseType: !1620, size: 128)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1621)
!1621 = !{!1622, !1631}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1620, file: !135, line: 135, baseType: !1623, size: 64)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1625)
!1625 = !{!1626, !1627, !1628, !1629, !1630}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1624, file: !135, line: 96, baseType: !1623, size: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1624, file: !135, line: 97, baseType: !1623, size: 64, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1624, file: !135, line: 101, baseType: !1067, size: 64, offset: 128)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1624, file: !135, line: 106, baseType: !1067, size: 64, offset: 192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1624, file: !135, line: 111, baseType: !1067, size: 64, offset: 256)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1620, file: !135, line: 136, baseType: !1623, size: 64, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1617, file: !135, line: 151, baseType: !1633, size: 192)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1634)
!1634 = !{!1635, !1636, !1637}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1633, file: !135, line: 141, baseType: !1067, size: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1633, file: !135, line: 145, baseType: !1067, size: 64, offset: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1633, file: !135, line: 150, baseType: !1164, size: 32, offset: 128)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1617, file: !135, line: 164, baseType: !1639, size: 128)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1640)
!1640 = !{!1641, !1642}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1639, file: !135, line: 161, baseType: !1067, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1639, file: !135, line: 163, baseType: !1195, size: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1609, file: !135, line: 168, baseType: !1644, size: 64, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1651}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1645, file: !135, line: 70, baseType: !1644, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1645, file: !135, line: 73, baseType: !1608, size: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1645, file: !135, line: 78, baseType: !1067, size: 64, offset: 128)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1645, file: !135, line: 85, baseType: !1245, size: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1645, file: !135, line: 88, baseType: !1164, size: 32, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1609, file: !135, line: 173, baseType: !1245, size: 64, offset: 512)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1609, file: !135, line: 173, baseType: !1245, size: 64, offset: 576)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1609, file: !135, line: 177, baseType: !1187, size: 8, offset: 640)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1604, file: !135, line: 200, baseType: !1656, size: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1659)
!1659 = !{!1660}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1658, file: !135, line: 185, baseType: !1661, size: 128)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1663)
!1663 = !{!1664, !1665, !1666}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1662, file: !135, line: 184, baseType: !7, size: 32)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1662, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1662, file: !135, line: 184, baseType: !1667, size: 64, offset: 64)
!1667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1607, size: 64, elements: !1168)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1604, file: !135, line: 203, baseType: !1669, size: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1672)
!1672 = !{!1673}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1671, file: !135, line: 189, baseType: !1674, size: 128)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1676)
!1676 = !{!1677, !1678, !1679}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1675, file: !135, line: 188, baseType: !7, size: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1675, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1675, file: !135, line: 188, baseType: !1680, size: 64, offset: 64)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1681, size: 64, elements: !1168)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1644)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1604, file: !135, line: 207, baseType: !1683, size: 64, offset: 192)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1684, line: 144, baseType: !1685)
!1684 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1684, line: 100, size: 896, elements: !1687)
!1687 = !{!1688, !1694, !1699, !1704, !1706, !1709, !1710, !1711, !1712, !1713, !1718, !1720, !1721, !1726, !1731}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1686, file: !1684, line: 102, baseType: !1689, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1684, line: 52, baseType: !1690)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!1693, !1492}
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1684, line: 47, baseType: !7)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1686, file: !1684, line: 105, baseType: !1695, size: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1684, line: 59, baseType: !1696)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!1164, !1492, !1492}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1686, file: !1684, line: 108, baseType: !1700, size: 64, offset: 128)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1684, line: 63, baseType: !1701)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{null, !1066}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1686, file: !1684, line: 111, baseType: !1705, size: 64, offset: 192)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1686, file: !1684, line: 114, baseType: !1707, size: 64, offset: 256)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1708, line: 46, baseType: !1121)
!1708 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1686, file: !1684, line: 117, baseType: !1707, size: 64, offset: 320)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1686, file: !1684, line: 120, baseType: !1707, size: 64, offset: 384)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1686, file: !1684, line: 124, baseType: !7, size: 32, offset: 448)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1686, file: !1684, line: 128, baseType: !7, size: 32, offset: 480)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1686, file: !1684, line: 131, baseType: !1714, size: 64, offset: 512)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1684, line: 75, baseType: !1715)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DISubroutineType(types: !1717)
!1717 = !{!1066, !1707, !1707}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1686, file: !1684, line: 132, baseType: !1719, size: 64, offset: 576)
!1719 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1684, line: 78, baseType: !1701)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1686, file: !1684, line: 135, baseType: !1066, size: 64, offset: 640)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1686, file: !1684, line: 136, baseType: !1722, size: 64, offset: 704)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1684, line: 82, baseType: !1723)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!1066, !1066, !1707, !1707}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1686, file: !1684, line: 137, baseType: !1727, size: 64, offset: 768)
!1727 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1684, line: 83, baseType: !1728)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{null, !1066, !1066}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1686, file: !1684, line: 141, baseType: !7, size: 32, offset: 832)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1604, file: !135, line: 211, baseType: !1733, size: 64, offset: 256)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1735)
!1735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1736)
!1736 = !{!1737}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1735, file: !158, line: 183, baseType: !1738, size: 128)
!1738 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1740)
!1740 = !{!1741, !1742, !1743}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1739, file: !158, line: 182, baseType: !7, size: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1739, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1739, file: !158, line: 182, baseType: !1744, size: 64, offset: 64)
!1744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 64, elements: !1168)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1604, file: !135, line: 220, baseType: !1746, size: 64, offset: 320)
!1746 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1747)
!1747 = !{!1748, !1749}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1746, file: !135, line: 218, baseType: !1733, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1746, file: !135, line: 219, baseType: !1750, size: 64)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!1751 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1752, line: 29, baseType: !1753)
!1752 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1752, line: 29, size: 96, elements: !1754)
!1754 = !{!1755}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1753, file: !1752, line: 29, baseType: !1756, size: 96)
!1756 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1752, line: 27, baseType: !1757)
!1757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1752, line: 27, size: 96, elements: !1758)
!1758 = !{!1759, !1760, !1761}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1757, file: !1752, line: 27, baseType: !7, size: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1757, file: !1752, line: 27, baseType: !7, size: 32, offset: 32)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1757, file: !1752, line: 27, baseType: !1762, size: 8, offset: 64)
!1762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1763, size: 8, elements: !1168)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1752, line: 26, baseType: !1187)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1599, file: !1600, line: 467, baseType: !1765, size: 64, offset: 64)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64)
!1766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1767)
!1767 = !{!1768, !1770, !1771, !1784, !1785, !1786, !1787, !1788, !1789, !1791, !1793, !1794}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1766, file: !142, line: 377, baseType: !1769, size: 64)
!1769 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1068, line: 111, baseType: !1360)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1766, file: !142, line: 378, baseType: !1769, size: 64, offset: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1766, file: !142, line: 381, baseType: !1772, size: 64, offset: 128)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64)
!1773 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1774)
!1774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1775)
!1775 = !{!1776}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1774, file: !142, line: 282, baseType: !1777, size: 128)
!1777 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1778)
!1778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1779)
!1779 = !{!1780, !1781, !1782}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1778, file: !142, line: 281, baseType: !7, size: 32)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1778, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1778, file: !142, line: 281, baseType: !1783, size: 64, offset: 64)
!1783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1769, size: 64, elements: !1168)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1766, file: !142, line: 384, baseType: !1164, size: 32, offset: 192)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1766, file: !142, line: 387, baseType: !1164, size: 32, offset: 224)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1766, file: !142, line: 390, baseType: !1164, size: 32, offset: 256)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1766, file: !142, line: 394, baseType: !1772, size: 64, offset: 320)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1766, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1766, file: !142, line: 399, baseType: !1790, size: 64, offset: 416)
!1790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !1314)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1766, file: !142, line: 402, baseType: !1792, size: 64, offset: 480)
!1792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1314)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1766, file: !142, line: 406, baseType: !1164, size: 32, offset: 544)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1766, file: !142, line: 409, baseType: !1164, size: 32, offset: 576)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1599, file: !1600, line: 470, baseType: !1387, size: 64, offset: 128)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1599, file: !1600, line: 473, baseType: !1797, size: 64, offset: 192)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64)
!1798 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1600, line: 166, flags: DIFlagFwdDecl)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1599, file: !1600, line: 476, baseType: !1800, size: 64, offset: 256)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64)
!1801 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1600, line: 476, flags: DIFlagFwdDecl)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1599, file: !1600, line: 479, baseType: !1683, size: 64, offset: 320)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1599, file: !1600, line: 484, baseType: !1067, size: 64, offset: 384)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1599, file: !1600, line: 488, baseType: !1067, size: 64, offset: 448)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1599, file: !1600, line: 493, baseType: !1067, size: 64, offset: 512)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1599, file: !1600, line: 496, baseType: !1067, size: 64, offset: 576)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1599, file: !1600, line: 501, baseType: !1808, size: 64, offset: 640)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1810)
!1810 = !{!1811, !1814, !1815, !1816, !1817, !1819, !1820, !1825, !1826, !1827, !1828, !1829, !1830}
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1809, file: !153, line: 2356, baseType: !1812, size: 64)
!1812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1813, size: 64)
!1813 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1809, file: !153, line: 2357, baseType: !1270, size: 64, offset: 64)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1809, file: !153, line: 2358, baseType: !1164, size: 32, offset: 128)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1809, file: !153, line: 2359, baseType: !1164, size: 32, offset: 160)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1809, file: !153, line: 2360, baseType: !1818, size: 128, offset: 192)
!1818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 128, elements: !1339)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1809, file: !153, line: 2364, baseType: !1164, size: 32, offset: 320)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1809, file: !153, line: 2367, baseType: !1821, size: 128, offset: 384)
!1821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1822)
!1822 = !{!1823, !1824}
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1821, file: !153, line: 2351, baseType: !1245, size: 64)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1821, file: !153, line: 2352, baseType: !1123, size: 64, offset: 64)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1809, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1809, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1809, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1809, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1809, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1809, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1599, file: !1600, line: 504, baseType: !1832, size: 64, offset: 704)
!1832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1833, size: 64)
!1833 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1600, line: 504, flags: DIFlagFwdDecl)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1599, file: !1600, line: 507, baseType: !1683, size: 64, offset: 768)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1599, file: !1600, line: 510, baseType: !1164, size: 32, offset: 832)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1599, file: !1600, line: 513, baseType: !1164, size: 32, offset: 864)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1599, file: !1600, line: 516, baseType: !1195, size: 32, offset: 896)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1599, file: !1600, line: 519, baseType: !1195, size: 32, offset: 928)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1599, file: !1600, line: 522, baseType: !7, size: 32, offset: 960)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1599, file: !1600, line: 523, baseType: !7, size: 32, offset: 992)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1599, file: !1600, line: 528, baseType: !1270, size: 64, offset: 1024)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1599, file: !1600, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1599, file: !1600, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1599, file: !1600, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1599, file: !1600, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1599, file: !1600, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1599, file: !1600, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1599, file: !1600, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1599, file: !1600, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1599, file: !1600, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1599, file: !1600, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
