; ModuleID = 'tree-ssa-forwprop.c'
source_filename = "tree-ssa-forwprop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!771 = !DIEnumerator(name: "TI_SQ_TYPE", value: 91, isUnsigned: true)
!772 = !DIEnumerator(name: "TI_DQ_TYPE", value: 92, isUnsigned: true)
!773 = !DIEnumerator(name: "TI_TQ_TYPE", value: 93, isUnsigned: true)
!774 = !DIEnumerator(name: "TI_UQQ_TYPE", value: 94, isUnsigned: true)
!775 = !DIEnumerator(name: "TI_UHQ_TYPE", value: 95, isUnsigned: true)
!776 = !DIEnumerator(name: "TI_USQ_TYPE", value: 96, isUnsigned: true)
!777 = !DIEnumerator(name: "TI_UDQ_TYPE", value: 97, isUnsigned: true)
!778 = !DIEnumerator(name: "TI_UTQ_TYPE", value: 98, isUnsigned: true)
!779 = !DIEnumerator(name: "TI_SAT_QQ_TYPE", value: 99, isUnsigned: true)
!780 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!781 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!782 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!783 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!784 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!785 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!786 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!787 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!788 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!789 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!790 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!791 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!792 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!793 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!794 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!795 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!796 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!797 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!798 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!799 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!800 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!801 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!802 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!803 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!804 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!805 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!806 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!807 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!808 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!809 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!810 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!811 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !813, line: 36, baseType: !7, size: 32, elements: !814)
!813 = !DIFile(filename: "./machmode.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!815 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!816 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!817 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!818 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!819 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!820 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!821 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!822 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!823 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!824 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!825 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!826 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!827 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!828 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!829 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!830 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!831 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!832 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!833 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!834 = !{!366, !835, !2136, !932, !1119, !1167, !2138, !876, !1200, !1104, !660, !2140, !965, !812, !189}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !837)
!837 = !{!838, !871, !879, !892, !911, !922, !927, !938, !944, !958, !970, !1008, !1469, !1497, !1514, !1515, !1520, !1529, !1535, !1540, !1544, !1548, !1787, !1834, !1840, !1846, !1853, !1866, !1880, !1897, !1909, !1931, !1946, !2118}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !836, file: !334, line: 3372, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !839, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !839, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !839, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !839, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !839, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !839, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !839, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !839, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !839, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !839, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !839, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !839, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !839, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !839, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !839, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !839, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !839, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !839, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !839, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !839, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !839, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !839, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !839, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !839, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !839, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !839, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !839, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !839, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !839, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !839, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !836, file: !334, line: 3373, baseType: !872, size: 192)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !873)
!873 = !{!874, !875, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !872, file: !334, line: 403, baseType: !839, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !872, file: !334, line: 404, baseType: !876, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !877, line: 56, baseType: !835)
!877 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!878 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !872, file: !334, line: 405, baseType: !876, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !836, file: !334, line: 3374, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !334, line: 1385, baseType: !872, size: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !880, file: !334, line: 1386, baseType: !884, size: 128, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !885, line: 58, baseType: !886)
!885 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !885, line: 54, size: 128, elements: !887)
!887 = !{!888, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !886, file: !885, line: 56, baseType: !889, size: 64)
!889 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !886, file: !885, line: 57, baseType: !891, size: 64, offset: 64)
!891 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !836, file: !334, line: 3375, baseType: !893, size: 256)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !334, line: 1398, baseType: !872, size: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !893, file: !334, line: 1399, baseType: !897, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !899, line: 52, size: 256, elements: !900)
!899 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!900 = !{!901, !902, !903, !904, !905, !906, !907}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !898, file: !899, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !898, file: !899, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !898, file: !899, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !898, file: !899, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !898, file: !899, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !898, file: !899, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !898, file: !899, line: 62, baseType: !908, size: 192, offset: 64)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 192, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 3)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !836, file: !334, line: 3376, baseType: !912, size: 256)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !912, file: !334, line: 1409, baseType: !872, size: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !912, file: !334, line: 1410, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !918, line: 27, size: 192, elements: !919)
!918 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !917, file: !918, line: 29, baseType: !884, size: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !917, file: !918, line: 30, baseType: !189, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !836, file: !334, line: 3377, baseType: !923, size: 256)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !923, file: !334, line: 1438, baseType: !872, size: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !923, file: !334, line: 1439, baseType: !876, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !836, file: !334, line: 3378, baseType: !928, size: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !929)
!929 = !{!930, !931, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !334, line: 1419, baseType: !872, size: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !928, file: !334, line: 1420, baseType: !932, size: 32, offset: 192)
!932 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !928, file: !334, line: 1421, baseType: !934, size: 8, offset: 224)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 8, elements: !936)
!935 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!936 = !{!937}
!937 = !DISubrange(count: 1)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !836, file: !334, line: 3379, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !334, line: 1429, baseType: !872, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !939, file: !334, line: 1430, baseType: !876, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !939, file: !334, line: 1431, baseType: !876, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !836, file: !334, line: 3380, baseType: !945, size: 320)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !334, line: 1461, baseType: !872, size: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !945, file: !334, line: 1462, baseType: !949, size: 128, offset: 192)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !950, line: 31, size: 128, elements: !951)
!950 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!951 = !{!952, !956, !957}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !949, file: !950, line: 32, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !949, file: !950, line: 33, baseType: !7, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !949, file: !950, line: 34, baseType: !7, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !836, file: !334, line: 3381, baseType: !959, size: 384)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !960)
!960 = !{!961, !962, !967, !968, !969}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !334, line: 2508, baseType: !872, size: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !959, file: !334, line: 2509, baseType: !963, size: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !964, line: 58, baseType: !965)
!964 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !966, line: 44, baseType: !7)
!966 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!967 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !959, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !334, line: 2511, baseType: !876, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !959, file: !334, line: 2512, baseType: !876, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !836, file: !334, line: 3382, baseType: !971, size: 896)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !334, line: 2653, baseType: !959, size: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !334, line: 2654, baseType: !876, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !971, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !971, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !971, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !971, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !971, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !971, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !971, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !971, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !971, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !971, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !971, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !971, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !971, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !971, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !971, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !971, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !971, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !971, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !971, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !971, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !971, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !971, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !971, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !971, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !971, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !971, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !971, file: !334, line: 2705, baseType: !876, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !971, file: !334, line: 2706, baseType: !876, size: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !971, file: !334, line: 2707, baseType: !876, size: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !971, file: !334, line: 2708, baseType: !876, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !971, file: !334, line: 2711, baseType: !1006, size: 64, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !836, file: !334, line: 3383, baseType: !1009, size: 960)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !334, line: 2757, baseType: !971, size: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1009, file: !334, line: 2758, baseType: !1013, size: 64, offset: 896)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !877, line: 50, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1016, line: 240, size: 384, elements: !1017)
!1016 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1015, file: !1016, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1015, file: !1016, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1015, file: !1016, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1015, file: !1016, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1015, file: !1016, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1015, file: !1016, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1015, file: !1016, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1015, file: !1016, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1015, file: !1016, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1015, file: !1016, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1015, file: !1016, line: 321, baseType: !1029, size: 320, offset: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1016, line: 315, size: 320, elements: !1030)
!1030 = !{!1031, !1436, !1438, !1467, !1468}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1029, file: !1016, line: 316, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 64, elements: !936)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1016, line: 183, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1016, line: 166, size: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1041, !1042, !1050, !1051, !1063, !1066, !1128, !1129, !1413, !1426, !1433}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1034, file: !1016, line: 168, baseType: !932, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1034, file: !1016, line: 169, baseType: !7, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1034, file: !1016, line: 170, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1034, file: !1016, line: 171, baseType: !1013, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1034, file: !1016, line: 172, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !877, line: 53, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1016, line: 359, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1045, file: !1016, line: 360, baseType: !932, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1045, file: !1016, line: 361, baseType: !1049, size: 64, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 64, elements: !936)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1034, file: !1016, line: 173, baseType: !189, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1034, file: !1016, line: 174, baseType: !1052, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1016, line: 133, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1016, line: 115, size: 32, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1053, file: !1016, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1053, file: !1016, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1053, file: !1016, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1053, file: !1016, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1053, file: !1016, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1053, file: !1016, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1053, file: !1016, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1053, file: !1016, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1034, file: !1016, line: 175, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1016, line: 175, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1034, file: !1016, line: 176, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1069, line: 75, size: 256, elements: !1070)
!1069 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = !{!1071, !1085, !1086, !1087}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1068, file: !1069, line: 76, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1069, line: 68, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1069, line: 63, size: 320, elements: !1075)
!1075 = !{!1076, !1078, !1079, !1080}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1074, file: !1069, line: 64, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1074, file: !1069, line: 65, baseType: !1077, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1074, file: !1069, line: 66, baseType: !7, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1074, file: !1069, line: 67, baseType: !1081, size: 128, offset: 192)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 128, elements: !1083)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1069, line: 29, baseType: !889)
!1083 = !{!1084}
!1084 = !DISubrange(count: 2)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1068, file: !1069, line: 77, baseType: !1072, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1068, file: !1069, line: 78, baseType: !7, size: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1068, file: !1069, line: 79, baseType: !1088, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1069, line: 49, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1069, line: 45, size: 832, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1090, file: !1069, line: 46, baseType: !1077, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1090, file: !1069, line: 47, baseType: !1067, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1090, file: !1069, line: 48, baseType: !1095, size: 704, offset: 128)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1096, line: 164, size: 704, elements: !1097)
!1096 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1097 = !{!1098, !1099, !1110, !1111, !1112, !1113, !1114, !1115, !1120, !1124, !1125, !1126, !1127}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1095, file: !1096, line: 166, baseType: !891, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1095, file: !1096, line: 167, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1096, line: 157, size: 192, elements: !1102)
!1102 = !{!1103, !1105, !1106}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1101, file: !1096, line: 159, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1101, file: !1096, line: 160, baseType: !1100, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1101, file: !1096, line: 161, baseType: !1107, size: 32, offset: 128)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 32, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 4)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1095, file: !1096, line: 168, baseType: !1104, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1095, file: !1096, line: 169, baseType: !1104, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1095, file: !1096, line: 170, baseType: !1104, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1095, file: !1096, line: 171, baseType: !891, size: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1095, file: !1096, line: 172, baseType: !932, size: 32, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1095, file: !1096, line: 176, baseType: !1116, size: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1100, !1119, !891}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1095, file: !1096, line: 177, baseType: !1121, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{null, !1119, !1100}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1095, file: !1096, line: 178, baseType: !1119, size: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1095, file: !1096, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1095, file: !1096, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1095, file: !1096, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1034, file: !1016, line: 177, baseType: !876, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1034, file: !1016, line: 178, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1132)
!1132 = !{!1133, !1378, !1379, !1380, !1383, !1387, !1388, !1389, !1407, !1408, !1409, !1410, !1411, !1412}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1131, file: !318, line: 219, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1136, file: !318, line: 151, baseType: !1139, size: 128)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1140, file: !318, line: 150, baseType: !7, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1140, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1140, file: !318, line: 150, baseType: !1145, size: 64, offset: 64)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 64, elements: !936)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !877, line: 108, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1370, !1371, !1372, !1373, !1374, !1375, !1376}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1148, file: !318, line: 124, baseType: !1130, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1148, file: !318, line: 125, baseType: !1130, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1148, file: !318, line: 131, baseType: !1153, size: 64, offset: 128)
!1153 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1154)
!1154 = !{!1155, !1369}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1153, file: !318, line: 129, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !877, line: 66, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !582, line: 143, size: 192, elements: !1159)
!1159 = !{!1160, !1367, !1368}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1158, file: !582, line: 145, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !877, line: 69, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !582, line: 136, size: 192, elements: !1164)
!1164 = !{!1165, !1365, !1366}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1163, file: !582, line: 137, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !877, line: 58, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !582, line: 737, size: 768, elements: !1169)
!1169 = !{!1170, !1187, !1220, !1226, !1231, !1236, !1243, !1249, !1255, !1260, !1274, !1279, !1285, !1290, !1300, !1305, !1323, !1330, !1337, !1343, !1348, !1354, !1360}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !582, line: 738, baseType: !1171, size: 256)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !582, line: 271, size: 256, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1171, file: !582, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1171, file: !582, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1171, file: !582, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1171, file: !582, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1171, file: !582, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1171, file: !582, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1171, file: !582, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1171, file: !582, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1171, file: !582, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1171, file: !582, line: 312, baseType: !7, size: 32, offset: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1171, file: !582, line: 316, baseType: !963, size: 32, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1171, file: !582, line: 319, baseType: !7, size: 32, offset: 96)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1171, file: !582, line: 323, baseType: !1130, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1171, file: !582, line: 327, baseType: !876, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1168, file: !582, line: 739, baseType: !1188, size: 448)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !582, line: 350, size: 448, elements: !1189)
!1189 = !{!1190, !1218}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1188, file: !582, line: 353, baseType: !1191, size: 384)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !582, line: 333, size: 384, elements: !1192)
!1192 = !{!1193, !1194, !1201}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1191, file: !582, line: 336, baseType: !1171, size: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1191, file: !582, line: 343, baseType: !1195, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !667, line: 37, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !667, line: 39, baseType: !1195, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1196, file: !667, line: 40, baseType: !1200, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1191, file: !582, line: 344, baseType: !1202, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !667, line: 45, size: 320, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1203, file: !667, line: 47, baseType: !1202, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1203, file: !667, line: 48, baseType: !1207, size: 256, offset: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1208)
!1208 = !{!1209, !1211, !1212, !1217}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1207, file: !334, line: 1884, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1207, file: !334, line: 1885, baseType: !1210, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1207, file: !334, line: 1891, baseType: !1213, size: 64, offset: 128)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1207, file: !334, line: 1891, size: 64, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1213, file: !334, line: 1891, baseType: !1166, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1213, file: !334, line: 1891, baseType: !876, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1207, file: !334, line: 1892, baseType: !1200, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1188, file: !582, line: 359, baseType: !1219, size: 64, offset: 384)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 64, elements: !936)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1168, file: !582, line: 740, baseType: !1221, size: 512)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !582, line: 365, size: 512, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1221, file: !582, line: 368, baseType: !1191, size: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1221, file: !582, line: 373, baseType: !876, size: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1221, file: !582, line: 374, baseType: !876, size: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1168, file: !582, line: 741, baseType: !1227, size: 576)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !582, line: 380, size: 576, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1227, file: !582, line: 383, baseType: !1221, size: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1227, file: !582, line: 389, baseType: !1219, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1168, file: !582, line: 742, baseType: !1232, size: 320)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !582, line: 395, size: 320, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1232, file: !582, line: 397, baseType: !1171, size: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1232, file: !582, line: 400, baseType: !1156, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1168, file: !582, line: 743, baseType: !1237, size: 448)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !582, line: 406, size: 448, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1237, file: !582, line: 408, baseType: !1171, size: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1237, file: !582, line: 412, baseType: !876, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1237, file: !582, line: 420, baseType: !876, size: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1237, file: !582, line: 423, baseType: !1156, size: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1168, file: !582, line: 744, baseType: !1244, size: 384)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !582, line: 429, size: 384, elements: !1245)
!1245 = !{!1246, !1247, !1248}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1244, file: !582, line: 431, baseType: !1171, size: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1244, file: !582, line: 434, baseType: !876, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1244, file: !582, line: 437, baseType: !1156, size: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1168, file: !582, line: 745, baseType: !1250, size: 384)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !582, line: 443, size: 384, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1250, file: !582, line: 445, baseType: !1171, size: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1250, file: !582, line: 449, baseType: !876, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1250, file: !582, line: 453, baseType: !1156, size: 64, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1168, file: !582, line: 746, baseType: !1256, size: 320)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !582, line: 459, size: 320, elements: !1257)
!1257 = !{!1258, !1259}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1256, file: !582, line: 461, baseType: !1171, size: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1256, file: !582, line: 464, baseType: !876, size: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1168, file: !582, line: 747, baseType: !1261, size: 768)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !582, line: 469, size: 768, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1261, file: !582, line: 471, baseType: !1171, size: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1261, file: !582, line: 474, baseType: !7, size: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1261, file: !582, line: 475, baseType: !7, size: 32, offset: 288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1261, file: !582, line: 478, baseType: !876, size: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1261, file: !582, line: 481, baseType: !1268, size: 384, offset: 384)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1269, size: 384, elements: !936)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1269, file: !334, line: 1920, baseType: !1207, size: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1269, file: !334, line: 1921, baseType: !876, size: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1269, file: !334, line: 1922, baseType: !963, size: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1168, file: !582, line: 748, baseType: !1275, size: 320)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !582, line: 487, size: 320, elements: !1276)
!1276 = !{!1277, !1278}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1275, file: !582, line: 490, baseType: !1171, size: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1275, file: !582, line: 494, baseType: !932, size: 32, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1168, file: !582, line: 749, baseType: !1280, size: 384)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !582, line: 500, size: 384, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1280, file: !582, line: 502, baseType: !1171, size: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1280, file: !582, line: 506, baseType: !1156, size: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1280, file: !582, line: 510, baseType: !1156, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1168, file: !582, line: 750, baseType: !1286, size: 320)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !582, line: 529, size: 320, elements: !1287)
!1287 = !{!1288, !1289}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1286, file: !582, line: 531, baseType: !1171, size: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1286, file: !582, line: 540, baseType: !1156, size: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1168, file: !582, line: 751, baseType: !1291, size: 704)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !582, line: 546, size: 704, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1291, file: !582, line: 549, baseType: !1221, size: 512)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1291, file: !582, line: 553, baseType: !1039, size: 64, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1291, file: !582, line: 557, baseType: !955, size: 8, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1291, file: !582, line: 558, baseType: !955, size: 8, offset: 584)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1291, file: !582, line: 559, baseType: !955, size: 8, offset: 592)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1291, file: !582, line: 560, baseType: !955, size: 8, offset: 600)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1291, file: !582, line: 566, baseType: !1219, size: 64, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1168, file: !582, line: 752, baseType: !1301, size: 384)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !582, line: 571, size: 384, elements: !1302)
!1302 = !{!1303, !1304}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1301, file: !582, line: 573, baseType: !1232, size: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1301, file: !582, line: 577, baseType: !876, size: 64, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1168, file: !582, line: 753, baseType: !1306, size: 576)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !582, line: 600, size: 576, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1313, !1322}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1306, file: !582, line: 602, baseType: !1232, size: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1306, file: !582, line: 605, baseType: !876, size: 64, offset: 320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1306, file: !582, line: 609, baseType: !1311, size: 64, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1312, line: 46, baseType: !889)
!1312 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1306, file: !582, line: 612, baseType: !1314, size: 64, offset: 448)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !582, line: 581, size: 320, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1315, file: !582, line: 583, baseType: !366, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1315, file: !582, line: 586, baseType: !876, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1315, file: !582, line: 589, baseType: !876, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1315, file: !582, line: 592, baseType: !876, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1315, file: !582, line: 595, baseType: !876, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1306, file: !582, line: 616, baseType: !1156, size: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1168, file: !582, line: 754, baseType: !1324, size: 512)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !582, line: 622, size: 512, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1329}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1324, file: !582, line: 624, baseType: !1232, size: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1324, file: !582, line: 628, baseType: !876, size: 64, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1324, file: !582, line: 632, baseType: !876, size: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1324, file: !582, line: 636, baseType: !876, size: 64, offset: 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1168, file: !582, line: 755, baseType: !1331, size: 704)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !582, line: 642, size: 704, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1331, file: !582, line: 644, baseType: !1324, size: 512)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1331, file: !582, line: 648, baseType: !876, size: 64, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1331, file: !582, line: 652, baseType: !876, size: 64, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1331, file: !582, line: 653, baseType: !876, size: 64, offset: 640)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1168, file: !582, line: 756, baseType: !1338, size: 448)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !582, line: 663, size: 448, elements: !1339)
!1339 = !{!1340, !1341, !1342}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1338, file: !582, line: 665, baseType: !1232, size: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1338, file: !582, line: 668, baseType: !876, size: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1338, file: !582, line: 673, baseType: !876, size: 64, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1168, file: !582, line: 757, baseType: !1344, size: 384)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !582, line: 694, size: 384, elements: !1345)
!1345 = !{!1346, !1347}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1344, file: !582, line: 696, baseType: !1232, size: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1344, file: !582, line: 699, baseType: !876, size: 64, offset: 320)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1168, file: !582, line: 758, baseType: !1349, size: 384)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !582, line: 681, size: 384, elements: !1350)
!1350 = !{!1351, !1352, !1353}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1349, file: !582, line: 683, baseType: !1171, size: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1349, file: !582, line: 686, baseType: !876, size: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1349, file: !582, line: 689, baseType: !876, size: 64, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1168, file: !582, line: 759, baseType: !1355, size: 384)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !582, line: 707, size: 384, elements: !1356)
!1356 = !{!1357, !1358, !1359}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1355, file: !582, line: 709, baseType: !1171, size: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1355, file: !582, line: 712, baseType: !876, size: 64, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1355, file: !582, line: 712, baseType: !876, size: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1168, file: !582, line: 760, baseType: !1361, size: 320)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !582, line: 718, size: 320, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1361, file: !582, line: 720, baseType: !1171, size: 256)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1361, file: !582, line: 723, baseType: !876, size: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1163, file: !582, line: 138, baseType: !1162, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1163, file: !582, line: 139, baseType: !1162, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1158, file: !582, line: 146, baseType: !1161, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1158, file: !582, line: 152, baseType: !1156, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1153, file: !318, line: 130, baseType: !1013, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1148, file: !318, line: 134, baseType: !1119, size: 64, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1148, file: !318, line: 137, baseType: !876, size: 64, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1148, file: !318, line: 138, baseType: !963, size: 32, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1148, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !318, line: 144, baseType: !932, size: 32, offset: 384)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1148, file: !318, line: 145, baseType: !932, size: 32, offset: 416)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1148, file: !318, line: 146, baseType: !1377, size: 64, offset: 448)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !891)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1131, file: !318, line: 220, baseType: !1134, size: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1131, file: !318, line: 223, baseType: !1119, size: 64, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1131, file: !318, line: 226, baseType: !1381, size: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1131, file: !318, line: 229, baseType: !1384, size: 128, offset: 256)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1385, size: 128, elements: !1083)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1131, file: !318, line: 232, baseType: !1130, size: 64, offset: 384)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1131, file: !318, line: 233, baseType: !1130, size: 64, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1131, file: !318, line: 238, baseType: !1390, size: 64, offset: 512)
!1390 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1391)
!1391 = !{!1392, !1398}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1390, file: !318, line: 236, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1395)
!1395 = !{!1396, !1397}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1394, file: !318, line: 275, baseType: !1156, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1394, file: !318, line: 278, baseType: !1156, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1390, file: !318, line: 237, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1400, file: !318, line: 261, baseType: !1013, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1400, file: !318, line: 262, baseType: !1013, size: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1400, file: !318, line: 266, baseType: !1013, size: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1400, file: !318, line: 267, baseType: !1013, size: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1400, file: !318, line: 270, baseType: !932, size: 32, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1131, file: !318, line: 241, baseType: !1377, size: 64, offset: 576)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1131, file: !318, line: 244, baseType: !932, size: 32, offset: 640)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1131, file: !318, line: 247, baseType: !932, size: 32, offset: 672)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1131, file: !318, line: 250, baseType: !932, size: 32, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1131, file: !318, line: 253, baseType: !932, size: 32, offset: 736)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !318, line: 256, baseType: !932, size: 32, offset: 768)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1034, file: !1016, line: 179, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1016, line: 150, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1016, line: 142, size: 320, elements: !1417)
!1417 = !{!1418, !1419, !1420, !1421, !1424, !1425}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1416, file: !1016, line: 144, baseType: !876, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1416, file: !1016, line: 145, baseType: !1013, size: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1416, file: !1016, line: 146, baseType: !1013, size: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1416, file: !1016, line: 147, baseType: !1422, size: 32, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1423, line: 31, baseType: !932)
!1423 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1416, file: !1016, line: 148, baseType: !7, size: 32, offset: 224)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1416, file: !1016, line: 149, baseType: !955, size: 8, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1034, file: !1016, line: 180, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1016, line: 162, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1016, line: 159, size: 128, elements: !1430)
!1430 = !{!1431, !1432}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1429, file: !1016, line: 160, baseType: !876, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1429, file: !1016, line: 161, baseType: !891, size: 64, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1034, file: !1016, line: 181, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1016, line: 181, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1029, file: !1016, line: 317, baseType: !1437, size: 64)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 64, elements: !936)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1029, file: !1016, line: 318, baseType: !1439, size: 320)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1016, line: 188, size: 320, elements: !1440)
!1440 = !{!1441, !1443, !1466}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1439, file: !1016, line: 190, baseType: !1442, size: 192)
!1442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 192, elements: !909)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1439, file: !1016, line: 193, baseType: !1444, size: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1016, line: 206, size: 320, elements: !1446)
!1446 = !{!1447, !1451, !1452, !1453, !1465}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1445, file: !1016, line: 208, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !877, line: 62, baseType: !1450)
!1450 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !877, line: 61, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1445, file: !1016, line: 211, baseType: !7, size: 32, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1445, file: !1016, line: 214, baseType: !891, size: 64, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1445, file: !1016, line: 224, baseType: !1454, size: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1016, line: 202, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1016, line: 202, size: 128, elements: !1457)
!1457 = !{!1458}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1456, file: !1016, line: 202, baseType: !1459, size: 128)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1016, line: 200, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1016, line: 200, size: 128, elements: !1461)
!1461 = !{!1462, !1463, !1464}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1460, file: !1016, line: 200, baseType: !7, size: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1460, file: !1016, line: 200, baseType: !7, size: 32, offset: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1460, file: !1016, line: 200, baseType: !1049, size: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1445, file: !1016, line: 234, baseType: !1454, size: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1439, file: !1016, line: 197, baseType: !891, size: 64, offset: 256)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1029, file: !1016, line: 319, baseType: !898, size: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1029, file: !1016, line: 320, baseType: !917, size: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !836, file: !334, line: 3384, baseType: !1470, size: 1472)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1471)
!1471 = !{!1472, !1493, !1494, !1495, !1496}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1470, file: !334, line: 3115, baseType: !1473, size: 1216)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1473, file: !334, line: 2985, baseType: !1009, size: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1473, file: !334, line: 2986, baseType: !876, size: 64, offset: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1473, file: !334, line: 2987, baseType: !876, size: 64, offset: 1024)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1473, file: !334, line: 2988, baseType: !876, size: 64, offset: 1088)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1473, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1473, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1473, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1473, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1473, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1473, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1473, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1473, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1473, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1473, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1473, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1473, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1473, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1473, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1470, file: !334, line: 3117, baseType: !876, size: 64, offset: 1216)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1470, file: !334, line: 3119, baseType: !876, size: 64, offset: 1280)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1470, file: !334, line: 3121, baseType: !876, size: 64, offset: 1344)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1470, file: !334, line: 3123, baseType: !876, size: 64, offset: 1408)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !836, file: !334, line: 3385, baseType: !1498, size: 1088)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1499)
!1499 = !{!1500, !1501, !1502}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1498, file: !334, line: 2875, baseType: !1009, size: 960)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1498, file: !334, line: 2876, baseType: !1013, size: 64, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1498, file: !334, line: 2877, baseType: !1503, size: 64, offset: 1024)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1505, line: 172, size: 128, elements: !1506)
!1505 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1512, !1513}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1504, file: !1505, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1504, file: !1505, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1504, file: !1505, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1504, file: !1505, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1504, file: !1505, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1504, file: !1505, line: 195, baseType: !7, size: 32, offset: 32)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1504, file: !1505, line: 199, baseType: !876, size: 64, offset: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !836, file: !334, line: 3386, baseType: !1473, size: 1216)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !836, file: !334, line: 3387, baseType: !1516, size: 1280)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1517)
!1517 = !{!1518, !1519}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1516, file: !334, line: 3094, baseType: !1473, size: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1516, file: !334, line: 3095, baseType: !1503, size: 64, offset: 1216)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !836, file: !334, line: 3388, baseType: !1521, size: 1216)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1521, file: !334, line: 2825, baseType: !971, size: 896)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1521, file: !334, line: 2827, baseType: !876, size: 64, offset: 896)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1521, file: !334, line: 2828, baseType: !876, size: 64, offset: 960)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1521, file: !334, line: 2829, baseType: !876, size: 64, offset: 1024)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1521, file: !334, line: 2830, baseType: !876, size: 64, offset: 1088)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1521, file: !334, line: 2831, baseType: !876, size: 64, offset: 1152)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !836, file: !334, line: 3389, baseType: !1530, size: 1024)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1531)
!1531 = !{!1532, !1533, !1534}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1530, file: !334, line: 2851, baseType: !1009, size: 960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1530, file: !334, line: 2852, baseType: !932, size: 32, offset: 960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1530, file: !334, line: 2853, baseType: !932, size: 32, offset: 992)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !836, file: !334, line: 3390, baseType: !1536, size: 1024)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1537)
!1537 = !{!1538, !1539}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1536, file: !334, line: 2858, baseType: !1009, size: 960)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1536, file: !334, line: 2859, baseType: !1503, size: 64, offset: 960)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !836, file: !334, line: 3391, baseType: !1541, size: 960)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1542)
!1542 = !{!1543}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1541, file: !334, line: 2863, baseType: !1009, size: 960)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !836, file: !334, line: 3392, baseType: !1545, size: 1472)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1546)
!1546 = !{!1547}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1545, file: !334, line: 3305, baseType: !1470, size: 1472)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !836, file: !334, line: 3393, baseType: !1549, size: 1792)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1550)
!1550 = !{!1551, !1552, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1549, file: !334, line: 3249, baseType: !1470, size: 1472)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1549, file: !334, line: 3251, baseType: !1553, size: 64, offset: 1472)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1555, line: 463, size: 1152, elements: !1556)
!1555 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1556 = !{!1557, !1560, !1591, !1592, !1707, !1710, !1711, !1712, !1713, !1714, !1715, !1739, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1554, file: !1555, line: 464, baseType: !1558, size: 64)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1555, line: 464, flags: DIFlagFwdDecl)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1554, file: !1555, line: 467, baseType: !1561, size: 64, offset: 64)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1563)
!1563 = !{!1564, !1566, !1567, !1580, !1581, !1582, !1583, !1584, !1585, !1587, !1589, !1590}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1562, file: !318, line: 377, baseType: !1565, size: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !877, line: 111, baseType: !1130)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1562, file: !318, line: 378, baseType: !1565, size: 64, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1562, file: !318, line: 381, baseType: !1568, size: 64, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1571)
!1571 = !{!1572}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1570, file: !318, line: 282, baseType: !1573, size: 128)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1575)
!1575 = !{!1576, !1577, !1578}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1574, file: !318, line: 281, baseType: !7, size: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1574, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1574, file: !318, line: 281, baseType: !1579, size: 64, offset: 64)
!1579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1565, size: 64, elements: !936)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1562, file: !318, line: 384, baseType: !932, size: 32, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1562, file: !318, line: 387, baseType: !932, size: 32, offset: 224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1562, file: !318, line: 390, baseType: !932, size: 32, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1562, file: !318, line: 394, baseType: !1568, size: 64, offset: 320)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1562, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1562, file: !318, line: 399, baseType: !1586, size: 64, offset: 416)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !1083)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1562, file: !318, line: 402, baseType: !1588, size: 64, offset: 480)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1083)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1562, file: !318, line: 406, baseType: !932, size: 32, offset: 544)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1562, file: !318, line: 409, baseType: !932, size: 32, offset: 576)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1554, file: !1555, line: 470, baseType: !1157, size: 64, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1554, file: !1555, line: 473, baseType: !1593, size: 64, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1505, line: 39, size: 1152, elements: !1595)
!1595 = !{!1596, !1646, !1659, !1671, !1672, !1684, !1685, !1689, !1690, !1691, !1692, !1693}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1594, file: !1505, line: 41, baseType: !1597, size: 64)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1598, line: 144, baseType: !1599)
