; ModuleID = 'cselib.c'
source_filename = "cselib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cselib_val_struct = type { i32, i32, %struct.rtx_def*, %struct.elt_loc_list*, %struct.elt_list*, %struct.cselib_val_struct* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.elt_loc_list = type { %struct.elt_loc_list*, %struct.rtx_def*, %struct.rtx_def* }
%struct.elt_list = type { %struct.elt_list*, %struct.cselib_val_struct* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }

!681 = !DIEnumerator(name: "PARAM_SCEV_MAX_EXPR_SIZE", value: 63, isUnsigned: true)
!682 = !DIEnumerator(name: "PARAM_OMEGA_MAX_VARS", value: 64, isUnsigned: true)
!683 = !DIEnumerator(name: "PARAM_OMEGA_MAX_GEQS", value: 65, isUnsigned: true)
!684 = !DIEnumerator(name: "PARAM_OMEGA_MAX_EQS", value: 66, isUnsigned: true)
!685 = !DIEnumerator(name: "PARAM_OMEGA_MAX_WILD_CARDS", value: 67, isUnsigned: true)
!686 = !DIEnumerator(name: "PARAM_OMEGA_HASH_TABLE_SIZE", value: 68, isUnsigned: true)
!687 = !DIEnumerator(name: "PARAM_OMEGA_MAX_KEYS", value: 69, isUnsigned: true)
!688 = !DIEnumerator(name: "PARAM_OMEGA_ELIMINATE_REDUNDANT_CONSTRAINTS", value: 70, isUnsigned: true)
!689 = !DIEnumerator(name: "PARAM_VECT_MAX_VERSION_FOR_ALIGNMENT_CHECKS", value: 71, isUnsigned: true)
!690 = !DIEnumerator(name: "PARAM_VECT_MAX_VERSION_FOR_ALIAS_CHECKS", value: 72, isUnsigned: true)
!691 = !DIEnumerator(name: "PARAM_MAX_CSELIB_MEMORY_LOCATIONS", value: 73, isUnsigned: true)
!692 = !DIEnumerator(name: "GGC_MIN_EXPAND", value: 74, isUnsigned: true)
!693 = !DIEnumerator(name: "GGC_MIN_HEAPSIZE", value: 75, isUnsigned: true)
!694 = !DIEnumerator(name: "PARAM_MAX_RELOAD_SEARCH_INSNS", value: 76, isUnsigned: true)
!695 = !DIEnumerator(name: "PARAM_MAX_SCHED_REGION_BLOCKS", value: 77, isUnsigned: true)
!696 = !DIEnumerator(name: "PARAM_MAX_SCHED_REGION_INSNS", value: 78, isUnsigned: true)
!697 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_BLOCKS", value: 79, isUnsigned: true)
!698 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_INSNS", value: 80, isUnsigned: true)
!699 = !DIEnumerator(name: "PARAM_MIN_SPEC_PROB", value: 81, isUnsigned: true)
!700 = !DIEnumerator(name: "PARAM_MAX_SCHED_EXTEND_REGIONS_ITERS", value: 82, isUnsigned: true)
!701 = !DIEnumerator(name: "PARAM_MAX_SCHED_INSN_CONFLICT_DELAY", value: 83, isUnsigned: true)
!702 = !DIEnumerator(name: "PARAM_SCHED_SPEC_PROB_CUTOFF", value: 84, isUnsigned: true)
!703 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_LOOKAHEAD", value: 85, isUnsigned: true)
!704 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_SCHED_TIMES", value: 86, isUnsigned: true)
!705 = !DIEnumerator(name: "PARAM_SELSCHED_INSNS_TO_RENAME", value: 87, isUnsigned: true)
!706 = !DIEnumerator(name: "PARAM_SCHED_MEM_TRUE_DEP_COST", value: 88, isUnsigned: true)
!707 = !DIEnumerator(name: "PARAM_MAX_LAST_VALUE_RTL", value: 89, isUnsigned: true)
!708 = !DIEnumerator(name: "PARAM_INTEGER_SHARE_LIMIT", value: 90, isUnsigned: true)
!709 = !DIEnumerator(name: "PARAM_MIN_VIRTUAL_MAPPINGS", value: 91, isUnsigned: true)
!710 = !DIEnumerator(name: "PARAM_VIRTUAL_MAPPINGS_TO_SYMS_RATIO", value: 92, isUnsigned: true)
!711 = !DIEnumerator(name: "PARAM_SSP_BUFFER_SIZE", value: 93, isUnsigned: true)
!712 = !DIEnumerator(name: "PARAM_MAX_JUMP_THREAD_DUPLICATION_STMTS", value: 94, isUnsigned: true)
!713 = !DIEnumerator(name: "PARAM_MAX_FIELDS_FOR_FIELD_SENSITIVE", value: 95, isUnsigned: true)
!714 = !DIEnumerator(name: "PARAM_MAX_SCHED_READY_INSNS", value: 96, isUnsigned: true)
!715 = !DIEnumerator(name: "PARAM_PREFETCH_LATENCY", value: 97, isUnsigned: true)
!716 = !DIEnumerator(name: "PARAM_SIMULTANEOUS_PREFETCHES", value: 98, isUnsigned: true)
!717 = !DIEnumerator(name: "PARAM_L1_CACHE_SIZE", value: 99, isUnsigned: true)
!718 = !DIEnumerator(name: "PARAM_L1_CACHE_LINE_SIZE", value: 100, isUnsigned: true)
!719 = !DIEnumerator(name: "PARAM_L2_CACHE_SIZE", value: 101, isUnsigned: true)
!720 = !DIEnumerator(name: "PARAM_USE_CANONICAL_TYPES", value: 102, isUnsigned: true)
!721 = !DIEnumerator(name: "PARAM_MAX_PARTIAL_ANTIC_LENGTH", value: 103, isUnsigned: true)
!722 = !DIEnumerator(name: "PARAM_SCCVN_MAX_SCC_SIZE", value: 104, isUnsigned: true)
!723 = !DIEnumerator(name: "PARAM_IRA_MAX_LOOPS_NUM", value: 105, isUnsigned: true)
!724 = !DIEnumerator(name: "PARAM_IRA_MAX_CONFLICT_TABLE_SIZE", value: 106, isUnsigned: true)
!725 = !DIEnumerator(name: "PARAM_IRA_LOOP_RESERVED_REGS", value: 107, isUnsigned: true)
!726 = !DIEnumerator(name: "PARAM_SWITCH_CONVERSION_BRANCH_RATIO", value: 108, isUnsigned: true)
!727 = !DIEnumerator(name: "PARAM_LOOP_BLOCK_TILE_SIZE", value: 109, isUnsigned: true)
!728 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_NB_SCOP_PARAMS", value: 110, isUnsigned: true)
!729 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_BBS_PER_FUNCTION", value: 111, isUnsigned: true)
!730 = !DIEnumerator(name: "PARAM_LOOP_INVARIANT_MAX_BBS_IN_LOOP", value: 112, isUnsigned: true)
!731 = !DIEnumerator(name: "PARAM_SLP_MAX_INSNS_IN_BB", value: 113, isUnsigned: true)
!732 = !DIEnumerator(name: "PARAM_MIN_INSN_TO_PREFETCH_RATIO", value: 114, isUnsigned: true)
!733 = !DIEnumerator(name: "PARAM_PREFETCH_MIN_INSN_TO_MEM_RATIO", value: 115, isUnsigned: true)
!734 = !DIEnumerator(name: "PARAM_MAX_VARTRACK_SIZE", value: 116, isUnsigned: true)
!735 = !DIEnumerator(name: "PARAM_MIN_NONDEBUG_INSN_UID", value: 117, isUnsigned: true)
!736 = !DIEnumerator(name: "PARAM_IPA_SRA_PTR_GROWTH_FACTOR", value: 118, isUnsigned: true)
!737 = !DIEnumerator(name: "LAST_PARAM", value: 119, isUnsigned: true)
!738 = !{!5, !739, !377, !740, !741, !7, !1835, !1836, !814, !588, !809, !802, !1837, !1839, !992, !1841, !743, !1843, !1845, !1846}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!740 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !742, line: 50, baseType: !743)
!742 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !744, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !744, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !744, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !744, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !744, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !744, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !744, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !744, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !744, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !744, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !744, file: !378, line: 321, baseType: !757, size: 320, offset: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !758)
!758 = !{!759, !1770, !1772, !1833, !1834}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !757, file: !378, line: 316, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 64, elements: !779)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !763)
!763 = !{!764, !765, !766, !770, !771, !781, !782, !794, !817, !880, !1748, !1749, !1760, !1767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !762, file: !378, line: 168, baseType: !740, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !762, file: !378, line: 169, baseType: !7, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !762, file: !378, line: 170, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !762, file: !378, line: 171, baseType: !741, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !762, file: !378, line: 172, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !742, line: 53, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !774, file: !378, line: 360, baseType: !740, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !774, file: !378, line: 361, baseType: !778, size: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 64, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 1)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !762, file: !378, line: 173, baseType: !5, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !762, file: !378, line: 174, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !784, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !784, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !784, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !784, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !784, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !784, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !784, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !784, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !762, file: !378, line: 175, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !569, line: 23, size: 320, elements: !797)
!797 = !{!798, !799, !800, !801, !808, !816}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !796, file: !569, line: 25, baseType: !7, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !796, file: !569, line: 28, baseType: !740, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !796, file: !569, line: 31, baseType: !741, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !796, file: !569, line: 35, baseType: !802, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !569, line: 45, size: 192, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !569, line: 47, baseType: !802, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !803, file: !569, line: 49, baseType: !741, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !803, file: !569, line: 51, baseType: !741, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !796, file: !569, line: 39, baseType: !809, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !569, line: 55, size: 128, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !569, line: 56, baseType: !809, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !810, file: !569, line: 57, baseType: !814, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !569, line: 42, baseType: !796)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !796, file: !569, line: 41, baseType: !795, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !762, file: !378, line: 176, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !820, line: 75, size: 256, elements: !821)
!820 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!821 = !{!822, !837, !838, !839}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !819, file: !820, line: 76, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !820, line: 68, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !820, line: 63, size: 320, elements: !826)
!826 = !{!827, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !820, line: 64, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !825, file: !820, line: 65, baseType: !828, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !825, file: !820, line: 66, baseType: !7, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !825, file: !820, line: 67, baseType: !832, size: 128, offset: 192)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 128, elements: !835)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !820, line: 29, baseType: !834)
!834 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!835 = !{!836}
!836 = !DISubrange(count: 2)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !819, file: !820, line: 77, baseType: !823, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !819, file: !820, line: 78, baseType: !7, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !819, file: !820, line: 79, baseType: !840, size: 64, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !820, line: 49, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !820, line: 45, size: 832, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !842, file: !820, line: 46, baseType: !828, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !842, file: !820, line: 47, baseType: !818, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !842, file: !820, line: 48, baseType: !847, size: 704, offset: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !848, line: 164, size: 704, elements: !849)
!848 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!849 = !{!850, !852, !863, !864, !865, !866, !867, !868, !872, !876, !877, !878, !879}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !847, file: !848, line: 166, baseType: !851, size: 64)
!851 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !847, file: !848, line: 167, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !848, line: 157, size: 192, elements: !855)
!855 = !{!856, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !854, file: !848, line: 159, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !854, file: !848, line: 160, baseType: !853, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !854, file: !848, line: 161, baseType: !860, size: 32, offset: 128)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 32, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 4)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !847, file: !848, line: 168, baseType: !857, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !847, file: !848, line: 169, baseType: !857, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !847, file: !848, line: 170, baseType: !857, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !847, file: !848, line: 171, baseType: !851, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !847, file: !848, line: 172, baseType: !740, size: 32, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !847, file: !848, line: 176, baseType: !869, size: 64, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!853, !739, !851}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !847, file: !848, line: 177, baseType: !873, size: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !739, !853}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !847, file: !848, line: 178, baseType: !739, size: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !847, file: !848, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !847, file: !848, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !847, file: !848, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !762, file: !378, line: 177, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !742, line: 56, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !884)
!884 = !{!885, !918, !924, !935, !954, !965, !970, !977, !983, !997, !1009, !1047, !1052, !1080, !1088, !1089, !1094, !1103, !1109, !1114, !1118, !1122, !1372, !1421, !1427, !1434, !1441, !1467, !1492, !1509, !1521, !1543, !1558, !1730}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !883, file: !151, line: 3372, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !886, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !886, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !886, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !886, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !886, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !886, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !886, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !886, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !886, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !886, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !886, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !886, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !886, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !886, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !886, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !886, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !886, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !886, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !886, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !886, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !886, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !886, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !886, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !886, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !886, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !886, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !886, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !886, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !886, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !886, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !151, line: 3373, baseType: !919, size: 192)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !919, file: !151, line: 403, baseType: !886, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !919, file: !151, line: 404, baseType: !881, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !919, file: !151, line: 405, baseType: !881, size: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !883, file: !151, line: 3374, baseType: !925, size: 320)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !151, line: 1385, baseType: !919, size: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !925, file: !151, line: 1386, baseType: !929, size: 128, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !930, line: 58, baseType: !931)
!930 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !930, line: 54, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !931, file: !930, line: 56, baseType: !834, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !931, file: !930, line: 57, baseType: !851, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !883, file: !151, line: 3375, baseType: !936, size: 256)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !151, line: 1398, baseType: !919, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !936, file: !151, line: 1399, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !942, line: 52, size: 256, elements: !943)
!942 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!943 = !{!944, !945, !946, !947, !948, !949, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !941, file: !942, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !941, file: !942, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !941, file: !942, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !941, file: !942, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !941, file: !942, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !941, file: !942, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !941, file: !942, line: 62, baseType: !951, size: 192, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 192, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 3)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !883, file: !151, line: 3376, baseType: !955, size: 256)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !151, line: 1409, baseType: !919, size: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !955, file: !151, line: 1410, baseType: !959, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !961, line: 27, size: 192, elements: !962)
!961 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !960, file: !961, line: 29, baseType: !929, size: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !960, file: !961, line: 30, baseType: !5, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !883, file: !151, line: 3377, baseType: !966, size: 256)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !151, line: 1438, baseType: !919, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !966, file: !151, line: 1439, baseType: !881, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !883, file: !151, line: 3378, baseType: !971, size: 256)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !151, line: 1419, baseType: !919, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !971, file: !151, line: 1420, baseType: !740, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !971, file: !151, line: 1421, baseType: !976, size: 8, offset: 224)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 8, elements: !779)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !883, file: !151, line: 3379, baseType: !978, size: 320)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !151, line: 1429, baseType: !919, size: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !978, file: !151, line: 1430, baseType: !881, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !978, file: !151, line: 1431, baseType: !881, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !883, file: !151, line: 3380, baseType: !984, size: 320)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !151, line: 1461, baseType: !919, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !984, file: !151, line: 1462, baseType: !988, size: 128, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !989, line: 31, size: 128, elements: !990)
!989 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!990 = !{!991, !995, !996}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !989, line: 32, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !988, file: !989, line: 33, baseType: !7, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !988, file: !989, line: 34, baseType: !7, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !883, file: !151, line: 3381, baseType: !998, size: 384)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !999)
!999 = !{!1000, !1001, !1006, !1007, !1008}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !151, line: 2508, baseType: !919, size: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !998, file: !151, line: 2509, baseType: !1002, size: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1003, line: 58, baseType: !1004)
!1003 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1005, line: 44, baseType: !7)
!1005 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !998, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !151, line: 2511, baseType: !881, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !998, file: !151, line: 2512, baseType: !881, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !883, file: !151, line: 3382, baseType: !1010, size: 896)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !151, line: 2653, baseType: !998, size: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !151, line: 2654, baseType: !881, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1010, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1010, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1010, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1010, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1010, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1010, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1010, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1010, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1010, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1010, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1010, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1010, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1010, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1010, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1010, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1010, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1010, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1010, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1010, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1010, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1010, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1010, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1010, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1010, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1010, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1010, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1010, file: !151, line: 2705, baseType: !881, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1010, file: !151, line: 2706, baseType: !881, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1010, file: !151, line: 2707, baseType: !881, size: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1010, file: !151, line: 2708, baseType: !881, size: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1010, file: !151, line: 2711, baseType: !1045, size: 64, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !883, file: !151, line: 3383, baseType: !1048, size: 960)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !151, line: 2757, baseType: !1010, size: 896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1048, file: !151, line: 2758, baseType: !741, size: 64, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !883, file: !151, line: 3384, baseType: !1053, size: 1472)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1054)
!1054 = !{!1055, !1076, !1077, !1078, !1079}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !151, line: 3115, baseType: !1056, size: 1216)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !151, line: 2985, baseType: !1048, size: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1056, file: !151, line: 2986, baseType: !881, size: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1056, file: !151, line: 2987, baseType: !881, size: 64, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1056, file: !151, line: 2988, baseType: !881, size: 64, offset: 1088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1056, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1056, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1056, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1056, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1056, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1056, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1056, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1056, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1056, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1056, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1056, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1056, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1056, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1056, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1053, file: !151, line: 3117, baseType: !881, size: 64, offset: 1216)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1053, file: !151, line: 3119, baseType: !881, size: 64, offset: 1280)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1053, file: !151, line: 3121, baseType: !881, size: 64, offset: 1344)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1053, file: !151, line: 3123, baseType: !881, size: 64, offset: 1408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !883, file: !151, line: 3385, baseType: !1081, size: 1088)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !151, line: 2875, baseType: !1048, size: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1081, file: !151, line: 2876, baseType: !741, size: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1081, file: !151, line: 2877, baseType: !1086, size: 64, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !883, file: !151, line: 3386, baseType: !1056, size: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !883, file: !151, line: 3387, baseType: !1090, size: 1280)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !151, line: 3094, baseType: !1056, size: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1090, file: !151, line: 3095, baseType: !1086, size: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !883, file: !151, line: 3388, baseType: !1095, size: 1216)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !151, line: 2825, baseType: !1010, size: 896)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1095, file: !151, line: 2827, baseType: !881, size: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1095, file: !151, line: 2828, baseType: !881, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1095, file: !151, line: 2829, baseType: !881, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1095, file: !151, line: 2830, baseType: !881, size: 64, offset: 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1095, file: !151, line: 2831, baseType: !881, size: 64, offset: 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !883, file: !151, line: 3389, baseType: !1104, size: 1024)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !151, line: 2851, baseType: !1048, size: 960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1104, file: !151, line: 2852, baseType: !740, size: 32, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1104, file: !151, line: 2853, baseType: !740, size: 32, offset: 992)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !883, file: !151, line: 3390, baseType: !1110, size: 1024)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !151, line: 2858, baseType: !1048, size: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1110, file: !151, line: 2859, baseType: !1086, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !883, file: !151, line: 3391, baseType: !1115, size: 960)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !151, line: 2863, baseType: !1048, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !883, file: !151, line: 3392, baseType: !1119, size: 1472)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1120)
!1120 = !{!1121}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !151, line: 3305, baseType: !1053, size: 1472)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !883, file: !151, line: 3393, baseType: !1123, size: 1792)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1124)
!1124 = !{!1125, !1126, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !151, line: 3249, baseType: !1053, size: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1123, file: !151, line: 3251, baseType: !1127, size: 64, offset: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1129, line: 463, size: 1152, elements: !1130)
!1129 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1130 = !{!1131, !1134, !1238, !1239, !1242, !1245, !1296, !1297, !1298, !1299, !1300, !1324, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1128, file: !1129, line: 464, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1129, line: 464, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1128, file: !1129, line: 467, baseType: !1135, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1137)
!1137 = !{!1138, !1213, !1214, !1227, !1228, !1229, !1230, !1231, !1232, !1234, !1236, !1237}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1136, file: !135, line: 377, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !742, line: 111, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1142)
!1142 = !{!1143, !1178, !1179, !1180, !1183, !1187, !1188, !1189, !1207, !1208, !1209, !1210, !1211, !1212}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1141, file: !135, line: 219, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1147)
!1147 = !{!1148}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1146, file: !135, line: 151, baseType: !1149, size: 128)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1150, file: !135, line: 150, baseType: !7, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1150, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1150, file: !135, line: 150, baseType: !1155, size: 64, offset: 64)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 64, elements: !779)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !742, line: 108, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1158, file: !135, line: 124, baseType: !1140, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1158, file: !135, line: 125, baseType: !1140, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1158, file: !135, line: 131, baseType: !1163, size: 64, offset: 128)
!1163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1164)
!1164 = !{!1165, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1163, file: !135, line: 129, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !742, line: 66, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !742, line: 65, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1163, file: !135, line: 130, baseType: !741, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1158, file: !135, line: 134, baseType: !739, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1158, file: !135, line: 137, baseType: !881, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1158, file: !135, line: 138, baseType: !1002, size: 32, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1158, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1158, file: !135, line: 144, baseType: !740, size: 32, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1158, file: !135, line: 145, baseType: !740, size: 32, offset: 416)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1158, file: !135, line: 146, baseType: !1177, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !851)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1141, file: !135, line: 220, baseType: !1144, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1141, file: !135, line: 223, baseType: !739, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1141, file: !135, line: 226, baseType: !1181, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1141, file: !135, line: 229, baseType: !1184, size: 128, offset: 256)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 128, elements: !835)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1141, file: !135, line: 232, baseType: !1140, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1141, file: !135, line: 233, baseType: !1140, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1141, file: !135, line: 238, baseType: !1190, size: 64, offset: 512)
!1190 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1191)
!1191 = !{!1192, !1198}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1190, file: !135, line: 236, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1194, file: !135, line: 275, baseType: !1166, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1194, file: !135, line: 278, baseType: !1166, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1190, file: !135, line: 237, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1200, file: !135, line: 261, baseType: !741, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1200, file: !135, line: 262, baseType: !741, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1200, file: !135, line: 266, baseType: !741, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1200, file: !135, line: 267, baseType: !741, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1200, file: !135, line: 270, baseType: !740, size: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1141, file: !135, line: 241, baseType: !1177, size: 64, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1141, file: !135, line: 244, baseType: !740, size: 32, offset: 640)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1141, file: !135, line: 247, baseType: !740, size: 32, offset: 672)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1141, file: !135, line: 250, baseType: !740, size: 32, offset: 704)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1141, file: !135, line: 253, baseType: !740, size: 32, offset: 736)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !135, line: 256, baseType: !740, size: 32, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1136, file: !135, line: 378, baseType: !1139, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1136, file: !135, line: 381, baseType: !1215, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1217, file: !135, line: 282, baseType: !1220, size: 128)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1221, file: !135, line: 281, baseType: !7, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1221, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1221, file: !135, line: 281, baseType: !1226, size: 64, offset: 64)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 64, elements: !779)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1136, file: !135, line: 384, baseType: !740, size: 32, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1136, file: !135, line: 387, baseType: !740, size: 32, offset: 224)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1136, file: !135, line: 390, baseType: !740, size: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1136, file: !135, line: 394, baseType: !1215, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1136, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1136, file: !135, line: 399, baseType: !1233, size: 64, offset: 416)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !835)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1136, file: !135, line: 402, baseType: !1235, size: 64, offset: 480)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !835)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1136, file: !135, line: 406, baseType: !740, size: 32, offset: 544)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1136, file: !135, line: 409, baseType: !740, size: 32, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1128, file: !1129, line: 470, baseType: !1167, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1128, file: !1129, line: 473, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1129, line: 166, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1128, file: !1129, line: 476, baseType: !1243, size: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1129, line: 476, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1128, file: !1129, line: 479, baseType: !1246, size: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !611, line: 144, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !611, line: 100, size: 896, elements: !1249)
!1249 = !{!1250, !1258, !1263, !1268, !1270, !1273, !1274, !1275, !1276, !1277, !1282, !1284, !1285, !1290, !1295}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1248, file: !611, line: 102, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !611, line: 52, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !611, line: 47, baseType: !7)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1248, file: !611, line: 105, baseType: !1259, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !611, line: 59, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!740, !1256, !1256}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1248, file: !611, line: 108, baseType: !1264, size: 64, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !611, line: 63, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{null, !739}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1248, file: !611, line: 111, baseType: !1269, size: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1248, file: !611, line: 114, baseType: !1271, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1272, line: 46, baseType: !834)
!1272 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1248, file: !611, line: 117, baseType: !1271, size: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1248, file: !611, line: 120, baseType: !1271, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1248, file: !611, line: 124, baseType: !7, size: 32, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1248, file: !611, line: 128, baseType: !7, size: 32, offset: 480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1248, file: !611, line: 131, baseType: !1278, size: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !611, line: 75, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!739, !1271, !1271}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1248, file: !611, line: 132, baseType: !1283, size: 64, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !611, line: 78, baseType: !1265)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1248, file: !611, line: 135, baseType: !739, size: 64, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1248, file: !611, line: 136, baseType: !1286, size: 64, offset: 704)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !611, line: 82, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!739, !739, !1271, !1271}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1248, file: !611, line: 137, baseType: !1291, size: 64, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !611, line: 83, baseType: !1292)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !739, !739}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1248, file: !611, line: 141, baseType: !7, size: 32, offset: 832)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1128, file: !1129, line: 484, baseType: !881, size: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1128, file: !1129, line: 488, baseType: !881, size: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1128, file: !1129, line: 493, baseType: !881, size: 64, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1128, file: !1129, line: 496, baseType: !881, size: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1128, file: !1129, line: 501, baseType: !1301, size: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1303)
!1303 = !{!1304, !1307, !1308, !1309, !1310, !1312, !1313, !1318, !1319, !1320, !1321, !1322, !1323}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1302, file: !146, line: 2356, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1302, file: !146, line: 2357, baseType: !767, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1302, file: !146, line: 2358, baseType: !740, size: 32, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1302, file: !146, line: 2359, baseType: !740, size: 32, offset: 160)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1302, file: !146, line: 2360, baseType: !1311, size: 128, offset: 192)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 128, elements: !861)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1302, file: !146, line: 2364, baseType: !740, size: 32, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1302, file: !146, line: 2367, baseType: !1314, size: 128, offset: 384)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1314, file: !146, line: 2351, baseType: !741, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1314, file: !146, line: 2352, baseType: !851, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1302, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1302, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1302, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1302, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1302, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1302, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1128, file: !1129, line: 504, baseType: !1325, size: 64, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1129, line: 504, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1128, file: !1129, line: 507, baseType: !1246, size: 64, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1128, file: !1129, line: 510, baseType: !740, size: 32, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1128, file: !1129, line: 513, baseType: !740, size: 32, offset: 864)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1128, file: !1129, line: 516, baseType: !1002, size: 32, offset: 896)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1128, file: !1129, line: 519, baseType: !1002, size: 32, offset: 928)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1128, file: !1129, line: 522, baseType: !7, size: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1128, file: !1129, line: 523, baseType: !7, size: 32, offset: 992)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1128, file: !1129, line: 528, baseType: !767, size: 64, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1128, file: !1129, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1128, file: !1129, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1128, file: !1129, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1128, file: !1129, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1128, file: !1129, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1128, file: !1129, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1128, file: !1129, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1128, file: !1129, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1128, file: !1129, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1128, file: !1129, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1128, file: !1129, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1128, file: !1129, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1128, file: !1129, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1128, file: !1129, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1128, file: !1129, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1128, file: !1129, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1123, file: !151, line: 3254, baseType: !881, size: 64, offset: 1536)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1123, file: !151, line: 3257, baseType: !881, size: 64, offset: 1600)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1123, file: !151, line: 3258, baseType: !881, size: 64, offset: 1664)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1123, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1123, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1123, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1123, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1123, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1123, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1123, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1123, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1123, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1123, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1123, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1123, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1123, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1123, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1123, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1123, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1123, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1123, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !883, file: !151, line: 3394, baseType: !1373, size: 1344)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1400, !1401, !1402, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1373, file: !151, line: 2280, baseType: !919, size: 192)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1373, file: !151, line: 2281, baseType: !881, size: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1373, file: !151, line: 2282, baseType: !881, size: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1373, file: !151, line: 2283, baseType: !881, size: 64, offset: 320)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1373, file: !151, line: 2284, baseType: !881, size: 64, offset: 384)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1373, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1373, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1373, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1373, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1373, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1373, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1373, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1373, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1373, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1373, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1373, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1373, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1373, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1373, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1373, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1373, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1373, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1373, file: !151, line: 2306, baseType: !1398, size: 32, offset: 544)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1399, line: 31, baseType: !740)
!1399 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1373, file: !151, line: 2307, baseType: !881, size: 64, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1373, file: !151, line: 2308, baseType: !881, size: 64, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1373, file: !151, line: 2314, baseType: !1403, size: 64, offset: 704)
!1403 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1404)
!1404 = !{!1405, !1406, !1407}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1403, file: !151, line: 2310, baseType: !740, size: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1403, file: !151, line: 2311, baseType: !767, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1403, file: !151, line: 2312, baseType: !1408, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1373, file: !151, line: 2315, baseType: !881, size: 64, offset: 768)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1373, file: !151, line: 2316, baseType: !881, size: 64, offset: 832)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1373, file: !151, line: 2317, baseType: !881, size: 64, offset: 896)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1373, file: !151, line: 2318, baseType: !881, size: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1373, file: !151, line: 2319, baseType: !881, size: 64, offset: 1024)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1373, file: !151, line: 2320, baseType: !881, size: 64, offset: 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1373, file: !151, line: 2321, baseType: !881, size: 64, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1373, file: !151, line: 2322, baseType: !881, size: 64, offset: 1216)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1373, file: !151, line: 2324, baseType: !1419, size: 64, offset: 1280)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !883, file: !151, line: 3395, baseType: !1422, size: 320)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1423)
!1423 = !{!1424, !1425, !1426}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1422, file: !151, line: 1470, baseType: !919, size: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1422, file: !151, line: 1471, baseType: !881, size: 64, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1422, file: !151, line: 1472, baseType: !881, size: 64, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !883, file: !151, line: 3396, baseType: !1428, size: 320)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1429)
!1429 = !{!1430, !1431, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1428, file: !151, line: 1483, baseType: !919, size: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1428, file: !151, line: 1484, baseType: !740, size: 32, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1428, file: !151, line: 1485, baseType: !1433, size: 64, offset: 256)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 64, elements: !779)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !883, file: !151, line: 3397, baseType: !1435, size: 384)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1435, file: !151, line: 1830, baseType: !919, size: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1435, file: !151, line: 1831, baseType: !1002, size: 32, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1435, file: !151, line: 1832, baseType: !881, size: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1435, file: !151, line: 1835, baseType: !1433, size: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !883, file: !151, line: 3398, baseType: !1442, size: 704)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1450, !1451, !1454}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1442, file: !151, line: 1899, baseType: !919, size: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1442, file: !151, line: 1902, baseType: !881, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1442, file: !151, line: 1905, baseType: !1447, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !742, line: 58, baseType: !1448)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !742, line: 57, flags: DIFlagFwdDecl)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1442, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1442, file: !151, line: 1911, baseType: !1452, size: 64, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1442, file: !151, line: 1914, baseType: !1455, size: 256, offset: 448)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1456)
!1456 = !{!1457, !1459, !1460, !1465}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1455, file: !151, line: 1884, baseType: !1458, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1455, file: !151, line: 1885, baseType: !1458, size: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1455, file: !151, line: 1891, baseType: !1461, size: 64, offset: 128)
!1461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1455, file: !151, line: 1891, size: 64, elements: !1462)
!1462 = !{!1463, !1464}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1461, file: !151, line: 1891, baseType: !1447, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1461, file: !151, line: 1891, baseType: !881, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1455, file: !151, line: 1892, baseType: !1466, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !883, file: !151, line: 3399, baseType: !1468, size: 704)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1474, !1475, !1487, !1488, !1489, !1490, !1491}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1468, file: !151, line: 2009, baseType: !919, size: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1468, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1468, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1468, file: !151, line: 2014, baseType: !1002, size: 32, offset: 224)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1468, file: !151, line: 2016, baseType: !881, size: 64, offset: 256)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1468, file: !151, line: 2017, baseType: !1476, size: 64, offset: 320)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1479)
!1479 = !{!1480}
