; ModuleID = 'domwalk.c'
source_filename = "domwalk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!190 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!191 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!192 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!193 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!194 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!195 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!196 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!197 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!198 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!199 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!200 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!201 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!202 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!203 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!204 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!205 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!206 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!207 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!208 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!209 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!210 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!211 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!212 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!214 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!215 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!216 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!217 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!218 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!219 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!220 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!221 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!222 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!223 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!224 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!235 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!236 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!237 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!238 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!239 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!240 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!241 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!242 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!243 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!244 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!245 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!246 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!247 = !{!248, !249, !1118, !5}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !251, line: 111, baseType: !252)
!251 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !254)
!254 = !{!255, !1083, !1084, !1085, !1088, !1092, !1093, !1094, !1112, !1113, !1114, !1115, !1116, !1117}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !253, file: !4, line: 219, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !258, file: !4, line: 151, baseType: !261, size: 128)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !263)
!263 = !{!264, !265, !266}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !262, file: !4, line: 150, baseType: !5, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !262, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !262, file: !4, line: 150, baseType: !267, size: 64, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 64, elements: !371)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !251, line: 108, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !271)
!271 = !{!272, !273, !274, !285, !286, !1077, !1078, !1079, !1080, !1081}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !270, file: !4, line: 124, baseType: !252, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !270, file: !4, line: 125, baseType: !252, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !270, file: !4, line: 131, baseType: !275, size: 64, offset: 128)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !276)
!276 = !{!277, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !275, file: !4, line: 129, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !251, line: 66, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !251, line: 65, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !275, file: !4, line: 130, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !251, line: 50, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !251, line: 49, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !270, file: !4, line: 134, baseType: !248, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !270, file: !4, line: 137, baseType: !287, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !251, line: 56, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !290)
!290 = !{!291, !324, !330, !343, !350, !357, !362, !373, !379, !393, !405, !443, !448, !476, !484, !485, !490, !499, !505, !510, !514, !518, !701, !750, !756, !763, !770, !796, !821, !838, !850, !872, !887, !1059}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !289, file: !21, line: 3372, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !292, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !292, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !292, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !292, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !292, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !292, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !292, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !292, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !292, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !292, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !292, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !292, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !292, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !292, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !292, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !292, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !292, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !292, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !292, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !292, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !292, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !292, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !292, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !292, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !292, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !292, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !292, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !292, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !292, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !292, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !289, file: !21, line: 3373, baseType: !325, size: 192)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !325, file: !21, line: 403, baseType: !292, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !325, file: !21, line: 404, baseType: !287, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !21, line: 405, baseType: !287, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !289, file: !21, line: 3374, baseType: !331, size: 320)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !331, file: !21, line: 1385, baseType: !325, size: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !331, file: !21, line: 1386, baseType: !335, size: 128, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !336, line: 58, baseType: !337)
!336 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 54, size: 128, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !337, file: !336, line: 56, baseType: !340, size: 64)
!340 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !337, file: !336, line: 57, baseType: !342, size: 64, offset: 64)
!342 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !289, file: !21, line: 3375, baseType: !344, size: 256)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !344, file: !21, line: 1398, baseType: !325, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !344, file: !21, line: 1399, baseType: !348, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !289, file: !21, line: 3376, baseType: !351, size: 256)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !351, file: !21, line: 1409, baseType: !325, size: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !351, file: !21, line: 1410, baseType: !355, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !289, file: !21, line: 3377, baseType: !358, size: 256)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !358, file: !21, line: 1438, baseType: !325, size: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !358, file: !21, line: 1439, baseType: !287, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !289, file: !21, line: 3378, baseType: !363, size: 256)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !364)
!364 = !{!365, !366, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !363, file: !21, line: 1419, baseType: !325, size: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !363, file: !21, line: 1420, baseType: !367, size: 32, offset: 192)
!367 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !363, file: !21, line: 1421, baseType: !369, size: 8, offset: 224)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 8, elements: !371)
!370 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !289, file: !21, line: 3379, baseType: !374, size: 320)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !374, file: !21, line: 1429, baseType: !325, size: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !374, file: !21, line: 1430, baseType: !287, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !374, file: !21, line: 1431, baseType: !287, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !289, file: !21, line: 3380, baseType: !380, size: 320)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !380, file: !21, line: 1461, baseType: !325, size: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !21, line: 1462, baseType: !384, size: 128, offset: 192)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !385, line: 31, size: 128, elements: !386)
!385 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!386 = !{!387, !391, !392}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !384, file: !385, line: 32, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !384, file: !385, line: 33, baseType: !5, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !384, file: !385, line: 34, baseType: !5, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !289, file: !21, line: 3381, baseType: !394, size: 384)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !395)
!395 = !{!396, !397, !402, !403, !404}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !394, file: !21, line: 2508, baseType: !325, size: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !394, file: !21, line: 2509, baseType: !398, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !399, line: 58, baseType: !400)
!399 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !401, line: 44, baseType: !5)
!401 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!402 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !394, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !394, file: !21, line: 2511, baseType: !287, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !394, file: !21, line: 2512, baseType: !287, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !289, file: !21, line: 3382, baseType: !406, size: 896)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !406, file: !21, line: 2653, baseType: !394, size: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !21, line: 2654, baseType: !287, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !406, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !406, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !406, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !406, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !406, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !406, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !406, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !406, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !406, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !406, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !406, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !406, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !406, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !406, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !406, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !406, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !406, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !406, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !406, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !406, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !406, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !406, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !406, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !406, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !406, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !406, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !406, file: !21, line: 2705, baseType: !287, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !406, file: !21, line: 2706, baseType: !287, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !406, file: !21, line: 2707, baseType: !287, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !406, file: !21, line: 2708, baseType: !287, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !406, file: !21, line: 2711, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !289, file: !21, line: 3383, baseType: !444, size: 960)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !444, file: !21, line: 2757, baseType: !406, size: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !444, file: !21, line: 2758, baseType: !282, size: 64, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !289, file: !21, line: 3384, baseType: !449, size: 1472)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !450)
!450 = !{!451, !472, !473, !474, !475}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !21, line: 3115, baseType: !452, size: 1216)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !452, file: !21, line: 2985, baseType: !444, size: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !452, file: !21, line: 2986, baseType: !287, size: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !452, file: !21, line: 2987, baseType: !287, size: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !452, file: !21, line: 2988, baseType: !287, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !452, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !452, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !452, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !452, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !452, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !452, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !452, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !452, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !452, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !452, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !452, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !452, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !452, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !452, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !449, file: !21, line: 3117, baseType: !287, size: 64, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !449, file: !21, line: 3119, baseType: !287, size: 64, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !449, file: !21, line: 3121, baseType: !287, size: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !449, file: !21, line: 3123, baseType: !287, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !289, file: !21, line: 3385, baseType: !477, size: 1088)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !21, line: 2875, baseType: !444, size: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !477, file: !21, line: 2876, baseType: !282, size: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !477, file: !21, line: 2877, baseType: !482, size: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !21, line: 2856, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !289, file: !21, line: 3386, baseType: !452, size: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !289, file: !21, line: 3387, baseType: !486, size: 1280)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !21, line: 3094, baseType: !452, size: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !486, file: !21, line: 3095, baseType: !482, size: 64, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !289, file: !21, line: 3388, baseType: !491, size: 1216)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !21, line: 2825, baseType: !406, size: 896)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !491, file: !21, line: 2827, baseType: !287, size: 64, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !491, file: !21, line: 2828, baseType: !287, size: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !491, file: !21, line: 2829, baseType: !287, size: 64, offset: 1024)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !491, file: !21, line: 2830, baseType: !287, size: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !491, file: !21, line: 2831, baseType: !287, size: 64, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !289, file: !21, line: 3389, baseType: !500, size: 1024)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !500, file: !21, line: 2851, baseType: !444, size: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !500, file: !21, line: 2852, baseType: !367, size: 32, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !500, file: !21, line: 2853, baseType: !367, size: 32, offset: 992)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !289, file: !21, line: 3390, baseType: !506, size: 1024)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !21, line: 2858, baseType: !444, size: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !506, file: !21, line: 2859, baseType: !482, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !289, file: !21, line: 3391, baseType: !511, size: 960)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !512)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !511, file: !21, line: 2863, baseType: !444, size: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !289, file: !21, line: 3392, baseType: !515, size: 1472)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !515, file: !21, line: 3305, baseType: !449, size: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !289, file: !21, line: 3393, baseType: !519, size: 1792)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !520)
!520 = !{!521, !522, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !519, file: !21, line: 3249, baseType: !449, size: 1472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !519, file: !21, line: 3251, baseType: !523, size: 64, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !525, line: 463, size: 1152, elements: !526)
!525 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!526 = !{!527, !530, !562, !563, !566, !569, !621, !622, !623, !624, !625, !653, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !524, file: !525, line: 464, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !525, line: 464, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !524, file: !525, line: 467, baseType: !531, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !533)
!533 = !{!534, !535, !536, !549, !550, !551, !552, !553, !554, !558, !560, !561}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !532, file: !4, line: 377, baseType: !250, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !532, file: !4, line: 378, baseType: !250, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !532, file: !4, line: 381, baseType: !537, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !539, file: !4, line: 282, baseType: !542, size: 128)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !543, file: !4, line: 281, baseType: !5, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !543, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !543, file: !4, line: 281, baseType: !548, size: 64, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !371)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !532, file: !4, line: 384, baseType: !367, size: 32, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !532, file: !4, line: 387, baseType: !367, size: 32, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !532, file: !4, line: 390, baseType: !367, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !532, file: !4, line: 394, baseType: !537, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !532, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !532, file: !4, line: 399, baseType: !555, size: 64, offset: 416)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 2)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !532, file: !4, line: 402, baseType: !559, size: 64, offset: 480)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !556)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !532, file: !4, line: 406, baseType: !367, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !532, file: !4, line: 409, baseType: !367, size: 32, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !524, file: !525, line: 470, baseType: !279, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !524, file: !525, line: 473, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !525, line: 166, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !524, file: !525, line: 476, baseType: !567, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !525, line: 476, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !524, file: !525, line: 479, baseType: !570, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !571, line: 144, baseType: !572)
!571 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !571, line: 100, size: 896, elements: !574)
!574 = !{!575, !583, !588, !593, !595, !598, !599, !600, !601, !602, !607, !609, !610, !615, !620}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !573, file: !571, line: 102, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !571, line: 52, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !571, line: 47, baseType: !5)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !573, file: !571, line: 105, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !571, line: 59, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!367, !581, !581}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !573, file: !571, line: 108, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !571, line: 63, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !248}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !573, file: !571, line: 111, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !573, file: !571, line: 114, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !597, line: 46, baseType: !340)
!597 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !573, file: !571, line: 117, baseType: !596, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !573, file: !571, line: 120, baseType: !596, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !573, file: !571, line: 124, baseType: !5, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !573, file: !571, line: 128, baseType: !5, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !573, file: !571, line: 131, baseType: !603, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !571, line: 75, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!248, !596, !596}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !573, file: !571, line: 132, baseType: !608, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !571, line: 78, baseType: !590)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !573, file: !571, line: 135, baseType: !248, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !573, file: !571, line: 136, baseType: !611, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !571, line: 82, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!248, !248, !596, !596}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !573, file: !571, line: 137, baseType: !616, size: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !571, line: 83, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !248, !248}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !573, file: !571, line: 141, baseType: !5, size: 32, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !524, file: !525, line: 484, baseType: !287, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !524, file: !525, line: 488, baseType: !287, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !524, file: !525, line: 493, baseType: !287, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !524, file: !525, line: 496, baseType: !287, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !524, file: !525, line: 501, baseType: !626, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !628)
!628 = !{!629, !632, !635, !636, !637, !641, !642, !647, !648, !649, !650, !651, !652}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !627, file: !16, line: 2356, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !16, line: 2356, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !627, file: !16, line: 2357, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !627, file: !16, line: 2358, baseType: !367, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !627, file: !16, line: 2359, baseType: !367, size: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !627, file: !16, line: 2360, baseType: !638, size: 128, offset: 192)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 128, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 4)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !627, file: !16, line: 2364, baseType: !367, size: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !627, file: !16, line: 2367, baseType: !643, size: 128, offset: 384)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !16, line: 2349, size: 128, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !643, file: !16, line: 2351, baseType: !282, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !643, file: !16, line: 2352, baseType: !342, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !627, file: !16, line: 2371, baseType: !15, size: 32, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !627, file: !16, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !627, file: !16, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !627, file: !16, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !627, file: !16, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !627, file: !16, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !524, file: !525, line: 504, baseType: !654, size: 64, offset: 704)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !525, line: 504, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !524, file: !525, line: 507, baseType: !570, size: 64, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !524, file: !525, line: 510, baseType: !367, size: 32, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !524, file: !525, line: 513, baseType: !367, size: 32, offset: 864)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !524, file: !525, line: 516, baseType: !398, size: 32, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !524, file: !525, line: 519, baseType: !398, size: 32, offset: 928)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !524, file: !525, line: 522, baseType: !5, size: 32, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !524, file: !525, line: 523, baseType: !5, size: 32, offset: 992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !524, file: !525, line: 528, baseType: !633, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !524, file: !525, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !524, file: !525, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !524, file: !525, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !524, file: !525, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !524, file: !525, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !524, file: !525, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !524, file: !525, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !524, file: !525, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !524, file: !525, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !524, file: !525, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !524, file: !525, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !524, file: !525, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !524, file: !525, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !524, file: !525, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !524, file: !525, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !524, file: !525, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !519, file: !21, line: 3254, baseType: !287, size: 64, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !519, file: !21, line: 3257, baseType: !287, size: 64, offset: 1600)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !519, file: !21, line: 3258, baseType: !287, size: 64, offset: 1664)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !519, file: !21, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !519, file: !21, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !519, file: !21, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !519, file: !21, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !519, file: !21, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !519, file: !21, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !519, file: !21, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !519, file: !21, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !519, file: !21, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !519, file: !21, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !519, file: !21, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !519, file: !21, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !519, file: !21, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !519, file: !21, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !519, file: !21, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !519, file: !21, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !519, file: !21, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !519, file: !21, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !21, line: 3394, baseType: !702, size: 1344)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !21, line: 2279, size: 1344, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !729, !730, !731, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !702, file: !21, line: 2280, baseType: !325, size: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !702, file: !21, line: 2281, baseType: !287, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !702, file: !21, line: 2282, baseType: !287, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !702, file: !21, line: 2283, baseType: !287, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !702, file: !21, line: 2284, baseType: !287, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !702, file: !21, line: 2285, baseType: !5, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !702, file: !21, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !702, file: !21, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !702, file: !21, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !702, file: !21, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !702, file: !21, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !702, file: !21, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !702, file: !21, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !702, file: !21, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !702, file: !21, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !702, file: !21, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !702, file: !21, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !702, file: !21, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !702, file: !21, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !702, file: !21, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !702, file: !21, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !702, file: !21, line: 2305, baseType: !5, size: 32, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !702, file: !21, line: 2306, baseType: !727, size: 32, offset: 544)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !728, line: 31, baseType: !367)
!728 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !702, file: !21, line: 2307, baseType: !287, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !702, file: !21, line: 2308, baseType: !287, size: 64, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !702, file: !21, line: 2314, baseType: !732, size: 64, offset: 704)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !21, line: 2309, size: 64, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !732, file: !21, line: 2310, baseType: !367, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !732, file: !21, line: 2311, baseType: !633, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !732, file: !21, line: 2312, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !21, line: 2277, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !702, file: !21, line: 2315, baseType: !287, size: 64, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !702, file: !21, line: 2316, baseType: !287, size: 64, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !702, file: !21, line: 2317, baseType: !287, size: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !702, file: !21, line: 2318, baseType: !287, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !702, file: !21, line: 2319, baseType: !287, size: 64, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !702, file: !21, line: 2320, baseType: !287, size: 64, offset: 1088)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !702, file: !21, line: 2321, baseType: !287, size: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !702, file: !21, line: 2322, baseType: !287, size: 64, offset: 1216)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !702, file: !21, line: 2324, baseType: !748, size: 64, offset: 1280)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !21, line: 2324, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !289, file: !21, line: 3395, baseType: !751, size: 320)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !21, line: 1469, size: 320, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !21, line: 1470, baseType: !325, size: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !751, file: !21, line: 1471, baseType: !287, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !751, file: !21, line: 1472, baseType: !287, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !289, file: !21, line: 3396, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !21, line: 1482, size: 320, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !21, line: 1483, baseType: !325, size: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !757, file: !21, line: 1484, baseType: !367, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !757, file: !21, line: 1485, baseType: !762, size: 64, offset: 256)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 64, elements: !371)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !289, file: !21, line: 3397, baseType: !764, size: 384)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !21, line: 1829, size: 384, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !764, file: !21, line: 1830, baseType: !325, size: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !764, file: !21, line: 1831, baseType: !398, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !764, file: !21, line: 1832, baseType: !287, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !764, file: !21, line: 1835, baseType: !762, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !289, file: !21, line: 3398, baseType: !771, size: 704)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !21, line: 1898, size: 704, elements: !772)
!772 = !{!773, !774, !775, !779, !780, !783}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !771, file: !21, line: 1899, baseType: !325, size: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !771, file: !21, line: 1902, baseType: !287, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !771, file: !21, line: 1905, baseType: !776, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !251, line: 58, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !251, line: 57, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !771, file: !21, line: 1908, baseType: !5, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !771, file: !21, line: 1911, baseType: !781, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !21, line: 1876, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !771, file: !21, line: 1914, baseType: !784, size: 256, offset: 448)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !21, line: 1883, size: 256, elements: !785)
!785 = !{!786, !788, !789, !794}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !21, line: 1884, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !21, line: 1885, baseType: !787, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !784, file: !21, line: 1891, baseType: !790, size: 64, offset: 128)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !784, file: !21, line: 1891, size: 64, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !790, file: !21, line: 1891, baseType: !776, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !790, file: !21, line: 1891, baseType: !287, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !784, file: !21, line: 1892, baseType: !795, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !289, file: !21, line: 3399, baseType: !797, size: 704)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !21, line: 2008, size: 704, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !816, !817, !818, !819, !820}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !21, line: 2009, baseType: !325, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !797, file: !21, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !797, file: !21, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !797, file: !21, line: 2014, baseType: !398, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !797, file: !21, line: 2016, baseType: !287, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !797, file: !21, line: 2017, baseType: !805, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !21, line: 183, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !21, line: 183, size: 128, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !807, file: !21, line: 183, baseType: !810, size: 128)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !21, line: 182, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !21, line: 182, size: 128, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !811, file: !21, line: 182, baseType: !5, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !811, file: !21, line: 182, baseType: !5, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !811, file: !21, line: 182, baseType: !762, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !797, file: !21, line: 2019, baseType: !287, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !797, file: !21, line: 2020, baseType: !287, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !797, file: !21, line: 2021, baseType: !287, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !797, file: !21, line: 2022, baseType: !287, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !797, file: !21, line: 2023, baseType: !287, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !289, file: !21, line: 3400, baseType: !822, size: 832)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !21, line: 2430, size: 832, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !21, line: 2431, baseType: !325, size: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !822, file: !21, line: 2433, baseType: !287, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !822, file: !21, line: 2434, baseType: !287, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !822, file: !21, line: 2435, baseType: !287, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !822, file: !21, line: 2436, baseType: !287, size: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !822, file: !21, line: 2437, baseType: !805, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !822, file: !21, line: 2438, baseType: !287, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !822, file: !21, line: 2440, baseType: !287, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !822, file: !21, line: 2441, baseType: !287, size: 64, offset: 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !822, file: !21, line: 2443, baseType: !834, size: 128, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !21, line: 182, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !21, line: 182, size: 128, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !835, file: !21, line: 182, baseType: !810, size: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !289, file: !21, line: 3401, baseType: !839, size: 320)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !21, line: 3327, size: 320, elements: !840)
!840 = !{!841, !842, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !21, line: 3329, baseType: !325, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !839, file: !21, line: 3330, baseType: !843, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !21, line: 3320, size: 192, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !21, line: 3322, baseType: !843, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !21, line: 3323, baseType: !843, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !844, file: !21, line: 3324, baseType: !287, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !839, file: !21, line: 3331, baseType: !843, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !289, file: !21, line: 3402, baseType: !851, size: 256)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !21, line: 1540, size: 256, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !21, line: 1541, baseType: !325, size: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !851, file: !21, line: 1542, baseType: !855, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !21, line: 1538, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !21, line: 1538, size: 192, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !857, file: !21, line: 1538, baseType: !860, size: 192)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !21, line: 1537, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !21, line: 1537, size: 192, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !861, file: !21, line: 1537, baseType: !5, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !861, file: !21, line: 1537, baseType: !5, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !861, file: !21, line: 1537, baseType: !866, size: 128, offset: 64)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 128, elements: !371)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !21, line: 1535, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !21, line: 1532, size: 128, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !868, file: !21, line: 1533, baseType: !287, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !868, file: !21, line: 1534, baseType: !287, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !289, file: !21, line: 3403, baseType: !873, size: 512)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !21, line: 1938, size: 512, elements: !874)
!874 = !{!875, !876, !877, !878, !884, !885, !886}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !21, line: 1939, baseType: !325, size: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !873, file: !21, line: 1940, baseType: !398, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !873, file: !21, line: 1941, baseType: !20, size: 32, offset: 224)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !873, file: !21, line: 1946, baseType: !879, size: 32, offset: 256)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !21, line: 1942, size: 32, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !879, file: !21, line: 1943, baseType: !39, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !879, file: !21, line: 1944, baseType: !46, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !879, file: !21, line: 1945, baseType: !53, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !873, file: !21, line: 1950, baseType: !278, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !873, file: !21, line: 1951, baseType: !278, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !873, file: !21, line: 1953, baseType: !762, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !289, file: !21, line: 3404, baseType: !888, size: 1664)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !21, line: 3337, size: 1664, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !888, file: !21, line: 3338, baseType: !325, size: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !888, file: !21, line: 3341, baseType: !892, size: 1472, offset: 192)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !893, line: 410, size: 1472, elements: !894)
!893 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !892, file: !893, line: 412, baseType: !367, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !892, file: !893, line: 413, baseType: !367, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !892, file: !893, line: 414, baseType: !367, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !892, file: !893, line: 415, baseType: !367, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !892, file: !893, line: 416, baseType: !367, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !892, file: !893, line: 417, baseType: !367, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !892, file: !893, line: 418, baseType: !390, size: 8, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !892, file: !893, line: 419, baseType: !390, size: 8, offset: 200)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !892, file: !893, line: 420, baseType: !904, size: 8, offset: 208)
!904 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !892, file: !893, line: 421, baseType: !904, size: 8, offset: 216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !892, file: !893, line: 422, baseType: !904, size: 8, offset: 224)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !892, file: !893, line: 423, baseType: !904, size: 8, offset: 232)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !892, file: !893, line: 424, baseType: !904, size: 8, offset: 240)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !892, file: !893, line: 425, baseType: !904, size: 8, offset: 248)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !892, file: !893, line: 426, baseType: !904, size: 8, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !892, file: !893, line: 427, baseType: !904, size: 8, offset: 264)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !892, file: !893, line: 428, baseType: !904, size: 8, offset: 272)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !892, file: !893, line: 429, baseType: !904, size: 8, offset: 280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !892, file: !893, line: 430, baseType: !904, size: 8, offset: 288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !892, file: !893, line: 431, baseType: !904, size: 8, offset: 296)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !892, file: !893, line: 432, baseType: !904, size: 8, offset: 304)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !892, file: !893, line: 433, baseType: !904, size: 8, offset: 312)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !892, file: !893, line: 434, baseType: !904, size: 8, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !892, file: !893, line: 435, baseType: !904, size: 8, offset: 328)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !892, file: !893, line: 436, baseType: !904, size: 8, offset: 336)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !892, file: !893, line: 437, baseType: !904, size: 8, offset: 344)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !892, file: !893, line: 438, baseType: !904, size: 8, offset: 352)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !892, file: !893, line: 439, baseType: !904, size: 8, offset: 360)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !892, file: !893, line: 440, baseType: !904, size: 8, offset: 368)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !892, file: !893, line: 441, baseType: !904, size: 8, offset: 376)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !892, file: !893, line: 442, baseType: !904, size: 8, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !892, file: !893, line: 443, baseType: !904, size: 8, offset: 392)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !892, file: !893, line: 444, baseType: !904, size: 8, offset: 400)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !892, file: !893, line: 445, baseType: !904, size: 8, offset: 408)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !892, file: !893, line: 446, baseType: !904, size: 8, offset: 416)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !892, file: !893, line: 447, baseType: !904, size: 8, offset: 424)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !892, file: !893, line: 448, baseType: !904, size: 8, offset: 432)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !892, file: !893, line: 449, baseType: !904, size: 8, offset: 440)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !892, file: !893, line: 450, baseType: !904, size: 8, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !892, file: !893, line: 451, baseType: !904, size: 8, offset: 456)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !892, file: !893, line: 452, baseType: !904, size: 8, offset: 464)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !892, file: !893, line: 453, baseType: !904, size: 8, offset: 472)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !892, file: !893, line: 454, baseType: !904, size: 8, offset: 480)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !892, file: !893, line: 455, baseType: !904, size: 8, offset: 488)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !892, file: !893, line: 456, baseType: !904, size: 8, offset: 496)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !892, file: !893, line: 457, baseType: !904, size: 8, offset: 504)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !892, file: !893, line: 458, baseType: !904, size: 8, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !892, file: !893, line: 459, baseType: !904, size: 8, offset: 520)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !892, file: !893, line: 460, baseType: !904, size: 8, offset: 528)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !892, file: !893, line: 461, baseType: !904, size: 8, offset: 536)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !892, file: !893, line: 462, baseType: !904, size: 8, offset: 544)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !892, file: !893, line: 463, baseType: !904, size: 8, offset: 552)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !892, file: !893, line: 464, baseType: !904, size: 8, offset: 560)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !892, file: !893, line: 465, baseType: !904, size: 8, offset: 568)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !892, file: !893, line: 466, baseType: !904, size: 8, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !892, file: !893, line: 467, baseType: !904, size: 8, offset: 584)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !892, file: !893, line: 468, baseType: !904, size: 8, offset: 592)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !892, file: !893, line: 469, baseType: !904, size: 8, offset: 600)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !892, file: !893, line: 470, baseType: !904, size: 8, offset: 608)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !892, file: !893, line: 471, baseType: !904, size: 8, offset: 616)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !892, file: !893, line: 472, baseType: !904, size: 8, offset: 624)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !892, file: !893, line: 473, baseType: !904, size: 8, offset: 632)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !892, file: !893, line: 474, baseType: !904, size: 8, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !892, file: !893, line: 475, baseType: !904, size: 8, offset: 648)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !892, file: !893, line: 476, baseType: !904, size: 8, offset: 656)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !892, file: !893, line: 477, baseType: !904, size: 8, offset: 664)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !892, file: !893, line: 478, baseType: !904, size: 8, offset: 672)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !892, file: !893, line: 479, baseType: !904, size: 8, offset: 680)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !892, file: !893, line: 480, baseType: !904, size: 8, offset: 688)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !892, file: !893, line: 481, baseType: !904, size: 8, offset: 696)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !892, file: !893, line: 482, baseType: !904, size: 8, offset: 704)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !892, file: !893, line: 483, baseType: !904, size: 8, offset: 712)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !892, file: !893, line: 484, baseType: !904, size: 8, offset: 720)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !892, file: !893, line: 485, baseType: !904, size: 8, offset: 728)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !892, file: !893, line: 486, baseType: !904, size: 8, offset: 736)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !892, file: !893, line: 487, baseType: !904, size: 8, offset: 744)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !892, file: !893, line: 488, baseType: !904, size: 8, offset: 752)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !892, file: !893, line: 489, baseType: !904, size: 8, offset: 760)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !892, file: !893, line: 490, baseType: !904, size: 8, offset: 768)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !892, file: !893, line: 491, baseType: !904, size: 8, offset: 776)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !892, file: !893, line: 492, baseType: !904, size: 8, offset: 784)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !892, file: !893, line: 493, baseType: !904, size: 8, offset: 792)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !892, file: !893, line: 494, baseType: !904, size: 8, offset: 800)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !892, file: !893, line: 495, baseType: !904, size: 8, offset: 808)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !892, file: !893, line: 496, baseType: !904, size: 8, offset: 816)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !892, file: !893, line: 497, baseType: !904, size: 8, offset: 824)
