; ModuleID = 'tree-ssa-propagate.c'
source_filename = "tree-ssa-propagate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!434 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!435 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!436 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!437 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!438 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!439 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!440 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!441 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !443)
!443 = !{!444, !445, !446, !447}
!444 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!445 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!446 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!447 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!450 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!460 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!461 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!462 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!463 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!464 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!465 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!466 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!467 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!468 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!469 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!470 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!471 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!472 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!473 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plf_mask", file: !391, line: 130, baseType: !7, size: 32, elements: !475)
!475 = !{!476, !477}
!476 = !DIEnumerator(name: "GF_PLF_1", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "GF_PLF_2", value: 2, isUnsigned: true)
!478 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !330, line: 295, baseType: !7, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!480 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!481 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!482 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!483 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!484 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!485 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!486 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!487 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!488 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!489 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!490 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!491 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!492 = !{!134, !493, !494, !495, !825, !1826, !858, !763, !1828, !7, !1337, !1833, !549, !1838, !442}
!493 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !496, line: 56, baseType: !497)
!496 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !499)
!499 = !{!500, !533, !539, !552, !571, !582, !587, !597, !603, !617, !629, !667, !1161, !1189, !1206, !1207, !1212, !1221, !1227, !1232, !1236, !1240, !1477, !1524, !1530, !1536, !1543, !1556, !1570, !1587, !1599, !1621, !1636, !1808}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !135, line: 3372, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !501, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !501, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !501, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !501, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !501, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !501, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !501, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !501, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !501, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !501, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !501, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !501, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !501, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !501, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !501, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !501, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !501, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !501, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !501, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !501, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !501, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !501, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !501, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !501, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !501, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !501, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !501, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !501, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !501, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !501, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !498, file: !135, line: 3373, baseType: !534, size: 192)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !534, file: !135, line: 403, baseType: !501, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !534, file: !135, line: 404, baseType: !495, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !534, file: !135, line: 405, baseType: !495, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !498, file: !135, line: 3374, baseType: !540, size: 320)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !540, file: !135, line: 1385, baseType: !534, size: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !540, file: !135, line: 1386, baseType: !544, size: 128, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !545, line: 58, baseType: !546)
!545 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 54, size: 128, elements: !547)
!547 = !{!548, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !546, file: !545, line: 56, baseType: !549, size: 64)
!549 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !546, file: !545, line: 57, baseType: !551, size: 64, offset: 64)
!551 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !498, file: !135, line: 3375, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !135, line: 1398, baseType: !534, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !553, file: !135, line: 1399, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !559, line: 52, size: 256, elements: !560)
!559 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !{!561, !562, !563, !564, !565, !566, !567}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !558, file: !559, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !558, file: !559, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !558, file: !559, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !558, file: !559, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !558, file: !559, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !558, file: !559, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !558, file: !559, line: 62, baseType: !568, size: 192, offset: 64)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 192, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 3)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !498, file: !135, line: 3376, baseType: !572, size: 256)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !572, file: !135, line: 1409, baseType: !534, size: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !572, file: !135, line: 1410, baseType: !576, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !578, line: 27, size: 192, elements: !579)
!578 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !578, line: 29, baseType: !544, size: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !577, file: !578, line: 30, baseType: !5, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !498, file: !135, line: 3377, baseType: !583, size: 256)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !135, line: 1438, baseType: !534, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !583, file: !135, line: 1439, baseType: !495, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !498, file: !135, line: 3378, baseType: !588, size: 256)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !135, line: 1419, baseType: !534, size: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !588, file: !135, line: 1420, baseType: !493, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !588, file: !135, line: 1421, baseType: !593, size: 8, offset: 224)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 8, elements: !595)
!594 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!595 = !{!596}
!596 = !DISubrange(count: 1)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !498, file: !135, line: 3379, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !135, line: 1429, baseType: !534, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !598, file: !135, line: 1430, baseType: !495, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !598, file: !135, line: 1431, baseType: !495, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !498, file: !135, line: 3380, baseType: !604, size: 320)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !135, line: 1461, baseType: !534, size: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !604, file: !135, line: 1462, baseType: !608, size: 128, offset: 192)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !609, line: 31, size: 128, elements: !610)
!609 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!610 = !{!611, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !608, file: !609, line: 32, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !608, file: !609, line: 33, baseType: !7, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !608, file: !609, line: 34, baseType: !7, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !498, file: !135, line: 3381, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !619)
!619 = !{!620, !621, !626, !627, !628}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !135, line: 2508, baseType: !534, size: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !618, file: !135, line: 2509, baseType: !622, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !623, line: 58, baseType: !624)
!623 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !625, line: 44, baseType: !7)
!625 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !618, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !618, file: !135, line: 2511, baseType: !495, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !618, file: !135, line: 2512, baseType: !495, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !498, file: !135, line: 3382, baseType: !630, size: 896)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !135, line: 2653, baseType: !618, size: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !135, line: 2654, baseType: !495, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !630, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !630, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !630, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !630, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !630, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !630, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !630, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !630, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !630, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !630, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !630, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !630, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !630, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !630, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !630, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !630, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !630, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !630, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !630, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !630, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !630, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !630, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !630, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !630, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !630, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !630, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !630, file: !135, line: 2705, baseType: !495, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !630, file: !135, line: 2706, baseType: !495, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !630, file: !135, line: 2707, baseType: !495, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !630, file: !135, line: 2708, baseType: !495, size: 64, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !630, file: !135, line: 2711, baseType: !665, size: 64, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !498, file: !135, line: 3383, baseType: !668, size: 960)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !668, file: !135, line: 2757, baseType: !630, size: 896)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !668, file: !135, line: 2758, baseType: !672, size: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !496, line: 50, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !675, line: 240, size: 384, elements: !676)
!675 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !674, file: !675, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !674, file: !675, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !674, file: !675, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !674, file: !675, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !674, file: !675, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !674, file: !675, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !674, file: !675, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !674, file: !675, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !674, file: !675, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !674, file: !675, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !674, file: !675, line: 321, baseType: !688, size: 320, offset: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !675, line: 315, size: 320, elements: !689)
!689 = !{!690, !1094, !1096, !1159, !1160}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !688, file: !675, line: 316, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 64, elements: !595)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !675, line: 183, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !675, line: 166, size: 64, elements: !694)
!694 = !{!695, !696, !697, !700, !701, !709, !710, !722, !725, !786, !787, !1071, !1084, !1091}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !693, file: !675, line: 168, baseType: !493, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !693, file: !675, line: 169, baseType: !7, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !693, file: !675, line: 170, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !693, file: !675, line: 171, baseType: !672, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !693, file: !675, line: 172, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !496, line: 53, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !675, line: 359, size: 128, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !704, file: !675, line: 360, baseType: !493, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !704, file: !675, line: 361, baseType: !708, size: 64, offset: 64)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !595)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !693, file: !675, line: 173, baseType: !5, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !693, file: !675, line: 174, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !675, line: 133, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !675, line: 115, size: 32, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !712, file: !675, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !712, file: !675, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !712, file: !675, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !712, file: !675, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !712, file: !675, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !712, file: !675, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !712, file: !675, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !712, file: !675, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !693, file: !675, line: 175, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !675, line: 175, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !693, file: !675, line: 176, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !728, line: 75, size: 256, elements: !729)
!728 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !{!730, !744, !745, !746}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !727, file: !728, line: 76, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !728, line: 68, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !728, line: 63, size: 320, elements: !734)
!734 = !{!735, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !733, file: !728, line: 64, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !733, file: !728, line: 65, baseType: !736, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !733, file: !728, line: 66, baseType: !7, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !733, file: !728, line: 67, baseType: !740, size: 128, offset: 192)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 128, elements: !742)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !728, line: 29, baseType: !549)
!742 = !{!743}
!743 = !DISubrange(count: 2)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !727, file: !728, line: 77, baseType: !731, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !727, file: !728, line: 78, baseType: !7, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !727, file: !728, line: 79, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !728, line: 49, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !728, line: 45, size: 832, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !749, file: !728, line: 46, baseType: !736, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !749, file: !728, line: 47, baseType: !726, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !749, file: !728, line: 48, baseType: !754, size: 704, offset: 128)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !755, line: 164, size: 704, elements: !756)
!755 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!756 = !{!757, !758, !769, !770, !771, !772, !773, !774, !778, !782, !783, !784, !785}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !754, file: !755, line: 166, baseType: !551, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !754, file: !755, line: 167, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !755, line: 157, size: 192, elements: !761)
!761 = !{!762, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !760, file: !755, line: 159, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !755, line: 160, baseType: !759, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !760, file: !755, line: 161, baseType: !766, size: 32, offset: 128)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 32, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 4)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !754, file: !755, line: 168, baseType: !763, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !754, file: !755, line: 169, baseType: !763, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !754, file: !755, line: 170, baseType: !763, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !754, file: !755, line: 171, baseType: !551, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !754, file: !755, line: 172, baseType: !493, size: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !754, file: !755, line: 176, baseType: !775, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!759, !494, !551}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !754, file: !755, line: 177, baseType: !779, size: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !494, !759}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !754, file: !755, line: 178, baseType: !494, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !754, file: !755, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !754, file: !755, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !754, file: !755, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !693, file: !675, line: 177, baseType: !495, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !693, file: !675, line: 178, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !790)
!790 = !{!791, !1036, !1037, !1038, !1041, !1045, !1046, !1047, !1065, !1066, !1067, !1068, !1069, !1070}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !789, file: !330, line: 219, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !795)
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !794, file: !330, line: 151, baseType: !797, size: 128)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !798, file: !330, line: 150, baseType: !7, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !798, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !798, file: !330, line: 150, baseType: !803, size: 64, offset: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 64, elements: !595)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !496, line: 108, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !807)
!807 = !{!808, !809, !810, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !806, file: !330, line: 124, baseType: !788, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !806, file: !330, line: 125, baseType: !788, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !806, file: !330, line: 131, baseType: !811, size: 64, offset: 128)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !812)
!812 = !{!813, !1027}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !811, file: !330, line: 129, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !496, line: 66, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !817)
!817 = !{!818, !1025, !1026}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !816, file: !391, line: 145, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !496, line: 69, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !822)
!822 = !{!823, !1023, !1024}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !821, file: !391, line: 137, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !496, line: 58, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !827)
!827 = !{!828, !845, !878, !884, !889, !894, !901, !907, !913, !918, !932, !937, !943, !948, !958, !963, !981, !988, !995, !1001, !1006, !1012, !1018}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !826, file: !391, line: 738, baseType: !829, size: 256)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !829, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !829, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !829, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !829, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !829, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !829, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !829, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !829, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !829, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !829, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !829, file: !391, line: 316, baseType: !622, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !829, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !829, file: !391, line: 323, baseType: !788, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !829, file: !391, line: 327, baseType: !495, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !826, file: !391, line: 739, baseType: !846, size: 448)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !847)
!847 = !{!848, !876}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !846, file: !391, line: 353, baseType: !849, size: 384)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !850)
!850 = !{!851, !852, !859}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !849, file: !391, line: 336, baseType: !829, size: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !849, file: !391, line: 343, baseType: !853, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !378, line: 37, size: 128, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !854, file: !378, line: 39, baseType: !853, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !854, file: !378, line: 40, baseType: !858, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !849, file: !391, line: 344, baseType: !860, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !378, line: 45, size: 320, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !861, file: !378, line: 47, baseType: !860, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !861, file: !378, line: 48, baseType: !865, size: 256, offset: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !866)
!866 = !{!867, !869, !870, !875}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !865, file: !135, line: 1884, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !865, file: !135, line: 1885, baseType: !868, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !865, file: !135, line: 1891, baseType: !871, size: 64, offset: 128)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !865, file: !135, line: 1891, size: 64, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !871, file: !135, line: 1891, baseType: !824, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !871, file: !135, line: 1891, baseType: !495, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !865, file: !135, line: 1892, baseType: !858, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !846, file: !391, line: 359, baseType: !877, size: 64, offset: 384)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !595)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !826, file: !391, line: 740, baseType: !879, size: 512)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !879, file: !391, line: 368, baseType: !849, size: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !879, file: !391, line: 373, baseType: !495, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !879, file: !391, line: 374, baseType: !495, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !826, file: !391, line: 741, baseType: !885, size: 576)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !885, file: !391, line: 383, baseType: !879, size: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !885, file: !391, line: 389, baseType: !877, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !826, file: !391, line: 742, baseType: !890, size: 320)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !890, file: !391, line: 397, baseType: !829, size: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !890, file: !391, line: 400, baseType: !814, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !826, file: !391, line: 743, baseType: !895, size: 448)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !896)
!896 = !{!897, !898, !899, !900}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !895, file: !391, line: 408, baseType: !829, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !895, file: !391, line: 412, baseType: !495, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !895, file: !391, line: 420, baseType: !495, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !895, file: !391, line: 423, baseType: !814, size: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !826, file: !391, line: 744, baseType: !902, size: 384)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !902, file: !391, line: 431, baseType: !829, size: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !902, file: !391, line: 434, baseType: !495, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !902, file: !391, line: 437, baseType: !814, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !826, file: !391, line: 745, baseType: !908, size: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !391, line: 445, baseType: !829, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !908, file: !391, line: 449, baseType: !495, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !908, file: !391, line: 453, baseType: !814, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !826, file: !391, line: 746, baseType: !914, size: 320)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !914, file: !391, line: 461, baseType: !829, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !914, file: !391, line: 464, baseType: !495, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !826, file: !391, line: 747, baseType: !919, size: 768)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !920)
!920 = !{!921, !922, !923, !924, !925}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !919, file: !391, line: 471, baseType: !829, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !919, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !919, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !919, file: !391, line: 478, baseType: !495, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !919, file: !391, line: 481, baseType: !926, size: 384, offset: 384)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 384, elements: !595)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !927, file: !135, line: 1920, baseType: !865, size: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !927, file: !135, line: 1921, baseType: !495, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !927, file: !135, line: 1922, baseType: !622, size: 32, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !826, file: !391, line: 748, baseType: !933, size: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !933, file: !391, line: 490, baseType: !829, size: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !933, file: !391, line: 494, baseType: !493, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !826, file: !391, line: 749, baseType: !938, size: 384)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !938, file: !391, line: 502, baseType: !829, size: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !938, file: !391, line: 506, baseType: !814, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !938, file: !391, line: 510, baseType: !814, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !826, file: !391, line: 750, baseType: !944, size: 320)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !944, file: !391, line: 531, baseType: !829, size: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !944, file: !391, line: 540, baseType: !814, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !826, file: !391, line: 751, baseType: !949, size: 704)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !949, file: !391, line: 549, baseType: !879, size: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !949, file: !391, line: 553, baseType: !698, size: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !949, file: !391, line: 557, baseType: !614, size: 8, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !949, file: !391, line: 558, baseType: !614, size: 8, offset: 584)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !949, file: !391, line: 559, baseType: !614, size: 8, offset: 592)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !949, file: !391, line: 560, baseType: !614, size: 8, offset: 600)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !949, file: !391, line: 566, baseType: !877, size: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !826, file: !391, line: 752, baseType: !959, size: 384)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !391, line: 573, baseType: !890, size: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !391, line: 577, baseType: !495, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !826, file: !391, line: 753, baseType: !964, size: 576)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !965)
!965 = !{!966, !967, !968, !971, !980}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !964, file: !391, line: 602, baseType: !890, size: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !964, file: !391, line: 605, baseType: !495, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !964, file: !391, line: 609, baseType: !969, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !970, line: 46, baseType: !549)
!970 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!971 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !964, file: !391, line: 612, baseType: !972, size: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !974)
!974 = !{!975, !976, !977, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !973, file: !391, line: 583, baseType: !134, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !973, file: !391, line: 586, baseType: !495, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !973, file: !391, line: 589, baseType: !495, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !973, file: !391, line: 592, baseType: !495, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !973, file: !391, line: 595, baseType: !495, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !964, file: !391, line: 616, baseType: !814, size: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !826, file: !391, line: 754, baseType: !982, size: 512)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !983)
!983 = !{!984, !985, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !982, file: !391, line: 624, baseType: !890, size: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !982, file: !391, line: 628, baseType: !495, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !982, file: !391, line: 632, baseType: !495, size: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !982, file: !391, line: 636, baseType: !495, size: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !826, file: !391, line: 755, baseType: !989, size: 704)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !990)
!990 = !{!991, !992, !993, !994}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !989, file: !391, line: 644, baseType: !982, size: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !989, file: !391, line: 648, baseType: !495, size: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !989, file: !391, line: 652, baseType: !495, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !989, file: !391, line: 653, baseType: !495, size: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !826, file: !391, line: 756, baseType: !996, size: 448)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !996, file: !391, line: 665, baseType: !890, size: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !996, file: !391, line: 668, baseType: !495, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !996, file: !391, line: 673, baseType: !495, size: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !826, file: !391, line: 757, baseType: !1002, size: 384)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1002, file: !391, line: 696, baseType: !890, size: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1002, file: !391, line: 699, baseType: !495, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !826, file: !391, line: 758, baseType: !1007, size: 384)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1007, file: !391, line: 683, baseType: !829, size: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1007, file: !391, line: 686, baseType: !495, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1007, file: !391, line: 689, baseType: !495, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !826, file: !391, line: 759, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !391, line: 709, baseType: !829, size: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1013, file: !391, line: 712, baseType: !495, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1013, file: !391, line: 712, baseType: !495, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !826, file: !391, line: 760, baseType: !1019, size: 320)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1019, file: !391, line: 720, baseType: !829, size: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1019, file: !391, line: 723, baseType: !495, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !821, file: !391, line: 138, baseType: !820, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !391, line: 139, baseType: !820, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !816, file: !391, line: 146, baseType: !819, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !816, file: !391, line: 152, baseType: !814, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !811, file: !330, line: 130, baseType: !672, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !806, file: !330, line: 134, baseType: !494, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !806, file: !330, line: 137, baseType: !495, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !806, file: !330, line: 138, baseType: !622, size: 32, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !806, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !330, line: 144, baseType: !493, size: 32, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !806, file: !330, line: 145, baseType: !493, size: 32, offset: 416)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !806, file: !330, line: 146, baseType: !1035, size: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !551)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !789, file: !330, line: 220, baseType: !792, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !789, file: !330, line: 223, baseType: !494, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !789, file: !330, line: 226, baseType: !1039, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !789, file: !330, line: 229, baseType: !1042, size: 128, offset: 256)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 128, elements: !742)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !789, file: !330, line: 232, baseType: !788, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !789, file: !330, line: 233, baseType: !788, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !789, file: !330, line: 238, baseType: !1048, size: 64, offset: 512)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1049)
!1049 = !{!1050, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1048, file: !330, line: 236, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1052, file: !330, line: 275, baseType: !814, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1052, file: !330, line: 278, baseType: !814, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1048, file: !330, line: 237, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1058, file: !330, line: 261, baseType: !672, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1058, file: !330, line: 262, baseType: !672, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1058, file: !330, line: 266, baseType: !672, size: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1058, file: !330, line: 267, baseType: !672, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1058, file: !330, line: 270, baseType: !493, size: 32, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !789, file: !330, line: 241, baseType: !1035, size: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !789, file: !330, line: 244, baseType: !493, size: 32, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !789, file: !330, line: 247, baseType: !493, size: 32, offset: 672)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !789, file: !330, line: 250, baseType: !493, size: 32, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !789, file: !330, line: 253, baseType: !493, size: 32, offset: 736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !330, line: 256, baseType: !493, size: 32, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !693, file: !675, line: 179, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !675, line: 150, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !675, line: 142, size: 320, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1082, !1083}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1074, file: !675, line: 144, baseType: !495, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1074, file: !675, line: 145, baseType: !672, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !675, line: 146, baseType: !672, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1074, file: !675, line: 147, baseType: !1080, size: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1081, line: 31, baseType: !493)
!1081 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1074, file: !675, line: 148, baseType: !7, size: 32, offset: 224)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1074, file: !675, line: 149, baseType: !614, size: 8, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !693, file: !675, line: 180, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !675, line: 162, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !675, line: 159, size: 128, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1087, file: !675, line: 160, baseType: !495, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1087, file: !675, line: 161, baseType: !551, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !693, file: !675, line: 181, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !675, line: 181, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !688, file: !675, line: 317, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !595)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !688, file: !675, line: 318, baseType: !1097, size: 320)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !675, line: 188, size: 320, elements: !1098)
!1098 = !{!1099, !1101, !1158}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1097, file: !675, line: 190, baseType: !1100, size: 192)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 192, elements: !569)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1097, file: !675, line: 193, baseType: !1102, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !675, line: 206, size: 320, elements: !1104)
!1104 = !{!1105, !1143, !1144, !1145, !1157}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1103, file: !675, line: 208, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !496, line: 62, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1109, line: 538, size: 256, elements: !1110)
!1109 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1110 = !{!1111, !1115, !1121, !1134}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !1109, line: 539, baseType: !1112, size: 32)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1109, line: 482, size: 32, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !1109, line: 484, baseType: !7, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1108, file: !1109, line: 540, baseType: !1116, size: 192)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1109, line: 488, size: 192, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !1109, line: 489, baseType: !1112, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1116, file: !1109, line: 492, baseType: !698, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1116, file: !1109, line: 496, baseType: !495, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1108, file: !1109, line: 541, baseType: !1122, size: 256)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1109, line: 504, size: 256, elements: !1123)
!1123 = !{!1124, !1125, !1132, !1133}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !1109, line: 505, baseType: !1112, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1122, file: !1109, line: 509, baseType: !1126, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1109, line: 501, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !1109, line: 510, baseType: !1130, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1122, file: !1109, line: 513, baseType: !1106, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1108, file: !1109, line: 542, baseType: !1135, size: 128)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1109, line: 530, size: 128, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !1109, line: 531, baseType: !1112, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1135, file: !1109, line: 534, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1109, line: 525, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!614, !495, !698, !549, !549}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1103, file: !675, line: 211, baseType: !7, size: 32, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !675, line: 214, baseType: !551, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1103, file: !675, line: 224, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !675, line: 202, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !675, line: 202, size: 128, elements: !1149)
!1149 = !{!1150}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1148, file: !675, line: 202, baseType: !1151, size: 128)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !675, line: 200, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !675, line: 200, size: 128, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1152, file: !675, line: 200, baseType: !7, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1152, file: !675, line: 200, baseType: !7, size: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1152, file: !675, line: 200, baseType: !708, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1103, file: !675, line: 234, baseType: !1146, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1097, file: !675, line: 197, baseType: !551, size: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !688, file: !675, line: 319, baseType: !558, size: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !688, file: !675, line: 320, baseType: !577, size: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !498, file: !135, line: 3384, baseType: !1162, size: 1472)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1163)
!1163 = !{!1164, !1185, !1186, !1187, !1188}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !135, line: 3115, baseType: !1165, size: 1216)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !135, line: 2985, baseType: !668, size: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1165, file: !135, line: 2986, baseType: !495, size: 64, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1165, file: !135, line: 2987, baseType: !495, size: 64, offset: 1024)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1165, file: !135, line: 2988, baseType: !495, size: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1165, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1165, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1165, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1165, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1165, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1165, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1165, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1165, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1165, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1165, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1165, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1165, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1165, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1165, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1162, file: !135, line: 3117, baseType: !495, size: 64, offset: 1216)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1162, file: !135, line: 3119, baseType: !495, size: 64, offset: 1280)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1162, file: !135, line: 3121, baseType: !495, size: 64, offset: 1344)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1162, file: !135, line: 3123, baseType: !495, size: 64, offset: 1408)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !498, file: !135, line: 3385, baseType: !1190, size: 1088)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1190, file: !135, line: 2875, baseType: !668, size: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1190, file: !135, line: 2876, baseType: !672, size: 64, offset: 960)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1190, file: !135, line: 2877, baseType: !1195, size: 64, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1197, line: 172, size: 128, elements: !1198)
!1197 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1196, file: !1197, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1196, file: !1197, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1196, file: !1197, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1196, file: !1197, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1196, file: !1197, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1196, file: !1197, line: 195, baseType: !7, size: 32, offset: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1196, file: !1197, line: 199, baseType: !495, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !498, file: !135, line: 3386, baseType: !1165, size: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !498, file: !135, line: 3387, baseType: !1208, size: 1280)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !135, line: 3094, baseType: !1165, size: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1208, file: !135, line: 3095, baseType: !1195, size: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !498, file: !135, line: 3388, baseType: !1213, size: 1216)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219, !1220}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1213, file: !135, line: 2825, baseType: !630, size: 896)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1213, file: !135, line: 2827, baseType: !495, size: 64, offset: 896)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1213, file: !135, line: 2828, baseType: !495, size: 64, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1213, file: !135, line: 2829, baseType: !495, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1213, file: !135, line: 2830, baseType: !495, size: 64, offset: 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1213, file: !135, line: 2831, baseType: !495, size: 64, offset: 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !498, file: !135, line: 3389, baseType: !1222, size: 1024)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1222, file: !135, line: 2851, baseType: !668, size: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1222, file: !135, line: 2852, baseType: !493, size: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1222, file: !135, line: 2853, baseType: !493, size: 32, offset: 992)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !498, file: !135, line: 3390, baseType: !1228, size: 1024)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1228, file: !135, line: 2858, baseType: !668, size: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1228, file: !135, line: 2859, baseType: !1195, size: 64, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !498, file: !135, line: 3391, baseType: !1233, size: 960)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1234)
!1234 = !{!1235}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !135, line: 2863, baseType: !668, size: 960)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !498, file: !135, line: 3392, baseType: !1237, size: 1472)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !135, line: 3305, baseType: !1162, size: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !498, file: !135, line: 3393, baseType: !1241, size: 1792)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1242)
!1242 = !{!1243, !1244, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !135, line: 3249, baseType: !1162, size: 1472)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1241, file: !135, line: 3251, baseType: !1245, size: 64, offset: 1472)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1247, line: 463, size: 1152, elements: !1248)
!1247 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1248 = !{!1249, !1252, !1283, !1284, !1397, !1400, !1401, !1402, !1403, !1404, !1405, !1429, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1246, file: !1247, line: 464, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1247, line: 464, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1246, file: !1247, line: 467, baseType: !1253, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1255)
!1255 = !{!1256, !1258, !1259, !1272, !1273, !1274, !1275, !1276, !1277, !1279, !1281, !1282}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1254, file: !330, line: 377, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !496, line: 111, baseType: !788)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1254, file: !330, line: 378, baseType: !1257, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1254, file: !330, line: 381, baseType: !1260, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1263)
!1263 = !{!1264}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1262, file: !330, line: 282, baseType: !1265, size: 128)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1267)
!1267 = !{!1268, !1269, !1270}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1266, file: !330, line: 281, baseType: !7, size: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1266, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1266, file: !330, line: 281, baseType: !1271, size: 64, offset: 64)
!1271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1257, size: 64, elements: !595)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1254, file: !330, line: 384, baseType: !493, size: 32, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1254, file: !330, line: 387, baseType: !493, size: 32, offset: 224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1254, file: !330, line: 390, baseType: !493, size: 32, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1254, file: !330, line: 394, baseType: !1260, size: 64, offset: 320)
