; ModuleID = 'mcf.c'
source_filename = "mcf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!187 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!188 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!189 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!190 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!191 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!192 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!193 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!194 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!195 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!196 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!197 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!198 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!199 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!200 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!201 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!202 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!203 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!204 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!205 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!206 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!207 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!208 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!209 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!210 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!211 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!212 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!214 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!215 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!216 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!217 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!218 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!219 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!220 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!221 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!222 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!223 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!224 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!235 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!236 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!237 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!238 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!239 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!240 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!241 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!242 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!243 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!244 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!245 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!246 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 68, baseType: !5, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257}
!249 = !DIEnumerator(name: "INVALID_EDGE", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "VERTEX_SPLIT_EDGE", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "REDIRECT_EDGE", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "REVERSE_EDGE", value: 3, isUnsigned: true)
!253 = !DIEnumerator(name: "SOURCE_CONNECT_EDGE", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "SINK_CONNECT_EDGE", value: 5, isUnsigned: true)
!255 = !DIEnumerator(name: "BALANCE_EDGE", value: 6, isUnsigned: true)
!256 = !DIEnumerator(name: "REDIRECT_NORMALIZED_EDGE", value: 7, isUnsigned: true)
!257 = !DIEnumerator(name: "REVERSE_NORMALIZED_EDGE", value: 8, isUnsigned: true)
!258 = !{!259, !266, !284, !306, !307, !298, !299, !272, !5, !308}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_info", file: !261, line: 27, size: 32, elements: !262)
!261 = !DIFile(filename: "./profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !260, file: !261, line: 29, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "on_tree", scope: !260, file: !261, line: 32, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !260, file: !261, line: 36, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_vertex_p", file: !1, line: 111, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_vertex_type", file: !1, line: 109, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixup_vertex_d", file: !1, line: 106, size: 64, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "succ_edges", scope: !269, file: !1, line: 108, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_fixup_edge_p_heap", file: !1, line: 103, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_fixup_edge_p_heap", file: !1, line: 103, size: 128, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !274, file: !1, line: 103, baseType: !277, size: 128)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_fixup_edge_p_base", file: !1, line: 102, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_fixup_edge_p_base", file: !1, line: 102, size: 128, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !278, file: !1, line: 102, baseType: !5, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !278, file: !1, line: 102, baseType: !5, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !278, file: !1, line: 102, baseType: !283, size: 64, offset: 64)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 64, elements: !304)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_edge_p", file: !1, line: 100, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_edge_type", file: !1, line: 98, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixup_edge_d", file: !1, line: 82, size: 512, elements: !288)
!288 = !{!289, !291, !292, !294, !296, !297, !300, !301, !302, !303}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !287, file: !1, line: 84, baseType: !290, size: 32)
!290 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !287, file: !1, line: 85, baseType: !290, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !1, line: 87, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_type", file: !1, line: 79, baseType: !247)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_rflow_valid", scope: !287, file: !1, line: 88, baseType: !295, size: 8, offset: 96)
!295 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "norm_vertex_index", scope: !287, file: !1, line: 90, baseType: !290, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !287, file: !1, line: 92, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !4, line: 119, baseType: !299)
!299 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rflow", scope: !287, file: !1, line: 94, baseType: !298, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !287, file: !1, line: 95, baseType: !298, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !287, file: !1, line: 96, baseType: !298, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "max_capacity", scope: !287, file: !1, line: 97, baseType: !298, size: 64, offset: 448)
!304 = !{!305}
!305 = !DISubrange(count: 1)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!309 = !{i32 7, !"Dwarf Version", i32 4}
!310 = !{i32 2, !"Debug Info Version", i32 3}
!311 = !{i32 1, !"wchar_size", i32 4}
!312 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!313 = distinct !DISubprogram(name: "sum_edge_counts", scope: !1, file: !1, line: 1372, type: !314, scopeLine: 1373, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1178)
!314 = !DISubroutineType(types: !315)
!315 = !{!298, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !318, file: !4, line: 151, baseType: !321, size: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !323)
!323 = !{!324, !325, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !322, file: !4, line: 150, baseType: !5, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !322, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !322, file: !4, line: 150, baseType: !327, size: 64, offset: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !304)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !329, line: 108, baseType: !330)
!329 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !332)
!332 = !{!333, !381, !382, !387, !388, !1173, !1174, !1175, !1176, !1177}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !331, file: !4, line: 124, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !336)
!336 = !{!337, !338, !339, !340, !343, !349, !350, !351, !375, !376, !377, !378, !379, !380}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !335, file: !4, line: 219, baseType: !316, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !335, file: !4, line: 220, baseType: !316, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !335, file: !4, line: 223, baseType: !307, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !335, file: !4, line: 226, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !4, line: 185, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !335, file: !4, line: 229, baseType: !344, size: 128, offset: 256)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 128, elements: !347)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !4, line: 229, flags: DIFlagFwdDecl)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !335, file: !4, line: 232, baseType: !334, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !335, file: !4, line: 233, baseType: !334, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !335, file: !4, line: 238, baseType: !352, size: 64, offset: 512)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !4, line: 235, size: 64, elements: !353)
!353 = !{!354, !363}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !352, file: !4, line: 236, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !4, line: 273, size: 128, elements: !357)
!357 = !{!358, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !356, file: !4, line: 275, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !329, line: 66, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !329, line: 65, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !356, file: !4, line: 278, baseType: !359, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !352, file: !4, line: 237, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !4, line: 259, size: 320, elements: !366)
!366 = !{!367, !371, !372, !373, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !365, file: !4, line: 261, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !329, line: 50, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !329, line: 49, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !365, file: !4, line: 262, baseType: !368, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !365, file: !4, line: 266, baseType: !368, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !365, file: !4, line: 267, baseType: !368, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !365, file: !4, line: 270, baseType: !290, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !335, file: !4, line: 241, baseType: !298, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !335, file: !4, line: 244, baseType: !290, size: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !335, file: !4, line: 247, baseType: !290, size: 32, offset: 672)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !335, file: !4, line: 250, baseType: !290, size: 32, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !335, file: !4, line: 253, baseType: !290, size: 32, offset: 736)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !4, line: 256, baseType: !290, size: 32, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !331, file: !4, line: 125, baseType: !334, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !331, file: !4, line: 131, baseType: !383, size: 64, offset: 128)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !383, file: !4, line: 129, baseType: !359, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !383, file: !4, line: 130, baseType: !368, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !331, file: !4, line: 134, baseType: !307, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !331, file: !4, line: 137, baseType: !389, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !329, line: 56, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !392)
!392 = !{!393, !426, !432, !444, !451, !458, !463, !471, !477, !490, !502, !540, !545, !573, !581, !582, !587, !596, !602, !607, !611, !615, !797, !846, !852, !859, !866, !892, !917, !934, !946, !968, !983, !1155}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !21, line: 3372, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !394, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !394, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !394, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !394, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !394, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !394, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !394, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !394, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !394, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !394, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !394, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !394, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !394, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !394, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !394, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !394, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !394, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !394, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !394, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !394, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !394, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !394, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !394, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !394, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !394, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !394, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !394, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !394, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !394, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !394, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !391, file: !21, line: 3373, baseType: !427, size: 192)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !427, file: !21, line: 403, baseType: !394, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !427, file: !21, line: 404, baseType: !389, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !21, line: 405, baseType: !389, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !391, file: !21, line: 3374, baseType: !433, size: 320)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !433, file: !21, line: 1385, baseType: !427, size: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !433, file: !21, line: 1386, baseType: !437, size: 128, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !438, line: 58, baseType: !439)
!438 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 54, size: 128, elements: !440)
!440 = !{!441, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !439, file: !438, line: 56, baseType: !442, size: 64)
!442 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !439, file: !438, line: 57, baseType: !299, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !391, file: !21, line: 3375, baseType: !445, size: 256)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !445, file: !21, line: 1398, baseType: !427, size: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !445, file: !21, line: 1399, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !391, file: !21, line: 3376, baseType: !452, size: 256)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !452, file: !21, line: 1409, baseType: !427, size: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !452, file: !21, line: 1410, baseType: !456, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !391, file: !21, line: 3377, baseType: !459, size: 256)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !21, line: 1438, baseType: !427, size: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !459, file: !21, line: 1439, baseType: !389, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !391, file: !21, line: 3378, baseType: !464, size: 256)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !464, file: !21, line: 1419, baseType: !427, size: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !464, file: !21, line: 1420, baseType: !290, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !464, file: !21, line: 1421, baseType: !469, size: 8, offset: 224)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 8, elements: !304)
!470 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !391, file: !21, line: 3379, baseType: !472, size: 320)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !472, file: !21, line: 1429, baseType: !427, size: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !472, file: !21, line: 1430, baseType: !389, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !472, file: !21, line: 1431, baseType: !389, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !391, file: !21, line: 3380, baseType: !478, size: 320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !21, line: 1461, baseType: !427, size: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !478, file: !21, line: 1462, baseType: !482, size: 128, offset: 192)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !483, line: 31, size: 128, elements: !484)
!483 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!484 = !{!485, !488, !489}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !482, file: !483, line: 32, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !482, file: !483, line: 33, baseType: !5, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !482, file: !483, line: 34, baseType: !5, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !391, file: !21, line: 3381, baseType: !491, size: 384)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !492)
!492 = !{!493, !494, !499, !500, !501}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !21, line: 2508, baseType: !427, size: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !491, file: !21, line: 2509, baseType: !495, size: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !496, line: 58, baseType: !497)
!496 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !498, line: 44, baseType: !5)
!498 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !491, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !21, line: 2511, baseType: !389, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !491, file: !21, line: 2512, baseType: !389, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !391, file: !21, line: 3382, baseType: !503, size: 896)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !503, file: !21, line: 2653, baseType: !491, size: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !503, file: !21, line: 2654, baseType: !389, size: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !503, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !503, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !503, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !503, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !503, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !503, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !503, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !503, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !503, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !503, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !503, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !503, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !503, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !503, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !503, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !503, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !503, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !503, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !503, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !503, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !503, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !503, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !503, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !503, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !503, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !503, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !503, file: !21, line: 2705, baseType: !389, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !503, file: !21, line: 2706, baseType: !389, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !503, file: !21, line: 2707, baseType: !389, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !503, file: !21, line: 2708, baseType: !389, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !503, file: !21, line: 2711, baseType: !538, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !391, file: !21, line: 3383, baseType: !541, size: 960)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !21, line: 2757, baseType: !503, size: 896)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !541, file: !21, line: 2758, baseType: !368, size: 64, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !391, file: !21, line: 3384, baseType: !546, size: 1472)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !547)
!547 = !{!548, !569, !570, !571, !572}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !546, file: !21, line: 3115, baseType: !549, size: 1216)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !549, file: !21, line: 2985, baseType: !541, size: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !549, file: !21, line: 2986, baseType: !389, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !549, file: !21, line: 2987, baseType: !389, size: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !549, file: !21, line: 2988, baseType: !389, size: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !549, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !549, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !549, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !549, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !549, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !549, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !549, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !549, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !549, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !549, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !549, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !549, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !549, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !549, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !546, file: !21, line: 3117, baseType: !389, size: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !546, file: !21, line: 3119, baseType: !389, size: 64, offset: 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !546, file: !21, line: 3121, baseType: !389, size: 64, offset: 1344)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !546, file: !21, line: 3123, baseType: !389, size: 64, offset: 1408)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !391, file: !21, line: 3385, baseType: !574, size: 1088)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !574, file: !21, line: 2875, baseType: !541, size: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !574, file: !21, line: 2876, baseType: !368, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !574, file: !21, line: 2877, baseType: !579, size: 64, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !21, line: 2856, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !391, file: !21, line: 3386, baseType: !549, size: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !391, file: !21, line: 3387, baseType: !583, size: 1280)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !21, line: 3094, baseType: !549, size: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !583, file: !21, line: 3095, baseType: !579, size: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !391, file: !21, line: 3388, baseType: !588, size: 1216)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !21, line: 2825, baseType: !503, size: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !588, file: !21, line: 2827, baseType: !389, size: 64, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !588, file: !21, line: 2828, baseType: !389, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !588, file: !21, line: 2829, baseType: !389, size: 64, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !588, file: !21, line: 2830, baseType: !389, size: 64, offset: 1088)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !588, file: !21, line: 2831, baseType: !389, size: 64, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !391, file: !21, line: 3389, baseType: !597, size: 1024)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !21, line: 2851, baseType: !541, size: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !597, file: !21, line: 2852, baseType: !290, size: 32, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !597, file: !21, line: 2853, baseType: !290, size: 32, offset: 992)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !391, file: !21, line: 3390, baseType: !603, size: 1024)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !21, line: 2858, baseType: !541, size: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !603, file: !21, line: 2859, baseType: !579, size: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !391, file: !21, line: 3391, baseType: !608, size: 960)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !609)
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !21, line: 2863, baseType: !541, size: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !391, file: !21, line: 3392, baseType: !612, size: 1472)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !612, file: !21, line: 3305, baseType: !546, size: 1472)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !391, file: !21, line: 3393, baseType: !616, size: 1792)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !617)
!617 = !{!618, !619, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !616, file: !21, line: 3249, baseType: !546, size: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !616, file: !21, line: 3251, baseType: !620, size: 64, offset: 1472)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !622, line: 463, size: 1152, elements: !623)
!622 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!623 = !{!624, !627, !658, !659, !662, !665, !717, !718, !719, !720, !721, !749, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !621, file: !622, line: 464, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !622, line: 464, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !621, file: !622, line: 467, baseType: !628, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !630)
!630 = !{!631, !633, !634, !647, !648, !649, !650, !651, !652, !654, !656, !657}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !629, file: !4, line: 377, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !329, line: 111, baseType: !334)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !629, file: !4, line: 378, baseType: !632, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !629, file: !4, line: 381, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !637, file: !4, line: 282, baseType: !640, size: 128)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !641, file: !4, line: 281, baseType: !5, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !641, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !641, file: !4, line: 281, baseType: !646, size: 64, offset: 64)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 64, elements: !304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !629, file: !4, line: 384, baseType: !290, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !629, file: !4, line: 387, baseType: !290, size: 32, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !629, file: !4, line: 390, baseType: !290, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !629, file: !4, line: 394, baseType: !635, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !629, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !629, file: !4, line: 399, baseType: !653, size: 64, offset: 416)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !347)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !629, file: !4, line: 402, baseType: !655, size: 64, offset: 480)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !347)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !629, file: !4, line: 406, baseType: !290, size: 32, offset: 544)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !629, file: !4, line: 409, baseType: !290, size: 32, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !621, file: !622, line: 470, baseType: !360, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !621, file: !622, line: 473, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !622, line: 166, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !621, file: !622, line: 476, baseType: !663, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !622, line: 476, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !621, file: !622, line: 479, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !667, line: 144, baseType: !668)
!667 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !667, line: 100, size: 896, elements: !670)
!670 = !{!671, !679, !684, !689, !691, !694, !695, !696, !697, !698, !703, !705, !706, !711, !716}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !669, file: !667, line: 102, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !667, line: 52, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !667, line: 47, baseType: !5)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !669, file: !667, line: 105, baseType: !680, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !667, line: 59, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!290, !677, !677}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !669, file: !667, line: 108, baseType: !685, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !667, line: 63, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !307}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !669, file: !667, line: 111, baseType: !690, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !667, line: 114, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !693, line: 46, baseType: !442)
!693 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!694 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !669, file: !667, line: 117, baseType: !692, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !669, file: !667, line: 120, baseType: !692, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !669, file: !667, line: 124, baseType: !5, size: 32, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !669, file: !667, line: 128, baseType: !5, size: 32, offset: 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !669, file: !667, line: 131, baseType: !699, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !667, line: 75, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!307, !692, !692}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !669, file: !667, line: 132, baseType: !704, size: 64, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !667, line: 78, baseType: !686)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !669, file: !667, line: 135, baseType: !307, size: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !669, file: !667, line: 136, baseType: !707, size: 64, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !667, line: 82, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!307, !307, !692, !692}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !669, file: !667, line: 137, baseType: !712, size: 64, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !667, line: 83, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !307, !307}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !669, file: !667, line: 141, baseType: !5, size: 32, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !621, file: !622, line: 484, baseType: !389, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !621, file: !622, line: 488, baseType: !389, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !621, file: !622, line: 493, baseType: !389, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !621, file: !622, line: 496, baseType: !389, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !621, file: !622, line: 501, baseType: !722, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !724)
!724 = !{!725, !728, !731, !732, !733, !737, !738, !743, !744, !745, !746, !747, !748}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !723, file: !16, line: 2356, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !16, line: 2356, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !723, file: !16, line: 2357, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !723, file: !16, line: 2358, baseType: !290, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !723, file: !16, line: 2359, baseType: !290, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !723, file: !16, line: 2360, baseType: !734, size: 128, offset: 192)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 4)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !723, file: !16, line: 2364, baseType: !290, size: 32, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !723, file: !16, line: 2367, baseType: !739, size: 128, offset: 384)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !16, line: 2349, size: 128, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !739, file: !16, line: 2351, baseType: !368, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !739, file: !16, line: 2352, baseType: !299, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !723, file: !16, line: 2371, baseType: !15, size: 32, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !723, file: !16, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !723, file: !16, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !723, file: !16, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !723, file: !16, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !723, file: !16, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !621, file: !622, line: 504, baseType: !750, size: 64, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !622, line: 504, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !621, file: !622, line: 507, baseType: !666, size: 64, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !621, file: !622, line: 510, baseType: !290, size: 32, offset: 832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !621, file: !622, line: 513, baseType: !290, size: 32, offset: 864)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !621, file: !622, line: 516, baseType: !495, size: 32, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !621, file: !622, line: 519, baseType: !495, size: 32, offset: 928)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !621, file: !622, line: 522, baseType: !5, size: 32, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !621, file: !622, line: 523, baseType: !5, size: 32, offset: 992)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !621, file: !622, line: 528, baseType: !729, size: 64, offset: 1024)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !621, file: !622, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !621, file: !622, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !621, file: !622, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !621, file: !622, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !621, file: !622, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !621, file: !622, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !621, file: !622, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !621, file: !622, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !621, file: !622, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !621, file: !622, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !621, file: !622, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !621, file: !622, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !621, file: !622, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !621, file: !622, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !621, file: !622, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !621, file: !622, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !616, file: !21, line: 3254, baseType: !389, size: 64, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !616, file: !21, line: 3257, baseType: !389, size: 64, offset: 1600)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !616, file: !21, line: 3258, baseType: !389, size: 64, offset: 1664)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !616, file: !21, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !616, file: !21, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !616, file: !21, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !616, file: !21, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !616, file: !21, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !616, file: !21, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !616, file: !21, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !616, file: !21, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !616, file: !21, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !616, file: !21, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !616, file: !21, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !616, file: !21, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !616, file: !21, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !616, file: !21, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !616, file: !21, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !616, file: !21, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !616, file: !21, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !616, file: !21, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !21, line: 3394, baseType: !798, size: 1344)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !21, line: 2279, size: 1344, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !826, !827, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !21, line: 2280, baseType: !427, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !798, file: !21, line: 2281, baseType: !389, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !798, file: !21, line: 2282, baseType: !389, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !798, file: !21, line: 2283, baseType: !389, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !798, file: !21, line: 2284, baseType: !389, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !798, file: !21, line: 2285, baseType: !5, size: 32, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !798, file: !21, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !798, file: !21, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !798, file: !21, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !798, file: !21, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !798, file: !21, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !798, file: !21, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !798, file: !21, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !798, file: !21, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !798, file: !21, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !798, file: !21, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !798, file: !21, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !798, file: !21, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !798, file: !21, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !798, file: !21, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !798, file: !21, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !798, file: !21, line: 2305, baseType: !5, size: 32, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !798, file: !21, line: 2306, baseType: !823, size: 32, offset: 544)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !824, line: 31, baseType: !290)
!824 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !798, file: !21, line: 2307, baseType: !389, size: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !798, file: !21, line: 2308, baseType: !389, size: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !798, file: !21, line: 2314, baseType: !828, size: 64, offset: 704)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !21, line: 2309, size: 64, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !828, file: !21, line: 2310, baseType: !290, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !828, file: !21, line: 2311, baseType: !729, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !828, file: !21, line: 2312, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !21, line: 2277, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !21, line: 2315, baseType: !389, size: 64, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !798, file: !21, line: 2316, baseType: !389, size: 64, offset: 832)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !798, file: !21, line: 2317, baseType: !389, size: 64, offset: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !798, file: !21, line: 2318, baseType: !389, size: 64, offset: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !798, file: !21, line: 2319, baseType: !389, size: 64, offset: 1024)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !798, file: !21, line: 2320, baseType: !389, size: 64, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !798, file: !21, line: 2321, baseType: !389, size: 64, offset: 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !798, file: !21, line: 2322, baseType: !389, size: 64, offset: 1216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !798, file: !21, line: 2324, baseType: !844, size: 64, offset: 1280)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !21, line: 2324, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !391, file: !21, line: 3395, baseType: !847, size: 320)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !21, line: 1469, size: 320, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !21, line: 1470, baseType: !427, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !847, file: !21, line: 1471, baseType: !389, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !847, file: !21, line: 1472, baseType: !389, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !21, line: 3396, baseType: !853, size: 320)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !21, line: 1482, size: 320, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !21, line: 1483, baseType: !427, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !853, file: !21, line: 1484, baseType: !290, size: 32, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !853, file: !21, line: 1485, baseType: !858, size: 64, offset: 256)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !304)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !391, file: !21, line: 3397, baseType: !860, size: 384)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !21, line: 1829, size: 384, elements: !861)
!861 = !{!862, !863, !864, !865}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !21, line: 1830, baseType: !427, size: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !860, file: !21, line: 1831, baseType: !495, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !860, file: !21, line: 1832, baseType: !389, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !860, file: !21, line: 1835, baseType: !858, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !391, file: !21, line: 3398, baseType: !867, size: 704)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !21, line: 1898, size: 704, elements: !868)
!868 = !{!869, !870, !871, !875, !876, !879}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !21, line: 1899, baseType: !427, size: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !867, file: !21, line: 1902, baseType: !389, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !867, file: !21, line: 1905, baseType: !872, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !329, line: 58, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !329, line: 57, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !867, file: !21, line: 1908, baseType: !5, size: 32, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !867, file: !21, line: 1911, baseType: !877, size: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !21, line: 1876, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !867, file: !21, line: 1914, baseType: !880, size: 256, offset: 448)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !21, line: 1883, size: 256, elements: !881)
!881 = !{!882, !884, !885, !890}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !21, line: 1884, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !21, line: 1885, baseType: !883, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !880, file: !21, line: 1891, baseType: !886, size: 64, offset: 128)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !21, line: 1891, size: 64, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !886, file: !21, line: 1891, baseType: !872, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !886, file: !21, line: 1891, baseType: !389, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !880, file: !21, line: 1892, baseType: !891, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !391, file: !21, line: 3399, baseType: !893, size: 704)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !21, line: 2008, size: 704, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !912, !913, !914, !915, !916}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !21, line: 2009, baseType: !427, size: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !893, file: !21, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !893, file: !21, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !893, file: !21, line: 2014, baseType: !495, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !893, file: !21, line: 2016, baseType: !389, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !893, file: !21, line: 2017, baseType: !901, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !21, line: 183, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !21, line: 183, size: 128, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !903, file: !21, line: 183, baseType: !906, size: 128)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !21, line: 182, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !21, line: 182, size: 128, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !907, file: !21, line: 182, baseType: !5, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !907, file: !21, line: 182, baseType: !5, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !907, file: !21, line: 182, baseType: !858, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !893, file: !21, line: 2019, baseType: !389, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !893, file: !21, line: 2020, baseType: !389, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !893, file: !21, line: 2021, baseType: !389, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !893, file: !21, line: 2022, baseType: !389, size: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !893, file: !21, line: 2023, baseType: !389, size: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !391, file: !21, line: 3400, baseType: !918, size: 832)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !21, line: 2430, size: 832, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !21, line: 2431, baseType: !427, size: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !21, line: 2433, baseType: !389, size: 64, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !918, file: !21, line: 2434, baseType: !389, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !918, file: !21, line: 2435, baseType: !389, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !918, file: !21, line: 2436, baseType: !389, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !918, file: !21, line: 2437, baseType: !901, size: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !918, file: !21, line: 2438, baseType: !389, size: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !918, file: !21, line: 2440, baseType: !389, size: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !918, file: !21, line: 2441, baseType: !389, size: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !918, file: !21, line: 2443, baseType: !930, size: 128, offset: 704)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !21, line: 182, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !21, line: 182, size: 128, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !931, file: !21, line: 182, baseType: !906, size: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !391, file: !21, line: 3401, baseType: !935, size: 320)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !21, line: 3327, size: 320, elements: !936)
!936 = !{!937, !938, !945}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !935, file: !21, line: 3329, baseType: !427, size: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !935, file: !21, line: 3330, baseType: !939, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !21, line: 3320, size: 192, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !940, file: !21, line: 3322, baseType: !939, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !21, line: 3323, baseType: !939, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !940, file: !21, line: 3324, baseType: !389, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !935, file: !21, line: 3331, baseType: !939, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !391, file: !21, line: 3402, baseType: !947, size: 256)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !21, line: 1540, size: 256, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !21, line: 1541, baseType: !427, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !947, file: !21, line: 1542, baseType: !951, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !21, line: 1538, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !21, line: 1538, size: 192, elements: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !953, file: !21, line: 1538, baseType: !956, size: 192)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !21, line: 1537, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !21, line: 1537, size: 192, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !21, line: 1537, baseType: !5, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !957, file: !21, line: 1537, baseType: !5, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !957, file: !21, line: 1537, baseType: !962, size: 128, offset: 64)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 128, elements: !304)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !21, line: 1535, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !21, line: 1532, size: 128, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !21, line: 1533, baseType: !389, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !964, file: !21, line: 1534, baseType: !389, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !391, file: !21, line: 3403, baseType: !969, size: 512)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !21, line: 1938, size: 512, elements: !970)
!970 = !{!971, !972, !973, !974, !980, !981, !982}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !21, line: 1939, baseType: !427, size: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !969, file: !21, line: 1940, baseType: !495, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !969, file: !21, line: 1941, baseType: !20, size: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !969, file: !21, line: 1946, baseType: !975, size: 32, offset: 256)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !21, line: 1942, size: 32, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !975, file: !21, line: 1943, baseType: !39, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !975, file: !21, line: 1944, baseType: !46, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !975, file: !21, line: 1945, baseType: !53, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !969, file: !21, line: 1950, baseType: !359, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !969, file: !21, line: 1951, baseType: !359, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !969, file: !21, line: 1953, baseType: !858, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !391, file: !21, line: 3404, baseType: !984, size: 1664)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !21, line: 3337, size: 1664, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !21, line: 3338, baseType: !427, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !984, file: !21, line: 3341, baseType: !988, size: 1472, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !989, line: 410, size: 1472, elements: !990)
!989 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !988, file: !989, line: 412, baseType: !290, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !988, file: !989, line: 413, baseType: !290, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !988, file: !989, line: 414, baseType: !290, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !988, file: !989, line: 415, baseType: !290, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !988, file: !989, line: 416, baseType: !290, size: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !988, file: !989, line: 417, baseType: !290, size: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !988, file: !989, line: 418, baseType: !295, size: 8, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !988, file: !989, line: 419, baseType: !295, size: 8, offset: 200)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !988, file: !989, line: 420, baseType: !1000, size: 8, offset: 208)
!1000 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !988, file: !989, line: 421, baseType: !1000, size: 8, offset: 216)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !988, file: !989, line: 422, baseType: !1000, size: 8, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !988, file: !989, line: 423, baseType: !1000, size: 8, offset: 232)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !988, file: !989, line: 424, baseType: !1000, size: 8, offset: 240)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !988, file: !989, line: 425, baseType: !1000, size: 8, offset: 248)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !988, file: !989, line: 426, baseType: !1000, size: 8, offset: 256)
