; ModuleID = 'lto-cgraph.c'
source_filename = "lto-cgraph.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cgraph_asm_node = type { %struct.cgraph_asm_node*, %union.tree_node*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!396 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!397 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!398 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!399 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!400 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!401 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!402 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!403 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!404 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!405 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!406 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !408, line: 256, baseType: !7, size: 32, elements: !409)
!408 = !DIFile(filename: "./lto-streamer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!410 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!413 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!414 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!415 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!416 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!417 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!418 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!419 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!420 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LTO_cgraph_tags", file: !385, line: 630, baseType: !7, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !427}
!423 = !DIEnumerator(name: "LTO_cgraph_avail_node", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "LTO_cgraph_overwritable_node", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "LTO_cgraph_unavail_node", value: 3, isUnsigned: true)
!426 = !DIEnumerator(name: "LTO_cgraph_edge", value: 4, isUnsigned: true)
!427 = !DIEnumerator(name: "LTO_cgraph_last_tag", value: 5, isUnsigned: true)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ld_plugin_symbol_resolution", file: !429, line: 123, baseType: !7, size: 32, elements: !430)
!429 = !DIFile(filename: "./include/plugin-api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439}
!431 = !DIEnumerator(name: "LDPR_UNKNOWN", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "LDPR_UNDEF", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "LDPR_PREVAILING_DEF", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "LDPR_PREVAILING_DEF_IRONLY", value: 3, isUnsigned: true)
!435 = !DIEnumerator(name: "LDPR_PREEMPTED_REG", value: 4, isUnsigned: true)
!436 = !DIEnumerator(name: "LDPR_PREEMPTED_IR", value: 5, isUnsigned: true)
!437 = !DIEnumerator(name: "LDPR_RESOLVED_IR", value: 6, isUnsigned: true)
!438 = !DIEnumerator(name: "LDPR_RESOLVED_EXEC", value: 7, isUnsigned: true)
!439 = !DIEnumerator(name: "LDPR_RESOLVED_DYN", value: 8, isUnsigned: true)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "size_type_kind", file: !135, line: 4288, baseType: !7, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445, !446}
!442 = !DIEnumerator(name: "SIZETYPE", value: 0, isUnsigned: true)
!443 = !DIEnumerator(name: "SSIZETYPE", value: 1, isUnsigned: true)
!444 = !DIEnumerator(name: "BITSIZETYPE", value: 2, isUnsigned: true)
!445 = !DIEnumerator(name: "SBITSIZETYPE", value: 3, isUnsigned: true)
!446 = !DIEnumerator(name: "TYPE_KIND_LAST", value: 4, isUnsigned: true)
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !408, line: 272, baseType: !7, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456}
!449 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "LTO_DECL_STREAM_FIELD_DECL", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "LTO_DECL_STREAM_FN_DECL", value: 2, isUnsigned: true)
!452 = !DIEnumerator(name: "LTO_DECL_STREAM_VAR_DECL", value: 3, isUnsigned: true)
!453 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE_DECL", value: 4, isUnsigned: true)
!454 = !DIEnumerator(name: "LTO_DECL_STREAM_NAMESPACE_DECL", value: 5, isUnsigned: true)
!455 = !DIEnumerator(name: "LTO_DECL_STREAM_LABEL_DECL", value: 6, isUnsigned: true)
!456 = !DIEnumerator(name: "LTO_N_DECL_STREAMS", value: 7, isUnsigned: true)
!457 = !{!458, !767, !2074, !580, !687, !466, !7, !421, !483, !752, !1027, !1927, !613, !478}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_cgraph_encoder_d", file: !408, line: 461, size: 128, elements: !460)
!460 = !{!461, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !459, file: !408, line: 464, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !464, line: 33, flags: DIFlagFwdDecl)
!464 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !459, file: !408, line: 467, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_cgraph_node_ptr_heap", file: !385, line: 271, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_cgraph_node_ptr_heap", file: !385, line: 271, size: 128, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !468, file: !385, line: 271, baseType: !471, size: 128)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_cgraph_node_ptr_base", file: !385, line: 270, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_cgraph_node_ptr_base", file: !385, line: 270, size: 128, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !472, file: !385, line: 270, baseType: !7, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !472, file: !385, line: 270, baseType: !7, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !472, file: !385, line: 270, baseType: !477, size: 64, offset: 64)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 64, elements: !584)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgraph_node_ptr", file: !385, line: 268, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !385, line: 181, size: 2496, elements: !481)
!481 = !{!482, !1913, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1967, !2011, !2021, !2025, !2051, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !480, file: !385, line: 182, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !484, line: 56, baseType: !485)
!484 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !487)
!487 = !{!488, !521, !527, !540, !559, !570, !575, !586, !592, !606, !618, !656, !1153, !1181, !1198, !1199, !1204, !1213, !1219, !1224, !1228, !1232, !1564, !1611, !1617, !1623, !1630, !1643, !1657, !1674, !1686, !1708, !1723, !1895}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !486, file: !135, line: 3372, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !489, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !489, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !489, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !489, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !489, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !489, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !489, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !489, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !489, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !489, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !489, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !489, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !489, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !489, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !489, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !489, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !489, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !489, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !489, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !489, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !489, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !489, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !489, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !489, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !489, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !489, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !489, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !489, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !489, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !489, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !135, line: 3373, baseType: !522, size: 192)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !135, line: 403, baseType: !489, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !522, file: !135, line: 404, baseType: !483, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !135, line: 405, baseType: !483, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !486, file: !135, line: 3374, baseType: !528, size: 320)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !528, file: !135, line: 1385, baseType: !522, size: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !528, file: !135, line: 1386, baseType: !532, size: 128, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !533, line: 58, baseType: !534)
!533 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 54, size: 128, elements: !535)
!535 = !{!536, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !534, file: !533, line: 56, baseType: !537, size: 64)
!537 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !534, file: !533, line: 57, baseType: !539, size: 64, offset: 64)
!539 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !486, file: !135, line: 3375, baseType: !541, size: 256)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !135, line: 1398, baseType: !522, size: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !541, file: !135, line: 1399, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !547, line: 52, size: 256, elements: !548)
!547 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !{!549, !550, !551, !552, !553, !554, !555}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !546, file: !547, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !546, file: !547, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !546, file: !547, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !546, file: !547, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !546, file: !547, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !546, file: !547, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !546, file: !547, line: 62, baseType: !556, size: 192, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 192, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 3)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !486, file: !135, line: 3376, baseType: !560, size: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !135, line: 1409, baseType: !522, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !560, file: !135, line: 1410, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !566, line: 27, size: 192, elements: !567)
!566 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !566, line: 29, baseType: !532, size: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !565, file: !566, line: 30, baseType: !5, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !486, file: !135, line: 3377, baseType: !571, size: 256)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !571, file: !135, line: 1438, baseType: !522, size: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !571, file: !135, line: 1439, baseType: !483, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !486, file: !135, line: 3378, baseType: !576, size: 256)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !577)
!577 = !{!578, !579, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !576, file: !135, line: 1419, baseType: !522, size: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !576, file: !135, line: 1420, baseType: !580, size: 32, offset: 192)
!580 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !576, file: !135, line: 1421, baseType: !582, size: 8, offset: 224)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 8, elements: !584)
!583 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!584 = !{!585}
!585 = !DISubrange(count: 1)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !486, file: !135, line: 3379, baseType: !587, size: 320)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !587, file: !135, line: 1429, baseType: !522, size: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !587, file: !135, line: 1430, baseType: !483, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !587, file: !135, line: 1431, baseType: !483, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !486, file: !135, line: 3380, baseType: !593, size: 320)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !135, line: 1461, baseType: !522, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !135, line: 1462, baseType: !597, size: 128, offset: 192)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !598, line: 31, size: 128, elements: !599)
!598 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!599 = !{!600, !604, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !597, file: !598, line: 32, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !597, file: !598, line: 33, baseType: !7, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !597, file: !598, line: 34, baseType: !7, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !486, file: !135, line: 3381, baseType: !607, size: 384)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !608)
!608 = !{!609, !610, !615, !616, !617}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !607, file: !135, line: 2508, baseType: !522, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !607, file: !135, line: 2509, baseType: !611, size: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !612, line: 58, baseType: !613)
!612 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !614, line: 44, baseType: !7)
!614 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!615 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !607, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !607, file: !135, line: 2511, baseType: !483, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !607, file: !135, line: 2512, baseType: !483, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !486, file: !135, line: 3382, baseType: !619, size: 896)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !619, file: !135, line: 2653, baseType: !607, size: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !135, line: 2654, baseType: !483, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !619, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !619, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !619, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !619, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !619, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !619, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !619, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !619, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !619, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !619, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !619, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !619, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !619, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !619, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !619, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !619, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !619, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !619, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !619, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !619, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !619, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !619, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !619, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !619, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !619, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !619, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !619, file: !135, line: 2705, baseType: !483, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !619, file: !135, line: 2706, baseType: !483, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !619, file: !135, line: 2707, baseType: !483, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !619, file: !135, line: 2708, baseType: !483, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !619, file: !135, line: 2711, baseType: !654, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !486, file: !135, line: 3383, baseType: !657, size: 960)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !657, file: !135, line: 2757, baseType: !619, size: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !657, file: !135, line: 2758, baseType: !661, size: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !484, line: 50, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !664, line: 240, size: 384, elements: !665)
!664 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !663, file: !664, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !663, file: !664, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !663, file: !664, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !663, file: !664, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !663, file: !664, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !663, file: !664, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !663, file: !664, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !663, file: !664, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !663, file: !664, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !663, file: !664, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !663, file: !664, line: 321, baseType: !677, size: 320, offset: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !664, line: 315, size: 320, elements: !678)
!678 = !{!679, !1086, !1088, !1151, !1152}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !677, file: !664, line: 316, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 64, elements: !584)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !664, line: 183, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !664, line: 166, size: 64, elements: !683)
!683 = !{!684, !685, !686, !689, !690, !698, !699, !711, !714, !776, !777, !1063, !1076, !1083}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !682, file: !664, line: 168, baseType: !580, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !682, file: !664, line: 169, baseType: !7, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !682, file: !664, line: 170, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !682, file: !664, line: 171, baseType: !661, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !682, file: !664, line: 172, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !484, line: 53, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !664, line: 359, size: 128, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !693, file: !664, line: 360, baseType: !580, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !693, file: !664, line: 361, baseType: !697, size: 64, offset: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 64, elements: !584)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !682, file: !664, line: 173, baseType: !5, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !682, file: !664, line: 174, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !664, line: 133, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 115, size: 32, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !701, file: !664, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !701, file: !664, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !701, file: !664, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !701, file: !664, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !701, file: !664, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !701, file: !664, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !701, file: !664, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !701, file: !664, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !682, file: !664, line: 175, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !664, line: 175, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !682, file: !664, line: 176, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !717, line: 75, size: 256, elements: !718)
!717 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!718 = !{!719, !733, !734, !735}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !716, file: !717, line: 76, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !717, line: 68, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !717, line: 63, size: 320, elements: !723)
!723 = !{!724, !726, !727, !728}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !717, line: 64, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !722, file: !717, line: 65, baseType: !725, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !722, file: !717, line: 66, baseType: !7, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !722, file: !717, line: 67, baseType: !729, size: 128, offset: 192)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 128, elements: !731)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !717, line: 29, baseType: !537)
!731 = !{!732}
!732 = !DISubrange(count: 2)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !716, file: !717, line: 77, baseType: !720, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !716, file: !717, line: 78, baseType: !7, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !716, file: !717, line: 79, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !717, line: 49, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !717, line: 45, size: 832, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !738, file: !717, line: 46, baseType: !725, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !738, file: !717, line: 47, baseType: !715, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !738, file: !717, line: 48, baseType: !743, size: 704, offset: 128)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !744, line: 164, size: 704, elements: !745)
!744 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!745 = !{!746, !747, !758, !759, !760, !761, !762, !763, !768, !772, !773, !774, !775}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !743, file: !744, line: 166, baseType: !539, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !743, file: !744, line: 167, baseType: !748, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !744, line: 157, size: 192, elements: !750)
!750 = !{!751, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !749, file: !744, line: 159, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !749, file: !744, line: 160, baseType: !748, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !749, file: !744, line: 161, baseType: !755, size: 32, offset: 128)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 32, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 4)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !743, file: !744, line: 168, baseType: !752, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !743, file: !744, line: 169, baseType: !752, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !743, file: !744, line: 170, baseType: !752, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !743, file: !744, line: 171, baseType: !539, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !743, file: !744, line: 172, baseType: !580, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !743, file: !744, line: 176, baseType: !764, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!748, !767, !539}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !743, file: !744, line: 177, baseType: !769, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !767, !748}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !743, file: !744, line: 178, baseType: !767, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !743, file: !744, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !743, file: !744, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !743, file: !744, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !682, file: !664, line: 177, baseType: !483, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !682, file: !664, line: 178, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !780)
!780 = !{!781, !1028, !1029, !1030, !1033, !1037, !1038, !1039, !1057, !1058, !1059, !1060, !1061, !1062}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !779, file: !337, line: 219, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !785)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !784, file: !337, line: 151, baseType: !787, size: 128)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !788, file: !337, line: 150, baseType: !7, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !788, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !788, file: !337, line: 150, baseType: !793, size: 64, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !584)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !484, line: 108, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !797)
!797 = !{!798, !799, !800, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !796, file: !337, line: 124, baseType: !778, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !796, file: !337, line: 125, baseType: !778, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !796, file: !337, line: 131, baseType: !801, size: 64, offset: 128)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !802)
!802 = !{!803, !1019}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !801, file: !337, line: 129, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !484, line: 66, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !807, line: 143, size: 192, elements: !808)
!807 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!808 = !{!809, !1017, !1018}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !806, file: !807, line: 145, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !484, line: 69, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !807, line: 136, size: 192, elements: !813)
!813 = !{!814, !1015, !1016}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !812, file: !807, line: 137, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !484, line: 58, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !807, line: 737, size: 768, elements: !818)
!818 = !{!819, !836, !870, !876, !881, !886, !893, !899, !905, !910, !924, !929, !935, !940, !950, !955, !973, !980, !987, !993, !998, !1004, !1010}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !817, file: !807, line: 738, baseType: !820, size: 256)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !807, line: 271, size: 256, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !820, file: !807, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !820, file: !807, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !820, file: !807, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !820, file: !807, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !820, file: !807, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !820, file: !807, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !820, file: !807, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !820, file: !807, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !820, file: !807, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !820, file: !807, line: 312, baseType: !7, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !820, file: !807, line: 316, baseType: !611, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !820, file: !807, line: 319, baseType: !7, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !820, file: !807, line: 323, baseType: !778, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !820, file: !807, line: 327, baseType: !483, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !817, file: !807, line: 739, baseType: !837, size: 448)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !807, line: 350, size: 448, elements: !838)
!838 = !{!839, !868}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !837, file: !807, line: 353, baseType: !840, size: 384)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !807, line: 333, size: 384, elements: !841)
!841 = !{!842, !843, !851}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !840, file: !807, line: 336, baseType: !820, size: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !840, file: !807, line: 343, baseType: !844, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !846, line: 37, size: 128, elements: !847)
!846 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !845, file: !846, line: 39, baseType: !844, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !845, file: !846, line: 40, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !840, file: !807, line: 344, baseType: !852, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !846, line: 45, size: 320, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !846, line: 47, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !853, file: !846, line: 48, baseType: !857, size: 256, offset: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !858)
!858 = !{!859, !861, !862, !867}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !857, file: !135, line: 1884, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !135, line: 1885, baseType: !860, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !857, file: !135, line: 1891, baseType: !863, size: 64, offset: 128)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !857, file: !135, line: 1891, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !863, file: !135, line: 1891, baseType: !815, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !863, file: !135, line: 1891, baseType: !483, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !857, file: !135, line: 1892, baseType: !850, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !837, file: !807, line: 359, baseType: !869, size: 64, offset: 384)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 64, elements: !584)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !817, file: !807, line: 740, baseType: !871, size: 512)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !807, line: 365, size: 512, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !871, file: !807, line: 368, baseType: !840, size: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !871, file: !807, line: 373, baseType: !483, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !871, file: !807, line: 374, baseType: !483, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !817, file: !807, line: 741, baseType: !877, size: 576)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !807, line: 380, size: 576, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !877, file: !807, line: 383, baseType: !871, size: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !877, file: !807, line: 389, baseType: !869, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !817, file: !807, line: 742, baseType: !882, size: 320)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !807, line: 395, size: 320, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !882, file: !807, line: 397, baseType: !820, size: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !882, file: !807, line: 400, baseType: !804, size: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !817, file: !807, line: 743, baseType: !887, size: 448)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !807, line: 406, size: 448, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !887, file: !807, line: 408, baseType: !820, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !887, file: !807, line: 412, baseType: !483, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !887, file: !807, line: 420, baseType: !483, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !887, file: !807, line: 423, baseType: !804, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !817, file: !807, line: 744, baseType: !894, size: 384)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !807, line: 429, size: 384, elements: !895)
!895 = !{!896, !897, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !894, file: !807, line: 431, baseType: !820, size: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !894, file: !807, line: 434, baseType: !483, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !894, file: !807, line: 437, baseType: !804, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !817, file: !807, line: 745, baseType: !900, size: 384)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !807, line: 443, size: 384, elements: !901)
!901 = !{!902, !903, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !900, file: !807, line: 445, baseType: !820, size: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !900, file: !807, line: 449, baseType: !483, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !900, file: !807, line: 453, baseType: !804, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !817, file: !807, line: 746, baseType: !906, size: 320)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !807, line: 459, size: 320, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !906, file: !807, line: 461, baseType: !820, size: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !906, file: !807, line: 464, baseType: !483, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !817, file: !807, line: 747, baseType: !911, size: 768)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !807, line: 469, size: 768, elements: !912)
!912 = !{!913, !914, !915, !916, !917}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !911, file: !807, line: 471, baseType: !820, size: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !911, file: !807, line: 474, baseType: !7, size: 32, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !911, file: !807, line: 475, baseType: !7, size: 32, offset: 288)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !911, file: !807, line: 478, baseType: !483, size: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !911, file: !807, line: 481, baseType: !918, size: 384, offset: 384)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 384, elements: !584)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !919, file: !135, line: 1920, baseType: !857, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !919, file: !135, line: 1921, baseType: !483, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !919, file: !135, line: 1922, baseType: !611, size: 32, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !817, file: !807, line: 748, baseType: !925, size: 320)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !807, line: 487, size: 320, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !925, file: !807, line: 490, baseType: !820, size: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !925, file: !807, line: 494, baseType: !580, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !817, file: !807, line: 749, baseType: !930, size: 384)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !807, line: 500, size: 384, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !930, file: !807, line: 502, baseType: !820, size: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !930, file: !807, line: 506, baseType: !804, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !930, file: !807, line: 510, baseType: !804, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !817, file: !807, line: 750, baseType: !936, size: 320)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !807, line: 529, size: 320, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !936, file: !807, line: 531, baseType: !820, size: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !936, file: !807, line: 540, baseType: !804, size: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !817, file: !807, line: 751, baseType: !941, size: 704)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !807, line: 546, size: 704, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !941, file: !807, line: 549, baseType: !871, size: 512)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !941, file: !807, line: 553, baseType: !687, size: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !941, file: !807, line: 557, baseType: !603, size: 8, offset: 576)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !941, file: !807, line: 558, baseType: !603, size: 8, offset: 584)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !941, file: !807, line: 559, baseType: !603, size: 8, offset: 592)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !941, file: !807, line: 560, baseType: !603, size: 8, offset: 600)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !941, file: !807, line: 566, baseType: !869, size: 64, offset: 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !817, file: !807, line: 752, baseType: !951, size: 384)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !807, line: 571, size: 384, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !951, file: !807, line: 573, baseType: !882, size: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !807, line: 577, baseType: !483, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !817, file: !807, line: 753, baseType: !956, size: 576)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !807, line: 600, size: 576, elements: !957)
!957 = !{!958, !959, !960, !963, !972}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !956, file: !807, line: 602, baseType: !882, size: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !956, file: !807, line: 605, baseType: !483, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !956, file: !807, line: 609, baseType: !961, size: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !962, line: 46, baseType: !537)
!962 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!963 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !956, file: !807, line: 612, baseType: !964, size: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !807, line: 581, size: 320, elements: !966)
!966 = !{!967, !968, !969, !970, !971}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !965, file: !807, line: 583, baseType: !134, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !965, file: !807, line: 586, baseType: !483, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !965, file: !807, line: 589, baseType: !483, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !965, file: !807, line: 592, baseType: !483, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !965, file: !807, line: 595, baseType: !483, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !956, file: !807, line: 616, baseType: !804, size: 64, offset: 512)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !817, file: !807, line: 754, baseType: !974, size: 512)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !807, line: 622, size: 512, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !974, file: !807, line: 624, baseType: !882, size: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !974, file: !807, line: 628, baseType: !483, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !974, file: !807, line: 632, baseType: !483, size: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !974, file: !807, line: 636, baseType: !483, size: 64, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !817, file: !807, line: 755, baseType: !981, size: 704)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !807, line: 642, size: 704, elements: !982)
!982 = !{!983, !984, !985, !986}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !981, file: !807, line: 644, baseType: !974, size: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !981, file: !807, line: 648, baseType: !483, size: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !981, file: !807, line: 652, baseType: !483, size: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !981, file: !807, line: 653, baseType: !483, size: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !817, file: !807, line: 756, baseType: !988, size: 448)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !807, line: 663, size: 448, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !988, file: !807, line: 665, baseType: !882, size: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !988, file: !807, line: 668, baseType: !483, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !988, file: !807, line: 673, baseType: !483, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !817, file: !807, line: 757, baseType: !994, size: 384)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !807, line: 694, size: 384, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !994, file: !807, line: 696, baseType: !882, size: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !994, file: !807, line: 699, baseType: !483, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !817, file: !807, line: 758, baseType: !999, size: 384)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !807, line: 681, size: 384, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !999, file: !807, line: 683, baseType: !820, size: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !999, file: !807, line: 686, baseType: !483, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !999, file: !807, line: 689, baseType: !483, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !817, file: !807, line: 759, baseType: !1005, size: 384)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !807, line: 707, size: 384, elements: !1006)
!1006 = !{!1007, !1008, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1005, file: !807, line: 709, baseType: !820, size: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1005, file: !807, line: 712, baseType: !483, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1005, file: !807, line: 712, baseType: !483, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !817, file: !807, line: 760, baseType: !1011, size: 320)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !807, line: 718, size: 320, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1011, file: !807, line: 720, baseType: !820, size: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1011, file: !807, line: 723, baseType: !483, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !807, line: 138, baseType: !811, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !807, line: 139, baseType: !811, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !806, file: !807, line: 146, baseType: !810, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !806, file: !807, line: 152, baseType: !804, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !801, file: !337, line: 130, baseType: !661, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !796, file: !337, line: 134, baseType: !767, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !796, file: !337, line: 137, baseType: !483, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !796, file: !337, line: 138, baseType: !611, size: 32, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !796, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !337, line: 144, baseType: !580, size: 32, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !796, file: !337, line: 145, baseType: !580, size: 32, offset: 416)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !796, file: !337, line: 146, baseType: !1027, size: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !539)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !779, file: !337, line: 220, baseType: !782, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !779, file: !337, line: 223, baseType: !767, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !779, file: !337, line: 226, baseType: !1031, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !779, file: !337, line: 229, baseType: !1034, size: 128, offset: 256)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 128, elements: !731)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !779, file: !337, line: 232, baseType: !778, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !779, file: !337, line: 233, baseType: !778, size: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !779, file: !337, line: 238, baseType: !1040, size: 64, offset: 512)
!1040 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1041)
!1041 = !{!1042, !1048}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1040, file: !337, line: 236, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1044, file: !337, line: 275, baseType: !804, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1044, file: !337, line: 278, baseType: !804, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1040, file: !337, line: 237, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1050, file: !337, line: 261, baseType: !661, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1050, file: !337, line: 262, baseType: !661, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1050, file: !337, line: 266, baseType: !661, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1050, file: !337, line: 267, baseType: !661, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1050, file: !337, line: 270, baseType: !580, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !779, file: !337, line: 241, baseType: !1027, size: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !779, file: !337, line: 244, baseType: !580, size: 32, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !779, file: !337, line: 247, baseType: !580, size: 32, offset: 672)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !779, file: !337, line: 250, baseType: !580, size: 32, offset: 704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !779, file: !337, line: 253, baseType: !580, size: 32, offset: 736)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !337, line: 256, baseType: !580, size: 32, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !682, file: !664, line: 179, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !664, line: 150, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !664, line: 142, size: 320, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1074, !1075}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1066, file: !664, line: 144, baseType: !483, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1066, file: !664, line: 145, baseType: !661, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !664, line: 146, baseType: !661, size: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1066, file: !664, line: 147, baseType: !1072, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1073, line: 31, baseType: !580)
!1073 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1066, file: !664, line: 148, baseType: !7, size: 32, offset: 224)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1066, file: !664, line: 149, baseType: !603, size: 8, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !682, file: !664, line: 180, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !664, line: 162, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !664, line: 159, size: 128, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1079, file: !664, line: 160, baseType: !483, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1079, file: !664, line: 161, baseType: !539, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !682, file: !664, line: 181, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !664, line: 181, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !677, file: !664, line: 317, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 64, elements: !584)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !677, file: !664, line: 318, baseType: !1089, size: 320)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !664, line: 188, size: 320, elements: !1090)
!1090 = !{!1091, !1093, !1150}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1089, file: !664, line: 190, baseType: !1092, size: 192)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 192, elements: !557)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1089, file: !664, line: 193, baseType: !1094, size: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !664, line: 206, size: 320, elements: !1096)
!1096 = !{!1097, !1135, !1136, !1137, !1149}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1095, file: !664, line: 208, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !484, line: 62, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1101, line: 538, size: 256, elements: !1102)
!1101 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1102 = !{!1103, !1107, !1113, !1126}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !1101, line: 539, baseType: !1104, size: 32)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1101, line: 482, size: 32, elements: !1105)
!1105 = !{!1106}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !1101, line: 484, baseType: !7, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1100, file: !1101, line: 540, baseType: !1108, size: 192)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1101, line: 488, size: 192, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !1101, line: 489, baseType: !1104, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1108, file: !1101, line: 492, baseType: !687, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1108, file: !1101, line: 496, baseType: !483, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1100, file: !1101, line: 541, baseType: !1114, size: 256)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1101, line: 504, size: 256, elements: !1115)
!1115 = !{!1116, !1117, !1124, !1125}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !1101, line: 505, baseType: !1104, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1114, file: !1101, line: 509, baseType: !1118, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1101, line: 501, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{null, !1122}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1114, file: !1101, line: 510, baseType: !1122, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !1101, line: 513, baseType: !1098, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1100, file: !1101, line: 542, baseType: !1127, size: 128)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1101, line: 530, size: 128, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !1101, line: 531, baseType: !1104, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1127, file: !1101, line: 534, baseType: !1131, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1101, line: 525, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!603, !483, !687, !537, !537}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1095, file: !664, line: 211, baseType: !7, size: 32, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !664, line: 214, baseType: !539, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1095, file: !664, line: 224, baseType: !1138, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !664, line: 202, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !664, line: 202, size: 128, elements: !1141)
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1140, file: !664, line: 202, baseType: !1143, size: 128)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !664, line: 200, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !664, line: 200, size: 128, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1144, file: !664, line: 200, baseType: !7, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1144, file: !664, line: 200, baseType: !7, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1144, file: !664, line: 200, baseType: !697, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1095, file: !664, line: 234, baseType: !1138, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1089, file: !664, line: 197, baseType: !539, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !677, file: !664, line: 319, baseType: !546, size: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !677, file: !664, line: 320, baseType: !565, size: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !486, file: !135, line: 3384, baseType: !1154, size: 1472)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1155)
!1155 = !{!1156, !1177, !1178, !1179, !1180}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !135, line: 3115, baseType: !1157, size: 1216)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1157, file: !135, line: 2985, baseType: !657, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1157, file: !135, line: 2986, baseType: !483, size: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1157, file: !135, line: 2987, baseType: !483, size: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1157, file: !135, line: 2988, baseType: !483, size: 64, offset: 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1157, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1157, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1157, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1157, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1157, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1157, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1157, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1157, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1157, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1157, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1157, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1157, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1157, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1157, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1154, file: !135, line: 3117, baseType: !483, size: 64, offset: 1216)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1154, file: !135, line: 3119, baseType: !483, size: 64, offset: 1280)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1154, file: !135, line: 3121, baseType: !483, size: 64, offset: 1344)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1154, file: !135, line: 3123, baseType: !483, size: 64, offset: 1408)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !486, file: !135, line: 3385, baseType: !1182, size: 1088)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1182, file: !135, line: 2875, baseType: !657, size: 960)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1182, file: !135, line: 2876, baseType: !661, size: 64, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1182, file: !135, line: 2877, baseType: !1187, size: 64, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1189, line: 172, size: 128, elements: !1190)
!1189 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1188, file: !1189, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1188, file: !1189, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1188, file: !1189, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1188, file: !1189, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1188, file: !1189, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1188, file: !1189, line: 195, baseType: !7, size: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1188, file: !1189, line: 199, baseType: !483, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !486, file: !135, line: 3386, baseType: !1157, size: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !486, file: !135, line: 3387, baseType: !1200, size: 1280)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1201)
!1201 = !{!1202, !1203}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1200, file: !135, line: 3094, baseType: !1157, size: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1200, file: !135, line: 3095, baseType: !1187, size: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !486, file: !135, line: 3388, baseType: !1205, size: 1216)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !135, line: 2825, baseType: !619, size: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1205, file: !135, line: 2827, baseType: !483, size: 64, offset: 896)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1205, file: !135, line: 2828, baseType: !483, size: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1205, file: !135, line: 2829, baseType: !483, size: 64, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1205, file: !135, line: 2830, baseType: !483, size: 64, offset: 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1205, file: !135, line: 2831, baseType: !483, size: 64, offset: 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !486, file: !135, line: 3389, baseType: !1214, size: 1024)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !135, line: 2851, baseType: !657, size: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1214, file: !135, line: 2852, baseType: !580, size: 32, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1214, file: !135, line: 2853, baseType: !580, size: 32, offset: 992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !486, file: !135, line: 3390, baseType: !1220, size: 1024)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1220, file: !135, line: 2858, baseType: !657, size: 960)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1220, file: !135, line: 2859, baseType: !1187, size: 64, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !486, file: !135, line: 3391, baseType: !1225, size: 960)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1226)
!1226 = !{!1227}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1225, file: !135, line: 2863, baseType: !657, size: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !486, file: !135, line: 3392, baseType: !1229, size: 1472)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1230)
!1230 = !{!1231}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1229, file: !135, line: 3305, baseType: !1154, size: 1472)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !486, file: !135, line: 3393, baseType: !1233, size: 1792)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1234)
!1234 = !{!1235, !1236, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !135, line: 3249, baseType: !1154, size: 1472)
