; ModuleID = 'df-core.c'
source_filename = "df-core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }
%struct.df_problem = type { i32, i32, void (%struct.bitmap_head_def*)*, void (%struct.bitmap_head_def*)*, void (%struct.basic_block_def*, i8*)*, void (%struct.bitmap_head_def*)*, void (%struct.bitmap_head_def*)*, void (%struct.dataflow*, %struct.bitmap_head_def*, i32*, i32)*, void (%struct.basic_block_def*)*, void (%struct.edge_def*)*, i8 (i32)*, void (%struct.bitmap_head_def*)*, void ()*, void ()*, void (%struct._IO_FILE*)*, void (%struct.basic_block_def*, %struct._IO_FILE*)*, void (%struct.basic_block_def*, %struct._IO_FILE*)*, void ()*, void ()*, %struct.df_problem*, i32, i8 }

!689 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!690 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!691 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!692 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!693 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!694 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!695 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!696 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!697 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!698 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!699 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!700 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!701 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!702 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!703 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!704 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!705 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!706 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!707 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!708 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!709 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!710 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!711 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!712 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!713 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!714 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!715 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!716 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!717 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!718 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!719 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!720 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!721 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!722 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!723 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!724 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!725 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!726 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_type", file: !6, line: 81, baseType: !7, size: 32, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIEnumerator(name: "DF_REF_REG_DEF", value: 0, isUnsigned: true)
!730 = !DIEnumerator(name: "DF_REF_REG_USE", value: 1, isUnsigned: true)
!731 = !DIEnumerator(name: "DF_REF_REG_MEM_LOAD", value: 2, isUnsigned: true)
!732 = !DIEnumerator(name: "DF_REF_REG_MEM_STORE", value: 3, isUnsigned: true)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_flags", file: !6, line: 84, baseType: !7, size: 32, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!735 = !DIEnumerator(name: "DF_REF_CONDITIONAL", value: 1, isUnsigned: true)
!736 = !DIEnumerator(name: "DF_REF_AT_TOP", value: 2, isUnsigned: true)
!737 = !DIEnumerator(name: "DF_REF_IN_NOTE", value: 4, isUnsigned: true)
!738 = !DIEnumerator(name: "DF_HARD_REG_LIVE", value: 8, isUnsigned: true)
!739 = !DIEnumerator(name: "DF_REF_PARTIAL", value: 16, isUnsigned: true)
!740 = !DIEnumerator(name: "DF_REF_READ_WRITE", value: 32, isUnsigned: true)
!741 = !DIEnumerator(name: "DF_REF_MAY_CLOBBER", value: 64, isUnsigned: true)
!742 = !DIEnumerator(name: "DF_REF_MUST_CLOBBER", value: 128, isUnsigned: true)
!743 = !DIEnumerator(name: "DF_REF_SIGN_EXTRACT", value: 256, isUnsigned: true)
!744 = !DIEnumerator(name: "DF_REF_ZERO_EXTRACT", value: 512, isUnsigned: true)
!745 = !DIEnumerator(name: "DF_REF_STRICT_LOW_PART", value: 1024, isUnsigned: true)
!746 = !DIEnumerator(name: "DF_REF_SUBREG", value: 2048, isUnsigned: true)
!747 = !DIEnumerator(name: "DF_REF_MW_HARDREG", value: 4096, isUnsigned: true)
!748 = !DIEnumerator(name: "DF_REF_CALL_STACK_USAGE", value: 8192, isUnsigned: true)
!749 = !DIEnumerator(name: "DF_REF_REG_MARKER", value: 16384, isUnsigned: true)
!750 = !DIEnumerator(name: "DF_REF_PRE_POST_MODIFY", value: 32768, isUnsigned: true)
!751 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_class", file: !6, line: 76, baseType: !7, size: 32, elements: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DIEnumerator(name: "DF_REF_BASE", value: 0, isUnsigned: true)
!754 = !DIEnumerator(name: "DF_REF_ARTIFICIAL", value: 1, isUnsigned: true)
!755 = !DIEnumerator(name: "DF_REF_REGULAR", value: 2, isUnsigned: true)
!756 = !DIEnumerator(name: "DF_REF_EXTRACT", value: 3, isUnsigned: true)
!757 = !{!758, !830, !772, !1991, !1866, !1248, !584, !1992, !7, !790, !2105, !2106}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dataflow", file: !6, line: 289, size: 448, elements: !760)
!760 = !{!761, !1961, !1962, !1963, !1985, !1986, !1987, !1988, !1989, !1990}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "problem", scope: !759, file: !6, line: 291, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_problem", file: !6, line: 255, size: 1280, elements: !764)
!764 = !{!765, !766, !767, !839, !841, !1857, !1859, !1861, !1867, !1872, !1877, !1882, !1884, !1889, !1891, !1947, !1952, !1953, !1955, !1957, !1958, !1960}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !6, line: 258, baseType: !7, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !763, file: !6, line: 259, baseType: !5, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_fun", scope: !763, file: !6, line: 260, baseType: !768, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_alloc_function", file: !6, line: 197, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !772}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !773, line: 47, baseType: !774)
!773 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !776, line: 75, size: 256, elements: !777)
!776 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !793, !794, !795}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !775, file: !776, line: 76, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !776, line: 68, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !776, line: 63, size: 320, elements: !782)
!782 = !{!783, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !776, line: 64, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !776, line: 65, baseType: !784, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !781, file: !776, line: 66, baseType: !7, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !781, file: !776, line: 67, baseType: !788, size: 128, offset: 192)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !791)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !776, line: 29, baseType: !790)
!790 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!791 = !{!792}
!792 = !DISubrange(count: 2)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !775, file: !776, line: 77, baseType: !779, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !775, file: !776, line: 78, baseType: !7, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !775, file: !776, line: 79, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !776, line: 49, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !776, line: 45, size: 832, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !798, file: !776, line: 46, baseType: !784, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !798, file: !776, line: 47, baseType: !774, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !798, file: !776, line: 48, baseType: !803, size: 704, offset: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !804, line: 164, size: 704, elements: !805)
!804 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !{!806, !808, !820, !821, !822, !823, !824, !826, !831, !835, !836, !837, !838}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !803, file: !804, line: 166, baseType: !807, size: 64)
!807 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !803, file: !804, line: 167, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !804, line: 157, size: 192, elements: !811)
!811 = !{!812, !815, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !810, file: !804, line: 159, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !804, line: 160, baseType: !809, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !810, file: !804, line: 161, baseType: !817, size: 32, offset: 128)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 32, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 4)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !803, file: !804, line: 168, baseType: !813, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !803, file: !804, line: 169, baseType: !813, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !803, file: !804, line: 170, baseType: !813, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !803, file: !804, line: 171, baseType: !807, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !803, file: !804, line: 172, baseType: !825, size: 32, offset: 384)
!825 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !803, file: !804, line: 176, baseType: !827, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!809, !830, !807}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !803, file: !804, line: 177, baseType: !832, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !830, !809}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !803, file: !804, line: 178, baseType: !830, size: 64, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !803, file: !804, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !803, file: !804, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !803, file: !804, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reset_fun", scope: !763, file: !6, line: 261, baseType: !840, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_reset_function", file: !6, line: 205, baseType: !769)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "free_bb_fun", scope: !763, file: !6, line: 262, baseType: !842, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_free_bb_function", file: !6, line: 209, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !846, !830}
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !773, line: 111, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !141, line: 217, size: 832, elements: !849)
!849 = !{!850, !1822, !1823, !1824, !1827, !1831, !1832, !1833, !1851, !1852, !1853, !1854, !1855, !1856}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !848, file: !141, line: 219, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !141, line: 151, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !141, line: 151, size: 128, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !853, file: !141, line: 151, baseType: !856, size: 128)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !141, line: 150, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !141, line: 150, size: 128, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !857, file: !141, line: 150, baseType: !7, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !857, file: !141, line: 150, baseType: !7, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !857, file: !141, line: 150, baseType: !862, size: 64, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 64, elements: !913)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !773, line: 108, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !141, line: 122, size: 512, elements: !866)
!866 = !{!867, !868, !869, !1814, !1815, !1816, !1817, !1818, !1819, !1820}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !865, file: !141, line: 124, baseType: !847, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !865, file: !141, line: 125, baseType: !847, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !865, file: !141, line: 131, baseType: !870, size: 64, offset: 128)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !141, line: 128, size: 64, elements: !871)
!871 = !{!872, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !870, file: !141, line: 129, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !773, line: 66, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !773, line: 65, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !870, file: !141, line: 130, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !773, line: 50, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !585, line: 240, size: 384, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !879, file: !585, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !879, file: !585, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !879, file: !585, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !879, file: !585, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !879, file: !585, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !879, file: !585, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !879, file: !585, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !879, file: !585, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !879, file: !585, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !879, file: !585, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !879, file: !585, line: 321, baseType: !892, size: 320, offset: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !585, line: 315, size: 320, elements: !893)
!893 = !{!894, !1749, !1751, !1812, !1813}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !892, file: !585, line: 316, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 64, elements: !913)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !585, line: 183, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !585, line: 166, size: 64, elements: !898)
!898 = !{!899, !900, !901, !904, !905, !915, !916, !928, !931, !932, !1727, !1728, !1739, !1746}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !897, file: !585, line: 168, baseType: !825, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !897, file: !585, line: 169, baseType: !7, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !897, file: !585, line: 170, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !897, file: !585, line: 171, baseType: !877, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !897, file: !585, line: 172, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !773, line: 53, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !585, line: 359, size: 128, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !908, file: !585, line: 360, baseType: !825, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !908, file: !585, line: 361, baseType: !912, size: 64, offset: 64)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 64, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 1)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !897, file: !585, line: 173, baseType: !12, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !897, file: !585, line: 174, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !585, line: 133, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 115, size: 32, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !918, file: !585, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !918, file: !585, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !918, file: !585, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !918, file: !585, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !918, file: !585, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !918, file: !585, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !918, file: !585, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !918, file: !585, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !897, file: !585, line: 175, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !585, line: 175, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !897, file: !585, line: 176, baseType: !774, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !897, file: !585, line: 177, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !773, line: 56, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !157, line: 3371, size: 1792, elements: !936)
!936 = !{!937, !970, !976, !987, !1006, !1017, !1022, !1029, !1035, !1049, !1061, !1099, !1104, !1132, !1140, !1141, !1146, !1155, !1161, !1166, !1170, !1174, !1351, !1400, !1406, !1413, !1420, !1446, !1471, !1488, !1500, !1522, !1537, !1709}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !935, file: !157, line: 3372, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !157, line: 360, size: 64, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !938, file: !157, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !938, file: !157, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !938, file: !157, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !938, file: !157, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !938, file: !157, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !938, file: !157, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !938, file: !157, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !938, file: !157, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !938, file: !157, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !938, file: !157, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !938, file: !157, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !938, file: !157, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !938, file: !157, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !938, file: !157, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !938, file: !157, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !938, file: !157, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !938, file: !157, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !938, file: !157, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !938, file: !157, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !938, file: !157, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !938, file: !157, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !938, file: !157, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !938, file: !157, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !938, file: !157, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !938, file: !157, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !938, file: !157, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !938, file: !157, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !938, file: !157, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !938, file: !157, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !938, file: !157, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !935, file: !157, line: 3373, baseType: !971, size: 192)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !157, line: 402, size: 192, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !971, file: !157, line: 403, baseType: !938, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !971, file: !157, line: 404, baseType: !933, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !157, line: 405, baseType: !933, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !935, file: !157, line: 3374, baseType: !977, size: 320)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !157, line: 1384, size: 320, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !157, line: 1385, baseType: !971, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !977, file: !157, line: 1386, baseType: !981, size: 128, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !982, line: 58, baseType: !983)
!982 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !982, line: 54, size: 128, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !983, file: !982, line: 56, baseType: !790, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !983, file: !982, line: 57, baseType: !807, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !935, file: !157, line: 3375, baseType: !988, size: 256)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !157, line: 1397, size: 256, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !157, line: 1398, baseType: !971, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !988, file: !157, line: 1399, baseType: !992, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !994, line: 52, size: 256, elements: !995)
!994 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !993, file: !994, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !993, file: !994, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !993, file: !994, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !993, file: !994, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !993, file: !994, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !993, file: !994, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !993, file: !994, line: 62, baseType: !1003, size: 192, offset: 64)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 192, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 3)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !935, file: !157, line: 3376, baseType: !1007, size: 256)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !157, line: 1408, size: 256, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !157, line: 1409, baseType: !971, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1007, file: !157, line: 1410, baseType: !1011, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1013, line: 27, size: 192, elements: !1014)
!1013 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1012, file: !1013, line: 29, baseType: !981, size: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1012, file: !1013, line: 30, baseType: !12, size: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !935, file: !157, line: 3377, baseType: !1018, size: 256)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !157, line: 1437, size: 256, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1018, file: !157, line: 1438, baseType: !971, size: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1018, file: !157, line: 1439, baseType: !933, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !935, file: !157, line: 3378, baseType: !1023, size: 256)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !157, line: 1418, size: 256, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !157, line: 1419, baseType: !971, size: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1023, file: !157, line: 1420, baseType: !825, size: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1023, file: !157, line: 1421, baseType: !1028, size: 8, offset: 224)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 8, elements: !913)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !935, file: !157, line: 3379, baseType: !1030, size: 320)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !157, line: 1428, size: 320, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !157, line: 1429, baseType: !971, size: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1030, file: !157, line: 1430, baseType: !933, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1030, file: !157, line: 1431, baseType: !933, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !935, file: !157, line: 3380, baseType: !1036, size: 320)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !157, line: 1460, size: 320, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1036, file: !157, line: 1461, baseType: !971, size: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1036, file: !157, line: 1462, baseType: !1040, size: 128, offset: 192)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1041, line: 31, size: 128, elements: !1042)
!1041 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1042 = !{!1043, !1047, !1048}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1040, file: !1041, line: 32, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1040, file: !1041, line: 33, baseType: !7, size: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1040, file: !1041, line: 34, baseType: !7, size: 32, offset: 96)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !935, file: !157, line: 3381, baseType: !1050, size: 384)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !157, line: 2507, size: 384, elements: !1051)
!1051 = !{!1052, !1053, !1058, !1059, !1060}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !157, line: 2508, baseType: !971, size: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1050, file: !157, line: 2509, baseType: !1054, size: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1055, line: 58, baseType: !1056)
!1055 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1057, line: 44, baseType: !7)
!1057 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1050, file: !157, line: 2510, baseType: !7, size: 32, offset: 224)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1050, file: !157, line: 2511, baseType: !933, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1050, file: !157, line: 2512, baseType: !933, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !935, file: !157, line: 3382, baseType: !1062, size: 896)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !157, line: 2652, size: 896, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !157, line: 2653, baseType: !1050, size: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !157, line: 2654, baseType: !933, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1062, file: !157, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1062, file: !157, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1062, file: !157, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1062, file: !157, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1062, file: !157, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1062, file: !157, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1062, file: !157, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1062, file: !157, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1062, file: !157, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1062, file: !157, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1062, file: !157, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1062, file: !157, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1062, file: !157, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1062, file: !157, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1062, file: !157, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1062, file: !157, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1062, file: !157, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1062, file: !157, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1062, file: !157, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1062, file: !157, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1062, file: !157, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1062, file: !157, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1062, file: !157, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1062, file: !157, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1062, file: !157, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1062, file: !157, line: 2703, baseType: !7, size: 32, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1062, file: !157, line: 2705, baseType: !933, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1062, file: !157, line: 2706, baseType: !933, size: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1062, file: !157, line: 2707, baseType: !933, size: 64, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1062, file: !157, line: 2708, baseType: !933, size: 64, offset: 768)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1062, file: !157, line: 2711, baseType: !1097, size: 64, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !157, line: 2711, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !935, file: !157, line: 3383, baseType: !1100, size: 960)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !157, line: 2756, size: 960, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !157, line: 2757, baseType: !1062, size: 896)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1100, file: !157, line: 2758, baseType: !877, size: 64, offset: 896)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !935, file: !157, line: 3384, baseType: !1105, size: 1472)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !157, line: 3114, size: 1472, elements: !1106)
!1106 = !{!1107, !1128, !1129, !1130, !1131}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !157, line: 3115, baseType: !1108, size: 1216)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !157, line: 2984, size: 1216, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !157, line: 2985, baseType: !1100, size: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1108, file: !157, line: 2986, baseType: !933, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1108, file: !157, line: 2987, baseType: !933, size: 64, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1108, file: !157, line: 2988, baseType: !933, size: 64, offset: 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1108, file: !157, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1108, file: !157, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1108, file: !157, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1108, file: !157, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1108, file: !157, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1108, file: !157, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1108, file: !157, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1108, file: !157, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1108, file: !157, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1108, file: !157, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1108, file: !157, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1108, file: !157, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1108, file: !157, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1108, file: !157, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1105, file: !157, line: 3117, baseType: !933, size: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1105, file: !157, line: 3119, baseType: !933, size: 64, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1105, file: !157, line: 3121, baseType: !933, size: 64, offset: 1344)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1105, file: !157, line: 3123, baseType: !933, size: 64, offset: 1408)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !935, file: !157, line: 3385, baseType: !1133, size: 1088)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !157, line: 2874, size: 1088, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !157, line: 2875, baseType: !1100, size: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1133, file: !157, line: 2876, baseType: !877, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1133, file: !157, line: 2877, baseType: !1138, size: 64, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !157, line: 2856, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !935, file: !157, line: 3386, baseType: !1108, size: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !935, file: !157, line: 3387, baseType: !1142, size: 1280)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !157, line: 3093, size: 1280, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !157, line: 3094, baseType: !1108, size: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1142, file: !157, line: 3095, baseType: !1138, size: 64, offset: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !935, file: !157, line: 3388, baseType: !1147, size: 1216)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !157, line: 2824, size: 1216, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !157, line: 2825, baseType: !1062, size: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1147, file: !157, line: 2827, baseType: !933, size: 64, offset: 896)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1147, file: !157, line: 2828, baseType: !933, size: 64, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1147, file: !157, line: 2829, baseType: !933, size: 64, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1147, file: !157, line: 2830, baseType: !933, size: 64, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1147, file: !157, line: 2831, baseType: !933, size: 64, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !935, file: !157, line: 3389, baseType: !1156, size: 1024)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !157, line: 2850, size: 1024, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !157, line: 2851, baseType: !1100, size: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1156, file: !157, line: 2852, baseType: !825, size: 32, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1156, file: !157, line: 2853, baseType: !825, size: 32, offset: 992)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !935, file: !157, line: 3390, baseType: !1162, size: 1024)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !157, line: 2857, size: 1024, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !157, line: 2858, baseType: !1100, size: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1162, file: !157, line: 2859, baseType: !1138, size: 64, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !935, file: !157, line: 3391, baseType: !1167, size: 960)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !157, line: 2862, size: 960, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !157, line: 2863, baseType: !1100, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !935, file: !157, line: 3392, baseType: !1171, size: 1472)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !157, line: 3304, size: 1472, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !157, line: 3305, baseType: !1105, size: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !935, file: !157, line: 3393, baseType: !1175, size: 1792)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !157, line: 3248, size: 1792, elements: !1176)
!1176 = !{!1177, !1178, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1175, file: !157, line: 3249, baseType: !1105, size: 1472)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1175, file: !157, line: 3251, baseType: !1179, size: 64, offset: 1472)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1181, line: 463, size: 1152, elements: !1182)
!1181 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1182 = !{!1183, !1186, !1216, !1217, !1220, !1223, !1275, !1276, !1277, !1278, !1279, !1303, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1180, file: !1181, line: 464, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1181, line: 464, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1180, file: !1181, line: 467, baseType: !1187, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !141, line: 374, size: 640, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1205, !1206, !1207, !1208, !1209, !1210, !1212, !1214, !1215}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1188, file: !141, line: 377, baseType: !846, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1188, file: !141, line: 378, baseType: !846, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1188, file: !141, line: 381, baseType: !1193, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !141, line: 282, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !141, line: 282, size: 128, elements: !1196)
!1196 = !{!1197}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1195, file: !141, line: 282, baseType: !1198, size: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !141, line: 281, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !141, line: 281, size: 128, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1199, file: !141, line: 281, baseType: !7, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1199, file: !141, line: 281, baseType: !7, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1199, file: !141, line: 281, baseType: !1204, size: 64, offset: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 64, elements: !913)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1188, file: !141, line: 384, baseType: !825, size: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1188, file: !141, line: 387, baseType: !825, size: 32, offset: 224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1188, file: !141, line: 390, baseType: !825, size: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1188, file: !141, line: 394, baseType: !1193, size: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1188, file: !141, line: 396, baseType: !140, size: 32, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1188, file: !141, line: 399, baseType: !1211, size: 64, offset: 416)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !791)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1188, file: !141, line: 402, baseType: !1213, size: 64, offset: 480)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !791)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1188, file: !141, line: 406, baseType: !825, size: 32, offset: 544)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1188, file: !141, line: 409, baseType: !825, size: 32, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1180, file: !1181, line: 470, baseType: !874, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1180, file: !1181, line: 473, baseType: !1218, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1181, line: 166, flags: DIFlagFwdDecl)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1180, file: !1181, line: 476, baseType: !1221, size: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1181, line: 476, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1180, file: !1181, line: 479, baseType: !1224, size: 64, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1225, line: 144, baseType: !1226)
!1225 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1225, line: 100, size: 896, elements: !1228)
!1228 = !{!1229, !1237, !1242, !1247, !1249, !1252, !1253, !1254, !1255, !1256, !1261, !1263, !1264, !1269, !1274}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1227, file: !1225, line: 102, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1225, line: 52, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1225, line: 47, baseType: !7)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1227, file: !1225, line: 105, baseType: !1238, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1225, line: 59, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!825, !1235, !1235}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1227, file: !1225, line: 108, baseType: !1243, size: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1225, line: 63, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !830}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1227, file: !1225, line: 111, baseType: !1248, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !1225, line: 114, baseType: !1250, size: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1251, line: 46, baseType: !790)
!1251 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1227, file: !1225, line: 117, baseType: !1250, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1227, file: !1225, line: 120, baseType: !1250, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1227, file: !1225, line: 124, baseType: !7, size: 32, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1227, file: !1225, line: 128, baseType: !7, size: 32, offset: 480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1227, file: !1225, line: 131, baseType: !1257, size: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1225, line: 75, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!830, !1250, !1250}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1227, file: !1225, line: 132, baseType: !1262, size: 64, offset: 576)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1225, line: 78, baseType: !1244)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1227, file: !1225, line: 135, baseType: !830, size: 64, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1227, file: !1225, line: 136, baseType: !1265, size: 64, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1225, line: 82, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!830, !830, !1250, !1250}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1227, file: !1225, line: 137, baseType: !1270, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1225, line: 83, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !830, !830}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1227, file: !1225, line: 141, baseType: !7, size: 32, offset: 832)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1180, file: !1181, line: 484, baseType: !933, size: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1180, file: !1181, line: 488, baseType: !933, size: 64, offset: 448)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1180, file: !1181, line: 493, baseType: !933, size: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1180, file: !1181, line: 496, baseType: !933, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1180, file: !1181, line: 501, baseType: !1280, size: 64, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !152, line: 2355, size: 576, elements: !1282)
!1282 = !{!1283, !1286, !1287, !1288, !1289, !1291, !1292, !1297, !1298, !1299, !1300, !1301, !1302}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1281, file: !152, line: 2356, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !152, line: 2356, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1281, file: !152, line: 2357, baseType: !902, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1281, file: !152, line: 2358, baseType: !825, size: 32, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1281, file: !152, line: 2359, baseType: !825, size: 32, offset: 160)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1281, file: !152, line: 2360, baseType: !1290, size: 128, offset: 192)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 128, elements: !818)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1281, file: !152, line: 2364, baseType: !825, size: 32, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1281, file: !152, line: 2367, baseType: !1293, size: 128, offset: 384)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !152, line: 2349, size: 128, elements: !1294)
!1294 = !{!1295, !1296}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1293, file: !152, line: 2351, baseType: !877, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1293, file: !152, line: 2352, baseType: !807, size: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1281, file: !152, line: 2371, baseType: !151, size: 32, offset: 512)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1281, file: !152, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1281, file: !152, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1281, file: !152, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1281, file: !152, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1281, file: !152, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1180, file: !1181, line: 504, baseType: !1304, size: 64, offset: 704)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1181, line: 504, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1180, file: !1181, line: 507, baseType: !1224, size: 64, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1180, file: !1181, line: 510, baseType: !825, size: 32, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1180, file: !1181, line: 513, baseType: !825, size: 32, offset: 864)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1180, file: !1181, line: 516, baseType: !1054, size: 32, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1180, file: !1181, line: 519, baseType: !1054, size: 32, offset: 928)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1180, file: !1181, line: 522, baseType: !7, size: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1180, file: !1181, line: 523, baseType: !7, size: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1180, file: !1181, line: 528, baseType: !902, size: 64, offset: 1024)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1180, file: !1181, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1180, file: !1181, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1180, file: !1181, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1180, file: !1181, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1180, file: !1181, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1180, file: !1181, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1180, file: !1181, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1180, file: !1181, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1180, file: !1181, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1180, file: !1181, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1180, file: !1181, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1180, file: !1181, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1180, file: !1181, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1180, file: !1181, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1180, file: !1181, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1180, file: !1181, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1175, file: !157, line: 3254, baseType: !933, size: 64, offset: 1536)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1175, file: !157, line: 3257, baseType: !933, size: 64, offset: 1600)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1175, file: !157, line: 3258, baseType: !933, size: 64, offset: 1664)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1175, file: !157, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1175, file: !157, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1175, file: !157, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1175, file: !157, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1175, file: !157, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1175, file: !157, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1175, file: !157, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1175, file: !157, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1175, file: !157, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1175, file: !157, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1175, file: !157, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1175, file: !157, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1175, file: !157, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1175, file: !157, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1175, file: !157, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1175, file: !157, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1175, file: !157, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1175, file: !157, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !157, line: 3394, baseType: !1352, size: 1344)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !157, line: 2279, size: 1344, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1379, !1380, !1381, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1352, file: !157, line: 2280, baseType: !971, size: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1352, file: !157, line: 2281, baseType: !933, size: 64, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1352, file: !157, line: 2282, baseType: !933, size: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1352, file: !157, line: 2283, baseType: !933, size: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1352, file: !157, line: 2284, baseType: !933, size: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1352, file: !157, line: 2285, baseType: !7, size: 32, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1352, file: !157, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1352, file: !157, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1352, file: !157, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1352, file: !157, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1352, file: !157, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1352, file: !157, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1352, file: !157, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1352, file: !157, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1352, file: !157, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1352, file: !157, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1352, file: !157, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1352, file: !157, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1352, file: !157, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1352, file: !157, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1352, file: !157, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1352, file: !157, line: 2305, baseType: !7, size: 32, offset: 512)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1352, file: !157, line: 2306, baseType: !1377, size: 32, offset: 544)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1378, line: 31, baseType: !825)
!1378 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1352, file: !157, line: 2307, baseType: !933, size: 64, offset: 576)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1352, file: !157, line: 2308, baseType: !933, size: 64, offset: 640)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1352, file: !157, line: 2314, baseType: !1382, size: 64, offset: 704)
!1382 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !157, line: 2309, size: 64, elements: !1383)
!1383 = !{!1384, !1385, !1386}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1382, file: !157, line: 2310, baseType: !825, size: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1382, file: !157, line: 2311, baseType: !902, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1382, file: !157, line: 2312, baseType: !1387, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !157, line: 2277, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1352, file: !157, line: 2315, baseType: !933, size: 64, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1352, file: !157, line: 2316, baseType: !933, size: 64, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1352, file: !157, line: 2317, baseType: !933, size: 64, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1352, file: !157, line: 2318, baseType: !933, size: 64, offset: 960)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1352, file: !157, line: 2319, baseType: !933, size: 64, offset: 1024)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1352, file: !157, line: 2320, baseType: !933, size: 64, offset: 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1352, file: !157, line: 2321, baseType: !933, size: 64, offset: 1152)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1352, file: !157, line: 2322, baseType: !933, size: 64, offset: 1216)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1352, file: !157, line: 2324, baseType: !1398, size: 64, offset: 1280)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !157, line: 2324, flags: DIFlagFwdDecl)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !935, file: !157, line: 3395, baseType: !1401, size: 320)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !157, line: 1469, size: 320, elements: !1402)
!1402 = !{!1403, !1404, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1401, file: !157, line: 1470, baseType: !971, size: 192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1401, file: !157, line: 1471, baseType: !933, size: 64, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1401, file: !157, line: 1472, baseType: !933, size: 64, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !935, file: !157, line: 3396, baseType: !1407, size: 320)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !157, line: 1482, size: 320, elements: !1408)
!1408 = !{!1409, !1410, !1411}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1407, file: !157, line: 1483, baseType: !971, size: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1407, file: !157, line: 1484, baseType: !825, size: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1407, file: !157, line: 1485, baseType: !1412, size: 64, offset: 256)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 64, elements: !913)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !935, file: !157, line: 3397, baseType: !1414, size: 384)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !157, line: 1829, size: 384, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1414, file: !157, line: 1830, baseType: !971, size: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1414, file: !157, line: 1831, baseType: !1054, size: 32, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1414, file: !157, line: 1832, baseType: !933, size: 64, offset: 256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1414, file: !157, line: 1835, baseType: !1412, size: 64, offset: 320)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !935, file: !157, line: 3398, baseType: !1421, size: 704)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !157, line: 1898, size: 704, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1429, !1430, !1433}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1421, file: !157, line: 1899, baseType: !971, size: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1421, file: !157, line: 1902, baseType: !933, size: 64, offset: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1421, file: !157, line: 1905, baseType: !1426, size: 64, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !773, line: 58, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !773, line: 57, flags: DIFlagFwdDecl)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1421, file: !157, line: 1908, baseType: !7, size: 32, offset: 320)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1421, file: !157, line: 1911, baseType: !1431, size: 64, offset: 384)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !157, line: 1876, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1421, file: !157, line: 1914, baseType: !1434, size: 256, offset: 448)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !157, line: 1883, size: 256, elements: !1435)
!1435 = !{!1436, !1438, !1439, !1444}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1434, file: !157, line: 1884, baseType: !1437, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1434, file: !157, line: 1885, baseType: !1437, size: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1434, file: !157, line: 1891, baseType: !1440, size: 64, offset: 128)
!1440 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1434, file: !157, line: 1891, size: 64, elements: !1441)
!1441 = !{!1442, !1443}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1440, file: !157, line: 1891, baseType: !1426, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1440, file: !157, line: 1891, baseType: !933, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1434, file: !157, line: 1892, baseType: !1445, size: 64, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !935, file: !157, line: 3399, baseType: !1447, size: 704)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !157, line: 2008, size: 704, elements: !1448)
!1448 = !{!1449, !1450, !1451, !1452, !1453, !1454, !1466, !1467, !1468, !1469, !1470}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1447, file: !157, line: 2009, baseType: !971, size: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1447, file: !157, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1447, file: !157, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1447, file: !157, line: 2014, baseType: !1054, size: 32, offset: 224)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1447, file: !157, line: 2016, baseType: !933, size: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1447, file: !157, line: 2017, baseType: !1455, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !157, line: 183, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !157, line: 183, size: 128, elements: !1458)
!1458 = !{!1459}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1457, file: !157, line: 183, baseType: !1460, size: 128)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !157, line: 182, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !157, line: 182, size: 128, elements: !1462)
!1462 = !{!1463, !1464, !1465}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1461, file: !157, line: 182, baseType: !7, size: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1461, file: !157, line: 182, baseType: !7, size: 32, offset: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1461, file: !157, line: 182, baseType: !1412, size: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1447, file: !157, line: 2019, baseType: !933, size: 64, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1447, file: !157, line: 2020, baseType: !933, size: 64, offset: 448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1447, file: !157, line: 2021, baseType: !933, size: 64, offset: 512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1447, file: !157, line: 2022, baseType: !933, size: 64, offset: 576)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1447, file: !157, line: 2023, baseType: !933, size: 64, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !935, file: !157, line: 3400, baseType: !1472, size: 832)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !157, line: 2430, size: 832, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1472, file: !157, line: 2431, baseType: !971, size: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1472, file: !157, line: 2433, baseType: !933, size: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1472, file: !157, line: 2434, baseType: !933, size: 64, offset: 256)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1472, file: !157, line: 2435, baseType: !933, size: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1472, file: !157, line: 2436, baseType: !933, size: 64, offset: 384)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1472, file: !157, line: 2437, baseType: !1455, size: 64, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1472, file: !157, line: 2438, baseType: !933, size: 64, offset: 512)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1472, file: !157, line: 2440, baseType: !933, size: 64, offset: 576)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1472, file: !157, line: 2441, baseType: !933, size: 64, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1472, file: !157, line: 2443, baseType: !1484, size: 128, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !157, line: 182, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !157, line: 182, size: 128, elements: !1486)
!1486 = !{!1487}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1485, file: !157, line: 182, baseType: !1460, size: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !935, file: !157, line: 3401, baseType: !1489, size: 320)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !157, line: 3327, size: 320, elements: !1490)
!1490 = !{!1491, !1492, !1499}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1489, file: !157, line: 3329, baseType: !971, size: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1489, file: !157, line: 3330, baseType: !1493, size: 64, offset: 192)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !157, line: 3320, size: 192, elements: !1495)
!1495 = !{!1496, !1497, !1498}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1494, file: !157, line: 3322, baseType: !1493, size: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1494, file: !157, line: 3323, baseType: !1493, size: 64, offset: 64)
