; ModuleID = 'rtlhooks.c'
source_filename = "rtlhooks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_hooks = type { %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i64, i64*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i32, i32*)*, i8 (i32, %struct.rtx_def*)* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.mem_attrs = type { %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, i32, i32, i8 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }

!470 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!471 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!472 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!473 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!474 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!475 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!476 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!477 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!478 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!479 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!480 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!481 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!482 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!483 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!484 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!485 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!486 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!487 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!488 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!489 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!490 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!491 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!492 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!493 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!494 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!495 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!496 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!497 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!498 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!499 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!500 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!501 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!502 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!503 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!504 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!505 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!506 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!507 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!508 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !510, line: 36, baseType: !7, size: 32, elements: !511)
!510 = !DIFile(filename: "./machmode.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!512 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!513 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!514 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!515 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!516 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!517 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!518 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!519 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!520 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!521 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!522 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!523 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!524 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!525 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!526 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!527 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!528 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!529 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!530 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!531 = !{!366, !532, !5, !509}
!532 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!533 = !{!0, !534}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "rtl_hooks", scope: !2, file: !3, line: 37, type: !536, isLocal: false, isDefinition: true)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_hooks", file: !367, line: 2441, size: 320, elements: !537)
!537 = !{!538, !1435, !1436, !1444, !1449}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gen_lowpart", scope: !536, file: !367, line: 2443, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !5, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !543, line: 50, baseType: !544)
!543 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !367, line: 240, size: 384, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !545, file: !367, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !545, file: !367, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !545, file: !367, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !545, file: !367, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !545, file: !367, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !545, file: !367, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !545, file: !367, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !545, file: !367, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !545, file: !367, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !545, file: !367, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !545, file: !367, line: 321, baseType: !558, size: 320, offset: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !367, line: 315, size: 320, elements: !559)
!559 = !{!560, !1402, !1404, !1433, !1434}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !558, file: !367, line: 316, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 64, elements: !581)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !367, line: 183, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !367, line: 166, size: 64, elements: !564)
!564 = !{!565, !567, !568, !572, !573, !583, !584, !596, !599, !602, !1378, !1381, !1392, !1399}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !563, file: !367, line: 168, baseType: !566, size: 32)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !563, file: !367, line: 169, baseType: !7, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !563, file: !367, line: 170, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !563, file: !367, line: 171, baseType: !542, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !563, file: !367, line: 172, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !543, line: 53, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !367, line: 359, size: 128, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !576, file: !367, line: 360, baseType: !566, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !576, file: !367, line: 361, baseType: !580, size: 64, offset: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 64, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 1)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !563, file: !367, line: 173, baseType: !5, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !563, file: !367, line: 174, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !367, line: 133, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 115, size: 32, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !586, file: !367, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !586, file: !367, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !586, file: !367, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !586, file: !367, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !586, file: !367, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !586, file: !367, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !586, file: !367, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !586, file: !367, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !563, file: !367, line: 175, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !367, line: 175, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !563, file: !367, line: 176, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !543, line: 46, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !563, file: !367, line: 177, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !543, line: 56, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !606)
!606 = !{!607, !640, !646, !659, !678, !689, !694, !701, !707, !721, !733, !771, !776, !804, !812, !813, !818, !827, !833, !838, !842, !846, !1001, !1050, !1056, !1063, !1070, !1096, !1121, !1138, !1150, !1172, !1188, !1360}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !605, file: !140, line: 3372, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !608, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !608, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !608, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !608, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !608, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !608, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !608, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !608, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !608, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !608, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !608, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !608, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !608, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !608, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !608, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !608, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !608, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !608, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !608, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !608, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !608, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !608, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !608, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !608, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !608, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !608, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !608, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !608, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !608, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !608, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !140, line: 3373, baseType: !641, size: 192)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !641, file: !140, line: 403, baseType: !608, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !641, file: !140, line: 404, baseType: !603, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !140, line: 405, baseType: !603, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !605, file: !140, line: 3374, baseType: !647, size: 320)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !647, file: !140, line: 1385, baseType: !641, size: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !647, file: !140, line: 1386, baseType: !651, size: 128, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !652, line: 58, baseType: !653)
!652 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 54, size: 128, elements: !654)
!654 = !{!655, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !653, file: !652, line: 56, baseType: !656, size: 64)
!656 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !653, file: !652, line: 57, baseType: !658, size: 64, offset: 64)
!658 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !605, file: !140, line: 3375, baseType: !660, size: 256)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !660, file: !140, line: 1398, baseType: !641, size: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !660, file: !140, line: 1399, baseType: !664, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !666, line: 52, size: 256, elements: !667)
!666 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!667 = !{!668, !669, !670, !671, !672, !673, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !665, file: !666, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !665, file: !666, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !665, file: !666, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !665, file: !666, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !665, file: !666, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !665, file: !666, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !665, file: !666, line: 62, baseType: !675, size: 192, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 192, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 3)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !605, file: !140, line: 3376, baseType: !679, size: 256)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !679, file: !140, line: 1409, baseType: !641, size: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !679, file: !140, line: 1410, baseType: !683, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !685, line: 27, size: 192, elements: !686)
!685 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !684, file: !685, line: 29, baseType: !651, size: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !684, file: !685, line: 30, baseType: !5, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !605, file: !140, line: 3377, baseType: !690, size: 256)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !140, line: 1438, baseType: !641, size: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !690, file: !140, line: 1439, baseType: !603, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !605, file: !140, line: 3378, baseType: !695, size: 256)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !140, line: 1419, baseType: !641, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !695, file: !140, line: 1420, baseType: !566, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !695, file: !140, line: 1421, baseType: !700, size: 8, offset: 224)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 8, elements: !581)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !605, file: !140, line: 3379, baseType: !702, size: 320)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !702, file: !140, line: 1429, baseType: !641, size: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !702, file: !140, line: 1430, baseType: !603, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !702, file: !140, line: 1431, baseType: !603, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !605, file: !140, line: 3380, baseType: !708, size: 320)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !140, line: 1461, baseType: !641, size: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !708, file: !140, line: 1462, baseType: !712, size: 128, offset: 192)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !713, line: 31, size: 128, elements: !714)
!713 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!714 = !{!715, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !712, file: !713, line: 32, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !712, file: !713, line: 33, baseType: !7, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !712, file: !713, line: 34, baseType: !7, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !605, file: !140, line: 3381, baseType: !722, size: 384)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !723)
!723 = !{!724, !725, !730, !731, !732}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !140, line: 2508, baseType: !641, size: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !722, file: !140, line: 2509, baseType: !726, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !727, line: 58, baseType: !728)
!727 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !729, line: 44, baseType: !7)
!729 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!730 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !722, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !722, file: !140, line: 2511, baseType: !603, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !722, file: !140, line: 2512, baseType: !603, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !605, file: !140, line: 3382, baseType: !734, size: 896)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !140, line: 2653, baseType: !722, size: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !734, file: !140, line: 2654, baseType: !603, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !734, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !734, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !734, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !734, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !734, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !734, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !734, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !734, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !734, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !734, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !734, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !734, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !734, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !734, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !734, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !734, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !734, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !734, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !734, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !734, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !734, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !734, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !734, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !734, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !734, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !734, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !734, file: !140, line: 2705, baseType: !603, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !734, file: !140, line: 2706, baseType: !603, size: 64, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !734, file: !140, line: 2707, baseType: !603, size: 64, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !734, file: !140, line: 2708, baseType: !603, size: 64, offset: 768)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !734, file: !140, line: 2711, baseType: !769, size: 64, offset: 832)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !605, file: !140, line: 3383, baseType: !772, size: 960)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !140, line: 2757, baseType: !734, size: 896)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !772, file: !140, line: 2758, baseType: !542, size: 64, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !605, file: !140, line: 3384, baseType: !777, size: 1472)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !778)
!778 = !{!779, !800, !801, !802, !803}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !140, line: 3115, baseType: !780, size: 1216)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !780, file: !140, line: 2985, baseType: !772, size: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !780, file: !140, line: 2986, baseType: !603, size: 64, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !780, file: !140, line: 2987, baseType: !603, size: 64, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !780, file: !140, line: 2988, baseType: !603, size: 64, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !780, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !780, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !780, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !780, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !780, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !780, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !780, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !780, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !780, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !780, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !780, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !780, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !780, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !780, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !777, file: !140, line: 3117, baseType: !603, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !777, file: !140, line: 3119, baseType: !603, size: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !777, file: !140, line: 3121, baseType: !603, size: 64, offset: 1344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !777, file: !140, line: 3123, baseType: !603, size: 64, offset: 1408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !605, file: !140, line: 3385, baseType: !805, size: 1088)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !140, line: 2875, baseType: !772, size: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !805, file: !140, line: 2876, baseType: !542, size: 64, offset: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !805, file: !140, line: 2877, baseType: !810, size: 64, offset: 1024)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !605, file: !140, line: 3386, baseType: !780, size: 1216)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !605, file: !140, line: 3387, baseType: !814, size: 1280)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !140, line: 3094, baseType: !780, size: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !814, file: !140, line: 3095, baseType: !810, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !605, file: !140, line: 3388, baseType: !819, size: 1216)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !140, line: 2825, baseType: !734, size: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !819, file: !140, line: 2827, baseType: !603, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !819, file: !140, line: 2828, baseType: !603, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !819, file: !140, line: 2829, baseType: !603, size: 64, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !819, file: !140, line: 2830, baseType: !603, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !819, file: !140, line: 2831, baseType: !603, size: 64, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !605, file: !140, line: 3389, baseType: !828, size: 1024)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !140, line: 2851, baseType: !772, size: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !828, file: !140, line: 2852, baseType: !566, size: 32, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !828, file: !140, line: 2853, baseType: !566, size: 32, offset: 992)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !605, file: !140, line: 3390, baseType: !834, size: 1024)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !140, line: 2858, baseType: !772, size: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !834, file: !140, line: 2859, baseType: !810, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !605, file: !140, line: 3391, baseType: !839, size: 960)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !140, line: 2863, baseType: !772, size: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !605, file: !140, line: 3392, baseType: !843, size: 1472)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !140, line: 3305, baseType: !777, size: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !605, file: !140, line: 3393, baseType: !847, size: 1792)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !848)
!848 = !{!849, !850, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !140, line: 3249, baseType: !777, size: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !847, file: !140, line: 3251, baseType: !851, size: 64, offset: 1472)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !853, line: 463, size: 1152, elements: !854)
!853 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!854 = !{!855, !858, !861, !864, !867, !870, !923, !924, !925, !926, !927, !953, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !852, file: !853, line: 464, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !853, line: 464, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !852, file: !853, line: 467, baseType: !859, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !853, line: 467, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !852, file: !853, line: 470, baseType: !862, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !543, line: 65, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !852, file: !853, line: 473, baseType: !865, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !853, line: 166, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !852, file: !853, line: 476, baseType: !868, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !853, line: 476, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !852, file: !853, line: 479, baseType: !871, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !872, line: 144, baseType: !873)
!872 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !872, line: 100, size: 896, elements: !875)
!875 = !{!876, !884, !889, !895, !897, !900, !901, !902, !903, !904, !909, !911, !912, !917, !922}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !874, file: !872, line: 102, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !872, line: 52, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !872, line: 47, baseType: !7)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !874, file: !872, line: 105, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !872, line: 59, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!566, !882, !882}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !874, file: !872, line: 108, baseType: !890, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !872, line: 63, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !874, file: !872, line: 111, baseType: !896, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !874, file: !872, line: 114, baseType: !898, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !899, line: 46, baseType: !656)
!899 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!900 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !874, file: !872, line: 117, baseType: !898, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !874, file: !872, line: 120, baseType: !898, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !874, file: !872, line: 124, baseType: !7, size: 32, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !874, file: !872, line: 128, baseType: !7, size: 32, offset: 480)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !874, file: !872, line: 131, baseType: !905, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !872, line: 75, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!894, !898, !898}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !874, file: !872, line: 132, baseType: !910, size: 64, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !872, line: 78, baseType: !891)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !874, file: !872, line: 135, baseType: !894, size: 64, offset: 640)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !874, file: !872, line: 136, baseType: !913, size: 64, offset: 704)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !872, line: 82, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!894, !894, !898, !898}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !874, file: !872, line: 137, baseType: !918, size: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !872, line: 83, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !894, !894}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !874, file: !872, line: 141, baseType: !7, size: 32, offset: 832)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !852, file: !853, line: 484, baseType: !603, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !852, file: !853, line: 488, baseType: !603, size: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !852, file: !853, line: 493, baseType: !603, size: 64, offset: 512)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !852, file: !853, line: 496, baseType: !603, size: 64, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !852, file: !853, line: 501, baseType: !928, size: 64, offset: 640)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !930)
!930 = !{!931, !934, !935, !936, !937, !941, !942, !947, !948, !949, !950, !951, !952}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !929, file: !135, line: 2356, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !929, file: !135, line: 2357, baseType: !569, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !929, file: !135, line: 2358, baseType: !566, size: 32, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !929, file: !135, line: 2359, baseType: !566, size: 32, offset: 160)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !929, file: !135, line: 2360, baseType: !938, size: 128, offset: 192)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 4)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !929, file: !135, line: 2364, baseType: !566, size: 32, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !929, file: !135, line: 2367, baseType: !943, size: 128, offset: 384)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !943, file: !135, line: 2351, baseType: !542, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !943, file: !135, line: 2352, baseType: !658, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !929, file: !135, line: 2371, baseType: !134, size: 32, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !929, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !929, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !929, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !929, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !929, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !852, file: !853, line: 504, baseType: !954, size: 64, offset: 704)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !853, line: 504, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !852, file: !853, line: 507, baseType: !871, size: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !852, file: !853, line: 510, baseType: !566, size: 32, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !852, file: !853, line: 513, baseType: !566, size: 32, offset: 864)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !852, file: !853, line: 516, baseType: !726, size: 32, offset: 896)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !852, file: !853, line: 519, baseType: !726, size: 32, offset: 928)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !852, file: !853, line: 522, baseType: !7, size: 32, offset: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !852, file: !853, line: 523, baseType: !7, size: 32, offset: 992)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !852, file: !853, line: 528, baseType: !569, size: 64, offset: 1024)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !852, file: !853, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !852, file: !853, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !852, file: !853, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !852, file: !853, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !852, file: !853, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !852, file: !853, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !852, file: !853, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !852, file: !853, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !852, file: !853, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !852, file: !853, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !852, file: !853, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !852, file: !853, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !852, file: !853, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !852, file: !853, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !852, file: !853, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !852, file: !853, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !847, file: !140, line: 3254, baseType: !603, size: 64, offset: 1536)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !847, file: !140, line: 3257, baseType: !603, size: 64, offset: 1600)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !847, file: !140, line: 3258, baseType: !603, size: 64, offset: 1664)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !847, file: !140, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !847, file: !140, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !847, file: !140, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !847, file: !140, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !847, file: !140, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !847, file: !140, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !847, file: !140, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !847, file: !140, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !847, file: !140, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !847, file: !140, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !847, file: !140, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !847, file: !140, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !847, file: !140, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !847, file: !140, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !847, file: !140, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !847, file: !140, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !847, file: !140, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !847, file: !140, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !140, line: 3394, baseType: !1002, size: 1344)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !140, line: 2279, size: 1344, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1029, !1030, !1031, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !140, line: 2280, baseType: !641, size: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1002, file: !140, line: 2281, baseType: !603, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1002, file: !140, line: 2282, baseType: !603, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1002, file: !140, line: 2283, baseType: !603, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1002, file: !140, line: 2284, baseType: !603, size: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1002, file: !140, line: 2285, baseType: !7, size: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1002, file: !140, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1002, file: !140, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1002, file: !140, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1002, file: !140, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1002, file: !140, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1002, file: !140, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1002, file: !140, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1002, file: !140, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1002, file: !140, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1002, file: !140, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1002, file: !140, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1002, file: !140, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1002, file: !140, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1002, file: !140, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1002, file: !140, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1002, file: !140, line: 2305, baseType: !7, size: 32, offset: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1002, file: !140, line: 2306, baseType: !1027, size: 32, offset: 544)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1028, line: 31, baseType: !566)
!1028 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1002, file: !140, line: 2307, baseType: !603, size: 64, offset: 576)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1002, file: !140, line: 2308, baseType: !603, size: 64, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1002, file: !140, line: 2314, baseType: !1032, size: 64, offset: 704)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !140, line: 2309, size: 64, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1032, file: !140, line: 2310, baseType: !566, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1032, file: !140, line: 2311, baseType: !569, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1032, file: !140, line: 2312, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !140, line: 2277, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !140, line: 2315, baseType: !603, size: 64, offset: 768)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1002, file: !140, line: 2316, baseType: !603, size: 64, offset: 832)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1002, file: !140, line: 2317, baseType: !603, size: 64, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1002, file: !140, line: 2318, baseType: !603, size: 64, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1002, file: !140, line: 2319, baseType: !603, size: 64, offset: 1024)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1002, file: !140, line: 2320, baseType: !603, size: 64, offset: 1088)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1002, file: !140, line: 2321, baseType: !603, size: 64, offset: 1152)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1002, file: !140, line: 2322, baseType: !603, size: 64, offset: 1216)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1002, file: !140, line: 2324, baseType: !1048, size: 64, offset: 1280)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !140, line: 2324, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !605, file: !140, line: 3395, baseType: !1051, size: 320)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !140, line: 1469, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1051, file: !140, line: 1470, baseType: !641, size: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1051, file: !140, line: 1471, baseType: !603, size: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1051, file: !140, line: 1472, baseType: !603, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !605, file: !140, line: 3396, baseType: !1057, size: 320)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !140, line: 1482, size: 320, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1057, file: !140, line: 1483, baseType: !641, size: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1057, file: !140, line: 1484, baseType: !566, size: 32, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1057, file: !140, line: 1485, baseType: !1062, size: 64, offset: 256)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 64, elements: !581)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !605, file: !140, line: 3397, baseType: !1064, size: 384)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !140, line: 1829, size: 384, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !140, line: 1830, baseType: !641, size: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1064, file: !140, line: 1831, baseType: !726, size: 32, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1064, file: !140, line: 1832, baseType: !603, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1064, file: !140, line: 1835, baseType: !1062, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !605, file: !140, line: 3398, baseType: !1071, size: 704)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !140, line: 1898, size: 704, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1079, !1080, !1083}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !140, line: 1899, baseType: !641, size: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1071, file: !140, line: 1902, baseType: !603, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1071, file: !140, line: 1905, baseType: !1076, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !543, line: 58, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !543, line: 57, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1071, file: !140, line: 1908, baseType: !7, size: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1071, file: !140, line: 1911, baseType: !1081, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !140, line: 1876, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1071, file: !140, line: 1914, baseType: !1084, size: 256, offset: 448)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !1085)
!1085 = !{!1086, !1088, !1089, !1094}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1084, file: !140, line: 1884, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1084, file: !140, line: 1885, baseType: !1087, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1084, file: !140, line: 1891, baseType: !1090, size: 64, offset: 128)
!1090 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1084, file: !140, line: 1891, size: 64, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1090, file: !140, line: 1891, baseType: !1076, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1090, file: !140, line: 1891, baseType: !603, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1084, file: !140, line: 1892, baseType: !1095, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !605, file: !140, line: 3399, baseType: !1097, size: 704)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !140, line: 2008, size: 704, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1116, !1117, !1118, !1119, !1120}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !140, line: 2009, baseType: !641, size: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1097, file: !140, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1097, file: !140, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1097, file: !140, line: 2014, baseType: !726, size: 32, offset: 224)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1097, file: !140, line: 2016, baseType: !603, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1097, file: !140, line: 2017, baseType: !1105, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !1108)
!1108 = !{!1109}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1107, file: !140, line: 183, baseType: !1110, size: 128)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1111, file: !140, line: 182, baseType: !7, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1111, file: !140, line: 182, baseType: !7, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1111, file: !140, line: 182, baseType: !1062, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1097, file: !140, line: 2019, baseType: !603, size: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1097, file: !140, line: 2020, baseType: !603, size: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1097, file: !140, line: 2021, baseType: !603, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1097, file: !140, line: 2022, baseType: !603, size: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1097, file: !140, line: 2023, baseType: !603, size: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !605, file: !140, line: 3400, baseType: !1122, size: 832)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !140, line: 2430, size: 832, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !140, line: 2431, baseType: !641, size: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1122, file: !140, line: 2433, baseType: !603, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1122, file: !140, line: 2434, baseType: !603, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1122, file: !140, line: 2435, baseType: !603, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1122, file: !140, line: 2436, baseType: !603, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1122, file: !140, line: 2437, baseType: !1105, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1122, file: !140, line: 2438, baseType: !603, size: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1122, file: !140, line: 2440, baseType: !603, size: 64, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1122, file: !140, line: 2441, baseType: !603, size: 64, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1122, file: !140, line: 2443, baseType: !1134, size: 128, offset: 704)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !140, line: 182, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !140, line: 182, size: 128, elements: !1136)
!1136 = !{!1137}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1135, file: !140, line: 182, baseType: !1110, size: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !605, file: !140, line: 3401, baseType: !1139, size: 320)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !140, line: 3327, size: 320, elements: !1140)
!1140 = !{!1141, !1142, !1149}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !140, line: 3329, baseType: !641, size: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1139, file: !140, line: 3330, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !140, line: 3320, size: 192, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1144, file: !140, line: 3322, baseType: !1143, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !140, line: 3323, baseType: !1143, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1144, file: !140, line: 3324, baseType: !603, size: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1139, file: !140, line: 3331, baseType: !1143, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !605, file: !140, line: 3402, baseType: !1151, size: 256)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !140, line: 1540, size: 256, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1151, file: !140, line: 1541, baseType: !641, size: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1151, file: !140, line: 1542, baseType: !1155, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !140, line: 1538, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !140, line: 1538, size: 192, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1157, file: !140, line: 1538, baseType: !1160, size: 192)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !140, line: 1537, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !140, line: 1537, size: 192, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1161, file: !140, line: 1537, baseType: !7, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1161, file: !140, line: 1537, baseType: !7, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1161, file: !140, line: 1537, baseType: !1166, size: 128, offset: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 128, elements: !581)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !140, line: 1535, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !140, line: 1532, size: 128, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1168, file: !140, line: 1533, baseType: !603, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1168, file: !140, line: 1534, baseType: !603, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !605, file: !140, line: 3403, baseType: !1173, size: 512)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !140, line: 1938, size: 512, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1184, !1186, !1187}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1173, file: !140, line: 1939, baseType: !641, size: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1173, file: !140, line: 1940, baseType: !726, size: 32, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1173, file: !140, line: 1941, baseType: !139, size: 32, offset: 224)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1173, file: !140, line: 1946, baseType: !1179, size: 32, offset: 256)
!1179 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !140, line: 1942, size: 32, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1179, file: !140, line: 1943, baseType: !158, size: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1179, file: !140, line: 1944, baseType: !165, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1179, file: !140, line: 1945, baseType: !172, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1173, file: !140, line: 1950, baseType: !1185, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !543, line: 66, baseType: !862)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1173, file: !140, line: 1951, baseType: !1185, size: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1173, file: !140, line: 1953, baseType: !1062, size: 64, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !605, file: !140, line: 3404, baseType: !1189, size: 1664)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !140, line: 3337, size: 1664, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1189, file: !140, line: 3338, baseType: !641, size: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1189, file: !140, line: 3341, baseType: !1193, size: 1472, offset: 192)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !1194, line: 410, size: 1472, elements: !1195)
!1194 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !1193, file: !1194, line: 412, baseType: !566, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !1193, file: !1194, line: 413, baseType: !566, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !1193, file: !1194, line: 414, baseType: !566, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !1193, file: !1194, line: 415, baseType: !566, size: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !1193, file: !1194, line: 416, baseType: !566, size: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !1193, file: !1194, line: 417, baseType: !566, size: 32, offset: 160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !1193, file: !1194, line: 418, baseType: !718, size: 8, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !1193, file: !1194, line: 419, baseType: !718, size: 8, offset: 200)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !1193, file: !1194, line: 420, baseType: !1205, size: 8, offset: 208)
!1205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !1193, file: !1194, line: 421, baseType: !1205, size: 8, offset: 216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !1193, file: !1194, line: 422, baseType: !1205, size: 8, offset: 224)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !1193, file: !1194, line: 423, baseType: !1205, size: 8, offset: 232)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !1193, file: !1194, line: 424, baseType: !1205, size: 8, offset: 240)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !1193, file: !1194, line: 425, baseType: !1205, size: 8, offset: 248)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !1193, file: !1194, line: 426, baseType: !1205, size: 8, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !1193, file: !1194, line: 427, baseType: !1205, size: 8, offset: 264)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !1193, file: !1194, line: 428, baseType: !1205, size: 8, offset: 272)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !1193, file: !1194, line: 429, baseType: !1205, size: 8, offset: 280)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !1193, file: !1194, line: 430, baseType: !1205, size: 8, offset: 288)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !1193, file: !1194, line: 431, baseType: !1205, size: 8, offset: 296)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !1193, file: !1194, line: 432, baseType: !1205, size: 8, offset: 304)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !1193, file: !1194, line: 433, baseType: !1205, size: 8, offset: 312)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !1193, file: !1194, line: 434, baseType: !1205, size: 8, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !1193, file: !1194, line: 435, baseType: !1205, size: 8, offset: 328)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !1193, file: !1194, line: 436, baseType: !1205, size: 8, offset: 336)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !1193, file: !1194, line: 437, baseType: !1205, size: 8, offset: 344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !1193, file: !1194, line: 438, baseType: !1205, size: 8, offset: 352)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !1193, file: !1194, line: 439, baseType: !1205, size: 8, offset: 360)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !1193, file: !1194, line: 440, baseType: !1205, size: 8, offset: 368)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !1193, file: !1194, line: 441, baseType: !1205, size: 8, offset: 376)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !1193, file: !1194, line: 442, baseType: !1205, size: 8, offset: 384)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !1193, file: !1194, line: 443, baseType: !1205, size: 8, offset: 392)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !1193, file: !1194, line: 444, baseType: !1205, size: 8, offset: 400)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !1193, file: !1194, line: 445, baseType: !1205, size: 8, offset: 408)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !1193, file: !1194, line: 446, baseType: !1205, size: 8, offset: 416)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !1193, file: !1194, line: 447, baseType: !1205, size: 8, offset: 424)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !1193, file: !1194, line: 448, baseType: !1205, size: 8, offset: 432)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !1193, file: !1194, line: 449, baseType: !1205, size: 8, offset: 440)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !1193, file: !1194, line: 450, baseType: !1205, size: 8, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !1193, file: !1194, line: 451, baseType: !1205, size: 8, offset: 456)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !1193, file: !1194, line: 452, baseType: !1205, size: 8, offset: 464)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !1193, file: !1194, line: 453, baseType: !1205, size: 8, offset: 472)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !1193, file: !1194, line: 454, baseType: !1205, size: 8, offset: 480)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !1193, file: !1194, line: 455, baseType: !1205, size: 8, offset: 488)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !1193, file: !1194, line: 456, baseType: !1205, size: 8, offset: 496)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !1193, file: !1194, line: 457, baseType: !1205, size: 8, offset: 504)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !1193, file: !1194, line: 458, baseType: !1205, size: 8, offset: 512)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !1193, file: !1194, line: 459, baseType: !1205, size: 8, offset: 520)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !1193, file: !1194, line: 460, baseType: !1205, size: 8, offset: 528)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !1193, file: !1194, line: 461, baseType: !1205, size: 8, offset: 536)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !1193, file: !1194, line: 462, baseType: !1205, size: 8, offset: 544)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !1193, file: !1194, line: 463, baseType: !1205, size: 8, offset: 552)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !1193, file: !1194, line: 464, baseType: !1205, size: 8, offset: 560)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !1193, file: !1194, line: 465, baseType: !1205, size: 8, offset: 568)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !1193, file: !1194, line: 466, baseType: !1205, size: 8, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !1193, file: !1194, line: 467, baseType: !1205, size: 8, offset: 584)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !1193, file: !1194, line: 468, baseType: !1205, size: 8, offset: 592)
