; ModuleID = 'cgraphbuild.c'
source_filename = "cgraphbuild.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type opaque

!483 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!484 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!485 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!486 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!487 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!488 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!489 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!490 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!491 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!492 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!493 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !456, line: 727, baseType: !7, size: 32, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!496 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!497 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!498 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!499 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!500 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!501 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!502 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!503 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!504 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!505 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!506 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!507 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!508 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!509 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!510 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!511 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!512 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!513 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!514 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!515 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!516 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!517 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!518 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !6, line: 58, baseType: !7, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!522 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!526 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!527 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!528 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!529 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!530 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!531 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!532 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !202, line: 295, baseType: !7, size: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!535 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!538 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!539 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!540 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!541 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!542 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!543 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!544 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!545 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!546 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!547 = !{!5, !548, !1729, !1083, !1032, !620, !618, !700, !7}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !456, line: 737, size: 768, elements: !550)
!550 = !{!551, !1576, !1586, !1592, !1597, !1602, !1609, !1615, !1621, !1626, !1640, !1645, !1651, !1656, !1666, !1671, !1687, !1694, !1701, !1707, !1712, !1718, !1724}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !549, file: !456, line: 738, baseType: !552, size: 256)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !456, line: 271, size: 256, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !569, !570, !1575}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !552, file: !456, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !552, file: !456, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !552, file: !456, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !552, file: !456, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !552, file: !456, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !552, file: !456, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !552, file: !456, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !552, file: !456, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !552, file: !456, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !552, file: !456, line: 312, baseType: !7, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !552, file: !456, line: 316, baseType: !565, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !566, line: 58, baseType: !567)
!566 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !568, line: 44, baseType: !7)
!568 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !552, file: !456, line: 319, baseType: !7, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !552, file: !456, line: 323, baseType: !571, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !573)
!573 = !{!574, !1540, !1541, !1542, !1545, !1549, !1550, !1551, !1569, !1570, !1571, !1572, !1573, !1574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !572, file: !202, line: 219, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !577, file: !202, line: 151, baseType: !580, size: 128)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !582)
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !581, file: !202, line: 150, baseType: !7, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !581, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !581, file: !202, line: 150, baseType: !586, size: 64, offset: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !704)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !588, line: 108, baseType: !589)
!588 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !591)
!591 = !{!592, !593, !594, !617, !619, !1534, !1535, !1536, !1537, !1538}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !590, file: !202, line: 124, baseType: !571, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !590, file: !202, line: 125, baseType: !571, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !590, file: !202, line: 131, baseType: !595, size: 64, offset: 128)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !596)
!596 = !{!597, !613}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !595, file: !202, line: 129, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !588, line: 66, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !456, line: 143, size: 192, elements: !601)
!601 = !{!602, !611, !612}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !600, file: !456, line: 145, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !588, line: 69, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !456, line: 136, size: 192, elements: !606)
!606 = !{!607, !609, !610}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !605, file: !456, line: 137, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !588, line: 58, baseType: !548)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !456, line: 138, baseType: !604, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !456, line: 139, baseType: !604, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !600, file: !456, line: 146, baseType: !603, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !600, file: !456, line: 152, baseType: !598, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !595, file: !202, line: 130, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !588, line: 50, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !588, line: 49, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !590, file: !202, line: 134, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !590, file: !202, line: 137, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !588, line: 56, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !623)
!623 = !{!624, !657, !663, !676, !683, !690, !695, !706, !712, !726, !734, !772, !777, !805, !822, !823, !828, !837, !843, !848, !852, !856, !1183, !1232, !1238, !1244, !1251, !1264, !1278, !1295, !1307, !1329, !1344, !1516}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !6, line: 3372, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !625, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !625, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !625, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !625, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !625, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !625, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !625, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !625, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !625, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !625, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !625, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !625, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !625, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !625, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !625, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !625, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !625, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !625, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !625, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !625, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !625, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !625, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !625, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !625, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !625, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !625, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !625, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !625, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !625, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !625, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !6, line: 3373, baseType: !658, size: 192)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !6, line: 403, baseType: !625, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !658, file: !6, line: 404, baseType: !620, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !6, line: 405, baseType: !620, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !622, file: !6, line: 3374, baseType: !664, size: 320)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !6, line: 1385, baseType: !658, size: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !664, file: !6, line: 1386, baseType: !668, size: 128, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !669, line: 58, baseType: !670)
!669 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 54, size: 128, elements: !671)
!671 = !{!672, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !670, file: !669, line: 56, baseType: !673, size: 64)
!673 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !670, file: !669, line: 57, baseType: !675, size: 64, offset: 64)
!675 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !622, file: !6, line: 3375, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !6, line: 1398, baseType: !658, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !677, file: !6, line: 1399, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !622, file: !6, line: 3376, baseType: !684, size: 256)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !6, line: 1409, baseType: !658, size: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !684, file: !6, line: 1410, baseType: !688, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !622, file: !6, line: 3377, baseType: !691, size: 256)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !691, file: !6, line: 1438, baseType: !658, size: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !691, file: !6, line: 1439, baseType: !620, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !622, file: !6, line: 3378, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !697)
!697 = !{!698, !699, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !6, line: 1419, baseType: !658, size: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !696, file: !6, line: 1420, baseType: !700, size: 32, offset: 192)
!700 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !696, file: !6, line: 1421, baseType: !702, size: 8, offset: 224)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 8, elements: !704)
!703 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!704 = !{!705}
!705 = !DISubrange(count: 1)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !622, file: !6, line: 3379, baseType: !707, size: 320)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !6, line: 1429, baseType: !658, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !707, file: !6, line: 1430, baseType: !620, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !707, file: !6, line: 1431, baseType: !620, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !622, file: !6, line: 3380, baseType: !713, size: 320)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !6, line: 1461, baseType: !658, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !6, line: 1462, baseType: !717, size: 128, offset: 192)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !718, line: 31, size: 128, elements: !719)
!718 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !{!720, !724, !725}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !717, file: !718, line: 32, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !717, file: !718, line: 33, baseType: !7, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !717, file: !718, line: 34, baseType: !7, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !622, file: !6, line: 3381, baseType: !727, size: 384)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !728)
!728 = !{!729, !730, !731, !732, !733}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !6, line: 2508, baseType: !658, size: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !727, file: !6, line: 2509, baseType: !565, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !727, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !6, line: 2511, baseType: !620, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !727, file: !6, line: 2512, baseType: !620, size: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !622, file: !6, line: 3382, baseType: !735, size: 896)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !735, file: !6, line: 2653, baseType: !727, size: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !735, file: !6, line: 2654, baseType: !620, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !735, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !735, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !735, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !735, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !735, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !735, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !735, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !735, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !735, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !735, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !735, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !735, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !735, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !735, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !735, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !735, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !735, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !735, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !735, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !735, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !735, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !735, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !735, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !735, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !735, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !735, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !735, file: !6, line: 2705, baseType: !620, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !735, file: !6, line: 2706, baseType: !620, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !735, file: !6, line: 2707, baseType: !620, size: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !735, file: !6, line: 2708, baseType: !620, size: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !735, file: !6, line: 2711, baseType: !770, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !622, file: !6, line: 3383, baseType: !773, size: 960)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !6, line: 2757, baseType: !735, size: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !773, file: !6, line: 2758, baseType: !614, size: 64, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !622, file: !6, line: 3384, baseType: !778, size: 1472)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !779)
!779 = !{!780, !801, !802, !803, !804}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !6, line: 3115, baseType: !781, size: 1216)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !6, line: 2985, baseType: !773, size: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !781, file: !6, line: 2986, baseType: !620, size: 64, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !781, file: !6, line: 2987, baseType: !620, size: 64, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !781, file: !6, line: 2988, baseType: !620, size: 64, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !781, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !781, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !781, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !781, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !781, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !781, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !781, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !781, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !781, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !781, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !781, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !781, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !781, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !781, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !778, file: !6, line: 3117, baseType: !620, size: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !778, file: !6, line: 3119, baseType: !620, size: 64, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !778, file: !6, line: 3121, baseType: !620, size: 64, offset: 1344)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !778, file: !6, line: 3123, baseType: !620, size: 64, offset: 1408)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !622, file: !6, line: 3385, baseType: !806, size: 1088)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !6, line: 2875, baseType: !773, size: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !806, file: !6, line: 2876, baseType: !614, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !806, file: !6, line: 2877, baseType: !811, size: 64, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !813, line: 172, size: 128, elements: !814)
!813 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!814 = !{!815, !816, !817, !818, !819, !820, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !812, file: !813, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !812, file: !813, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !812, file: !813, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !812, file: !813, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !812, file: !813, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !812, file: !813, line: 195, baseType: !7, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !812, file: !813, line: 199, baseType: !620, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !622, file: !6, line: 3386, baseType: !781, size: 1216)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !622, file: !6, line: 3387, baseType: !824, size: 1280)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !6, line: 3094, baseType: !781, size: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !824, file: !6, line: 3095, baseType: !811, size: 64, offset: 1216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !622, file: !6, line: 3388, baseType: !829, size: 1216)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !829, file: !6, line: 2825, baseType: !735, size: 896)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !829, file: !6, line: 2827, baseType: !620, size: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !829, file: !6, line: 2828, baseType: !620, size: 64, offset: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !829, file: !6, line: 2829, baseType: !620, size: 64, offset: 1024)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !829, file: !6, line: 2830, baseType: !620, size: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !829, file: !6, line: 2831, baseType: !620, size: 64, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !622, file: !6, line: 3389, baseType: !838, size: 1024)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !6, line: 2851, baseType: !773, size: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !838, file: !6, line: 2852, baseType: !700, size: 32, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !838, file: !6, line: 2853, baseType: !700, size: 32, offset: 992)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !622, file: !6, line: 3390, baseType: !844, size: 1024)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !6, line: 2858, baseType: !773, size: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !844, file: !6, line: 2859, baseType: !811, size: 64, offset: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !622, file: !6, line: 3391, baseType: !849, size: 960)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !850)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !6, line: 2863, baseType: !773, size: 960)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !622, file: !6, line: 3392, baseType: !853, size: 1472)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !6, line: 3305, baseType: !778, size: 1472)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !622, file: !6, line: 3393, baseType: !857, size: 1792)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !858)
!858 = !{!859, !860, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !6, line: 3249, baseType: !778, size: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !857, file: !6, line: 3251, baseType: !861, size: 64, offset: 1472)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !863, line: 463, size: 1152, elements: !864)
!863 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!864 = !{!865, !868, !901, !902, !1101, !1104, !1105, !1106, !1107, !1108, !1109, !1135, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !862, file: !863, line: 464, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !863, line: 464, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !862, file: !863, line: 467, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !871)
!871 = !{!872, !874, !875, !888, !889, !890, !891, !892, !893, !897, !899, !900}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !870, file: !202, line: 377, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !588, line: 111, baseType: !571)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !870, file: !202, line: 378, baseType: !873, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !870, file: !202, line: 381, baseType: !876, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !878, file: !202, line: 282, baseType: !881, size: 128)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !882, file: !202, line: 281, baseType: !7, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !882, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !882, file: !202, line: 281, baseType: !887, size: 64, offset: 64)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 64, elements: !704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !870, file: !202, line: 384, baseType: !700, size: 32, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !870, file: !202, line: 387, baseType: !700, size: 32, offset: 224)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !870, file: !202, line: 390, baseType: !700, size: 32, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !870, file: !202, line: 394, baseType: !876, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !870, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !870, file: !202, line: 399, baseType: !894, size: 64, offset: 416)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 2)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !870, file: !202, line: 402, baseType: !898, size: 64, offset: 480)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !895)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !870, file: !202, line: 406, baseType: !700, size: 32, offset: 544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !870, file: !202, line: 409, baseType: !700, size: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !862, file: !863, line: 470, baseType: !599, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !862, file: !863, line: 473, baseType: !903, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !813, line: 39, size: 1152, elements: !905)
!905 = !{!906, !958, !971, !984, !985, !1055, !1056, !1060, !1061, !1062, !1063, !1064}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !904, file: !813, line: 41, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !908, line: 144, baseType: !909)
!908 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !908, line: 100, size: 896, elements: !911)
!911 = !{!912, !920, !925, !930, !932, !935, !936, !937, !938, !939, !944, !946, !947, !952, !957}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !910, file: !908, line: 102, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !908, line: 52, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !908, line: 47, baseType: !7)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !910, file: !908, line: 105, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !908, line: 59, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!700, !918, !918}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !910, file: !908, line: 108, baseType: !926, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !908, line: 63, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !618}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !910, file: !908, line: 111, baseType: !931, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !910, file: !908, line: 114, baseType: !933, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !934, line: 46, baseType: !673)
!934 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!935 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !910, file: !908, line: 117, baseType: !933, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !910, file: !908, line: 120, baseType: !933, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !910, file: !908, line: 124, baseType: !7, size: 32, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !910, file: !908, line: 128, baseType: !7, size: 32, offset: 480)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !910, file: !908, line: 131, baseType: !940, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !908, line: 75, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!618, !933, !933}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !910, file: !908, line: 132, baseType: !945, size: 64, offset: 576)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !908, line: 78, baseType: !927)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !910, file: !908, line: 135, baseType: !618, size: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !910, file: !908, line: 136, baseType: !948, size: 64, offset: 704)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !908, line: 82, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!618, !618, !933, !933}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !910, file: !908, line: 137, baseType: !953, size: 64, offset: 768)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !908, line: 83, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !618, !618}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !910, file: !908, line: 141, baseType: !7, size: 32, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !904, file: !813, line: 48, baseType: !959, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !456, line: 35, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !456, line: 35, size: 128, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !961, file: !456, line: 35, baseType: !964, size: 128)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !456, line: 33, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !456, line: 33, size: 128, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !965, file: !456, line: 33, baseType: !7, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !965, file: !456, line: 33, baseType: !7, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !965, file: !456, line: 33, baseType: !970, size: 64, offset: 64)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 64, elements: !704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !904, file: !813, line: 51, baseType: !972, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !974, file: !6, line: 183, baseType: !977, size: 128)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !978, file: !6, line: 182, baseType: !7, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !978, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !978, file: !6, line: 182, baseType: !983, size: 64, offset: 64)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 64, elements: !704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !904, file: !813, line: 54, baseType: !620, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !904, file: !813, line: 57, baseType: !986, size: 128, offset: 256)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !987, line: 31, size: 128, elements: !988)
!987 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!988 = !{!989, !990, !991, !992, !993, !994, !995}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !986, file: !987, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !986, file: !987, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !986, file: !987, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !986, file: !987, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !986, file: !987, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !986, file: !987, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !986, file: !987, line: 56, baseType: !996, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !588, line: 47, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !999, line: 75, size: 256, elements: !1000)
!999 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = !{!1001, !1013, !1014, !1015}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !998, file: !999, line: 76, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !999, line: 68, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !999, line: 63, size: 320, elements: !1005)
!1005 = !{!1006, !1008, !1009, !1010}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !999, line: 64, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !999, line: 65, baseType: !1007, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1004, file: !999, line: 66, baseType: !7, size: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1004, file: !999, line: 67, baseType: !1011, size: 128, offset: 192)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, elements: !895)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !999, line: 29, baseType: !673)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !998, file: !999, line: 77, baseType: !1002, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !998, file: !999, line: 78, baseType: !7, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !998, file: !999, line: 79, baseType: !1016, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !999, line: 49, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !999, line: 45, size: 832, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1018, file: !999, line: 46, baseType: !1007, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1018, file: !999, line: 47, baseType: !997, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1018, file: !999, line: 48, baseType: !1023, size: 704, offset: 128)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1024, line: 164, size: 704, elements: !1025)
!1024 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = !{!1026, !1027, !1038, !1039, !1040, !1041, !1042, !1043, !1047, !1051, !1052, !1053, !1054}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1023, file: !1024, line: 166, baseType: !675, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1023, file: !1024, line: 167, baseType: !1028, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1024, line: 157, size: 192, elements: !1030)
!1030 = !{!1031, !1033, !1034}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1029, file: !1024, line: 159, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1029, file: !1024, line: 160, baseType: !1028, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1029, file: !1024, line: 161, baseType: !1035, size: 32, offset: 128)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 32, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 4)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1023, file: !1024, line: 168, baseType: !1032, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1023, file: !1024, line: 169, baseType: !1032, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1023, file: !1024, line: 170, baseType: !1032, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1023, file: !1024, line: 171, baseType: !675, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1023, file: !1024, line: 172, baseType: !700, size: 32, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1023, file: !1024, line: 176, baseType: !1044, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1028, !618, !675}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1023, file: !1024, line: 177, baseType: !1048, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !618, !1028}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1023, file: !1024, line: 178, baseType: !618, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1023, file: !1024, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1023, file: !1024, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1023, file: !1024, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !904, file: !813, line: 60, baseType: !986, size: 128, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !904, file: !813, line: 64, baseType: !1057, size: 64, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1059, line: 33, flags: DIFlagFwdDecl)
!1059 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !904, file: !813, line: 67, baseType: !620, size: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !904, file: !813, line: 73, baseType: !907, size: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !904, file: !813, line: 77, baseType: !996, size: 64, offset: 704)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !904, file: !813, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !904, file: !813, line: 82, baseType: !1065, size: 320, offset: 832)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1066, line: 62, size: 320, elements: !1067)
!1066 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1067 = !{!1068, !1074, !1075, !1076, !1077, !1084}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1065, file: !1066, line: 63, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1066, line: 56, size: 128, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1070, file: !1066, line: 57, baseType: !1069, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1070, file: !1066, line: 58, baseType: !702, size: 8, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1065, file: !1066, line: 64, baseType: !7, size: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1065, file: !1066, line: 66, baseType: !7, size: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1065, file: !1066, line: 68, baseType: !723, size: 8, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1065, file: !1066, line: 70, baseType: !1078, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1066, line: 37, size: 128, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !1066, line: 39, baseType: !1078, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1079, file: !1066, line: 40, baseType: !1083, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1065, file: !1066, line: 71, baseType: !1085, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1066, line: 45, size: 320, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1086, file: !1066, line: 47, baseType: !1085, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1086, file: !1066, line: 48, baseType: !1090, size: 256, offset: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !1091)
!1091 = !{!1092, !1094, !1095, !1100}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1090, file: !6, line: 1884, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !6, line: 1885, baseType: !1093, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1090, file: !6, line: 1891, baseType: !1096, size: 64, offset: 128)
!1096 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1090, file: !6, line: 1891, size: 64, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1096, file: !6, line: 1891, baseType: !608, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1096, file: !6, line: 1891, baseType: !620, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1090, file: !6, line: 1892, baseType: !1083, size: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !862, file: !863, line: 476, baseType: !1102, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !863, line: 476, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !862, file: !863, line: 479, baseType: !907, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !862, file: !863, line: 484, baseType: !620, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !862, file: !863, line: 488, baseType: !620, size: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !862, file: !863, line: 493, baseType: !620, size: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !862, file: !863, line: 496, baseType: !620, size: 64, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !862, file: !863, line: 501, baseType: !1110, size: 64, offset: 640)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1112)
!1112 = !{!1113, !1116, !1119, !1120, !1121, !1123, !1124, !1129, !1130, !1131, !1132, !1133, !1134}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1111, file: !213, line: 2356, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1111, file: !213, line: 2357, baseType: !1117, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1111, file: !213, line: 2358, baseType: !700, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1111, file: !213, line: 2359, baseType: !700, size: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1111, file: !213, line: 2360, baseType: !1122, size: 128, offset: 192)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 128, elements: !1036)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1111, file: !213, line: 2364, baseType: !700, size: 32, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1111, file: !213, line: 2367, baseType: !1125, size: 128, offset: 384)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1125, file: !213, line: 2351, baseType: !614, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1125, file: !213, line: 2352, baseType: !675, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1111, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1111, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1111, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1111, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1111, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1111, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !862, file: !863, line: 504, baseType: !1136, size: 64, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !863, line: 504, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !862, file: !863, line: 507, baseType: !907, size: 64, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !862, file: !863, line: 510, baseType: !700, size: 32, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !862, file: !863, line: 513, baseType: !700, size: 32, offset: 864)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !862, file: !863, line: 516, baseType: !565, size: 32, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !862, file: !863, line: 519, baseType: !565, size: 32, offset: 928)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !862, file: !863, line: 522, baseType: !7, size: 32, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !862, file: !863, line: 523, baseType: !7, size: 32, offset: 992)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !862, file: !863, line: 528, baseType: !1117, size: 64, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !862, file: !863, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !862, file: !863, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !862, file: !863, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !862, file: !863, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !862, file: !863, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !862, file: !863, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !862, file: !863, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !862, file: !863, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !862, file: !863, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !862, file: !863, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !862, file: !863, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !862, file: !863, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !862, file: !863, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !862, file: !863, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !862, file: !863, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !862, file: !863, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !857, file: !6, line: 3254, baseType: !620, size: 64, offset: 1536)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !857, file: !6, line: 3257, baseType: !620, size: 64, offset: 1600)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !857, file: !6, line: 3258, baseType: !620, size: 64, offset: 1664)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !857, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !857, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !857, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !857, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !857, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !857, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !857, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !857, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !857, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !857, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !857, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !857, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !857, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !857, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !857, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !857, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !857, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !857, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !622, file: !6, line: 3394, baseType: !1184, size: 1344)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1211, !1212, !1213, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1184, file: !6, line: 2280, baseType: !658, size: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1184, file: !6, line: 2281, baseType: !620, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1184, file: !6, line: 2282, baseType: !620, size: 64, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1184, file: !6, line: 2283, baseType: !620, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1184, file: !6, line: 2284, baseType: !620, size: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1184, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1184, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1184, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1184, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1184, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1184, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1184, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1184, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1184, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1184, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1184, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1184, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1184, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1184, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1184, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1184, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1184, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1184, file: !6, line: 2306, baseType: !1209, size: 32, offset: 544)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1210, line: 31, baseType: !700)
!1210 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1184, file: !6, line: 2307, baseType: !620, size: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1184, file: !6, line: 2308, baseType: !620, size: 64, offset: 640)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1184, file: !6, line: 2314, baseType: !1214, size: 64, offset: 704)
!1214 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1214, file: !6, line: 2310, baseType: !700, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1214, file: !6, line: 2311, baseType: !1117, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1214, file: !6, line: 2312, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1184, file: !6, line: 2315, baseType: !620, size: 64, offset: 768)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1184, file: !6, line: 2316, baseType: !620, size: 64, offset: 832)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1184, file: !6, line: 2317, baseType: !620, size: 64, offset: 896)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1184, file: !6, line: 2318, baseType: !620, size: 64, offset: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1184, file: !6, line: 2319, baseType: !620, size: 64, offset: 1024)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1184, file: !6, line: 2320, baseType: !620, size: 64, offset: 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1184, file: !6, line: 2321, baseType: !620, size: 64, offset: 1152)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1184, file: !6, line: 2322, baseType: !620, size: 64, offset: 1216)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1184, file: !6, line: 2324, baseType: !1230, size: 64, offset: 1280)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !622, file: !6, line: 3395, baseType: !1233, size: 320)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !6, line: 1470, baseType: !658, size: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1233, file: !6, line: 1471, baseType: !620, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1233, file: !6, line: 1472, baseType: !620, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !622, file: !6, line: 3396, baseType: !1239, size: 320)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1239, file: !6, line: 1483, baseType: !658, size: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1239, file: !6, line: 1484, baseType: !700, size: 32, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1239, file: !6, line: 1485, baseType: !983, size: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !622, file: !6, line: 3397, baseType: !1245, size: 384)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !6, line: 1829, size: 384, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1245, file: !6, line: 1830, baseType: !658, size: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1245, file: !6, line: 1831, baseType: !565, size: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1245, file: !6, line: 1832, baseType: !620, size: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1245, file: !6, line: 1835, baseType: !983, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !622, file: !6, line: 3398, baseType: !1252, size: 704)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !6, line: 1898, size: 704, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1263}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !6, line: 1899, baseType: !658, size: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1252, file: !6, line: 1902, baseType: !620, size: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1252, file: !6, line: 1905, baseType: !608, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1252, file: !6, line: 1908, baseType: !7, size: 32, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1252, file: !6, line: 1911, baseType: !1259, size: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !813, line: 117, size: 128, elements: !1261)
!1261 = !{!1262}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1260, file: !813, line: 120, baseType: !986, size: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1252, file: !6, line: 1914, baseType: !1090, size: 256, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !622, file: !6, line: 3399, baseType: !1265, size: 704)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !6, line: 2008, size: 704, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1265, file: !6, line: 2009, baseType: !658, size: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1265, file: !6, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1265, file: !6, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1265, file: !6, line: 2014, baseType: !565, size: 32, offset: 224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1265, file: !6, line: 2016, baseType: !620, size: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1265, file: !6, line: 2017, baseType: !972, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1265, file: !6, line: 2019, baseType: !620, size: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1265, file: !6, line: 2020, baseType: !620, size: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1265, file: !6, line: 2021, baseType: !620, size: 64, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1265, file: !6, line: 2022, baseType: !620, size: 64, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1265, file: !6, line: 2023, baseType: !620, size: 64, offset: 640)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !622, file: !6, line: 3400, baseType: !1279, size: 832)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !6, line: 2430, size: 832, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1279, file: !6, line: 2431, baseType: !658, size: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1279, file: !6, line: 2433, baseType: !620, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1279, file: !6, line: 2434, baseType: !620, size: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1279, file: !6, line: 2435, baseType: !620, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1279, file: !6, line: 2436, baseType: !620, size: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1279, file: !6, line: 2437, baseType: !972, size: 64, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1279, file: !6, line: 2438, baseType: !620, size: 64, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1279, file: !6, line: 2440, baseType: !620, size: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1279, file: !6, line: 2441, baseType: !620, size: 64, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1279, file: !6, line: 2443, baseType: !1291, size: 128, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !6, line: 182, baseType: !1292)
