; ModuleID = 'cpp_charset.c'
source_filename = "cpp_charset.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.conversion = type { i8*, i8 (i8*, i8*, i64, %struct._cpp_strbuf*)*, i8* }
%struct._cpp_strbuf = type { i8*, i64, i64 }
%struct.anon.3 = type { i8, i8, i16 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }

!104 = !DIEnumerator(name: "CPP_OPEN_SQUARE", value: 39, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_CLOSE_SQUARE", value: 40, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_OPEN_BRACE", value: 41, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_CLOSE_BRACE", value: 42, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_SEMICOLON", value: 43, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_ELLIPSIS", value: 44, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_PLUS_PLUS", value: 45, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_MINUS_MINUS", value: 46, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_DEREF", value: 47, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!117 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!122 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!123 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!124 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!125 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!126 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!127 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!128 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!129 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!130 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!131 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!132 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!133 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!134 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!135 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!136 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!137 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!138 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!139 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!140 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!141 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!142 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ht_lookup_option", file: !144, line: 43, baseType: !7, size: 32, elements: !145)
!144 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!145 = !{!146, !147}
!146 = !DIEnumerator(name: "HT_NO_INSERT", value: 0, isUnsigned: true)
!147 = !DIEnumerator(name: "HT_ALLOC", value: 1, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 833, baseType: !7, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156}
!150 = !DIEnumerator(name: "C99", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "DIG", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "CXX", value: 4, isUnsigned: true)
!153 = !DIEnumerator(name: "CID", value: 8, isUnsigned: true)
!154 = !DIEnumerator(name: "NFC", value: 16, isUnsigned: true)
!155 = !DIEnumerator(name: "NKC", value: 32, isUnsigned: true)
!156 = !DIEnumerator(name: "CTX", value: 64, isUnsigned: true)
!157 = !{!158, !159, !163, !164, !7, !162, !165, !166, !168, !170, !251, !253}
!158 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !161, line: 22, baseType: !162)
!161 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!163 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!164 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !167, line: 29, baseType: !165)
!167 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 46, baseType: !158)
!169 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !173)
!173 = !{!174, !182, !183, !184, !185, !186, !187}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !172, file: !6, line: 645, baseType: !175, size: 128)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !144, line: 31, size: 128, elements: !176)
!176 = !{!177, !180, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !175, file: !144, line: 32, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !144, line: 33, baseType: !7, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !175, file: !144, line: 34, baseType: !7, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !172, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !172, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !172, file: !6, line: 650, baseType: !162, size: 8, offset: 136)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !172, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !172, file: !6, line: 654, baseType: !188, size: 64, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !189)
!189 = !{!190, !239, !249, !250}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !188, file: !6, line: 635, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !161, line: 36, size: 256, elements: !194)
!194 = !{!195, !197, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !193, file: !161, line: 42, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !193, file: !161, line: 51, baseType: !198, size: 64, offset: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !161, line: 47, size: 64, elements: !199)
!199 = !{!200, !229}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !198, file: !161, line: 49, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !204)
!204 = !{!205, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !203, file: !6, line: 213, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !207, line: 44, baseType: !7)
!207 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !203, file: !6, line: 215, baseType: !164, size: 16, offset: 48)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !203, file: !6, line: 237, baseType: !211, size: 128, offset: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !212)
!212 = !{!213, !217, !218, !223, !227, !228}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !6, line: 220, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !214, file: !6, line: 207, baseType: !170, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !211, file: !6, line: 223, baseType: !201, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !211, file: !6, line: 226, baseType: !219, size: 128)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !219, file: !6, line: 163, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !219, file: !6, line: 164, baseType: !178, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !211, file: !6, line: 229, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !224, file: !6, line: 197, baseType: !7, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !211, file: !6, line: 233, baseType: !7, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !211, file: !6, line: 236, baseType: !7, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !198, file: !161, line: 50, baseType: !178, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !193, file: !161, line: 54, baseType: !206, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !193, file: !161, line: 57, baseType: !7, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !193, file: !161, line: 60, baseType: !164, size: 16, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !193, file: !161, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !193, file: !161, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !193, file: !161, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !193, file: !161, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !193, file: !161, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !193, file: !161, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !188, file: !6, line: 637, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !161, line: 28, size: 320, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !161, line: 29, baseType: !240, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !241, file: !161, line: 30, baseType: !7, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !241, file: !161, line: 31, baseType: !246, size: 192, offset: 128)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 192, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !188, file: !6, line: 639, baseType: !5, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !188, file: !6, line: 641, baseType: !164, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "cppchar_t", file: !6, line: 258, baseType: !7)
!254 = !{!0, !255, !269, !271, !282, !776, !782}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "masks", scope: !257, file: !3, line: 173, type: !266, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "one_utf8_to_cppchar", scope: !3, file: !3, line: 170, type: !258, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !265)
!258 = !DISubroutineType(types: !259)
!259 = !{!163, !260, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!265 = !{}
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 6)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "patns", scope: !257, file: !3, line: 174, type: !266, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "ucnranges", scope: !2, file: !3, line: 857, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 23904, elements: !280)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 850, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !3, line: 852, baseType: !162, size: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "combine", scope: !275, file: !3, line: 854, baseType: !162, size: 8, offset: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !275, file: !3, line: 856, baseType: !164, size: 16, offset: 16)
!280 = !{!281}
!281 = !DISubrange(count: 747)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "charconsts", scope: !284, file: !3, line: 1264, type: !773, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "convert_escape", scope: !3, file: !3, line: 1259, type: !285, scopeLine: 1261, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !265)
!285 = !DISubroutineType(types: !286)
!286 = !{!261, !287, !261, !261, !362, !355}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !290, line: 322, size: 10432, elements: !291)
!290 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !{!292, !370, !371, !388, !418, !419, !430, !431, !432, !462, !464, !468, !469, !470, !471, !472, !473, !474, !475, !476, !479, !480, !483, !484, !517, !518, !519, !522, !523, !524, !525, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !551, !552, !553, !556, !638, !664, !667, !668, !731, !738, !739, !746, !747, !748, !749, !752, !753, !766}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !289, file: !290, line: 325, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !290, line: 249, size: 1536, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !309, !310, !311, !312, !314, !317, !318, !321, !322, !323, !324, !325, !326, !354}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !295, file: !290, line: 251, baseType: !178, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !295, file: !290, line: 252, baseType: !178, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !295, file: !290, line: 253, baseType: !178, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !295, file: !290, line: 255, baseType: !178, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !295, file: !290, line: 256, baseType: !178, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !295, file: !290, line: 258, baseType: !303, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !290, line: 235, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !290, line: 236, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !305, file: !290, line: 239, baseType: !178, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !290, line: 245, baseType: !7, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !295, file: !290, line: 259, baseType: !7, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !295, file: !290, line: 260, baseType: !7, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !295, file: !290, line: 261, baseType: !7, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !295, file: !290, line: 263, baseType: !313, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !295, file: !290, line: 267, baseType: !315, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !295, file: !290, line: 271, baseType: !178, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !295, file: !290, line: 275, baseType: !319, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !290, line: 275, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !295, file: !290, line: 278, baseType: !162, size: 8, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !295, file: !290, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !295, file: !290, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !295, file: !290, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !295, file: !290, line: 298, baseType: !162, size: 8, offset: 784)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !295, file: !290, line: 302, baseType: !327, size: 512, offset: 832)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !328)
!328 = !{!329, !331, !332, !333, !334, !335, !336, !340, !346, !351}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !6, line: 526, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !6, line: 529, baseType: !251, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !327, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !327, file: !6, line: 534, baseType: !162, size: 8, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !327, file: !6, line: 537, baseType: !162, size: 8, offset: 168)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !327, file: !6, line: 541, baseType: !251, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !327, file: !6, line: 545, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !327, file: !6, line: 551, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!251, !338, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !327)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !327, file: !6, line: 555, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !348, line: 47, baseType: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !350, line: 148, baseType: !158)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !327, file: !6, line: 556, baseType: !352, size: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !348, line: 59, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !350, line: 145, baseType: !158)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !295, file: !290, line: 306, baseType: !355, size: 192, offset: 1344)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !290, line: 47, size: 192, elements: !356)
!356 = !{!357, !368, !369}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !355, file: !290, line: 49, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !290, line: 45, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!162, !166, !178, !168, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !3, line: 99, size: 192, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !363, file: !3, line: 101, baseType: !159, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "asize", scope: !363, file: !3, line: 102, baseType: !168, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !363, file: !3, line: 103, baseType: !168, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !355, file: !290, line: 50, baseType: !166, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !355, file: !290, line: 51, baseType: !163, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !289, file: !290, line: 328, baseType: !293, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !289, file: !290, line: 331, baseType: !372, size: 160, offset: 128)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !290, line: 177, size: 160, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !372, file: !290, line: 180, baseType: !162, size: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !372, file: !290, line: 185, baseType: !162, size: 8, offset: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !372, file: !290, line: 188, baseType: !162, size: 8, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !372, file: !290, line: 191, baseType: !162, size: 8, offset: 24)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !372, file: !290, line: 194, baseType: !162, size: 8, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !372, file: !290, line: 198, baseType: !162, size: 8, offset: 40)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !372, file: !290, line: 201, baseType: !162, size: 8, offset: 48)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !372, file: !290, line: 204, baseType: !162, size: 8, offset: 56)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !372, file: !290, line: 207, baseType: !162, size: 8, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !372, file: !290, line: 210, baseType: !162, size: 8, offset: 72)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !372, file: !290, line: 214, baseType: !162, size: 8, offset: 80)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !372, file: !290, line: 217, baseType: !7, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !372, file: !290, line: 220, baseType: !162, size: 8, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !372, file: !290, line: 223, baseType: !162, size: 8, offset: 136)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !289, file: !290, line: 334, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !207, line: 74, size: 448, elements: !391)
!391 = !{!392, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !390, file: !207, line: 75, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !207, line: 61, size: 192, elements: !395)
!395 = !{!396, !397, !399, !400, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !394, file: !207, line: 62, baseType: !338, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !394, file: !207, line: 63, baseType: !398, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !207, line: 39, baseType: !7)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !394, file: !207, line: 64, baseType: !206, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !394, file: !207, line: 65, baseType: !163, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !394, file: !207, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !394, file: !207, line: 68, baseType: !162, size: 8, offset: 168)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !394, file: !207, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !390, file: !207, line: 76, baseType: !7, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !390, file: !207, line: 77, baseType: !7, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !390, file: !207, line: 79, baseType: !7, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !390, file: !207, line: 84, baseType: !163, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !390, file: !207, line: 87, baseType: !7, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !390, file: !207, line: 90, baseType: !162, size: 8, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !390, file: !207, line: 93, baseType: !206, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !390, file: !207, line: 96, baseType: !206, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !390, file: !207, line: 100, baseType: !7, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !390, file: !207, line: 104, baseType: !414, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !207, line: 47, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!165, !165, !168}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !289, file: !290, line: 337, baseType: !206, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !289, file: !290, line: 340, baseType: !420, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !290, line: 99, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !290, line: 100, size: 256, elements: !423)
!423 = !{!424, !426, !428, !429}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !290, line: 102, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !422, file: !290, line: 103, baseType: !427, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !422, file: !290, line: 103, baseType: !427, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !422, file: !290, line: 103, baseType: !427, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !289, file: !290, line: 341, baseType: !420, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !289, file: !290, line: 342, baseType: !420, size: 64, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !289, file: !290, line: 345, baseType: !433, size: 448, offset: 640)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !290, line: 142, size: 448, elements: !434)
!434 = !{!435, !438, !439, !459, !460, !461}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !290, line: 145, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !290, line: 141, baseType: !433)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !290, line: 145, baseType: !436, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !433, file: !290, line: 164, baseType: !440, size: 128, offset: 128)
!440 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !290, line: 147, size: 128, elements: !441)
!441 = !{!442, !454}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !440, file: !290, line: 156, baseType: !443, size: 128)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !290, line: 152, size: 128, elements: !444)
!444 = !{!445, !453}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !443, file: !290, line: 154, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !290, line: 121, size: 64, elements: !447)
!447 = !{!448, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !446, file: !290, line: 123, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !446, file: !290, line: 124, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !443, file: !290, line: 155, baseType: !446, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !440, file: !290, line: 163, baseType: !455, size: 128)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !290, line: 159, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !455, file: !290, line: 161, baseType: !178, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !455, file: !290, line: 162, baseType: !178, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !433, file: !290, line: 168, baseType: !420, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !433, file: !290, line: 171, baseType: !170, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !433, file: !290, line: 174, baseType: !162, size: 8, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !289, file: !290, line: 346, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !289, file: !290, line: 349, baseType: !465, size: 64, offset: 1152)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !290, line: 40, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !289, file: !290, line: 352, baseType: !202, size: 192, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !289, file: !290, line: 356, baseType: !206, size: 32, offset: 1408)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !289, file: !290, line: 360, baseType: !162, size: 8, offset: 1440)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !289, file: !290, line: 363, baseType: !330, size: 64, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !289, file: !290, line: 364, baseType: !330, size: 64, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !289, file: !290, line: 365, baseType: !327, size: 512, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !289, file: !290, line: 368, baseType: !315, size: 64, offset: 2112)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !289, file: !290, line: 370, baseType: !315, size: 64, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !289, file: !290, line: 373, baseType: !477, size: 64, offset: 2240)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !290, line: 373, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !289, file: !290, line: 374, baseType: !477, size: 64, offset: 2304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !289, file: !290, line: 375, baseType: !481, size: 64, offset: 2368)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !290, line: 375, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !289, file: !290, line: 378, baseType: !477, size: 64, offset: 2432)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !289, file: !290, line: 379, baseType: !485, size: 704, offset: 2496)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !486, line: 164, size: 704, elements: !487)
!486 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !{!488, !490, !500, !501, !502, !503, !504, !505, !509, !513, !514, !515, !516}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !485, file: !486, line: 166, baseType: !489, size: 64)
!489 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !485, file: !486, line: 167, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !486, line: 157, size: 192, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !492, file: !486, line: 159, baseType: !251, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !486, line: 160, baseType: !491, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !492, file: !486, line: 161, baseType: !497, size: 32, offset: 128)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 32, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 4)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !485, file: !486, line: 168, baseType: !251, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !485, file: !486, line: 169, baseType: !251, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !485, file: !486, line: 170, baseType: !251, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !485, file: !486, line: 171, baseType: !489, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !485, file: !486, line: 172, baseType: !163, size: 32, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !485, file: !486, line: 176, baseType: !506, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!491, !165, !489}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !485, file: !486, line: 177, baseType: !510, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !165, !491}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !485, file: !486, line: 178, baseType: !165, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !485, file: !486, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !485, file: !486, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !485, file: !486, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !289, file: !290, line: 383, baseType: !162, size: 8, offset: 3200)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !289, file: !290, line: 387, baseType: !162, size: 8, offset: 3208)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !289, file: !290, line: 390, baseType: !520, size: 64, offset: 3264)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !289, file: !290, line: 391, baseType: !520, size: 64, offset: 3328)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !289, file: !290, line: 392, baseType: !162, size: 8, offset: 3392)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !289, file: !290, line: 395, baseType: !201, size: 64, offset: 3456)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !289, file: !290, line: 396, baseType: !526, size: 256, offset: 3520)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !290, line: 128, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !290, line: 129, size: 256, elements: !528)
!528 = !{!529, !531, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !290, line: 131, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !527, file: !290, line: 131, baseType: !530, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !527, file: !290, line: 132, baseType: !201, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !527, file: !290, line: 132, baseType: !201, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !289, file: !290, line: 396, baseType: !530, size: 64, offset: 3776)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !289, file: !290, line: 397, baseType: !7, size: 32, offset: 3840)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !289, file: !290, line: 400, baseType: !7, size: 32, offset: 3872)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !289, file: !290, line: 403, baseType: !427, size: 64, offset: 3904)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !289, file: !290, line: 404, baseType: !7, size: 32, offset: 3968)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !289, file: !290, line: 408, baseType: !355, size: 192, offset: 4032)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !289, file: !290, line: 412, baseType: !355, size: 192, offset: 4224)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !289, file: !290, line: 416, baseType: !355, size: 192, offset: 4416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !289, file: !290, line: 420, baseType: !355, size: 192, offset: 4608)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !289, file: !290, line: 424, baseType: !355, size: 192, offset: 4800)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !289, file: !290, line: 427, baseType: !178, size: 64, offset: 4992)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !289, file: !290, line: 428, baseType: !178, size: 64, offset: 5056)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !289, file: !290, line: 431, baseType: !202, size: 192, offset: 5120)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !289, file: !290, line: 432, baseType: !202, size: 192, offset: 5312)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !289, file: !290, line: 435, baseType: !549, size: 64, offset: 5504)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !289, file: !290, line: 439, baseType: !485, size: 704, offset: 5568)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !289, file: !290, line: 443, baseType: !485, size: 704, offset: 6272)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !289, file: !290, line: 447, baseType: !554, size: 64, offset: 6976)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !290, line: 447, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !289, file: !290, line: 450, baseType: !557, size: 1088, offset: 7040)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !558)
!558 = !{!559, !563, !569, !573, !577, !581, !582, !589, !593, !597, !601, !607, !611, !628, !629, !630, !634}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !557, file: !6, line: 475, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !287, !449, !163}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !557, file: !6, line: 481, baseType: !564, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !287, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !557, file: !6, line: 483, baseType: !570, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !287, !338}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !557, file: !6, line: 484, baseType: !574, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !287, !7, !178, !338, !163, !452}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !557, file: !6, line: 486, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !287, !7, !170}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !557, file: !6, line: 487, baseType: !578, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !557, file: !6, line: 488, baseType: !583, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !287, !7, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !219)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !557, file: !6, line: 489, baseType: !590, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !287, !7}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !557, file: !6, line: 490, baseType: !594, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!163, !287, !338, !163}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !557, file: !6, line: 491, baseType: !598, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !287, !338, !163, !338}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !557, file: !6, line: 492, baseType: !602, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!338, !287, !338, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !557, file: !6, line: 496, baseType: !608, size: 64, offset: 704)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!170, !287, !449}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !557, file: !6, line: 500, baseType: !612, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!162, !287, !163, !206, !7, !338, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !617, line: 52, baseType: !618)
!617 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !619, line: 32, baseType: !620)
!619 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 192, elements: !247)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !622, file: !3, baseType: !7, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !622, file: !3, baseType: !7, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !622, file: !3, baseType: !165, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !622, file: !3, baseType: !165, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !557, file: !6, line: 506, baseType: !578, size: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !557, file: !6, line: 507, baseType: !578, size: 64, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !557, file: !6, line: 510, baseType: !631, size: 64, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !287}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !557, file: !6, line: 513, baseType: !635, size: 64, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !287, !206, !170}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !289, file: !290, line: 453, baseType: !639, size: 64, offset: 8128)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !144, line: 46, size: 1152, elements: !641)
!641 = !{!642, !643, !647, !653, !657, !658, !659, !661, !662, !663}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !640, file: !144, line: 49, baseType: !485, size: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !640, file: !144, line: 51, baseType: !644, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !144, line: 41, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !640, file: !144, line: 53, baseType: !648, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!645, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !144, line: 40, baseType: !640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !640, file: !144, line: 56, baseType: !654, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!165, !168}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !640, file: !144, line: 58, baseType: !7, size: 32, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !640, file: !144, line: 59, baseType: !7, size: 32, offset: 928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !640, file: !144, line: 62, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !640, file: !144, line: 65, baseType: !7, size: 32, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !640, file: !144, line: 66, baseType: !7, size: 32, offset: 1056)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !640, file: !144, line: 69, baseType: !162, size: 8, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !289, file: !290, line: 456, baseType: !665, size: 64, offset: 8192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !290, line: 42, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !289, file: !290, line: 456, baseType: !665, size: 64, offset: 8256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !289, file: !290, line: 459, baseType: !669, size: 1024, offset: 8320)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !669, file: !6, line: 282, baseType: !7, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !669, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !669, file: !6, line: 288, baseType: !162, size: 8, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !669, file: !6, line: 291, baseType: !162, size: 8, offset: 72)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !669, file: !6, line: 296, baseType: !162, size: 8, offset: 80)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !669, file: !6, line: 299, baseType: !162, size: 8, offset: 88)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !669, file: !6, line: 303, baseType: !162, size: 8, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !669, file: !6, line: 306, baseType: !162, size: 8, offset: 104)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !669, file: !6, line: 309, baseType: !162, size: 8, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !669, file: !6, line: 312, baseType: !162, size: 8, offset: 120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !669, file: !6, line: 315, baseType: !162, size: 8, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !669, file: !6, line: 318, baseType: !162, size: 8, offset: 136)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !669, file: !6, line: 321, baseType: !162, size: 8, offset: 144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !669, file: !6, line: 324, baseType: !162, size: 8, offset: 152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !669, file: !6, line: 328, baseType: !162, size: 8, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !669, file: !6, line: 331, baseType: !162, size: 8, offset: 168)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !669, file: !6, line: 334, baseType: !162, size: 8, offset: 176)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !669, file: !6, line: 338, baseType: !162, size: 8, offset: 184)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !669, file: !6, line: 341, baseType: !162, size: 8, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !669, file: !6, line: 344, baseType: !162, size: 8, offset: 200)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !669, file: !6, line: 348, baseType: !162, size: 8, offset: 208)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !669, file: !6, line: 352, baseType: !162, size: 8, offset: 216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !669, file: !6, line: 356, baseType: !162, size: 8, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !669, file: !6, line: 360, baseType: !162, size: 8, offset: 232)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !669, file: !6, line: 363, baseType: !162, size: 8, offset: 240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !669, file: !6, line: 366, baseType: !162, size: 8, offset: 248)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !669, file: !6, line: 370, baseType: !162, size: 8, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !669, file: !6, line: 373, baseType: !162, size: 8, offset: 264)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !669, file: !6, line: 376, baseType: !162, size: 8, offset: 272)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !669, file: !6, line: 379, baseType: !162, size: 8, offset: 280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !669, file: !6, line: 382, baseType: !162, size: 8, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !669, file: !6, line: 385, baseType: !162, size: 8, offset: 296)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !669, file: !6, line: 389, baseType: !162, size: 8, offset: 304)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !669, file: !6, line: 392, baseType: !162, size: 8, offset: 312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !669, file: !6, line: 395, baseType: !162, size: 8, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !669, file: !6, line: 398, baseType: !162, size: 8, offset: 328)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !669, file: !6, line: 401, baseType: !162, size: 8, offset: 336)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !669, file: !6, line: 404, baseType: !338, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !669, file: !6, line: 407, baseType: !338, size: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !669, file: !6, line: 410, baseType: !338, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !669, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !669, file: !6, line: 417, baseType: !162, size: 8, offset: 608)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !669, file: !6, line: 420, baseType: !162, size: 8, offset: 616)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !669, file: !6, line: 441, baseType: !715, size: 64, offset: 640)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !669, file: !6, line: 423, size: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !715, file: !6, line: 426, baseType: !37, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !715, file: !6, line: 429, baseType: !162, size: 8, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !715, file: !6, line: 433, baseType: !162, size: 8, offset: 40)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !715, file: !6, line: 436, baseType: !162, size: 8, offset: 48)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !715, file: !6, line: 440, baseType: !162, size: 8, offset: 56)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !669, file: !6, line: 447, baseType: !168, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !669, file: !6, line: 447, baseType: !168, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !669, file: !6, line: 447, baseType: !168, size: 64, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !669, file: !6, line: 447, baseType: !168, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !669, file: !6, line: 450, baseType: !162, size: 8, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !669, file: !6, line: 450, baseType: !162, size: 8, offset: 968)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !669, file: !6, line: 454, baseType: !162, size: 8, offset: 976)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !669, file: !6, line: 457, baseType: !162, size: 8, offset: 984)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !669, file: !6, line: 460, baseType: !162, size: 8, offset: 992)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !289, file: !290, line: 463, baseType: !732, size: 256, offset: 9344)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !290, line: 227, size: 256, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !732, file: !290, line: 229, baseType: !170, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !732, file: !290, line: 230, baseType: !170, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !732, file: !290, line: 231, baseType: !170, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !732, file: !290, line: 232, baseType: !170, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !289, file: !290, line: 466, baseType: !162, size: 8, offset: 9600)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !289, file: !290, line: 475, baseType: !740, size: 256, offset: 9664)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !290, line: 469, size: 256, elements: !741)
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !740, file: !290, line: 471, baseType: !427, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !740, file: !290, line: 472, baseType: !427, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !740, file: !290, line: 473, baseType: !427, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !740, file: !290, line: 474, baseType: !206, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !289, file: !290, line: 478, baseType: !178, size: 64, offset: 9920)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !289, file: !290, line: 478, baseType: !178, size: 64, offset: 9984)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !289, file: !290, line: 478, baseType: !178, size: 64, offset: 10048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !289, file: !290, line: 482, baseType: !750, size: 64, offset: 10112)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !290, line: 482, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !289, file: !290, line: 485, baseType: !7, size: 32, offset: 10176)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !289, file: !290, line: 488, baseType: !754, size: 128, offset: 10240)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !756)
!756 = !{!757, !764, !765}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !755, file: !6, line: 894, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !760, file: !6, line: 883, baseType: !251, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !760, file: !6, line: 886, baseType: !206, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !755, file: !6, line: 897, baseType: !163, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !755, file: !6, line: 900, baseType: !163, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !289, file: !290, line: 491, baseType: !767, size: 64, offset: 10368)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !290, line: 310, size: 192, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !290, line: 312, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !290, line: 314, baseType: !251, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !768, file: !290, line: 316, baseType: !191, size: 64, offset: 128)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 64, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 8)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "masks", scope: !778, file: !3, line: 232, type: !266, isLocal: true, isDefinition: true)
!778 = distinct !DISubprogram(name: "one_cppchar_to_utf8", scope: !3, file: !3, line: 230, type: !779, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !265)
!779 = !DISubroutineType(types: !780)
!780 = !{!163, !253, !781, !263}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "limits", scope: !778, file: !3, line: 233, type: !266, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 1536, elements: !774)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conversion", file: !3, line: 617, size: 192, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !786, file: !3, line: 619, baseType: !338, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !786, file: !3, line: 620, baseType: !358, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fake_cd", scope: !786, file: !3, line: 621, baseType: !166, size: 64, offset: 128)
!791 = !{i32 7, !"Dwarf Version", i32 4}
!792 = !{i32 2, !"Debug Info Version", i32 3}
!793 = !{i32 1, !"wchar_size", i32 4}
!794 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!795 = distinct !DISubprogram(name: "cpp_init_iconv", scope: !3, file: !3, line: 705, type: !632, scopeLine: 706, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!796 = !DILocalVariable(name: "pfile", arg: 1, scope: !795, file: !3, line: 705, type: !287)
!797 = !DILocation(line: 705, column: 29, scope: !795)
!798 = !DILocalVariable(name: "ncset", scope: !795, file: !3, line: 707, type: !338)
!799 = !DILocation(line: 707, column: 15, scope: !795)
!800 = !DILocation(line: 707, column: 23, scope: !795)
!801 = !DILocalVariable(name: "wcset", scope: !795, file: !3, line: 708, type: !338)
!802 = !DILocation(line: 708, column: 15, scope: !795)
!803 = !DILocation(line: 708, column: 23, scope: !795)
!804 = !DILocalVariable(name: "default_wcset", scope: !795, file: !3, line: 709, type: !338)
!805 = !DILocation(line: 709, column: 15, scope: !795)
!806 = !DILocalVariable(name: "be", scope: !795, file: !3, line: 711, type: !162)
!807 = !DILocation(line: 711, column: 8, scope: !795)
!808 = !DILocation(line: 711, column: 13, scope: !795)
!809 = !DILocation(line: 713, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !795, file: !3, line: 713, column: 7)
!811 = !DILocation(line: 713, column: 43, scope: !810)
!812 = !DILocation(line: 713, column: 7, scope: !795)
!813 = !DILocation(line: 714, column: 21, scope: !810)
!814 = !DILocation(line: 714, column: 19, scope: !810)
!815 = !DILocation(line: 714, column: 5, scope: !810)
!816 = !DILocation(line: 715, column: 12, scope: !817)
!817 = distinct !DILexicalBlock(scope: !810, file: !3, line: 715, column: 12)
!818 = !DILocation(line: 715, column: 48, scope: !817)
!819 = !DILocation(line: 715, column: 12, scope: !810)
!820 = !DILocation(line: 716, column: 21, scope: !817)
!821 = !DILocation(line: 716, column: 19, scope: !817)
!822 = !DILocation(line: 716, column: 5, scope: !817)
!823 = !DILocation(line: 720, column: 18, scope: !817)
!824 = !DILocation(line: 722, column: 8, scope: !825)
!825 = distinct !DILexicalBlock(scope: !795, file: !3, line: 722, column: 7)
!826 = !DILocation(line: 722, column: 7, scope: !795)
!827 = !DILocation(line: 723, column: 11, scope: !825)
!828 = !DILocation(line: 723, column: 5, scope: !825)
!829 = !DILocation(line: 724, column: 8, scope: !830)
!830 = distinct !DILexicalBlock(scope: !795, file: !3, line: 724, column: 7)
!831 = !DILocation(line: 724, column: 7, scope: !795)
!832 = !DILocation(line: 725, column: 13, scope: !830)
!833 = !DILocation(line: 725, column: 11, scope: !830)
!834 = !DILocation(line: 725, column: 5, scope: !830)
!835 = !DILocation(line: 727, column: 3, scope: !795)
!836 = !DILocation(line: 727, column: 10, scope: !795)
!837 = !DILocation(line: 727, column: 46, scope: !795)
!838 = !DILocation(line: 727, column: 53, scope: !795)
!839 = !DILocation(line: 727, column: 29, scope: !795)
!840 = !DILocation(line: 728, column: 35, scope: !795)
!841 = !DILocation(line: 728, column: 3, scope: !795)
!842 = !DILocation(line: 728, column: 10, scope: !795)
!843 = !DILocation(line: 728, column: 27, scope: !795)
!844 = !DILocation(line: 728, column: 33, scope: !795)
!845 = !DILocation(line: 729, column: 3, scope: !795)
!846 = !DILocation(line: 729, column: 10, scope: !795)
!847 = !DILocation(line: 729, column: 44, scope: !795)
!848 = !DILocation(line: 729, column: 27, scope: !795)
!849 = !DILocation(line: 730, column: 33, scope: !795)
!850 = !DILocation(line: 730, column: 3, scope: !795)
!851 = !DILocation(line: 730, column: 10, scope: !795)
!852 = !DILocation(line: 730, column: 25, scope: !795)
!853 = !DILocation(line: 730, column: 31, scope: !795)
!854 = !DILocation(line: 731, column: 3, scope: !795)
!855 = !DILocation(line: 731, column: 10, scope: !795)
!856 = !DILocation(line: 731, column: 46, scope: !795)
!857 = !DILocation(line: 732, column: 11, scope: !795)
!858 = !DILocation(line: 731, column: 29, scope: !795)
!859 = !DILocation(line: 734, column: 3, scope: !795)
!860 = !DILocation(line: 734, column: 10, scope: !795)
!861 = !DILocation(line: 734, column: 27, scope: !795)
!862 = !DILocation(line: 734, column: 33, scope: !795)
!863 = !DILocation(line: 735, column: 3, scope: !795)
!864 = !DILocation(line: 735, column: 10, scope: !795)
!865 = !DILocation(line: 735, column: 46, scope: !795)
!866 = !DILocation(line: 736, column: 11, scope: !795)
!867 = !DILocation(line: 735, column: 29, scope: !795)
!868 = !DILocation(line: 738, column: 3, scope: !795)
!869 = !DILocation(line: 738, column: 10, scope: !795)
!870 = !DILocation(line: 738, column: 27, scope: !795)
!871 = !DILocation(line: 738, column: 33, scope: !795)
!872 = !DILocation(line: 739, column: 3, scope: !795)
!873 = !DILocation(line: 739, column: 10, scope: !795)
!874 = !DILocation(line: 739, column: 44, scope: !795)
!875 = !DILocation(line: 739, column: 51, scope: !795)
!876 = !DILocation(line: 739, column: 27, scope: !795)
!877 = !DILocation(line: 740, column: 33, scope: !795)
!878 = !DILocation(line: 740, column: 3, scope: !795)
!879 = !DILocation(line: 740, column: 10, scope: !795)
!880 = !DILocation(line: 740, column: 25, scope: !795)
!881 = !DILocation(line: 740, column: 31, scope: !795)
!882 = !DILocation(line: 741, column: 1, scope: !795)
!883 = distinct !DISubprogram(name: "init_iconv_desc", scope: !3, file: !3, line: 640, type: !884, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !265)
!884 = !DISubroutineType(types: !885)
!885 = !{!355, !287, !338, !338}
!886 = !DILocalVariable(name: "pfile", arg: 1, scope: !883, file: !3, line: 640, type: !287)
!887 = !DILocation(line: 640, column: 30, scope: !883)
!888 = !DILocalVariable(name: "to", arg: 2, scope: !883, file: !3, line: 640, type: !338)
!889 = !DILocation(line: 640, column: 49, scope: !883)
!890 = !DILocalVariable(name: "from", arg: 3, scope: !883, file: !3, line: 640, type: !338)
!891 = !DILocation(line: 640, column: 65, scope: !883)
!892 = !DILocalVariable(name: "ret", scope: !883, file: !3, line: 642, type: !355)
!893 = !DILocation(line: 642, column: 25, scope: !883)
!894 = !DILocalVariable(name: "pair", scope: !883, file: !3, line: 643, type: !251)
!895 = !DILocation(line: 643, column: 9, scope: !883)
!896 = !DILocalVariable(name: "i", scope: !883, file: !3, line: 644, type: !168)
!897 = !DILocation(line: 644, column: 10, scope: !883)
!898 = !DILocation(line: 646, column: 20, scope: !899)
!899 = distinct !DILexicalBlock(scope: !883, file: !3, line: 646, column: 7)
!900 = !DILocation(line: 646, column: 24, scope: !899)
!901 = !DILocation(line: 646, column: 8, scope: !899)
!902 = !DILocation(line: 646, column: 7, scope: !883)
!903 = !DILocation(line: 648, column: 11, scope: !904)
!904 = distinct !DILexicalBlock(scope: !899, file: !3, line: 647, column: 5)
!905 = !DILocation(line: 648, column: 16, scope: !904)
!906 = !DILocation(line: 649, column: 11, scope: !904)
!907 = !DILocation(line: 649, column: 14, scope: !904)
!908 = !DILocation(line: 650, column: 11, scope: !904)
!909 = !DILocation(line: 650, column: 17, scope: !904)
!910 = !DILocation(line: 651, column: 7, scope: !904)
!911 = !DILocation(line: 654, column: 19, scope: !883)
!912 = !DILocation(line: 654, column: 8, scope: !883)
!913 = !DILocation(line: 656, column: 10, scope: !883)
!914 = !DILocation(line: 656, column: 16, scope: !883)
!915 = !DILocation(line: 656, column: 3, scope: !883)
!916 = !DILocation(line: 657, column: 10, scope: !883)
!917 = !DILocation(line: 657, column: 3, scope: !883)
!918 = !DILocation(line: 658, column: 10, scope: !883)
!919 = !DILocation(line: 658, column: 16, scope: !883)
!920 = !DILocation(line: 658, column: 3, scope: !883)
!921 = !DILocation(line: 659, column: 10, scope: !922)
!922 = distinct !DILexicalBlock(scope: !883, file: !3, line: 659, column: 3)
!923 = !DILocation(line: 659, column: 8, scope: !922)
!924 = !DILocation(line: 659, column: 15, scope: !925)
!925 = distinct !DILexicalBlock(scope: !922, file: !3, line: 659, column: 3)
!926 = !DILocation(line: 659, column: 17, scope: !925)
!927 = !DILocation(line: 659, column: 3, scope: !922)
!928 = !DILocation(line: 660, column: 22, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !3, line: 660, column: 9)
!930 = !DILocation(line: 660, column: 43, scope: !929)
!931 = !DILocation(line: 660, column: 28, scope: !929)
!932 = !DILocation(line: 660, column: 46, scope: !929)
!933 = !DILocation(line: 660, column: 10, scope: !929)
!934 = !DILocation(line: 660, column: 9, scope: !925)
!935 = !DILocation(line: 662, column: 28, scope: !936)
!936 = distinct !DILexicalBlock(scope: !929, file: !3, line: 661, column: 7)
!937 = !DILocation(line: 662, column: 13, scope: !936)
!938 = !DILocation(line: 662, column: 31, scope: !936)
!939 = !DILocation(line: 662, column: 6, scope: !936)
!940 = !DILocation(line: 662, column: 11, scope: !936)
!941 = !DILocation(line: 663, column: 26, scope: !936)
!942 = !DILocation(line: 663, column: 11, scope: !936)
!943 = !DILocation(line: 663, column: 29, scope: !936)
!944 = !DILocation(line: 663, column: 6, scope: !936)
!945 = !DILocation(line: 663, column: 9, scope: !936)
!946 = !DILocation(line: 664, column: 6, scope: !936)
!947 = !DILocation(line: 664, column: 12, scope: !936)
!948 = !DILocation(line: 665, column: 2, scope: !936)
!949 = !DILocation(line: 660, column: 50, scope: !929)
!950 = !DILocation(line: 659, column: 49, scope: !925)
!951 = !DILocation(line: 659, column: 3, scope: !925)
!952 = distinct !{!952, !927, !953}
!953 = !DILocation(line: 666, column: 7, scope: !922)
!954 = !DILocation(line: 671, column: 11, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 670, column: 5)
!956 = distinct !DILexicalBlock(scope: !883, file: !3, line: 669, column: 7)
!957 = !DILocation(line: 671, column: 16, scope: !955)
!958 = !DILocation(line: 672, column: 16, scope: !955)
!959 = !DILocation(line: 672, column: 11, scope: !955)
!960 = !DILocation(line: 672, column: 14, scope: !955)
!961 = !DILocation(line: 673, column: 11, scope: !955)
!962 = !DILocation(line: 673, column: 17, scope: !955)
!963 = !DILocation(line: 675, column: 15, scope: !964)
!964 = distinct !DILexicalBlock(scope: !955, file: !3, line: 675, column: 11)
!965 = !DILocation(line: 675, column: 18, scope: !964)
!966 = !DILocation(line: 675, column: 11, scope: !955)
!967 = !DILocation(line: 677, column: 8, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !3, line: 677, column: 8)
!969 = distinct !DILexicalBlock(scope: !964, file: !3, line: 676, column: 2)
!970 = !DILocation(line: 677, column: 14, scope: !968)
!971 = !DILocation(line: 677, column: 8, scope: !969)
!972 = !DILocation(line: 678, column: 17, scope: !968)
!973 = !DILocation(line: 680, column: 10, scope: !968)
!974 = !DILocation(line: 680, column: 16, scope: !968)
!975 = !DILocation(line: 678, column: 6, scope: !968)
!976 = !DILocation(line: 682, column: 17, scope: !968)
!977 = !DILocation(line: 682, column: 6, scope: !968)
!978 = !DILocation(line: 684, column: 8, scope: !969)
!979 = !DILocation(line: 684, column: 13, scope: !969)
!980 = !DILocation(line: 685, column: 2, scope: !969)
!981 = !DILocation(line: 696, column: 3, scope: !883)
!982 = !DILocation(line: 697, column: 1, scope: !883)
!983 = distinct !DISubprogram(name: "_cpp_destroy_iconv", scope: !3, file: !3, line: 745, type: !632, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!984 = !DILocalVariable(name: "pfile", arg: 1, scope: !983, file: !3, line: 745, type: !287)
!985 = !DILocation(line: 745, column: 33, scope: !983)
!986 = !DILocation(line: 749, column: 11, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 749, column: 11)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 748, column: 5)
!989 = distinct !DILexicalBlock(scope: !983, file: !3, line: 747, column: 7)
!990 = !DILocation(line: 749, column: 18, scope: !987)
!991 = !DILocation(line: 749, column: 35, scope: !987)
!992 = !DILocation(line: 749, column: 40, scope: !987)
!993 = !DILocation(line: 749, column: 11, scope: !988)
!994 = !DILocation(line: 750, column: 2, scope: !987)
!995 = !DILocation(line: 751, column: 11, scope: !996)
!996 = distinct !DILexicalBlock(scope: !988, file: !3, line: 751, column: 11)
!997 = !DILocation(line: 751, column: 18, scope: !996)
!998 = !DILocation(line: 751, column: 33, scope: !996)
!999 = !DILocation(line: 751, column: 38, scope: !996)
!1000 = !DILocation(line: 751, column: 11, scope: !988)
!1001 = !DILocation(line: 752, column: 2, scope: !996)
!1002 = !DILocation(line: 753, column: 11, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !988, file: !3, line: 753, column: 11)
!1004 = !DILocation(line: 753, column: 18, scope: !1003)
!1005 = !DILocation(line: 753, column: 35, scope: !1003)
!1006 = !DILocation(line: 753, column: 40, scope: !1003)
!1007 = !DILocation(line: 753, column: 11, scope: !988)
!1008 = !DILocation(line: 754, column: 2, scope: !1003)
!1009 = !DILocation(line: 755, column: 11, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !988, file: !3, line: 755, column: 11)
!1011 = !DILocation(line: 755, column: 18, scope: !1010)
!1012 = !DILocation(line: 755, column: 35, scope: !1010)
!1013 = !DILocation(line: 755, column: 40, scope: !1010)
!1014 = !DILocation(line: 755, column: 11, scope: !988)
!1015 = !DILocation(line: 756, column: 2, scope: !1010)
!1016 = !DILocation(line: 757, column: 11, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !988, file: !3, line: 757, column: 11)
!1018 = !DILocation(line: 757, column: 18, scope: !1017)
!1019 = !DILocation(line: 757, column: 33, scope: !1017)
!1020 = !DILocation(line: 757, column: 38, scope: !1017)
!1021 = !DILocation(line: 757, column: 11, scope: !988)
!1022 = !DILocation(line: 758, column: 2, scope: !1017)
!1023 = !DILocation(line: 760, column: 1, scope: !983)
!1024 = distinct !DISubprogram(name: "convert_using_iconv", scope: !3, file: !3, line: 562, type: !1025, scopeLine: 564, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !265)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!162, !166, !261, !168, !362}
!1027 = !DILocalVariable(name: "cd", arg: 1, scope: !1024, file: !3, line: 562, type: !166)
!1028 = !DILocation(line: 562, column: 30, scope: !1024)
!1029 = !DILocalVariable(name: "from", arg: 2, scope: !1024, file: !3, line: 562, type: !261)
!1030 = !DILocation(line: 562, column: 47, scope: !1024)
!1031 = !DILocalVariable(name: "flen", arg: 3, scope: !1024, file: !3, line: 562, type: !168)
!1032 = !DILocation(line: 562, column: 60, scope: !1024)
!1033 = !DILocalVariable(name: "to", arg: 4, scope: !1024, file: !3, line: 563, type: !362)
!1034 = !DILocation(line: 563, column: 28, scope: !1024)
!1035 = !DILocalVariable(name: "inbuf", scope: !1024, file: !3, line: 565, type: !251)
!1036 = !DILocation(line: 565, column: 21, scope: !1024)
!1037 = !DILocalVariable(name: "outbuf", scope: !1024, file: !3, line: 566, type: !251)
!1038 = !DILocation(line: 566, column: 9, scope: !1024)
!1039 = !DILocalVariable(name: "inbytesleft", scope: !1024, file: !3, line: 567, type: !168)
!1040 = !DILocation(line: 567, column: 10, scope: !1024)
!1041 = !DILocalVariable(name: "outbytesleft", scope: !1024, file: !3, line: 567, type: !168)
!1042 = !DILocation(line: 567, column: 23, scope: !1024)
!1043 = !DILocation(line: 570, column: 7, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 570, column: 7)
!1045 = !DILocation(line: 570, column: 7, scope: !1024)
!1046 = !DILocation(line: 571, column: 5, scope: !1044)
!1047 = !DILocation(line: 573, column: 31, scope: !1024)
!1048 = !DILocation(line: 573, column: 9, scope: !1024)
!1049 = !DILocation(line: 574, column: 17, scope: !1024)
!1050 = !DILocation(line: 574, column: 15, scope: !1024)
!1051 = !DILocation(line: 575, column: 20, scope: !1024)
!1052 = !DILocation(line: 575, column: 24, scope: !1024)
!1053 = !DILocation(line: 575, column: 31, scope: !1024)
!1054 = !DILocation(line: 575, column: 35, scope: !1024)
!1055 = !DILocation(line: 575, column: 29, scope: !1024)
!1056 = !DILocation(line: 575, column: 10, scope: !1024)
!1057 = !DILocation(line: 576, column: 18, scope: !1024)
!1058 = !DILocation(line: 576, column: 22, scope: !1024)
!1059 = !DILocation(line: 576, column: 30, scope: !1024)
!1060 = !DILocation(line: 576, column: 34, scope: !1024)
!1061 = !DILocation(line: 576, column: 28, scope: !1024)
!1062 = !DILocation(line: 576, column: 16, scope: !1024)
!1063 = !DILocation(line: 578, column: 3, scope: !1024)
!1064 = !DILocation(line: 581, column: 13, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 579, column: 5)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 578, column: 3)
!1067 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 578, column: 3)
!1068 = !DILocation(line: 585, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 585, column: 11)
!1070 = !DILocation(line: 585, column: 11, scope: !1065)
!1071 = !DILocation(line: 588, column: 8, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 588, column: 8)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 586, column: 2)
!1074 = !DILocation(line: 588, column: 8, scope: !1073)
!1075 = !DILocation(line: 590, column: 12, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 590, column: 12)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 589, column: 6)
!1078 = !DILocation(line: 590, column: 18, scope: !1076)
!1079 = !DILocation(line: 590, column: 12, scope: !1077)
!1080 = !DILocation(line: 591, column: 3, scope: !1076)
!1081 = !DILocation(line: 593, column: 8, scope: !1077)
!1082 = !DILocation(line: 593, column: 8, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 593, column: 8)
!1084 = !DILocation(line: 594, column: 12, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 594, column: 12)
!1086 = !DILocation(line: 594, column: 12, scope: !1077)
!1087 = !DILocation(line: 595, column: 3, scope: !1085)
!1088 = !DILocation(line: 596, column: 6, scope: !1077)
!1089 = !DILocation(line: 598, column: 14, scope: !1073)
!1090 = !DILocation(line: 598, column: 18, scope: !1073)
!1091 = !DILocation(line: 598, column: 26, scope: !1073)
!1092 = !DILocation(line: 598, column: 24, scope: !1073)
!1093 = !DILocation(line: 598, column: 4, scope: !1073)
!1094 = !DILocation(line: 598, column: 8, scope: !1073)
!1095 = !DILocation(line: 598, column: 12, scope: !1073)
!1096 = !DILocation(line: 599, column: 4, scope: !1073)
!1097 = !DILocation(line: 601, column: 11, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 601, column: 11)
!1099 = !DILocation(line: 601, column: 17, scope: !1098)
!1100 = !DILocation(line: 601, column: 11, scope: !1065)
!1101 = !DILocation(line: 602, column: 2, scope: !1098)
!1102 = !DILocation(line: 604, column: 7, scope: !1065)
!1103 = !DILocation(line: 604, column: 7, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 604, column: 7)
!1105 = !DILocation(line: 578, column: 3, scope: !1066)
!1106 = distinct !{!1106, !1107, !1108}
!1107 = !DILocation(line: 578, column: 3, scope: !1067)
!1108 = !DILocation(line: 605, column: 5, scope: !1067)
!1109 = !DILocation(line: 606, column: 1, scope: !1024)
!1110 = distinct !DISubprogram(name: "cpp_host_to_exec_charset", scope: !3, file: !3, line: 775, type: !1111, scopeLine: 776, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!253, !287, !253}
!1113 = !DILocalVariable(name: "pfile", arg: 1, scope: !1110, file: !3, line: 775, type: !287)
!1114 = !DILocation(line: 775, column: 39, scope: !1110)
!1115 = !DILocalVariable(name: "c", arg: 2, scope: !1110, file: !3, line: 775, type: !253)
!1116 = !DILocation(line: 775, column: 56, scope: !1110)
!1117 = !DILocalVariable(name: "sbuf", scope: !1110, file: !3, line: 777, type: !1118)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 8, elements: !247)
!1119 = !DILocation(line: 777, column: 9, scope: !1110)
!1120 = !DILocalVariable(name: "tbuf", scope: !1110, file: !3, line: 778, type: !363)
!1121 = !DILocation(line: 778, column: 22, scope: !1110)
!1122 = !DILocation(line: 783, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 783, column: 7)
!1124 = !DILocation(line: 783, column: 9, scope: !1123)
!1125 = !DILocation(line: 783, column: 7, scope: !1110)
!1126 = !DILocation(line: 785, column: 18, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 784, column: 5)
!1128 = !DILocation(line: 787, column: 19, scope: !1127)
!1129 = !DILocation(line: 787, column: 4, scope: !1127)
!1130 = !DILocation(line: 785, column: 7, scope: !1127)
!1131 = !DILocation(line: 788, column: 7, scope: !1127)
!1132 = !DILocation(line: 794, column: 13, scope: !1110)
!1133 = !DILocation(line: 794, column: 3, scope: !1110)
!1134 = !DILocation(line: 794, column: 11, scope: !1110)
!1135 = !DILocation(line: 797, column: 8, scope: !1110)
!1136 = !DILocation(line: 797, column: 14, scope: !1110)
!1137 = !DILocation(line: 798, column: 15, scope: !1110)
!1138 = !DILocation(line: 798, column: 8, scope: !1110)
!1139 = !DILocation(line: 798, column: 13, scope: !1110)
!1140 = !DILocation(line: 799, column: 8, scope: !1110)
!1141 = !DILocation(line: 799, column: 12, scope: !1110)
!1142 = !DILocation(line: 801, column: 8, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 801, column: 7)
!1144 = !DILocation(line: 801, column: 7, scope: !1110)
!1145 = !DILocation(line: 803, column: 18, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 802, column: 5)
!1147 = !DILocation(line: 803, column: 7, scope: !1146)
!1148 = !DILocation(line: 804, column: 7, scope: !1146)
!1149 = !DILocation(line: 806, column: 12, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 806, column: 7)
!1151 = !DILocation(line: 806, column: 16, scope: !1150)
!1152 = !DILocation(line: 806, column: 7, scope: !1110)
!1153 = !DILocation(line: 808, column: 18, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 807, column: 5)
!1155 = !DILocation(line: 810, column: 19, scope: !1154)
!1156 = !DILocation(line: 810, column: 4, scope: !1154)
!1157 = !DILocation(line: 808, column: 7, scope: !1154)
!1158 = !DILocation(line: 811, column: 7, scope: !1154)
!1159 = !DILocation(line: 813, column: 12, scope: !1110)
!1160 = !DILocation(line: 813, column: 7, scope: !1110)
!1161 = !DILocation(line: 813, column: 5, scope: !1110)
!1162 = !DILocation(line: 814, column: 13, scope: !1110)
!1163 = !DILocation(line: 814, column: 3, scope: !1110)
!1164 = !DILocation(line: 815, column: 10, scope: !1110)
!1165 = !DILocation(line: 815, column: 3, scope: !1110)
!1166 = !DILocation(line: 816, column: 1, scope: !1110)
!1167 = distinct !DISubprogram(name: "_cpp_valid_ucn", scope: !3, file: !3, line: 988, type: !1168, scopeLine: 991, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!253, !287, !260, !261, !163, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "normalize_state", file: !290, line: 641, size: 96, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1171, file: !290, line: 644, baseType: !253, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "prev_class", scope: !1171, file: !290, line: 646, baseType: !162, size: 8, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1171, file: !290, line: 648, baseType: !31, size: 32, offset: 64)
!1176 = !DILocalVariable(name: "pfile", arg: 1, scope: !1167, file: !3, line: 988, type: !287)
!1177 = !DILocation(line: 988, column: 29, scope: !1167)
!1178 = !DILocalVariable(name: "pstr", arg: 2, scope: !1167, file: !3, line: 988, type: !260)
!1179 = !DILocation(line: 988, column: 50, scope: !1167)
!1180 = !DILocalVariable(name: "limit", arg: 3, scope: !1167, file: !3, line: 989, type: !261)
!1181 = !DILocation(line: 989, column: 16, scope: !1167)
!1182 = !DILocalVariable(name: "identifier_pos", arg: 4, scope: !1167, file: !3, line: 989, type: !163)
!1183 = !DILocation(line: 989, column: 27, scope: !1167)
!1184 = !DILocalVariable(name: "nst", arg: 5, scope: !1167, file: !3, line: 990, type: !1170)
!1185 = !DILocation(line: 990, column: 27, scope: !1167)
!1186 = !DILocalVariable(name: "result", scope: !1167, file: !3, line: 992, type: !253)
!1187 = !DILocation(line: 992, column: 13, scope: !1167)
!1188 = !DILocalVariable(name: "c", scope: !1167, file: !3, line: 992, type: !253)
!1189 = !DILocation(line: 992, column: 21, scope: !1167)
!1190 = !DILocalVariable(name: "length", scope: !1167, file: !3, line: 993, type: !7)
!1191 = !DILocation(line: 993, column: 16, scope: !1167)
!1192 = !DILocalVariable(name: "str", scope: !1167, file: !3, line: 994, type: !261)
!1193 = !DILocation(line: 994, column: 16, scope: !1167)
!1194 = !DILocation(line: 994, column: 23, scope: !1167)
!1195 = !DILocation(line: 994, column: 22, scope: !1167)
!1196 = !DILocalVariable(name: "base", scope: !1167, file: !3, line: 995, type: !261)
!1197 = !DILocation(line: 995, column: 16, scope: !1167)
!1198 = !DILocation(line: 995, column: 23, scope: !1167)
!1199 = !DILocation(line: 995, column: 27, scope: !1167)
!1200 = !DILocation(line: 997, column: 8, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 997, column: 7)
!1202 = !DILocation(line: 997, column: 38, scope: !1201)
!1203 = !DILocation(line: 997, column: 42, scope: !1201)
!1204 = !DILocation(line: 997, column: 7, scope: !1167)
