; ModuleID = 'tree-pretty-print.c'
source_filename = "tree-pretty-print.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }
%struct.pp_wrapping_mode_t = type { i32, i32 }
%struct.text_info = type { i8*, [1 x %struct.__va_list_tag]*, i32, i32*, %union.tree_node** }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.tree_node = type { %struct.tree_function_decl }

!549 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS_GUESSED", value: 7, isUnsigned: true)
!550 = !DIEnumerator(name: "PRED_CONTINUE", value: 8, isUnsigned: true)
!551 = !DIEnumerator(name: "PRED_NORETURN", value: 9, isUnsigned: true)
!552 = !DIEnumerator(name: "PRED_COLD_FUNCTION", value: 10, isUnsigned: true)
!553 = !DIEnumerator(name: "PRED_LOOP_BRANCH", value: 11, isUnsigned: true)
!554 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!555 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!556 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!557 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!558 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!559 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!560 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!561 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!562 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!563 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!564 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!565 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!566 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!567 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!568 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!569 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!570 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_node_structure_enum", file: !135, line: 630, baseType: !7, size: 32, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!573 = !DIEnumerator(name: "TS_BASE", value: 0, isUnsigned: true)
!574 = !DIEnumerator(name: "TS_COMMON", value: 1, isUnsigned: true)
!575 = !DIEnumerator(name: "TS_INT_CST", value: 2, isUnsigned: true)
!576 = !DIEnumerator(name: "TS_REAL_CST", value: 3, isUnsigned: true)
!577 = !DIEnumerator(name: "TS_FIXED_CST", value: 4, isUnsigned: true)
!578 = !DIEnumerator(name: "TS_VECTOR", value: 5, isUnsigned: true)
!579 = !DIEnumerator(name: "TS_STRING", value: 6, isUnsigned: true)
!580 = !DIEnumerator(name: "TS_COMPLEX", value: 7, isUnsigned: true)
!581 = !DIEnumerator(name: "TS_IDENTIFIER", value: 8, isUnsigned: true)
!582 = !DIEnumerator(name: "TS_DECL_MINIMAL", value: 9, isUnsigned: true)
!583 = !DIEnumerator(name: "TS_DECL_COMMON", value: 10, isUnsigned: true)
!584 = !DIEnumerator(name: "TS_DECL_WRTL", value: 11, isUnsigned: true)
!585 = !DIEnumerator(name: "TS_DECL_NON_COMMON", value: 12, isUnsigned: true)
!586 = !DIEnumerator(name: "TS_DECL_WITH_VIS", value: 13, isUnsigned: true)
!587 = !DIEnumerator(name: "TS_FIELD_DECL", value: 14, isUnsigned: true)
!588 = !DIEnumerator(name: "TS_VAR_DECL", value: 15, isUnsigned: true)
!589 = !DIEnumerator(name: "TS_PARM_DECL", value: 16, isUnsigned: true)
!590 = !DIEnumerator(name: "TS_LABEL_DECL", value: 17, isUnsigned: true)
!591 = !DIEnumerator(name: "TS_RESULT_DECL", value: 18, isUnsigned: true)
!592 = !DIEnumerator(name: "TS_CONST_DECL", value: 19, isUnsigned: true)
!593 = !DIEnumerator(name: "TS_TYPE_DECL", value: 20, isUnsigned: true)
!594 = !DIEnumerator(name: "TS_FUNCTION_DECL", value: 21, isUnsigned: true)
!595 = !DIEnumerator(name: "TS_TYPE", value: 22, isUnsigned: true)
!596 = !DIEnumerator(name: "TS_LIST", value: 23, isUnsigned: true)
!597 = !DIEnumerator(name: "TS_VEC", value: 24, isUnsigned: true)
!598 = !DIEnumerator(name: "TS_EXP", value: 25, isUnsigned: true)
!599 = !DIEnumerator(name: "TS_SSA_NAME", value: 26, isUnsigned: true)
!600 = !DIEnumerator(name: "TS_BLOCK", value: 27, isUnsigned: true)
!601 = !DIEnumerator(name: "TS_BINFO", value: 28, isUnsigned: true)
!602 = !DIEnumerator(name: "TS_STATEMENT_LIST", value: 29, isUnsigned: true)
!603 = !DIEnumerator(name: "TS_CONSTRUCTOR", value: 30, isUnsigned: true)
!604 = !DIEnumerator(name: "TS_OMP_CLAUSE", value: 31, isUnsigned: true)
!605 = !DIEnumerator(name: "TS_OPTIMIZATION", value: 32, isUnsigned: true)
!606 = !DIEnumerator(name: "TS_TARGET_OPTION", value: 33, isUnsigned: true)
!607 = !DIEnumerator(name: "LAST_TS_ENUM", value: 34, isUnsigned: true)
!608 = !{!609, !610, !707, !134, !740, !666, !664, !1055, !535, !540}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !611, line: 56, baseType: !612)
!611 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !614)
!614 = !{!615, !648, !654, !667, !686, !697, !702, !713, !719, !733, !745, !783, !791, !819, !836, !837, !842, !851, !857, !862, !866, !870, !1456, !1505, !1511, !1517, !1524, !1537, !1551, !1568, !1580, !1602, !1617, !1789}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !135, line: 3372, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !616, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !616, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !616, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !616, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !616, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !616, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !616, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !616, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !616, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !616, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !616, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !616, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !616, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !616, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !616, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !616, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !616, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !616, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !616, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !616, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !616, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !616, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !616, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !616, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !616, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !616, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !616, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !616, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !616, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !616, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !135, line: 3373, baseType: !649, size: 192)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !649, file: !135, line: 403, baseType: !616, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !649, file: !135, line: 404, baseType: !610, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !649, file: !135, line: 405, baseType: !610, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !613, file: !135, line: 3374, baseType: !655, size: 320)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !135, line: 1385, baseType: !649, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !655, file: !135, line: 1386, baseType: !659, size: 128, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !660, line: 58, baseType: !661)
!660 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 54, size: 128, elements: !662)
!662 = !{!663, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !661, file: !660, line: 56, baseType: !664, size: 64)
!664 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !661, file: !660, line: 57, baseType: !666, size: 64, offset: 64)
!666 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !613, file: !135, line: 3375, baseType: !668, size: 256)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !668, file: !135, line: 1398, baseType: !649, size: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !668, file: !135, line: 1399, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !674, line: 52, size: 256, elements: !675)
!674 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!675 = !{!676, !677, !678, !679, !680, !681, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !673, file: !674, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !673, file: !674, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !673, file: !674, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !673, file: !674, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !673, file: !674, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !673, file: !674, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !673, file: !674, line: 62, baseType: !683, size: 192, offset: 64)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 192, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 3)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !613, file: !135, line: 3376, baseType: !687, size: 256)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !687, file: !135, line: 1409, baseType: !649, size: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !687, file: !135, line: 1410, baseType: !691, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !693, line: 27, size: 192, elements: !694)
!693 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !693, line: 29, baseType: !659, size: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !692, file: !693, line: 30, baseType: !5, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !613, file: !135, line: 3377, baseType: !698, size: 256)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !135, line: 1438, baseType: !649, size: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !698, file: !135, line: 1439, baseType: !610, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !613, file: !135, line: 3378, baseType: !703, size: 256)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !704)
!704 = !{!705, !706, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !703, file: !135, line: 1419, baseType: !649, size: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !703, file: !135, line: 1420, baseType: !707, size: 32, offset: 192)
!707 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !703, file: !135, line: 1421, baseType: !709, size: 8, offset: 224)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 8, elements: !711)
!710 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!711 = !{!712}
!712 = !DISubrange(count: 1)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !613, file: !135, line: 3379, baseType: !714, size: 320)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !714, file: !135, line: 1429, baseType: !649, size: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !714, file: !135, line: 1430, baseType: !610, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !714, file: !135, line: 1431, baseType: !610, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !613, file: !135, line: 3380, baseType: !720, size: 320)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !135, line: 1461, baseType: !649, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !720, file: !135, line: 1462, baseType: !724, size: 128, offset: 192)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !725, line: 31, size: 128, elements: !726)
!725 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!726 = !{!727, !731, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !724, file: !725, line: 32, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !724, file: !725, line: 33, baseType: !7, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !724, file: !725, line: 34, baseType: !7, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !613, file: !135, line: 3381, baseType: !734, size: 384)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !735)
!735 = !{!736, !737, !742, !743, !744}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !135, line: 2508, baseType: !649, size: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !734, file: !135, line: 2509, baseType: !738, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !739, line: 58, baseType: !740)
!739 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !741, line: 44, baseType: !7)
!741 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !734, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !135, line: 2511, baseType: !610, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !734, file: !135, line: 2512, baseType: !610, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !613, file: !135, line: 3382, baseType: !746, size: 896)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !135, line: 2653, baseType: !734, size: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !135, line: 2654, baseType: !610, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !746, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !746, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !746, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !746, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !746, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !746, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !746, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !746, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !746, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !746, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !746, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !746, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !746, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !746, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !746, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !746, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !746, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !746, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !746, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !746, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !746, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !746, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !746, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !746, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !746, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !746, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !746, file: !135, line: 2705, baseType: !610, size: 64, offset: 576)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !746, file: !135, line: 2706, baseType: !610, size: 64, offset: 640)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !746, file: !135, line: 2707, baseType: !610, size: 64, offset: 704)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !746, file: !135, line: 2708, baseType: !610, size: 64, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !746, file: !135, line: 2711, baseType: !781, size: 64, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !613, file: !135, line: 3383, baseType: !784, size: 960)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !135, line: 2757, baseType: !746, size: 896)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !784, file: !135, line: 2758, baseType: !788, size: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !611, line: 50, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !611, line: 49, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !613, file: !135, line: 3384, baseType: !792, size: 1472)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !793)
!793 = !{!794, !815, !816, !817, !818}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !135, line: 3115, baseType: !795, size: 1216)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !135, line: 2985, baseType: !784, size: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !795, file: !135, line: 2986, baseType: !610, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !795, file: !135, line: 2987, baseType: !610, size: 64, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !795, file: !135, line: 2988, baseType: !610, size: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !795, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !795, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !795, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !795, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !795, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !795, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !795, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !795, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !795, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !795, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !795, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !795, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !795, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !795, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !792, file: !135, line: 3117, baseType: !610, size: 64, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !792, file: !135, line: 3119, baseType: !610, size: 64, offset: 1280)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !792, file: !135, line: 3121, baseType: !610, size: 64, offset: 1344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !792, file: !135, line: 3123, baseType: !610, size: 64, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !613, file: !135, line: 3385, baseType: !820, size: 1088)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !820, file: !135, line: 2875, baseType: !784, size: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !820, file: !135, line: 2876, baseType: !788, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !820, file: !135, line: 2877, baseType: !825, size: 64, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !827, line: 172, size: 128, elements: !828)
!827 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !826, file: !827, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !826, file: !827, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !826, file: !827, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !826, file: !827, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !826, file: !827, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !826, file: !827, line: 195, baseType: !7, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !826, file: !827, line: 199, baseType: !610, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !613, file: !135, line: 3386, baseType: !795, size: 1216)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !613, file: !135, line: 3387, baseType: !838, size: 1280)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !135, line: 3094, baseType: !795, size: 1216)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !838, file: !135, line: 3095, baseType: !825, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !613, file: !135, line: 3388, baseType: !843, size: 1216)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !135, line: 2825, baseType: !746, size: 896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !843, file: !135, line: 2827, baseType: !610, size: 64, offset: 896)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !843, file: !135, line: 2828, baseType: !610, size: 64, offset: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !843, file: !135, line: 2829, baseType: !610, size: 64, offset: 1024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !843, file: !135, line: 2830, baseType: !610, size: 64, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !843, file: !135, line: 2831, baseType: !610, size: 64, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !613, file: !135, line: 3389, baseType: !852, size: 1024)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !852, file: !135, line: 2851, baseType: !784, size: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !852, file: !135, line: 2852, baseType: !707, size: 32, offset: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !852, file: !135, line: 2853, baseType: !707, size: 32, offset: 992)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !613, file: !135, line: 3390, baseType: !858, size: 1024)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !135, line: 2858, baseType: !784, size: 960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !858, file: !135, line: 2859, baseType: !825, size: 64, offset: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !613, file: !135, line: 3391, baseType: !863, size: 960)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !863, file: !135, line: 2863, baseType: !784, size: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !613, file: !135, line: 3392, baseType: !867, size: 1472)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !135, line: 3305, baseType: !792, size: 1472)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !613, file: !135, line: 3393, baseType: !871, size: 1792)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !872)
!872 = !{!873, !874, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !135, line: 3249, baseType: !792, size: 1472)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !871, file: !135, line: 3251, baseType: !875, size: 64, offset: 1472)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !877, line: 463, size: 1152, elements: !878)
!877 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!878 = !{!879, !882, !1202, !1203, !1376, !1379, !1380, !1381, !1382, !1383, !1384, !1408, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !876, file: !877, line: 464, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !877, line: 464, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !876, file: !877, line: 467, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !885)
!885 = !{!886, !1177, !1178, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1200, !1201}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !884, file: !330, line: 377, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !611, line: 111, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !890)
!890 = !{!891, !1140, !1141, !1142, !1145, !1151, !1152, !1153, !1171, !1172, !1173, !1174, !1175, !1176}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !889, file: !330, line: 219, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !894, file: !330, line: 151, baseType: !897, size: 128)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !898, file: !330, line: 150, baseType: !7, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !898, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !898, file: !330, line: 150, baseType: !903, size: 64, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 64, elements: !711)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !611, line: 108, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !907)
!907 = !{!908, !909, !910, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !906, file: !330, line: 124, baseType: !888, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !906, file: !330, line: 125, baseType: !888, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !906, file: !330, line: 131, baseType: !911, size: 64, offset: 128)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !912)
!912 = !{!913, !1131}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !911, file: !330, line: 129, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !611, line: 66, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !917, line: 143, size: 192, elements: !918)
!917 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!918 = !{!919, !1129, !1130}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !916, file: !917, line: 145, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !611, line: 69, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !917, line: 136, size: 192, elements: !923)
!923 = !{!924, !1127, !1128}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !922, file: !917, line: 137, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !611, line: 58, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !917, line: 737, size: 768, elements: !928)
!928 = !{!929, !946, !980, !986, !991, !996, !1003, !1009, !1015, !1020, !1034, !1039, !1045, !1050, !1062, !1067, !1085, !1092, !1099, !1105, !1110, !1116, !1122}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !927, file: !917, line: 738, baseType: !930, size: 256)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !917, line: 271, size: 256, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !930, file: !917, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !930, file: !917, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !930, file: !917, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !930, file: !917, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !930, file: !917, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !930, file: !917, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !930, file: !917, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !930, file: !917, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !930, file: !917, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !930, file: !917, line: 312, baseType: !7, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !930, file: !917, line: 316, baseType: !738, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !930, file: !917, line: 319, baseType: !7, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !930, file: !917, line: 323, baseType: !888, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !930, file: !917, line: 327, baseType: !610, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !927, file: !917, line: 739, baseType: !947, size: 448)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !917, line: 350, size: 448, elements: !948)
!948 = !{!949, !978}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !947, file: !917, line: 353, baseType: !950, size: 384)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !917, line: 333, size: 384, elements: !951)
!951 = !{!952, !953, !961}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !950, file: !917, line: 336, baseType: !930, size: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !950, file: !917, line: 343, baseType: !954, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !956, line: 37, size: 128, elements: !957)
!956 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !956, line: 39, baseType: !954, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !955, file: !956, line: 40, baseType: !960, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !950, file: !917, line: 344, baseType: !962, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !956, line: 45, size: 320, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !956, line: 47, baseType: !962, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !963, file: !956, line: 48, baseType: !967, size: 256, offset: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !968)
!968 = !{!969, !971, !972, !977}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !967, file: !135, line: 1884, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !135, line: 1885, baseType: !970, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !967, file: !135, line: 1891, baseType: !973, size: 64, offset: 128)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !967, file: !135, line: 1891, size: 64, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !973, file: !135, line: 1891, baseType: !925, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !973, file: !135, line: 1891, baseType: !610, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !967, file: !135, line: 1892, baseType: !960, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !947, file: !917, line: 359, baseType: !979, size: 64, offset: 384)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 64, elements: !711)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !927, file: !917, line: 740, baseType: !981, size: 512)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !917, line: 365, size: 512, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !981, file: !917, line: 368, baseType: !950, size: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !981, file: !917, line: 373, baseType: !610, size: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !981, file: !917, line: 374, baseType: !610, size: 64, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !927, file: !917, line: 741, baseType: !987, size: 576)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !917, line: 380, size: 576, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !987, file: !917, line: 383, baseType: !981, size: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !987, file: !917, line: 389, baseType: !979, size: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !927, file: !917, line: 742, baseType: !992, size: 320)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !917, line: 395, size: 320, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !992, file: !917, line: 397, baseType: !930, size: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !992, file: !917, line: 400, baseType: !914, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !927, file: !917, line: 743, baseType: !997, size: 448)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !917, line: 406, size: 448, elements: !998)
!998 = !{!999, !1000, !1001, !1002}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !997, file: !917, line: 408, baseType: !930, size: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !997, file: !917, line: 412, baseType: !610, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !997, file: !917, line: 420, baseType: !610, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !997, file: !917, line: 423, baseType: !914, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !927, file: !917, line: 744, baseType: !1004, size: 384)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !917, line: 429, size: 384, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !917, line: 431, baseType: !930, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1004, file: !917, line: 434, baseType: !610, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1004, file: !917, line: 437, baseType: !914, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !927, file: !917, line: 745, baseType: !1010, size: 384)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !917, line: 443, size: 384, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1010, file: !917, line: 445, baseType: !930, size: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1010, file: !917, line: 449, baseType: !610, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1010, file: !917, line: 453, baseType: !914, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !927, file: !917, line: 746, baseType: !1016, size: 320)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !917, line: 459, size: 320, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1016, file: !917, line: 461, baseType: !930, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1016, file: !917, line: 464, baseType: !610, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !927, file: !917, line: 747, baseType: !1021, size: 768)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !917, line: 469, size: 768, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1021, file: !917, line: 471, baseType: !930, size: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1021, file: !917, line: 474, baseType: !7, size: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1021, file: !917, line: 475, baseType: !7, size: 32, offset: 288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1021, file: !917, line: 478, baseType: !610, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1021, file: !917, line: 481, baseType: !1028, size: 384, offset: 384)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 384, elements: !711)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1029, file: !135, line: 1920, baseType: !967, size: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1029, file: !135, line: 1921, baseType: !610, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1029, file: !135, line: 1922, baseType: !738, size: 32, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !927, file: !917, line: 748, baseType: !1035, size: 320)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !917, line: 487, size: 320, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1035, file: !917, line: 490, baseType: !930, size: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1035, file: !917, line: 494, baseType: !707, size: 32, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !927, file: !917, line: 749, baseType: !1040, size: 384)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !917, line: 500, size: 384, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1040, file: !917, line: 502, baseType: !930, size: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1040, file: !917, line: 506, baseType: !914, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1040, file: !917, line: 510, baseType: !914, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !927, file: !917, line: 750, baseType: !1046, size: 320)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !917, line: 529, size: 320, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1046, file: !917, line: 531, baseType: !930, size: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1046, file: !917, line: 540, baseType: !914, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !927, file: !917, line: 751, baseType: !1051, size: 704)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !917, line: 546, size: 704, elements: !1052)
!1052 = !{!1053, !1054, !1057, !1058, !1059, !1060, !1061}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1051, file: !917, line: 549, baseType: !981, size: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1051, file: !917, line: 553, baseType: !1055, size: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1051, file: !917, line: 557, baseType: !730, size: 8, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1051, file: !917, line: 558, baseType: !730, size: 8, offset: 584)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1051, file: !917, line: 559, baseType: !730, size: 8, offset: 592)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1051, file: !917, line: 560, baseType: !730, size: 8, offset: 600)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1051, file: !917, line: 566, baseType: !979, size: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !927, file: !917, line: 752, baseType: !1063, size: 384)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !917, line: 571, size: 384, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1063, file: !917, line: 573, baseType: !992, size: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !917, line: 577, baseType: !610, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !927, file: !917, line: 753, baseType: !1068, size: 576)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !917, line: 600, size: 576, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1075, !1084}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1068, file: !917, line: 602, baseType: !992, size: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1068, file: !917, line: 605, baseType: !610, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1068, file: !917, line: 609, baseType: !1073, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1074, line: 46, baseType: !664)
!1074 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1068, file: !917, line: 612, baseType: !1076, size: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !917, line: 581, size: 320, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1077, file: !917, line: 583, baseType: !134, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1077, file: !917, line: 586, baseType: !610, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1077, file: !917, line: 589, baseType: !610, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1077, file: !917, line: 592, baseType: !610, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1077, file: !917, line: 595, baseType: !610, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1068, file: !917, line: 616, baseType: !914, size: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !927, file: !917, line: 754, baseType: !1086, size: 512)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !917, line: 622, size: 512, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1086, file: !917, line: 624, baseType: !992, size: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1086, file: !917, line: 628, baseType: !610, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1086, file: !917, line: 632, baseType: !610, size: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1086, file: !917, line: 636, baseType: !610, size: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !927, file: !917, line: 755, baseType: !1093, size: 704)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !917, line: 642, size: 704, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1093, file: !917, line: 644, baseType: !1086, size: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1093, file: !917, line: 648, baseType: !610, size: 64, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1093, file: !917, line: 652, baseType: !610, size: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1093, file: !917, line: 653, baseType: !610, size: 64, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !927, file: !917, line: 756, baseType: !1100, size: 448)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !917, line: 663, size: 448, elements: !1101)
!1101 = !{!1102, !1103, !1104}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1100, file: !917, line: 665, baseType: !992, size: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1100, file: !917, line: 668, baseType: !610, size: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1100, file: !917, line: 673, baseType: !610, size: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !927, file: !917, line: 757, baseType: !1106, size: 384)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !917, line: 694, size: 384, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1106, file: !917, line: 696, baseType: !992, size: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1106, file: !917, line: 699, baseType: !610, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !927, file: !917, line: 758, baseType: !1111, size: 384)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !917, line: 681, size: 384, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1111, file: !917, line: 683, baseType: !930, size: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1111, file: !917, line: 686, baseType: !610, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1111, file: !917, line: 689, baseType: !610, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !927, file: !917, line: 759, baseType: !1117, size: 384)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !917, line: 707, size: 384, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1117, file: !917, line: 709, baseType: !930, size: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1117, file: !917, line: 712, baseType: !610, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1117, file: !917, line: 712, baseType: !610, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !927, file: !917, line: 760, baseType: !1123, size: 320)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !917, line: 718, size: 320, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1123, file: !917, line: 720, baseType: !930, size: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1123, file: !917, line: 723, baseType: !610, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !922, file: !917, line: 138, baseType: !921, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !917, line: 139, baseType: !921, size: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !916, file: !917, line: 146, baseType: !920, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !916, file: !917, line: 152, baseType: !914, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !911, file: !330, line: 130, baseType: !788, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !906, file: !330, line: 134, baseType: !609, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !906, file: !330, line: 137, baseType: !610, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !906, file: !330, line: 138, baseType: !738, size: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !906, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !906, file: !330, line: 144, baseType: !707, size: 32, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !906, file: !330, line: 145, baseType: !707, size: 32, offset: 416)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !906, file: !330, line: 146, baseType: !1139, size: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !666)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !889, file: !330, line: 220, baseType: !892, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !889, file: !330, line: 223, baseType: !609, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !889, file: !330, line: 226, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !889, file: !330, line: 229, baseType: !1146, size: 128, offset: 256)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 128, elements: !1149)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1149 = !{!1150}
!1150 = !DISubrange(count: 2)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !889, file: !330, line: 232, baseType: !888, size: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !889, file: !330, line: 233, baseType: !888, size: 64, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !889, file: !330, line: 238, baseType: !1154, size: 64, offset: 512)
!1154 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1155)
!1155 = !{!1156, !1162}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1154, file: !330, line: 236, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1158, file: !330, line: 275, baseType: !914, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1158, file: !330, line: 278, baseType: !914, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1154, file: !330, line: 237, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1164, file: !330, line: 261, baseType: !788, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1164, file: !330, line: 262, baseType: !788, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1164, file: !330, line: 266, baseType: !788, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1164, file: !330, line: 267, baseType: !788, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1164, file: !330, line: 270, baseType: !707, size: 32, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !889, file: !330, line: 241, baseType: !1139, size: 64, offset: 576)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !889, file: !330, line: 244, baseType: !707, size: 32, offset: 640)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !889, file: !330, line: 247, baseType: !707, size: 32, offset: 672)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !889, file: !330, line: 250, baseType: !707, size: 32, offset: 704)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !889, file: !330, line: 253, baseType: !707, size: 32, offset: 736)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !889, file: !330, line: 256, baseType: !707, size: 32, offset: 768)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !884, file: !330, line: 378, baseType: !887, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !884, file: !330, line: 381, baseType: !1179, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1181, file: !330, line: 282, baseType: !1184, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1185, file: !330, line: 281, baseType: !7, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1185, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1185, file: !330, line: 281, baseType: !1190, size: 64, offset: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 64, elements: !711)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !884, file: !330, line: 384, baseType: !707, size: 32, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !884, file: !330, line: 387, baseType: !707, size: 32, offset: 224)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !884, file: !330, line: 390, baseType: !707, size: 32, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !884, file: !330, line: 394, baseType: !1179, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !884, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !884, file: !330, line: 399, baseType: !1197, size: 64, offset: 416)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !1149)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !884, file: !330, line: 402, baseType: !1199, size: 64, offset: 480)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1149)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !884, file: !330, line: 406, baseType: !707, size: 32, offset: 544)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !884, file: !330, line: 409, baseType: !707, size: 32, offset: 576)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !876, file: !877, line: 470, baseType: !915, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !876, file: !877, line: 473, baseType: !1204, size: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !827, line: 39, size: 1152, elements: !1206)
!1206 = !{!1207, !1257, !1270, !1282, !1283, !1353, !1354, !1358, !1359, !1360, !1361, !1362}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1205, file: !827, line: 41, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1209, line: 144, baseType: !1210)
!1209 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1209, line: 100, size: 896, elements: !1212)
!1212 = !{!1213, !1221, !1226, !1231, !1233, !1234, !1235, !1236, !1237, !1238, !1243, !1245, !1246, !1251, !1256}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1211, file: !1209, line: 102, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1209, line: 52, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1209, line: 47, baseType: !7)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1211, file: !1209, line: 105, baseType: !1222, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1209, line: 59, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!707, !1219, !1219}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1211, file: !1209, line: 108, baseType: !1227, size: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1209, line: 63, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{null, !609}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1211, file: !1209, line: 111, baseType: !1232, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1211, file: !1209, line: 114, baseType: !1073, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1211, file: !1209, line: 117, baseType: !1073, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1211, file: !1209, line: 120, baseType: !1073, size: 64, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1211, file: !1209, line: 124, baseType: !7, size: 32, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1211, file: !1209, line: 128, baseType: !7, size: 32, offset: 480)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1211, file: !1209, line: 131, baseType: !1239, size: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1209, line: 75, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!609, !1073, !1073}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1211, file: !1209, line: 132, baseType: !1244, size: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1209, line: 78, baseType: !1228)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1211, file: !1209, line: 135, baseType: !609, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1211, file: !1209, line: 136, baseType: !1247, size: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1209, line: 82, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!609, !609, !1073, !1073}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1211, file: !1209, line: 137, baseType: !1252, size: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1209, line: 83, baseType: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !609, !609}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1211, file: !1209, line: 141, baseType: !7, size: 32, offset: 832)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1205, file: !827, line: 48, baseType: !1258, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !917, line: 35, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !917, line: 35, size: 128, elements: !1261)
!1261 = !{!1262}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1260, file: !917, line: 35, baseType: !1263, size: 128)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !917, line: 33, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !917, line: 33, size: 128, elements: !1265)
!1265 = !{!1266, !1267, !1268}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1264, file: !917, line: 33, baseType: !7, size: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1264, file: !917, line: 33, baseType: !7, size: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1264, file: !917, line: 33, baseType: !1269, size: 64, offset: 64)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 64, elements: !711)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1205, file: !827, line: 51, baseType: !1271, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1274)
!1274 = !{!1275}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1273, file: !135, line: 183, baseType: !1276, size: 128)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1278)
!1278 = !{!1279, !1280, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1277, file: !135, line: 182, baseType: !7, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1277, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1277, file: !135, line: 182, baseType: !979, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1205, file: !827, line: 54, baseType: !610, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1205, file: !827, line: 57, baseType: !1284, size: 128, offset: 256)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1285, line: 31, size: 128, elements: !1286)
!1285 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1293}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1284, file: !1285, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1284, file: !1285, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1284, file: !1285, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1284, file: !1285, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1284, file: !1285, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1284, file: !1285, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1284, file: !1285, line: 56, baseType: !1294, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !611, line: 47, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1297, line: 75, size: 256, elements: !1298)
!1297 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1298 = !{!1299, !1311, !1312, !1313}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1296, file: !1297, line: 76, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1297, line: 68, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1297, line: 63, size: 320, elements: !1303)
!1303 = !{!1304, !1306, !1307, !1308}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1302, file: !1297, line: 64, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1302, file: !1297, line: 65, baseType: !1305, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1302, file: !1297, line: 66, baseType: !7, size: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1302, file: !1297, line: 67, baseType: !1309, size: 128, offset: 192)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1310, size: 128, elements: !1149)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1297, line: 29, baseType: !664)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1296, file: !1297, line: 77, baseType: !1300, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1296, file: !1297, line: 78, baseType: !7, size: 32, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1296, file: !1297, line: 79, baseType: !1314, size: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1297, line: 49, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1297, line: 45, size: 832, elements: !1317)
!1317 = !{!1318, !1319, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1316, file: !1297, line: 46, baseType: !1305, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1316, file: !1297, line: 47, baseType: !1295, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1316, file: !1297, line: 48, baseType: !1321, size: 704, offset: 128)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1322, line: 164, size: 704, elements: !1323)
!1322 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1323 = !{!1324, !1325, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1349, !1350, !1351, !1352}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1321, file: !1322, line: 166, baseType: !666, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1321, file: !1322, line: 167, baseType: !1326, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1322, line: 157, size: 192, elements: !1328)
!1328 = !{!1329, !1331, !1332}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1327, file: !1322, line: 159, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1327, file: !1322, line: 160, baseType: !1326, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1327, file: !1322, line: 161, baseType: !1333, size: 32, offset: 128)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 32, elements: !1334)
!1334 = !{!1335}
!1335 = !DISubrange(count: 4)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1321, file: !1322, line: 168, baseType: !1330, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1321, file: !1322, line: 169, baseType: !1330, size: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1321, file: !1322, line: 170, baseType: !1330, size: 64, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1321, file: !1322, line: 171, baseType: !666, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1321, file: !1322, line: 172, baseType: !707, size: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1321, file: !1322, line: 176, baseType: !1342, size: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!1326, !609, !666}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1321, file: !1322, line: 177, baseType: !1346, size: 64, offset: 512)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{null, !609, !1326}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1321, file: !1322, line: 178, baseType: !609, size: 64, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1321, file: !1322, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1321, file: !1322, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1321, file: !1322, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1205, file: !827, line: 60, baseType: !1284, size: 128, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1205, file: !827, line: 64, baseType: !1355, size: 64, offset: 512)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1357, line: 33, flags: DIFlagFwdDecl)
!1357 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1205, file: !827, line: 67, baseType: !610, size: 64, offset: 576)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1205, file: !827, line: 73, baseType: !1208, size: 64, offset: 640)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1205, file: !827, line: 77, baseType: !1294, size: 64, offset: 704)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1205, file: !827, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1205, file: !827, line: 82, baseType: !1363, size: 320, offset: 832)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !956, line: 62, size: 320, elements: !1364)
!1364 = !{!1365, !1371, !1372, !1373, !1374, !1375}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1363, file: !956, line: 63, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !956, line: 56, size: 128, elements: !1368)
!1368 = !{!1369, !1370}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1367, file: !956, line: 57, baseType: !1366, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1367, file: !956, line: 58, baseType: !709, size: 8, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1363, file: !956, line: 64, baseType: !7, size: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1363, file: !956, line: 66, baseType: !7, size: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1363, file: !956, line: 68, baseType: !730, size: 8, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1363, file: !956, line: 70, baseType: !954, size: 64, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1363, file: !956, line: 71, baseType: !962, size: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !876, file: !877, line: 476, baseType: !1377, size: 64, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !877, line: 476, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !876, file: !877, line: 479, baseType: !1208, size: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !876, file: !877, line: 484, baseType: !610, size: 64, offset: 384)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !876, file: !877, line: 488, baseType: !610, size: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !876, file: !877, line: 493, baseType: !610, size: 64, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !876, file: !877, line: 496, baseType: !610, size: 64, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !876, file: !877, line: 501, baseType: !1385, size: 64, offset: 640)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !341, line: 2355, size: 576, elements: !1387)
!1387 = !{!1388, !1391, !1392, !1393, !1394, !1396, !1397, !1402, !1403, !1404, !1405, !1406, !1407}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1386, file: !341, line: 2356, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !341, line: 2356, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1386, file: !341, line: 2357, baseType: !1055, size: 64, offset: 64)
