; ModuleID = 'loop-unswitch.c'
source_filename = "loop-unswitch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!681 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_SCHED_TIMES", value: 86, isUnsigned: true)
!682 = !DIEnumerator(name: "PARAM_SELSCHED_INSNS_TO_RENAME", value: 87, isUnsigned: true)
!683 = !DIEnumerator(name: "PARAM_SCHED_MEM_TRUE_DEP_COST", value: 88, isUnsigned: true)
!684 = !DIEnumerator(name: "PARAM_MAX_LAST_VALUE_RTL", value: 89, isUnsigned: true)
!685 = !DIEnumerator(name: "PARAM_INTEGER_SHARE_LIMIT", value: 90, isUnsigned: true)
!686 = !DIEnumerator(name: "PARAM_MIN_VIRTUAL_MAPPINGS", value: 91, isUnsigned: true)
!687 = !DIEnumerator(name: "PARAM_VIRTUAL_MAPPINGS_TO_SYMS_RATIO", value: 92, isUnsigned: true)
!688 = !DIEnumerator(name: "PARAM_SSP_BUFFER_SIZE", value: 93, isUnsigned: true)
!689 = !DIEnumerator(name: "PARAM_MAX_JUMP_THREAD_DUPLICATION_STMTS", value: 94, isUnsigned: true)
!690 = !DIEnumerator(name: "PARAM_MAX_FIELDS_FOR_FIELD_SENSITIVE", value: 95, isUnsigned: true)
!691 = !DIEnumerator(name: "PARAM_MAX_SCHED_READY_INSNS", value: 96, isUnsigned: true)
!692 = !DIEnumerator(name: "PARAM_PREFETCH_LATENCY", value: 97, isUnsigned: true)
!693 = !DIEnumerator(name: "PARAM_SIMULTANEOUS_PREFETCHES", value: 98, isUnsigned: true)
!694 = !DIEnumerator(name: "PARAM_L1_CACHE_SIZE", value: 99, isUnsigned: true)
!695 = !DIEnumerator(name: "PARAM_L1_CACHE_LINE_SIZE", value: 100, isUnsigned: true)
!696 = !DIEnumerator(name: "PARAM_L2_CACHE_SIZE", value: 101, isUnsigned: true)
!697 = !DIEnumerator(name: "PARAM_USE_CANONICAL_TYPES", value: 102, isUnsigned: true)
!698 = !DIEnumerator(name: "PARAM_MAX_PARTIAL_ANTIC_LENGTH", value: 103, isUnsigned: true)
!699 = !DIEnumerator(name: "PARAM_SCCVN_MAX_SCC_SIZE", value: 104, isUnsigned: true)
!700 = !DIEnumerator(name: "PARAM_IRA_MAX_LOOPS_NUM", value: 105, isUnsigned: true)
!701 = !DIEnumerator(name: "PARAM_IRA_MAX_CONFLICT_TABLE_SIZE", value: 106, isUnsigned: true)
!702 = !DIEnumerator(name: "PARAM_IRA_LOOP_RESERVED_REGS", value: 107, isUnsigned: true)
!703 = !DIEnumerator(name: "PARAM_SWITCH_CONVERSION_BRANCH_RATIO", value: 108, isUnsigned: true)
!704 = !DIEnumerator(name: "PARAM_LOOP_BLOCK_TILE_SIZE", value: 109, isUnsigned: true)
!705 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_NB_SCOP_PARAMS", value: 110, isUnsigned: true)
!706 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_BBS_PER_FUNCTION", value: 111, isUnsigned: true)
!707 = !DIEnumerator(name: "PARAM_LOOP_INVARIANT_MAX_BBS_IN_LOOP", value: 112, isUnsigned: true)
!708 = !DIEnumerator(name: "PARAM_SLP_MAX_INSNS_IN_BB", value: 113, isUnsigned: true)
!709 = !DIEnumerator(name: "PARAM_MIN_INSN_TO_PREFETCH_RATIO", value: 114, isUnsigned: true)
!710 = !DIEnumerator(name: "PARAM_PREFETCH_MIN_INSN_TO_MEM_RATIO", value: 115, isUnsigned: true)
!711 = !DIEnumerator(name: "PARAM_MAX_VARTRACK_SIZE", value: 116, isUnsigned: true)
!712 = !DIEnumerator(name: "PARAM_MIN_NONDEBUG_INSN_UID", value: 117, isUnsigned: true)
!713 = !DIEnumerator(name: "PARAM_IPA_SRA_PTR_GROWTH_FACTOR", value: 118, isUnsigned: true)
!714 = !DIEnumerator(name: "LAST_PARAM", value: 119, isUnsigned: true)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtx_class", file: !389, line: 60, baseType: !5, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!717 = !DIEnumerator(name: "RTX_COMPARE", value: 0, isUnsigned: true)
!718 = !DIEnumerator(name: "RTX_COMM_COMPARE", value: 1, isUnsigned: true)
!719 = !DIEnumerator(name: "RTX_BIN_ARITH", value: 2, isUnsigned: true)
!720 = !DIEnumerator(name: "RTX_COMM_ARITH", value: 3, isUnsigned: true)
!721 = !DIEnumerator(name: "RTX_UNARY", value: 4, isUnsigned: true)
!722 = !DIEnumerator(name: "RTX_EXTRA", value: 5, isUnsigned: true)
!723 = !DIEnumerator(name: "RTX_MATCH", value: 6, isUnsigned: true)
!724 = !DIEnumerator(name: "RTX_INSN", value: 7, isUnsigned: true)
!725 = !DIEnumerator(name: "RTX_OBJ", value: 8, isUnsigned: true)
!726 = !DIEnumerator(name: "RTX_CONST_OBJ", value: 9, isUnsigned: true)
!727 = !DIEnumerator(name: "RTX_TERNARY", value: 10, isUnsigned: true)
!728 = !DIEnumerator(name: "RTX_BITFIELD_OPS", value: 11, isUnsigned: true)
!729 = !DIEnumerator(name: "RTX_AUTOINC", value: 12, isUnsigned: true)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !146, line: 295, baseType: !5, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!732 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!733 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!734 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!735 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!736 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!737 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!738 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!739 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!740 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!741 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!742 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!743 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!744 = !{!3, !531, !388, !745, !857, !1880, !1194, !769}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !746, line: 50, baseType: !747)
!746 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !389, line: 240, size: 384, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !748, file: !389, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !748, file: !389, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !748, file: !389, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !748, file: !389, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !748, file: !389, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !748, file: !389, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !748, file: !389, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !748, file: !389, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !748, file: !389, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !748, file: !389, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !748, file: !389, line: 321, baseType: !761, size: 320, offset: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !389, line: 315, size: 320, elements: !762)
!762 = !{!763, !1815, !1817, !1878, !1879}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !761, file: !389, line: 316, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 64, elements: !784)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !389, line: 183, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !389, line: 166, size: 64, elements: !767)
!767 = !{!768, !770, !771, !775, !776, !786, !787, !799, !802, !866, !1793, !1794, !1805, !1812}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !766, file: !389, line: 168, baseType: !769, size: 32)
!769 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !766, file: !389, line: 169, baseType: !5, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !766, file: !389, line: 170, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !766, file: !389, line: 171, baseType: !745, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !766, file: !389, line: 172, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !746, line: 53, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !389, line: 359, size: 128, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !779, file: !389, line: 360, baseType: !769, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !779, file: !389, line: 361, baseType: !783, size: 64, offset: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 64, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 1)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !766, file: !389, line: 173, baseType: !3, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !766, file: !389, line: 174, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !389, line: 133, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 115, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !789, file: !389, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !789, file: !389, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !789, file: !389, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !789, file: !389, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !789, file: !389, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !789, file: !389, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !789, file: !389, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !789, file: !389, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !766, file: !389, line: 175, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !389, line: 175, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !766, file: !389, line: 176, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !805, line: 75, size: 256, elements: !806)
!805 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!806 = !{!807, !822, !823, !824}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !804, file: !805, line: 76, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !805, line: 68, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !805, line: 63, size: 320, elements: !811)
!811 = !{!812, !814, !815, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !805, line: 64, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !805, line: 65, baseType: !813, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !810, file: !805, line: 66, baseType: !5, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !810, file: !805, line: 67, baseType: !817, size: 128, offset: 192)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 128, elements: !820)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !805, line: 29, baseType: !819)
!819 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!820 = !{!821}
!821 = !DISubrange(count: 2)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !804, file: !805, line: 77, baseType: !808, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !804, file: !805, line: 78, baseType: !5, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !804, file: !805, line: 79, baseType: !825, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !805, line: 49, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !805, line: 45, size: 832, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !827, file: !805, line: 46, baseType: !813, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !827, file: !805, line: 47, baseType: !803, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !827, file: !805, line: 48, baseType: !832, size: 704, offset: 128)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !833, line: 164, size: 704, elements: !834)
!833 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!834 = !{!835, !837, !848, !849, !850, !851, !852, !853, !858, !862, !863, !864, !865}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !832, file: !833, line: 166, baseType: !836, size: 64)
!836 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !832, file: !833, line: 167, baseType: !838, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !833, line: 157, size: 192, elements: !840)
!840 = !{!841, !843, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !839, file: !833, line: 159, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !839, file: !833, line: 160, baseType: !838, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !839, file: !833, line: 161, baseType: !845, size: 32, offset: 128)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 32, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 4)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !832, file: !833, line: 168, baseType: !842, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !832, file: !833, line: 169, baseType: !842, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !832, file: !833, line: 170, baseType: !842, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !832, file: !833, line: 171, baseType: !836, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !832, file: !833, line: 172, baseType: !769, size: 32, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !832, file: !833, line: 176, baseType: !854, size: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!838, !857, !836}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !832, file: !833, line: 177, baseType: !859, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !857, !838}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !832, file: !833, line: 178, baseType: !857, size: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !832, file: !833, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !832, file: !833, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !832, file: !833, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !766, file: !389, line: 177, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !746, line: 56, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !162, line: 3371, size: 1792, elements: !870)
!870 = !{!871, !904, !910, !921, !940, !951, !956, !963, !969, !983, !995, !1033, !1038, !1066, !1074, !1075, !1080, !1089, !1095, !1100, !1104, !1108, !1420, !1469, !1475, !1482, !1489, !1512, !1537, !1554, !1566, !1588, !1603, !1775}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !869, file: !162, line: 3372, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !162, line: 360, size: 64, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !872, file: !162, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !872, file: !162, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !872, file: !162, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !872, file: !162, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !872, file: !162, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !872, file: !162, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !872, file: !162, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !872, file: !162, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !872, file: !162, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !872, file: !162, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !872, file: !162, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !872, file: !162, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !872, file: !162, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !872, file: !162, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !872, file: !162, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !872, file: !162, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !872, file: !162, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !872, file: !162, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !872, file: !162, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !872, file: !162, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !872, file: !162, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !872, file: !162, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !872, file: !162, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !872, file: !162, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !872, file: !162, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !872, file: !162, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !872, file: !162, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !872, file: !162, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !872, file: !162, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !872, file: !162, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !869, file: !162, line: 3373, baseType: !905, size: 192)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !162, line: 402, size: 192, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !162, line: 403, baseType: !872, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !905, file: !162, line: 404, baseType: !867, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !162, line: 405, baseType: !867, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !869, file: !162, line: 3374, baseType: !911, size: 320)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !162, line: 1384, size: 320, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !162, line: 1385, baseType: !905, size: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !911, file: !162, line: 1386, baseType: !915, size: 128, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !916, line: 58, baseType: !917)
!916 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !916, line: 54, size: 128, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !917, file: !916, line: 56, baseType: !819, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !917, file: !916, line: 57, baseType: !836, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !869, file: !162, line: 3375, baseType: !922, size: 256)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !162, line: 1397, size: 256, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !162, line: 1398, baseType: !905, size: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !922, file: !162, line: 1399, baseType: !926, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !928, line: 52, size: 256, elements: !929)
!928 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !927, file: !928, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !927, file: !928, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !927, file: !928, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !927, file: !928, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !927, file: !928, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !927, file: !928, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !927, file: !928, line: 62, baseType: !937, size: 192, offset: 64)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 192, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 3)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !869, file: !162, line: 3376, baseType: !941, size: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !162, line: 1408, size: 256, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !162, line: 1409, baseType: !905, size: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !941, file: !162, line: 1410, baseType: !945, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !947, line: 27, size: 192, elements: !948)
!947 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !947, line: 29, baseType: !915, size: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !946, file: !947, line: 30, baseType: !3, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !869, file: !162, line: 3377, baseType: !952, size: 256)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !162, line: 1437, size: 256, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !162, line: 1438, baseType: !905, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !952, file: !162, line: 1439, baseType: !867, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !869, file: !162, line: 3378, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !162, line: 1418, size: 256, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !162, line: 1419, baseType: !905, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !957, file: !162, line: 1420, baseType: !769, size: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !957, file: !162, line: 1421, baseType: !962, size: 8, offset: 224)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 8, elements: !784)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !869, file: !162, line: 3379, baseType: !964, size: 320)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !162, line: 1428, size: 320, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !162, line: 1429, baseType: !905, size: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !964, file: !162, line: 1430, baseType: !867, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !964, file: !162, line: 1431, baseType: !867, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !869, file: !162, line: 3380, baseType: !970, size: 320)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !162, line: 1460, size: 320, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !162, line: 1461, baseType: !905, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !970, file: !162, line: 1462, baseType: !974, size: 128, offset: 192)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !975, line: 31, size: 128, elements: !976)
!975 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!976 = !{!977, !981, !982}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !974, file: !975, line: 32, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !974, file: !975, line: 33, baseType: !5, size: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !974, file: !975, line: 34, baseType: !5, size: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !869, file: !162, line: 3381, baseType: !984, size: 384)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !162, line: 2507, size: 384, elements: !985)
!985 = !{!986, !987, !992, !993, !994}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !162, line: 2508, baseType: !905, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !984, file: !162, line: 2509, baseType: !988, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !989, line: 58, baseType: !990)
!989 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !991, line: 44, baseType: !5)
!991 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!992 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !984, file: !162, line: 2510, baseType: !5, size: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !162, line: 2511, baseType: !867, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !984, file: !162, line: 2512, baseType: !867, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !869, file: !162, line: 3382, baseType: !996, size: 896)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !162, line: 2652, size: 896, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !162, line: 2653, baseType: !984, size: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !996, file: !162, line: 2654, baseType: !867, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !996, file: !162, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !996, file: !162, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !996, file: !162, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !996, file: !162, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !996, file: !162, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !996, file: !162, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !996, file: !162, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !996, file: !162, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !996, file: !162, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !996, file: !162, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !996, file: !162, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !996, file: !162, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !996, file: !162, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !996, file: !162, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !996, file: !162, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !996, file: !162, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !996, file: !162, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !996, file: !162, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !996, file: !162, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !996, file: !162, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !996, file: !162, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !996, file: !162, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !996, file: !162, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !996, file: !162, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !996, file: !162, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !996, file: !162, line: 2703, baseType: !5, size: 32, offset: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !996, file: !162, line: 2705, baseType: !867, size: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !996, file: !162, line: 2706, baseType: !867, size: 64, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !996, file: !162, line: 2707, baseType: !867, size: 64, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !996, file: !162, line: 2708, baseType: !867, size: 64, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !996, file: !162, line: 2711, baseType: !1031, size: 64, offset: 832)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !162, line: 2711, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !869, file: !162, line: 3383, baseType: !1034, size: 960)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !162, line: 2756, size: 960, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1034, file: !162, line: 2757, baseType: !996, size: 896)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1034, file: !162, line: 2758, baseType: !745, size: 64, offset: 896)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !869, file: !162, line: 3384, baseType: !1039, size: 1472)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !162, line: 3114, size: 1472, elements: !1040)
!1040 = !{!1041, !1062, !1063, !1064, !1065}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !162, line: 3115, baseType: !1042, size: 1216)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !162, line: 2984, size: 1216, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !162, line: 2985, baseType: !1034, size: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1042, file: !162, line: 2986, baseType: !867, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1042, file: !162, line: 2987, baseType: !867, size: 64, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1042, file: !162, line: 2988, baseType: !867, size: 64, offset: 1088)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1042, file: !162, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1042, file: !162, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1042, file: !162, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1042, file: !162, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1042, file: !162, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1042, file: !162, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1042, file: !162, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1042, file: !162, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1042, file: !162, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1042, file: !162, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1042, file: !162, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1042, file: !162, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1042, file: !162, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1042, file: !162, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1039, file: !162, line: 3117, baseType: !867, size: 64, offset: 1216)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1039, file: !162, line: 3119, baseType: !867, size: 64, offset: 1280)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1039, file: !162, line: 3121, baseType: !867, size: 64, offset: 1344)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1039, file: !162, line: 3123, baseType: !867, size: 64, offset: 1408)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !869, file: !162, line: 3385, baseType: !1067, size: 1088)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !162, line: 2874, size: 1088, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !162, line: 2875, baseType: !1034, size: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1067, file: !162, line: 2876, baseType: !745, size: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1067, file: !162, line: 2877, baseType: !1072, size: 64, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !162, line: 2856, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !869, file: !162, line: 3386, baseType: !1042, size: 1216)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !869, file: !162, line: 3387, baseType: !1076, size: 1280)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !162, line: 3093, size: 1280, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !162, line: 3094, baseType: !1042, size: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1076, file: !162, line: 3095, baseType: !1072, size: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !869, file: !162, line: 3388, baseType: !1081, size: 1216)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !162, line: 2824, size: 1216, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !162, line: 2825, baseType: !996, size: 896)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1081, file: !162, line: 2827, baseType: !867, size: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1081, file: !162, line: 2828, baseType: !867, size: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1081, file: !162, line: 2829, baseType: !867, size: 64, offset: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1081, file: !162, line: 2830, baseType: !867, size: 64, offset: 1088)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1081, file: !162, line: 2831, baseType: !867, size: 64, offset: 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !869, file: !162, line: 3389, baseType: !1090, size: 1024)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !162, line: 2850, size: 1024, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !162, line: 2851, baseType: !1034, size: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1090, file: !162, line: 2852, baseType: !769, size: 32, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1090, file: !162, line: 2853, baseType: !769, size: 32, offset: 992)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !869, file: !162, line: 3390, baseType: !1096, size: 1024)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !162, line: 2857, size: 1024, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !162, line: 2858, baseType: !1034, size: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1096, file: !162, line: 2859, baseType: !1072, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !869, file: !162, line: 3391, baseType: !1101, size: 960)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !162, line: 2862, size: 960, elements: !1102)
!1102 = !{!1103}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !162, line: 2863, baseType: !1034, size: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !869, file: !162, line: 3392, baseType: !1105, size: 1472)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !162, line: 3304, size: 1472, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !162, line: 3305, baseType: !1039, size: 1472)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !869, file: !162, line: 3393, baseType: !1109, size: 1792)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !162, line: 3248, size: 1792, elements: !1110)
!1110 = !{!1111, !1112, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !162, line: 3249, baseType: !1039, size: 1472)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1109, file: !162, line: 3251, baseType: !1113, size: 64, offset: 1472)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1115, line: 463, size: 1152, elements: !1116)
!1115 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1116 = !{!1117, !1120, !1280, !1281, !1284, !1343, !1344, !1345, !1346, !1347, !1348, !1372, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1114, file: !1115, line: 464, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1115, line: 464, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1114, file: !1115, line: 467, baseType: !1121, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !146, line: 374, size: 640, elements: !1123)
!1123 = !{!1124, !1255, !1256, !1269, !1270, !1271, !1272, !1273, !1274, !1276, !1278, !1279}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1122, file: !146, line: 377, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !746, line: 111, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !146, line: 217, size: 832, elements: !1128)
!1128 = !{!1129, !1164, !1165, !1166, !1225, !1229, !1230, !1231, !1249, !1250, !1251, !1252, !1253, !1254}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1127, file: !146, line: 219, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !146, line: 151, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !146, line: 151, size: 128, elements: !1133)
!1133 = !{!1134}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1132, file: !146, line: 151, baseType: !1135, size: 128)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !146, line: 150, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !146, line: 150, size: 128, elements: !1137)
!1137 = !{!1138, !1139, !1140}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1136, file: !146, line: 150, baseType: !5, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1136, file: !146, line: 150, baseType: !5, size: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1136, file: !146, line: 150, baseType: !1141, size: 64, offset: 64)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 64, elements: !784)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !746, line: 108, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !146, line: 122, size: 512, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1144, file: !146, line: 124, baseType: !1126, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1144, file: !146, line: 125, baseType: !1126, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1144, file: !146, line: 131, baseType: !1149, size: 64, offset: 128)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !146, line: 128, size: 64, elements: !1150)
!1150 = !{!1151, !1155}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1149, file: !146, line: 129, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !746, line: 66, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !746, line: 65, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1149, file: !146, line: 130, baseType: !745, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1144, file: !146, line: 134, baseType: !857, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1144, file: !146, line: 137, baseType: !867, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1144, file: !146, line: 138, baseType: !988, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1144, file: !146, line: 142, baseType: !5, size: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !146, line: 144, baseType: !769, size: 32, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1144, file: !146, line: 145, baseType: !769, size: 32, offset: 416)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1144, file: !146, line: 146, baseType: !1163, size: 64, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !146, line: 119, baseType: !836)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1127, file: !146, line: 220, baseType: !1130, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1127, file: !146, line: 223, baseType: !857, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1127, file: !146, line: 226, baseType: !1167, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 100, size: 1216, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1179, !1180, !1181, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1215, !1223, !1224}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1168, file: !133, line: 102, baseType: !769, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1168, file: !133, line: 105, baseType: !5, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1168, file: !133, line: 108, baseType: !1126, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1168, file: !133, line: 111, baseType: !1126, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1168, file: !133, line: 114, baseType: !1175, size: 64, offset: 192)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !133, line: 41, size: 64, elements: !1176)
!1176 = !{!1177, !1178}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1175, file: !133, line: 42, baseType: !132, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1175, file: !133, line: 43, baseType: !5, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1168, file: !133, line: 117, baseType: !5, size: 32, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1168, file: !133, line: 120, baseType: !5, size: 32, offset: 288)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1168, file: !133, line: 123, baseType: !1182, size: 64, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !133, line: 87, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !133, line: 87, size: 128, elements: !1185)
!1185 = !{!1186}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1184, file: !133, line: 87, baseType: !1187, size: 128)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !133, line: 85, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !133, line: 85, size: 128, elements: !1189)
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1188, file: !133, line: 85, baseType: !5, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1188, file: !133, line: 85, baseType: !5, size: 32, offset: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1188, file: !133, line: 85, baseType: !1193, size: 64, offset: 64)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 64, elements: !784)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !133, line: 84, baseType: !1167)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1168, file: !133, line: 126, baseType: !1167, size: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1168, file: !133, line: 129, baseType: !1167, size: 64, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1168, file: !133, line: 132, baseType: !857, size: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1168, file: !133, line: 139, baseType: !867, size: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1168, file: !133, line: 143, baseType: !915, size: 128, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1168, file: !133, line: 146, baseType: !915, size: 128, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1168, file: !133, line: 148, baseType: !980, size: 8, offset: 896)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1168, file: !133, line: 149, baseType: !980, size: 8, offset: 904)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1168, file: !133, line: 153, baseType: !141, size: 32, offset: 928)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1168, file: !133, line: 156, baseType: !1205, size: 64, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !133, line: 48, size: 320, elements: !1207)
!1207 = !{!1208, !1212, !1213, !1214}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1206, file: !133, line: 50, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !746, line: 58, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !746, line: 57, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1206, file: !133, line: 59, baseType: !915, size: 128, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1206, file: !133, line: 64, baseType: !980, size: 8, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1206, file: !133, line: 67, baseType: !1205, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1168, file: !133, line: 159, baseType: !1216, size: 64, offset: 1024)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !133, line: 72, size: 256, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1217, file: !133, line: 74, baseType: !1143, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1217, file: !133, line: 77, baseType: !1216, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1217, file: !133, line: 78, baseType: !1216, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1217, file: !133, line: 81, baseType: !1216, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1168, file: !133, line: 162, baseType: !980, size: 8, offset: 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1168, file: !133, line: 166, baseType: !867, size: 64, offset: 1152)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1127, file: !146, line: 229, baseType: !1226, size: 128, offset: 256)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 128, elements: !820)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !146, line: 229, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1127, file: !146, line: 232, baseType: !1126, size: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1127, file: !146, line: 233, baseType: !1126, size: 64, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1127, file: !146, line: 238, baseType: !1232, size: 64, offset: 512)
!1232 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !146, line: 235, size: 64, elements: !1233)
!1233 = !{!1234, !1240}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1232, file: !146, line: 236, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !146, line: 273, size: 128, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1236, file: !146, line: 275, baseType: !1152, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1236, file: !146, line: 278, baseType: !1152, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1232, file: !146, line: 237, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !146, line: 259, size: 320, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1242, file: !146, line: 261, baseType: !745, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1242, file: !146, line: 262, baseType: !745, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1242, file: !146, line: 266, baseType: !745, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1242, file: !146, line: 267, baseType: !745, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1242, file: !146, line: 270, baseType: !769, size: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1127, file: !146, line: 241, baseType: !1163, size: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1127, file: !146, line: 244, baseType: !769, size: 32, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1127, file: !146, line: 247, baseType: !769, size: 32, offset: 672)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1127, file: !146, line: 250, baseType: !769, size: 32, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1127, file: !146, line: 253, baseType: !769, size: 32, offset: 736)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1127, file: !146, line: 256, baseType: !769, size: 32, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1122, file: !146, line: 378, baseType: !1125, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1122, file: !146, line: 381, baseType: !1257, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !146, line: 282, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !146, line: 282, size: 128, elements: !1260)
!1260 = !{!1261}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1259, file: !146, line: 282, baseType: !1262, size: 128)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !146, line: 281, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !146, line: 281, size: 128, elements: !1264)
!1264 = !{!1265, !1266, !1267}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1263, file: !146, line: 281, baseType: !5, size: 32)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1263, file: !146, line: 281, baseType: !5, size: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1263, file: !146, line: 281, baseType: !1268, size: 64, offset: 64)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 64, elements: !784)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1122, file: !146, line: 384, baseType: !769, size: 32, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1122, file: !146, line: 387, baseType: !769, size: 32, offset: 224)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1122, file: !146, line: 390, baseType: !769, size: 32, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1122, file: !146, line: 394, baseType: !1257, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1122, file: !146, line: 396, baseType: !145, size: 32, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1122, file: !146, line: 399, baseType: !1275, size: 64, offset: 416)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !820)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1122, file: !146, line: 402, baseType: !1277, size: 64, offset: 480)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !820)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1122, file: !146, line: 406, baseType: !769, size: 32, offset: 544)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1122, file: !146, line: 409, baseType: !769, size: 32, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1114, file: !1115, line: 470, baseType: !1153, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1114, file: !1115, line: 473, baseType: !1282, size: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1115, line: 166, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1114, file: !1115, line: 476, baseType: !1285, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !133, line: 187, size: 256, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1342}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1286, file: !133, line: 189, baseType: !769, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1286, file: !133, line: 192, baseType: !1182, size: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1286, file: !133, line: 197, baseType: !1291, size: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1292, line: 144, baseType: !1293)
!1292 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1292, line: 100, size: 896, elements: !1295)
!1295 = !{!1296, !1304, !1309, !1314, !1316, !1319, !1320, !1321, !1322, !1323, !1328, !1330, !1331, !1336, !1341}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1294, file: !1292, line: 102, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1292, line: 52, baseType: !1298)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!1301, !1302}
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1292, line: 47, baseType: !5)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1294, file: !1292, line: 105, baseType: !1305, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1292, line: 59, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!769, !1302, !1302}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1294, file: !1292, line: 108, baseType: !1310, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1292, line: 63, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{null, !857}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1294, file: !1292, line: 111, baseType: !1315, size: 64, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1294, file: !1292, line: 114, baseType: !1317, size: 64, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1318, line: 46, baseType: !819)
!1318 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1294, file: !1292, line: 117, baseType: !1317, size: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1294, file: !1292, line: 120, baseType: !1317, size: 64, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1294, file: !1292, line: 124, baseType: !5, size: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1294, file: !1292, line: 128, baseType: !5, size: 32, offset: 480)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1294, file: !1292, line: 131, baseType: !1324, size: 64, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1292, line: 75, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!857, !1317, !1317}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1294, file: !1292, line: 132, baseType: !1329, size: 64, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1292, line: 78, baseType: !1311)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1294, file: !1292, line: 135, baseType: !857, size: 64, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1294, file: !1292, line: 136, baseType: !1332, size: 64, offset: 704)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1292, line: 82, baseType: !1333)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!857, !857, !1317, !1317}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1294, file: !1292, line: 137, baseType: !1337, size: 64, offset: 768)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1292, line: 83, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !857, !857}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1294, file: !1292, line: 141, baseType: !5, size: 32, offset: 832)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1286, file: !133, line: 200, baseType: !1167, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1114, file: !1115, line: 479, baseType: !1291, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1114, file: !1115, line: 484, baseType: !867, size: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1114, file: !1115, line: 488, baseType: !867, size: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1114, file: !1115, line: 493, baseType: !867, size: 64, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1114, file: !1115, line: 496, baseType: !867, size: 64, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1114, file: !1115, line: 501, baseType: !1349, size: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !157, line: 2355, size: 576, elements: !1351)
!1351 = !{!1352, !1355, !1356, !1357, !1358, !1360, !1361, !1366, !1367, !1368, !1369, !1370, !1371}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1350, file: !157, line: 2356, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !157, line: 2356, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1350, file: !157, line: 2357, baseType: !772, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1350, file: !157, line: 2358, baseType: !769, size: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1350, file: !157, line: 2359, baseType: !769, size: 32, offset: 160)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1350, file: !157, line: 2360, baseType: !1359, size: 128, offset: 192)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !846)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1350, file: !157, line: 2364, baseType: !769, size: 32, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1350, file: !157, line: 2367, baseType: !1362, size: 128, offset: 384)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !157, line: 2349, size: 128, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1362, file: !157, line: 2351, baseType: !745, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1362, file: !157, line: 2352, baseType: !836, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1350, file: !157, line: 2371, baseType: !156, size: 32, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1350, file: !157, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1350, file: !157, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1350, file: !157, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1350, file: !157, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1350, file: !157, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1114, file: !1115, line: 504, baseType: !1373, size: 64, offset: 704)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1115, line: 504, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1114, file: !1115, line: 507, baseType: !1291, size: 64, offset: 768)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1114, file: !1115, line: 510, baseType: !769, size: 32, offset: 832)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1114, file: !1115, line: 513, baseType: !769, size: 32, offset: 864)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1114, file: !1115, line: 516, baseType: !988, size: 32, offset: 896)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1114, file: !1115, line: 519, baseType: !988, size: 32, offset: 928)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1114, file: !1115, line: 522, baseType: !5, size: 32, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1114, file: !1115, line: 523, baseType: !5, size: 32, offset: 992)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1114, file: !1115, line: 528, baseType: !772, size: 64, offset: 1024)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1114, file: !1115, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1114, file: !1115, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1114, file: !1115, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1114, file: !1115, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1114, file: !1115, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1114, file: !1115, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1114, file: !1115, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1114, file: !1115, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1114, file: !1115, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1114, file: !1115, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1114, file: !1115, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1114, file: !1115, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1114, file: !1115, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1114, file: !1115, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1114, file: !1115, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1114, file: !1115, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1109, file: !162, line: 3254, baseType: !867, size: 64, offset: 1536)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1109, file: !162, line: 3257, baseType: !867, size: 64, offset: 1600)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1109, file: !162, line: 3258, baseType: !867, size: 64, offset: 1664)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1109, file: !162, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1109, file: !162, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1109, file: !162, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1109, file: !162, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1109, file: !162, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1109, file: !162, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1109, file: !162, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1109, file: !162, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1109, file: !162, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1109, file: !162, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1109, file: !162, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1109, file: !162, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1109, file: !162, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1109, file: !162, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1109, file: !162, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1109, file: !162, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1109, file: !162, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1109, file: !162, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !869, file: !162, line: 3394, baseType: !1421, size: 1344)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !162, line: 2279, size: 1344, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1448, !1449, !1450, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1421, file: !162, line: 2280, baseType: !905, size: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1421, file: !162, line: 2281, baseType: !867, size: 64, offset: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1421, file: !162, line: 2282, baseType: !867, size: 64, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1421, file: !162, line: 2283, baseType: !867, size: 64, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1421, file: !162, line: 2284, baseType: !867, size: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1421, file: !162, line: 2285, baseType: !5, size: 32, offset: 448)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1421, file: !162, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1421, file: !162, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1421, file: !162, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1421, file: !162, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1421, file: !162, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1421, file: !162, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1421, file: !162, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1421, file: !162, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1421, file: !162, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1421, file: !162, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1421, file: !162, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1421, file: !162, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1421, file: !162, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1421, file: !162, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1421, file: !162, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1421, file: !162, line: 2305, baseType: !5, size: 32, offset: 512)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1421, file: !162, line: 2306, baseType: !1446, size: 32, offset: 544)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1447, line: 31, baseType: !769)
!1447 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1421, file: !162, line: 2307, baseType: !867, size: 64, offset: 576)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1421, file: !162, line: 2308, baseType: !867, size: 64, offset: 640)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1421, file: !162, line: 2314, baseType: !1451, size: 64, offset: 704)
!1451 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !162, line: 2309, size: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1451, file: !162, line: 2310, baseType: !769, size: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1451, file: !162, line: 2311, baseType: !772, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1451, file: !162, line: 2312, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !162, line: 2277, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1421, file: !162, line: 2315, baseType: !867, size: 64, offset: 768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1421, file: !162, line: 2316, baseType: !867, size: 64, offset: 832)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1421, file: !162, line: 2317, baseType: !867, size: 64, offset: 896)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1421, file: !162, line: 2318, baseType: !867, size: 64, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1421, file: !162, line: 2319, baseType: !867, size: 64, offset: 1024)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1421, file: !162, line: 2320, baseType: !867, size: 64, offset: 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1421, file: !162, line: 2321, baseType: !867, size: 64, offset: 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1421, file: !162, line: 2322, baseType: !867, size: 64, offset: 1216)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1421, file: !162, line: 2324, baseType: !1467, size: 64, offset: 1280)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !162, line: 2324, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !869, file: !162, line: 3395, baseType: !1470, size: 320)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !162, line: 1469, size: 320, elements: !1471)
!1471 = !{!1472, !1473, !1474}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1470, file: !162, line: 1470, baseType: !905, size: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1470, file: !162, line: 1471, baseType: !867, size: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1470, file: !162, line: 1472, baseType: !867, size: 64, offset: 256)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !869, file: !162, line: 3396, baseType: !1476, size: 320)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !162, line: 1482, size: 320, elements: !1477)
!1477 = !{!1478, !1479, !1480}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1476, file: !162, line: 1483, baseType: !905, size: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1476, file: !162, line: 1484, baseType: !769, size: 32, offset: 192)
