; ModuleID = 'cpp_traditional.c'
source_filename = "cpp_traditional.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }

!9 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !4, line: 158, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!19 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !4, line: 265, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !4, line: 262, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ls", file: !1, line: 72, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49}
!42 = !DIEnumerator(name: "ls_none", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "ls_fun_open", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "ls_fun_close", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "ls_defined", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "ls_defined_close", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "ls_hash", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "ls_predicate", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "ls_answer", value: 7, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "node_type", file: !4, line: 584, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "NT_VOID", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "NT_MACRO", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "NT_ASSERTION", value: 2, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 57, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "./include/safe-ctype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!58 = !DIEnumerator(name: "_sch_isblank", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "_sch_iscntrl", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "_sch_isdigit", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "_sch_islower", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "_sch_isprint", value: 16, isUnsigned: true)
!63 = !DIEnumerator(name: "_sch_ispunct", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "_sch_isspace", value: 64, isUnsigned: true)
!65 = !DIEnumerator(name: "_sch_isupper", value: 128, isUnsigned: true)
!66 = !DIEnumerator(name: "_sch_isxdigit", value: 256, isUnsigned: true)
!67 = !DIEnumerator(name: "_sch_isidst", value: 512, isUnsigned: true)
!68 = !DIEnumerator(name: "_sch_isvsp", value: 1024, isUnsigned: true)
!69 = !DIEnumerator(name: "_sch_isnvsp", value: 2048, isUnsigned: true)
!70 = !DIEnumerator(name: "_sch_isalpha", value: 136, isUnsigned: true)
!71 = !DIEnumerator(name: "_sch_isalnum", value: 140, isUnsigned: true)
!72 = !DIEnumerator(name: "_sch_isidnum", value: 516, isUnsigned: true)
!73 = !DIEnumerator(name: "_sch_isgraph", value: 172, isUnsigned: true)
!74 = !DIEnumerator(name: "_sch_iscppsp", value: 3072, isUnsigned: true)
!75 = !DIEnumerator(name: "_sch_isbasic", value: 3088, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ht_lookup_option", file: !77, line: 43, baseType: !5, size: 32, elements: !78)
!77 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "HT_NO_INSERT", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "HT_ALLOC", value: 1, isUnsigned: true)
!81 = !{!82, !83, !84, !96, !175, !176, !179, !97, !180, !181}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block", file: !1, line: 35, size: 64, elements: !86)
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "text_len", scope: !85, file: !1, line: 37, baseType: !5, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !85, file: !1, line: 38, baseType: !83, size: 16, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !85, file: !1, line: 39, baseType: !90, size: 8, offset: 48)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8, elements: !94)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !92, line: 22, baseType: !93)
!92 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !4, line: 36, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !4, line: 644, size: 256, elements: !100)
!100 = !{!101, !109, !110, !111, !112, !113, !114}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !99, file: !4, line: 645, baseType: !102, size: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !77, line: 31, size: 128, elements: !103)
!103 = !{!104, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !102, file: !77, line: 32, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !102, file: !77, line: 33, baseType: !5, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !102, file: !77, line: 34, baseType: !5, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !99, file: !4, line: 646, baseType: !5, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !99, file: !4, line: 647, baseType: !5, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !99, file: !4, line: 650, baseType: !93, size: 8, offset: 136)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !4, line: 651, baseType: !5, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !4, line: 652, baseType: !5, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !4, line: 654, baseType: !115, size: 64, offset: 192)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !4, line: 633, size: 64, elements: !116)
!116 = !{!117, !165, !173, !174}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !115, file: !4, line: 635, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !4, line: 37, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !92, line: 36, size: 256, elements: !121)
!121 = !{!122, !123, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !120, file: !92, line: 42, baseType: !96, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !120, file: !92, line: 51, baseType: !124, size: 64, offset: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !92, line: 47, size: 64, elements: !125)
!125 = !{!126, !155}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !124, file: !92, line: 49, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !4, line: 34, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !4, line: 212, size: 192, elements: !130)
!130 = !{!131, !134, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !129, file: !4, line: 213, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !133, line: 44, baseType: !5)
!133 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !4, line: 214, baseType: !5, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !4, line: 215, baseType: !83, size: 16, offset: 48)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !4, line: 237, baseType: !137, size: 128, offset: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !4, line: 217, size: 128, elements: !138)
!138 = !{!139, !143, !144, !149, !153, !154}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !137, file: !4, line: 220, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !4, line: 201, size: 64, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !4, line: 207, baseType: !97, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !137, file: !4, line: 223, baseType: !127, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !137, file: !4, line: 226, baseType: !145, size: 128)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !4, line: 162, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !145, file: !4, line: 163, baseType: !5, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !145, file: !4, line: 164, baseType: !105, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !137, file: !4, line: 229, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !4, line: 195, size: 32, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !150, file: !4, line: 197, baseType: !5, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !137, file: !4, line: 233, baseType: !5, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !137, file: !4, line: 236, baseType: !5, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !124, file: !92, line: 50, baseType: !105, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !120, file: !92, line: 54, baseType: !132, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !120, file: !92, line: 57, baseType: !5, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !120, file: !92, line: 60, baseType: !83, size: 16, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !120, file: !92, line: 63, baseType: !5, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !120, file: !92, line: 66, baseType: !5, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !120, file: !92, line: 69, baseType: !5, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !120, file: !92, line: 72, baseType: !5, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !120, file: !92, line: 75, baseType: !5, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !120, file: !92, line: 80, baseType: !5, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !115, file: !4, line: 637, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !92, line: 28, size: 320, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !92, line: 29, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !167, file: !92, line: 30, baseType: !5, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !167, file: !92, line: 31, baseType: !172, size: 192, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 192, elements: !94)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !115, file: !4, line: 639, baseType: !3, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !115, file: !4, line: 641, baseType: !83, size: 16)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 46, baseType: !178)
!177 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!184 = !{i32 7, !"Dwarf Version", i32 4}
!185 = !{i32 2, !"Debug Info Version", i32 3}
!186 = !{i32 1, !"wchar_size", i32 4}
!187 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!188 = distinct !DISubprogram(name: "_cpp_overlay_buffer", scope: !1, file: !1, line: 268, type: !189, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !676)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191, !674, !176}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !4, line: 31, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !194, line: 322, size: 10432, elements: !195)
!194 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !{!196, !272, !273, !290, !320, !321, !331, !332, !333, !363, !365, !369, !370, !371, !372, !373, !374, !375, !376, !377, !380, !381, !384, !385, !418, !419, !420, !423, !424, !425, !426, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !452, !453, !454, !457, !539, !565, !568, !569, !632, !639, !640, !647, !648, !649, !650, !653, !654, !667}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !193, file: !194, line: 325, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !4, line: 32, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !194, line: 249, size: 1536, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !213, !214, !215, !216, !218, !221, !222, !225, !226, !227, !228, !229, !230, !257}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !199, file: !194, line: 251, baseType: !105, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !199, file: !194, line: 252, baseType: !105, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !199, file: !194, line: 253, baseType: !105, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !199, file: !194, line: 255, baseType: !105, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !199, file: !194, line: 256, baseType: !105, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !199, file: !194, line: 258, baseType: !207, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !194, line: 235, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !194, line: 236, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !209, file: !194, line: 239, baseType: !105, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !194, line: 245, baseType: !5, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !199, file: !194, line: 259, baseType: !5, size: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !199, file: !194, line: 260, baseType: !5, size: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !199, file: !194, line: 261, baseType: !5, size: 32, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !194, line: 263, baseType: !217, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !199, file: !194, line: 267, baseType: !219, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !4, line: 42, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !199, file: !194, line: 271, baseType: !105, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !199, file: !194, line: 275, baseType: !223, size: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !194, line: 275, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !199, file: !194, line: 278, baseType: !93, size: 8, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !199, file: !194, line: 284, baseType: !5, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !199, file: !194, line: 289, baseType: !5, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !199, file: !194, line: 294, baseType: !5, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !199, file: !194, line: 298, baseType: !93, size: 8, offset: 784)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !199, file: !194, line: 302, baseType: !231, size: 512, offset: 832)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !4, line: 523, size: 512, elements: !232)
!232 = !{!233, !235, !237, !238, !239, !240, !241, !243, !249, !254}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !4, line: 526, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !4, line: 529, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !4, line: 530, baseType: !5, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !231, file: !4, line: 534, baseType: !93, size: 8, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !231, file: !4, line: 537, baseType: !93, size: 8, offset: 168)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !231, file: !4, line: 541, baseType: !236, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !231, file: !4, line: 545, baseType: !242, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !231, file: !4, line: 551, baseType: !244, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!236, !181, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !4, line: 39, baseType: !231)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !231, file: !4, line: 555, baseType: !250, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !251, line: 47, baseType: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !253, line: 148, baseType: !178)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !231, file: !4, line: 556, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !251, line: 59, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !253, line: 145, baseType: !178)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !199, file: !194, line: 306, baseType: !258, size: 192, offset: 1344)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !194, line: 47, size: 192, elements: !259)
!259 = !{!260, !269, !270}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !258, file: !194, line: 49, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !194, line: 45, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!93, !265, !105, !176, !267}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !266, line: 29, baseType: !82)
!266 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !194, line: 43, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !258, file: !194, line: 50, baseType: !265, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !258, file: !194, line: 51, baseType: !271, size: 32, offset: 128)
!271 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !193, file: !194, line: 328, baseType: !197, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !193, file: !194, line: 331, baseType: !274, size: 160, offset: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !194, line: 177, size: 160, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !274, file: !194, line: 180, baseType: !93, size: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !274, file: !194, line: 185, baseType: !93, size: 8, offset: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !274, file: !194, line: 188, baseType: !93, size: 8, offset: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !274, file: !194, line: 191, baseType: !93, size: 8, offset: 24)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !274, file: !194, line: 194, baseType: !93, size: 8, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !274, file: !194, line: 198, baseType: !93, size: 8, offset: 40)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !274, file: !194, line: 201, baseType: !93, size: 8, offset: 48)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !274, file: !194, line: 204, baseType: !93, size: 8, offset: 56)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !274, file: !194, line: 207, baseType: !93, size: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !274, file: !194, line: 210, baseType: !93, size: 8, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !274, file: !194, line: 214, baseType: !93, size: 8, offset: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !274, file: !194, line: 217, baseType: !5, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !274, file: !194, line: 220, baseType: !93, size: 8, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !274, file: !194, line: 223, baseType: !93, size: 8, offset: 136)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !193, file: !194, line: 334, baseType: !291, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !133, line: 74, size: 448, elements: !293)
!293 = !{!294, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !292, file: !133, line: 75, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !133, line: 61, size: 192, elements: !297)
!297 = !{!298, !299, !301, !302, !303, !304, !305}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !296, file: !133, line: 62, baseType: !181, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !296, file: !133, line: 63, baseType: !300, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !133, line: 39, baseType: !5)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !296, file: !133, line: 64, baseType: !132, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !296, file: !133, line: 65, baseType: !271, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !296, file: !133, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !296, file: !133, line: 68, baseType: !93, size: 8, offset: 168)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !296, file: !133, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !292, file: !133, line: 76, baseType: !5, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !292, file: !133, line: 77, baseType: !5, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !292, file: !133, line: 79, baseType: !5, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !292, file: !133, line: 84, baseType: !271, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !292, file: !133, line: 87, baseType: !5, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !292, file: !133, line: 90, baseType: !93, size: 8, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !292, file: !133, line: 93, baseType: !132, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !292, file: !133, line: 96, baseType: !132, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !292, file: !133, line: 100, baseType: !5, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !292, file: !133, line: 104, baseType: !316, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !133, line: 47, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!82, !82, !176}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !193, file: !194, line: 337, baseType: !132, size: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !193, file: !194, line: 340, baseType: !322, size: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !194, line: 99, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !194, line: 100, size: 256, elements: !325)
!325 = !{!326, !328, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !194, line: 102, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !324, file: !194, line: 103, baseType: !179, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !324, file: !194, line: 103, baseType: !179, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !324, file: !194, line: 103, baseType: !179, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !193, file: !194, line: 341, baseType: !322, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !193, file: !194, line: 342, baseType: !322, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !193, file: !194, line: 345, baseType: !334, size: 448, offset: 640)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !194, line: 142, size: 448, elements: !335)
!335 = !{!336, !339, !340, !360, !361, !362}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !194, line: 145, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !194, line: 141, baseType: !334)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !194, line: 145, baseType: !337, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !334, file: !194, line: 164, baseType: !341, size: 128, offset: 128)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !194, line: 147, size: 128, elements: !342)
!342 = !{!343, !355}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !341, file: !194, line: 156, baseType: !344, size: 128)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !194, line: 152, size: 128, elements: !345)
!345 = !{!346, !354}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !344, file: !194, line: 154, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !194, line: 121, size: 64, elements: !348)
!348 = !{!349, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !347, file: !194, line: 123, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !347, file: !194, line: 124, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !344, file: !194, line: 155, baseType: !347, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !341, file: !194, line: 163, baseType: !356, size: 128)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !341, file: !194, line: 159, size: 128, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !356, file: !194, line: 161, baseType: !105, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !356, file: !194, line: 162, baseType: !105, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !334, file: !194, line: 168, baseType: !322, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !334, file: !194, line: 171, baseType: !97, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !334, file: !194, line: 174, baseType: !93, size: 8, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !193, file: !194, line: 346, baseType: !364, size: 64, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !193, file: !194, line: 349, baseType: !366, size: 64, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !194, line: 40, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !193, file: !194, line: 352, baseType: !128, size: 192, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !193, file: !194, line: 356, baseType: !132, size: 32, offset: 1408)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !193, file: !194, line: 360, baseType: !93, size: 8, offset: 1440)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !193, file: !194, line: 363, baseType: !234, size: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !193, file: !194, line: 364, baseType: !234, size: 64, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !193, file: !194, line: 365, baseType: !231, size: 512, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !193, file: !194, line: 368, baseType: !219, size: 64, offset: 2112)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !193, file: !194, line: 370, baseType: !219, size: 64, offset: 2176)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !193, file: !194, line: 373, baseType: !378, size: 64, offset: 2240)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !194, line: 373, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !193, file: !194, line: 374, baseType: !378, size: 64, offset: 2304)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !193, file: !194, line: 375, baseType: !382, size: 64, offset: 2368)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !194, line: 375, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !193, file: !194, line: 378, baseType: !378, size: 64, offset: 2432)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !193, file: !194, line: 379, baseType: !386, size: 704, offset: 2496)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !387, line: 164, size: 704, elements: !388)
!387 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !{!389, !391, !401, !402, !403, !404, !405, !406, !410, !414, !415, !416, !417}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !386, file: !387, line: 166, baseType: !390, size: 64)
!390 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !386, file: !387, line: 167, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !387, line: 157, size: 192, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !393, file: !387, line: 159, baseType: !236, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !393, file: !387, line: 160, baseType: !392, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !393, file: !387, line: 161, baseType: !398, size: 32, offset: 128)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 32, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 4)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !386, file: !387, line: 168, baseType: !236, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !386, file: !387, line: 169, baseType: !236, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !386, file: !387, line: 170, baseType: !236, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !386, file: !387, line: 171, baseType: !390, size: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !386, file: !387, line: 172, baseType: !271, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !386, file: !387, line: 176, baseType: !407, size: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!392, !82, !390}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !386, file: !387, line: 177, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !82, !392}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !386, file: !387, line: 178, baseType: !82, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !386, file: !387, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !386, file: !387, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !386, file: !387, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !193, file: !194, line: 383, baseType: !93, size: 8, offset: 3200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !193, file: !194, line: 387, baseType: !93, size: 8, offset: 3208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !193, file: !194, line: 390, baseType: !421, size: 64, offset: 3264)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !193, file: !194, line: 391, baseType: !421, size: 64, offset: 3328)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !193, file: !194, line: 392, baseType: !93, size: 8, offset: 3392)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !193, file: !194, line: 395, baseType: !127, size: 64, offset: 3456)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !193, file: !194, line: 396, baseType: !427, size: 256, offset: 3520)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !194, line: 128, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !194, line: 129, size: 256, elements: !429)
!429 = !{!430, !432, !433, !434}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !194, line: 131, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !428, file: !194, line: 131, baseType: !431, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !428, file: !194, line: 132, baseType: !127, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !428, file: !194, line: 132, baseType: !127, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !193, file: !194, line: 396, baseType: !431, size: 64, offset: 3776)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !193, file: !194, line: 397, baseType: !5, size: 32, offset: 3840)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !193, file: !194, line: 400, baseType: !5, size: 32, offset: 3872)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !193, file: !194, line: 403, baseType: !179, size: 64, offset: 3904)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !193, file: !194, line: 404, baseType: !5, size: 32, offset: 3968)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !193, file: !194, line: 408, baseType: !258, size: 192, offset: 4032)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !193, file: !194, line: 412, baseType: !258, size: 192, offset: 4224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !193, file: !194, line: 416, baseType: !258, size: 192, offset: 4416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !193, file: !194, line: 420, baseType: !258, size: 192, offset: 4608)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !193, file: !194, line: 424, baseType: !258, size: 192, offset: 4800)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !193, file: !194, line: 427, baseType: !105, size: 64, offset: 4992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !193, file: !194, line: 428, baseType: !105, size: 64, offset: 5056)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !193, file: !194, line: 431, baseType: !128, size: 192, offset: 5120)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !193, file: !194, line: 432, baseType: !128, size: 192, offset: 5312)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !193, file: !194, line: 435, baseType: !450, size: 64, offset: 5504)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !4, line: 685, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !193, file: !194, line: 439, baseType: !386, size: 704, offset: 5568)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !193, file: !194, line: 443, baseType: !386, size: 704, offset: 6272)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !193, file: !194, line: 447, baseType: !455, size: 64, offset: 6976)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !194, line: 447, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !193, file: !194, line: 450, baseType: !458, size: 1088, offset: 7040)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !4, line: 472, size: 1088, elements: !459)
!459 = !{!460, !464, !470, !474, !478, !482, !483, !490, !494, !498, !502, !508, !512, !529, !530, !531, !535}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !458, file: !4, line: 475, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !191, !350, !271}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !458, file: !4, line: 481, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !191, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !458, file: !4, line: 483, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !191, !181}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !458, file: !4, line: 484, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !191, !5, !105, !181, !271, !353}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !458, file: !4, line: 486, baseType: !479, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !191, !5, !97}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !458, file: !4, line: 487, baseType: !479, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !458, file: !4, line: 488, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !191, !5, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !4, line: 35, baseType: !145)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !458, file: !4, line: 489, baseType: !491, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !191, !5}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !458, file: !4, line: 490, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!271, !191, !181, !271}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !458, file: !4, line: 491, baseType: !499, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !191, !181, !271, !181}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !458, file: !4, line: 492, baseType: !503, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !4, line: 469, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!181, !191, !181, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !458, file: !4, line: 496, baseType: !509, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!97, !191, !350}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !458, file: !4, line: 500, baseType: !513, size: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!93, !191, !271, !132, !5, !181, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !518, line: 52, baseType: !519)
!518 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !520, line: 32, baseType: !521)
!520 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !522)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, elements: !94)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !524)
!524 = !{!525, !526, !527, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !523, file: !1, baseType: !5, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !523, file: !1, baseType: !5, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !523, file: !1, baseType: !82, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !523, file: !1, baseType: !82, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !458, file: !4, line: 506, baseType: !479, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !458, file: !4, line: 507, baseType: !479, size: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !458, file: !4, line: 510, baseType: !532, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !191}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !458, file: !4, line: 513, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !191, !132, !97}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !193, file: !194, line: 453, baseType: !540, size: 64, offset: 8128)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !77, line: 46, size: 1152, elements: !542)
!542 = !{!543, !544, !548, !554, !558, !559, !560, !562, !563, !564}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !541, file: !77, line: 49, baseType: !386, size: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !541, file: !77, line: 51, baseType: !545, size: 64, offset: 704)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !77, line: 41, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !541, file: !77, line: 53, baseType: !549, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!546, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !77, line: 40, baseType: !541)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !541, file: !77, line: 56, baseType: !555, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!82, !176}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !541, file: !77, line: 58, baseType: !5, size: 32, offset: 896)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !541, file: !77, line: 59, baseType: !5, size: 32, offset: 928)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !541, file: !77, line: 62, baseType: !561, size: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !541, file: !77, line: 65, baseType: !5, size: 32, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !541, file: !77, line: 66, baseType: !5, size: 32, offset: 1056)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !541, file: !77, line: 69, baseType: !93, size: 8, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !193, file: !194, line: 456, baseType: !566, size: 64, offset: 8192)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !194, line: 42, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !193, file: !194, line: 456, baseType: !566, size: 64, offset: 8256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !193, file: !194, line: 459, baseType: !570, size: 1024, offset: 8320)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !4, line: 279, size: 1024, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !570, file: !4, line: 282, baseType: !5, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !570, file: !4, line: 285, baseType: !17, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !570, file: !4, line: 288, baseType: !93, size: 8, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !570, file: !4, line: 291, baseType: !93, size: 8, offset: 72)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !570, file: !4, line: 296, baseType: !93, size: 8, offset: 80)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !570, file: !4, line: 299, baseType: !93, size: 8, offset: 88)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !570, file: !4, line: 303, baseType: !93, size: 8, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !570, file: !4, line: 306, baseType: !93, size: 8, offset: 104)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !570, file: !4, line: 309, baseType: !93, size: 8, offset: 112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !570, file: !4, line: 312, baseType: !93, size: 8, offset: 120)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !570, file: !4, line: 315, baseType: !93, size: 8, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !570, file: !4, line: 318, baseType: !93, size: 8, offset: 136)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !570, file: !4, line: 321, baseType: !93, size: 8, offset: 144)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !570, file: !4, line: 324, baseType: !93, size: 8, offset: 152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !570, file: !4, line: 328, baseType: !93, size: 8, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !570, file: !4, line: 331, baseType: !93, size: 8, offset: 168)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !570, file: !4, line: 334, baseType: !93, size: 8, offset: 176)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !570, file: !4, line: 338, baseType: !93, size: 8, offset: 184)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !570, file: !4, line: 341, baseType: !93, size: 8, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !570, file: !4, line: 344, baseType: !93, size: 8, offset: 200)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !570, file: !4, line: 348, baseType: !93, size: 8, offset: 208)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !570, file: !4, line: 352, baseType: !93, size: 8, offset: 216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !570, file: !4, line: 356, baseType: !93, size: 8, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !570, file: !4, line: 360, baseType: !93, size: 8, offset: 232)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !570, file: !4, line: 363, baseType: !93, size: 8, offset: 240)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !570, file: !4, line: 366, baseType: !93, size: 8, offset: 248)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !570, file: !4, line: 370, baseType: !93, size: 8, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !570, file: !4, line: 373, baseType: !93, size: 8, offset: 264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !570, file: !4, line: 376, baseType: !93, size: 8, offset: 272)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !570, file: !4, line: 379, baseType: !93, size: 8, offset: 280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !570, file: !4, line: 382, baseType: !93, size: 8, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !570, file: !4, line: 385, baseType: !93, size: 8, offset: 296)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !570, file: !4, line: 389, baseType: !93, size: 8, offset: 304)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !570, file: !4, line: 392, baseType: !93, size: 8, offset: 312)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !570, file: !4, line: 395, baseType: !93, size: 8, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !570, file: !4, line: 398, baseType: !93, size: 8, offset: 328)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !570, file: !4, line: 401, baseType: !93, size: 8, offset: 336)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !570, file: !4, line: 404, baseType: !181, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !570, file: !4, line: 407, baseType: !181, size: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !570, file: !4, line: 410, baseType: !181, size: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !570, file: !4, line: 414, baseType: !29, size: 32, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !570, file: !4, line: 417, baseType: !93, size: 8, offset: 608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !570, file: !4, line: 420, baseType: !93, size: 8, offset: 616)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !570, file: !4, line: 441, baseType: !616, size: 64, offset: 640)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !4, line: 423, size: 64, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !616, file: !4, line: 426, baseType: !35, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !616, file: !4, line: 429, baseType: !93, size: 8, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !616, file: !4, line: 433, baseType: !93, size: 8, offset: 40)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !616, file: !4, line: 436, baseType: !93, size: 8, offset: 48)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !616, file: !4, line: 440, baseType: !93, size: 8, offset: 56)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !570, file: !4, line: 447, baseType: !176, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !570, file: !4, line: 447, baseType: !176, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !570, file: !4, line: 447, baseType: !176, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !570, file: !4, line: 447, baseType: !176, size: 64, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !570, file: !4, line: 450, baseType: !93, size: 8, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !570, file: !4, line: 450, baseType: !93, size: 8, offset: 968)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !570, file: !4, line: 454, baseType: !93, size: 8, offset: 976)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !570, file: !4, line: 457, baseType: !93, size: 8, offset: 984)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !570, file: !4, line: 460, baseType: !93, size: 8, offset: 992)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !193, file: !194, line: 463, baseType: !633, size: 256, offset: 9344)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !194, line: 227, size: 256, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !633, file: !194, line: 229, baseType: !97, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !633, file: !194, line: 230, baseType: !97, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !633, file: !194, line: 231, baseType: !97, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !633, file: !194, line: 232, baseType: !97, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !193, file: !194, line: 466, baseType: !93, size: 8, offset: 9600)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !193, file: !194, line: 475, baseType: !641, size: 256, offset: 9664)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !194, line: 469, size: 256, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !641, file: !194, line: 471, baseType: !179, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !641, file: !194, line: 472, baseType: !179, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !641, file: !194, line: 473, baseType: !179, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !641, file: !194, line: 474, baseType: !132, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !193, file: !194, line: 478, baseType: !105, size: 64, offset: 9920)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !193, file: !194, line: 478, baseType: !105, size: 64, offset: 9984)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !193, file: !194, line: 478, baseType: !105, size: 64, offset: 10048)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !193, file: !194, line: 482, baseType: !651, size: 64, offset: 10112)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !194, line: 482, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !193, file: !194, line: 485, baseType: !5, size: 32, offset: 10176)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !193, file: !194, line: 488, baseType: !655, size: 128, offset: 10240)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !4, line: 901, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 891, size: 128, elements: !657)
!657 = !{!658, !665, !666}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !656, file: !4, line: 894, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !4, line: 887, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 880, size: 128, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !661, file: !4, line: 883, baseType: !236, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !661, file: !4, line: 886, baseType: !132, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !656, file: !4, line: 897, baseType: !271, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !656, file: !4, line: 900, baseType: !271, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !193, file: !194, line: 491, baseType: !668, size: 64, offset: 10368)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !194, line: 310, size: 192, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !194, line: 312, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !194, line: 314, baseType: !236, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !669, file: !194, line: 316, baseType: !118, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!676 = !{}
!677 = !DILocalVariable(name: "pfile", arg: 1, scope: !188, file: !1, line: 268, type: !191)
!678 = !DILocation(line: 268, column: 34, scope: !188)
!679 = !DILocalVariable(name: "start", arg: 2, scope: !188, file: !1, line: 268, type: !674)
!680 = !DILocation(line: 268, column: 54, scope: !188)
!681 = !DILocalVariable(name: "len", arg: 3, scope: !188, file: !1, line: 268, type: !176)
!682 = !DILocation(line: 268, column: 68, scope: !188)
!683 = !DILocalVariable(name: "buffer", scope: !188, file: !1, line: 270, type: !197)
!684 = !DILocation(line: 270, column: 15, scope: !188)
!685 = !DILocation(line: 270, column: 24, scope: !188)
!686 = !DILocation(line: 270, column: 31, scope: !188)
!687 = !DILocation(line: 272, column: 28, scope: !188)
!688 = !DILocation(line: 272, column: 3, scope: !188)
!689 = !DILocation(line: 272, column: 10, scope: !188)
!690 = !DILocation(line: 272, column: 26, scope: !188)
!691 = !DILocation(line: 273, column: 22, scope: !188)
!692 = !DILocation(line: 273, column: 30, scope: !188)
!693 = !DILocation(line: 273, column: 3, scope: !188)
!694 = !DILocation(line: 273, column: 10, scope: !188)
!695 = !DILocation(line: 273, column: 20, scope: !188)
!696 = !DILocation(line: 274, column: 25, scope: !188)
!697 = !DILocation(line: 274, column: 33, scope: !188)
!698 = !DILocation(line: 274, column: 3, scope: !188)
!699 = !DILocation(line: 274, column: 10, scope: !188)
!700 = !DILocation(line: 274, column: 23, scope: !188)
!701 = !DILocation(line: 275, column: 28, scope: !188)
!702 = !DILocation(line: 275, column: 36, scope: !188)
!703 = !DILocation(line: 275, column: 3, scope: !188)
!704 = !DILocation(line: 275, column: 10, scope: !188)
!705 = !DILocation(line: 275, column: 26, scope: !188)
!706 = !DILocation(line: 276, column: 3, scope: !188)
!707 = !DILocation(line: 276, column: 11, scope: !188)
!708 = !DILocation(line: 276, column: 21, scope: !188)
!709 = !DILocation(line: 278, column: 17, scope: !188)
!710 = !DILocation(line: 278, column: 3, scope: !188)
!711 = !DILocation(line: 278, column: 11, scope: !188)
!712 = !DILocation(line: 278, column: 15, scope: !188)
!713 = !DILocation(line: 279, column: 23, scope: !188)
!714 = !DILocation(line: 279, column: 3, scope: !188)
!715 = !DILocation(line: 279, column: 11, scope: !188)
!716 = !DILocation(line: 279, column: 21, scope: !188)
!717 = !DILocation(line: 280, column: 20, scope: !188)
!718 = !DILocation(line: 280, column: 28, scope: !188)
!719 = !DILocation(line: 280, column: 26, scope: !188)
!720 = !DILocation(line: 280, column: 3, scope: !188)
!721 = !DILocation(line: 280, column: 11, scope: !188)
!722 = !DILocation(line: 280, column: 18, scope: !188)
!723 = !DILocation(line: 281, column: 1, scope: !188)
!724 = distinct !DISubprogram(name: "_cpp_remove_overlay", scope: !1, file: !1, line: 285, type: !533, scopeLine: 286, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !676)
!725 = !DILocalVariable(name: "pfile", arg: 1, scope: !724, file: !1, line: 285, type: !191)
!726 = !DILocation(line: 285, column: 34, scope: !724)
!727 = !DILocalVariable(name: "buffer", scope: !724, file: !1, line: 287, type: !197)
!728 = !DILocation(line: 287, column: 15, scope: !724)
!729 = !DILocation(line: 287, column: 24, scope: !724)
!730 = !DILocation(line: 287, column: 31, scope: !724)
!731 = !DILocation(line: 289, column: 17, scope: !724)
!732 = !DILocation(line: 289, column: 24, scope: !724)
!733 = !DILocation(line: 289, column: 3, scope: !724)
!734 = !DILocation(line: 289, column: 11, scope: !724)
!735 = !DILocation(line: 289, column: 15, scope: !724)
!736 = !DILocation(line: 290, column: 20, scope: !724)
!737 = !DILocation(line: 290, column: 27, scope: !724)
!738 = !DILocation(line: 290, column: 3, scope: !724)
!739 = !DILocation(line: 290, column: 11, scope: !724)
!740 = !DILocation(line: 290, column: 18, scope: !724)
!741 = !DILocation(line: 291, column: 23, scope: !724)
!742 = !DILocation(line: 291, column: 30, scope: !724)
!743 = !DILocation(line: 291, column: 3, scope: !724)
!744 = !DILocation(line: 291, column: 11, scope: !724)
!745 = !DILocation(line: 291, column: 21, scope: !724)
!746 = !DILocation(line: 292, column: 3, scope: !724)
!747 = !DILocation(line: 292, column: 11, scope: !724)
!748 = !DILocation(line: 292, column: 21, scope: !724)
!749 = !DILocation(line: 294, column: 3, scope: !724)
!750 = !DILocation(line: 294, column: 10, scope: !724)
!751 = !DILocation(line: 294, column: 26, scope: !724)
!752 = !DILocation(line: 295, column: 1, scope: !724)
!753 = distinct !DISubprogram(name: "_cpp_read_logical_line_trad", scope: !1, file: !1, line: 300, type: !754, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !676)
!754 = !DISubroutineType(types: !755)
!755 = !{!93, !191}
!756 = !DILocalVariable(name: "pfile", arg: 1, scope: !753, file: !1, line: 300, type: !191)
!757 = !DILocation(line: 300, column: 42, scope: !753)
!758 = !DILocation(line: 302, column: 3, scope: !753)
!759 = !DILocation(line: 304, column: 11, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 304, column: 11)
!761 = distinct !DILexicalBlock(scope: !753, file: !1, line: 303, column: 5)
!762 = !DILocation(line: 304, column: 18, scope: !760)
!763 = !DILocation(line: 304, column: 26, scope: !760)
!764 = !DILocation(line: 304, column: 36, scope: !760)
!765 = !DILocation(line: 304, column: 61, scope: !760)
!766 = !DILocation(line: 304, column: 40, scope: !760)
!767 = !DILocation(line: 304, column: 11, scope: !761)
!768 = !DILocation(line: 305, column: 2, scope: !760)
!769 = !DILocation(line: 306, column: 5, scope: !761)
!770 = !DILocation(line: 307, column: 39, scope: !753)
!771 = !DILocation(line: 307, column: 11, scope: !753)
!772 = !DILocation(line: 307, column: 52, scope: !753)
!773 = !DILocation(line: 307, column: 55, scope: !753)
!774 = !DILocation(line: 307, column: 62, scope: !753)
!775 = !DILocation(line: 307, column: 68, scope: !753)
!776 = distinct !{!776, !758, !777}
!777 = !DILocation(line: 307, column: 76, scope: !753)
!778 = !DILocation(line: 309, column: 10, scope: !753)
!779 = !DILocation(line: 309, column: 17, scope: !753)
!780 = !DILocation(line: 309, column: 24, scope: !753)
!781 = !DILocation(line: 309, column: 3, scope: !753)
!782 = !DILocation(line: 310, column: 1, scope: !753)
!783 = distinct !DISubprogram(name: "_cpp_scan_out_logical_line", scope: !1, file: !1, line: 345, type: !784, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !676)
!784 = !DISubroutineType(types: !785)
!785 = !{!93, !191, !118}
!786 = !DILocalVariable(name: "pfile", arg: 1, scope: !783, file: !1, line: 345, type: !191)
!787 = !DILocation(line: 345, column: 41, scope: !783)
!788 = !DILocalVariable(name: "macro", arg: 2, scope: !783, file: !1, line: 345, type: !118)
!789 = !DILocation(line: 345, column: 59, scope: !783)
!790 = !DILocalVariable(name: "result", scope: !783, file: !1, line: 347, type: !93)
!791 = !DILocation(line: 347, column: 8, scope: !783)
!792 = !DILocalVariable(name: "context", scope: !783, file: !1, line: 348, type: !337)
!793 = !DILocation(line: 348, column: 16, scope: !783)
!794 = !DILocalVariable(name: "cur", scope: !783, file: !1, line: 349, type: !674)
!795 = !DILocation(line: 349, column: 16, scope: !783)
!796 = !DILocalVariable(name: "out", scope: !783, file: !1, line: 350, type: !175)
!797 = !DILocation(line: 350, column: 10, scope: !783)
!798 = !DILocalVariable(name: "fmacro", scope: !783, file: !1, line: 351, type: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fun_macro", file: !1, line: 47, size: 320, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !799, file: !1, line: 50, baseType: !322, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !799, file: !1, line: 56, baseType: !180, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !799, file: !1, line: 59, baseType: !97, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !799, file: !1, line: 62, baseType: !176, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !799, file: !1, line: 65, baseType: !132, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !799, file: !1, line: 68, baseType: !5, size: 32, offset: 288)
!807 = !DILocation(line: 351, column: 20, scope: !783)
!808 = !DILocalVariable(name: "c", scope: !783, file: !1, line: 352, type: !5)
!809 = !DILocation(line: 352, column: 16, scope: !783)
!810 = !DILocalVariable(name: "paren_depth", scope: !783, file: !1, line: 352, type: !5)
!811 = !DILocation(line: 352, column: 19, scope: !783)
!812 = !DILocalVariable(name: "quote", scope: !783, file: !1, line: 352, type: !5)
!813 = !DILocation(line: 352, column: 36, scope: !783)
!814 = !DILocalVariable(name: "lex_state", scope: !783, file: !1, line: 353, type: !40)
!815 = !DILocation(line: 353, column: 11, scope: !783)
!816 = !DILocalVariable(name: "header_ok", scope: !783, file: !1, line: 354, type: !93)
!817 = !DILocation(line: 354, column: 8, scope: !783)
!818 = !DILocalVariable(name: "start_of_input_line", scope: !783, file: !1, line: 355, type: !674)
!819 = !DILocation(line: 355, column: 16, scope: !783)
!820 = !DILocation(line: 357, column: 10, scope: !783)
!821 = !DILocation(line: 357, column: 15, scope: !783)
!822 = !DILocation(line: 358, column: 10, scope: !783)
!823 = !DILocation(line: 358, column: 15, scope: !783)
!824 = !DILocation(line: 359, column: 10, scope: !783)
!825 = !DILocation(line: 359, column: 15, scope: !783)
!826 = !DILocation(line: 360, column: 10, scope: !783)
!827 = !DILocation(line: 360, column: 17, scope: !783)
!828 = !DILocation(line: 361, column: 10, scope: !783)
!829 = !DILocation(line: 361, column: 15, scope: !783)
!830 = !DILocation(line: 362, column: 10, scope: !783)
!831 = !DILocation(line: 362, column: 15, scope: !783)
!832 = !DILocation(line: 364, column: 9, scope: !783)
!833 = !DILocation(line: 365, column: 15, scope: !783)
!834 = !DILocation(line: 365, column: 22, scope: !783)
!835 = !DILocation(line: 365, column: 28, scope: !783)
!836 = !DILocation(line: 365, column: 13, scope: !783)
!837 = !DILocation(line: 366, column: 26, scope: !783)
!838 = !DILocation(line: 366, column: 33, scope: !783)
!839 = !DILocation(line: 366, column: 41, scope: !783)
!840 = !DILocation(line: 366, column: 3, scope: !783)
!841 = !DILocation(line: 366, column: 24, scope: !783)
!842 = !DILocation(line: 367, column: 29, scope: !783)
!843 = !DILocation(line: 367, column: 36, scope: !783)
!844 = !DILocation(line: 367, column: 44, scope: !783)
!845 = !DILocation(line: 367, column: 3, scope: !783)
!846 = !DILocation(line: 367, column: 27, scope: !783)
!847 = !DILocation(line: 368, column: 20, scope: !783)
!848 = !DILocation(line: 368, column: 27, scope: !783)
!849 = !DILocation(line: 368, column: 31, scope: !783)
!850 = !DILocation(line: 368, column: 3, scope: !783)
!851 = !DILocation(line: 368, column: 10, scope: !783)
!852 = !DILocation(line: 368, column: 14, scope: !783)
!853 = !DILocation(line: 368, column: 18, scope: !783)
!854 = !DILocation(line: 369, column: 27, scope: !783)
!855 = !DILocation(line: 369, column: 34, scope: !783)
!856 = !DILocation(line: 369, column: 46, scope: !783)
!857 = !DILocation(line: 369, column: 3, scope: !783)
!858 = !DILocation(line: 369, column: 10, scope: !783)
!859 = !DILocation(line: 369, column: 14, scope: !783)
!860 = !DILocation(line: 369, column: 25, scope: !783)
!861 = !DILocation(line: 372, column: 25, scope: !783)
!862 = !DILocation(line: 372, column: 32, scope: !783)
!863 = !DILocation(line: 372, column: 40, scope: !783)
!864 = !DILocation(line: 372, column: 23, scope: !783)
!865 = !DILocation(line: 372, column: 3, scope: !783)
!866 = !DILabel(scope: !783, name: "new_context", file: !1, line: 373)
!867 = !DILocation(line: 373, column: 2, scope: !783)
!868 = !DILocation(line: 374, column: 13, scope: !783)
!869 = !DILocation(line: 374, column: 20, scope: !783)
!870 = !DILocation(line: 374, column: 11, scope: !783)
!871 = !DILocation(line: 375, column: 9, scope: !783)
!872 = !DILocation(line: 375, column: 7, scope: !783)
!873 = !DILocation(line: 376, column: 24, scope: !783)
