; ModuleID = 'hashtab.c'
source_filename = "hashtab.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.prime_ent = type { i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }

@htab_hash_pointer = dso_local global i32 (i8*)* @hash_pointer, align 8, !dbg !0
@htab_eq_pointer = dso_local global i32 (i8*, i8*)* @eq_pointer, align 8, !dbg !74

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "htab_hash_pointer", scope: !2, file: !3, line: 86, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !73, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "hashtab.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !6, line: 147, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!11 = !{!12, !35, !37, !65, !66, !39, !69, !21, !70}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !6, line: 144, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !6, line: 100, size: 896, elements: !15)
!15 = !{!16, !24, !30, !36, !38, !42, !43, !44, !45, !46, !51, !53, !54, !59, !64}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !14, file: !6, line: 102, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !6, line: 52, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !22}
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !6, line: 47, baseType: !7)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !14, file: !6, line: 105, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !6, line: 59, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !22, !22}
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !14, file: !6, line: 108, baseType: !31, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !6, line: 63, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !14, file: !6, line: 111, baseType: !37, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !14, file: !6, line: 114, baseType: !39, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !40, line: 46, baseType: !41)
!40 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !14, file: !6, line: 117, baseType: !39, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !14, file: !6, line: 120, baseType: !39, size: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !14, file: !6, line: 124, baseType: !7, size: 32, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !14, file: !6, line: 128, baseType: !7, size: 32, offset: 480)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !14, file: !6, line: 131, baseType: !47, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !6, line: 75, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!35, !39, !39}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !14, file: !6, line: 132, baseType: !52, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !6, line: 78, baseType: !32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !14, file: !6, line: 135, baseType: !35, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !14, file: !6, line: 136, baseType: !55, size: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !6, line: 82, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!35, !35, !39, !39}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !14, file: !6, line: 137, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !6, line: 83, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !35, !35}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !14, file: !6, line: 141, baseType: !7, size: 32, offset: 832)
!65 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !71, line: 87, baseType: !72)
!71 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!72 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!73 = !{!0, !74, !76}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "htab_eq_pointer", scope: !2, file: !3, line: 87, type: !25, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "prime_tab", scope: !2, file: !3, line: 139, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 3840, elements: !86)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prime_ent", file: !3, line: 131, size: 128, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prime", scope: !80, file: !3, line: 133, baseType: !21, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "inv", scope: !80, file: !3, line: 134, baseType: !21, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "inv_m2", scope: !80, file: !3, line: 135, baseType: !21, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !80, file: !3, line: 136, baseType: !21, size: 32, offset: 96)
!86 = !{!87}
!87 = !DISubrange(count: 30)
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!92 = distinct !DISubprogram(name: "hash_pointer", scope: !3, file: !3, line: 204, type: !19, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !93)
!93 = !{}
!94 = !DILocalVariable(name: "p", arg: 1, scope: !92, file: !3, line: 204, type: !22)
!95 = !DILocation(line: 204, column: 25, scope: !92)
!96 = !DILocation(line: 206, column: 33, scope: !92)
!97 = !DILocation(line: 206, column: 23, scope: !92)
!98 = !DILocation(line: 206, column: 35, scope: !92)
!99 = !DILocation(line: 206, column: 10, scope: !92)
!100 = !DILocation(line: 206, column: 3, scope: !92)
!101 = distinct !DISubprogram(name: "eq_pointer", scope: !3, file: !3, line: 212, type: !27, scopeLine: 213, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !93)
!102 = !DILocalVariable(name: "p1", arg: 1, scope: !101, file: !3, line: 212, type: !22)
!103 = !DILocation(line: 212, column: 23, scope: !101)
!104 = !DILocalVariable(name: "p2", arg: 2, scope: !101, file: !3, line: 212, type: !22)
!105 = !DILocation(line: 212, column: 37, scope: !101)
!106 = !DILocation(line: 214, column: 10, scope: !101)
!107 = !DILocation(line: 214, column: 16, scope: !101)
!108 = !DILocation(line: 214, column: 13, scope: !101)
!109 = !DILocation(line: 214, column: 3, scope: !101)
!110 = distinct !DISubprogram(name: "htab_size", scope: !3, file: !3, line: 228, type: !111, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!111 = !DISubroutineType(types: !112)
!112 = !{!39, !12}
!113 = !DILocalVariable(name: "htab", arg: 1, scope: !110, file: !3, line: 228, type: !12)
!114 = !DILocation(line: 228, column: 21, scope: !110)
!115 = !DILocation(line: 230, column: 10, scope: !110)
!116 = !DILocation(line: 230, column: 3, scope: !110)
!117 = distinct !DISubprogram(name: "htab_elements", scope: !3, file: !3, line: 238, type: !111, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!118 = !DILocalVariable(name: "htab", arg: 1, scope: !117, file: !3, line: 238, type: !12)
!119 = !DILocation(line: 238, column: 25, scope: !117)
!120 = !DILocation(line: 240, column: 10, scope: !117)
!121 = !DILocation(line: 240, column: 3, scope: !117)
!122 = distinct !DISubprogram(name: "htab_create_alloc", scope: !3, file: !3, line: 295, type: !123, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !39, !17, !25, !31, !47, !52}
!125 = !DILocalVariable(name: "size", arg: 1, scope: !122, file: !3, line: 295, type: !39)
!126 = !DILocation(line: 295, column: 27, scope: !122)
!127 = !DILocalVariable(name: "hash_f", arg: 2, scope: !122, file: !3, line: 295, type: !17)
!128 = !DILocation(line: 295, column: 43, scope: !122)
!129 = !DILocalVariable(name: "eq_f", arg: 3, scope: !122, file: !3, line: 295, type: !25)
!130 = !DILocation(line: 295, column: 59, scope: !122)
!131 = !DILocalVariable(name: "del_f", arg: 4, scope: !122, file: !3, line: 296, type: !31)
!132 = !DILocation(line: 296, column: 29, scope: !122)
!133 = !DILocalVariable(name: "alloc_f", arg: 5, scope: !122, file: !3, line: 296, type: !47)
!134 = !DILocation(line: 296, column: 47, scope: !122)
!135 = !DILocalVariable(name: "free_f", arg: 6, scope: !122, file: !3, line: 296, type: !52)
!136 = !DILocation(line: 296, column: 66, scope: !122)
!137 = !DILocalVariable(name: "result", scope: !122, file: !3, line: 298, type: !12)
