; ModuleID = 'ipa-reference.c'
source_filename = "ipa-reference.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ipa_opt_pass_d = type { %struct.opt_pass, void ()*, void (%struct.cgraph_node_set_def*)*, void ()*, void (%struct.cgraph_node*)*, void (%struct.cgraph_node*, %union.gimple_statement_d**)*, i32, i32 (%struct.cgraph_node*)*, void (%struct.varpool_node*)* }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }

!553 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!554 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!555 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!556 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!557 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!558 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!559 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!560 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!561 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!562 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!563 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!564 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!565 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!566 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!567 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!568 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!569 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!570 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!571 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!572 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!573 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!574 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!575 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!576 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !578, line: 256, baseType: !7, size: 32, elements: !579)
!578 = !DIFile(filename: "./lto-streamer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!580 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!581 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!582 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!583 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!584 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!585 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!586 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!587 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!588 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!589 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!590 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!591 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !578, line: 272, baseType: !7, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600}
!593 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE", value: 0, isUnsigned: true)
!594 = !DIEnumerator(name: "LTO_DECL_STREAM_FIELD_DECL", value: 1, isUnsigned: true)
!595 = !DIEnumerator(name: "LTO_DECL_STREAM_FN_DECL", value: 2, isUnsigned: true)
!596 = !DIEnumerator(name: "LTO_DECL_STREAM_VAR_DECL", value: 3, isUnsigned: true)
!597 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE_DECL", value: 4, isUnsigned: true)
!598 = !DIEnumerator(name: "LTO_DECL_STREAM_NAMESPACE_DECL", value: 5, isUnsigned: true)
!599 = !DIEnumerator(name: "LTO_DECL_STREAM_LABEL_DECL", value: 6, isUnsigned: true)
!600 = !DIEnumerator(name: "LTO_N_DECL_STREAMS", value: 7, isUnsigned: true)
!601 = !{!7, !602, !603, !2044, !2051, !1112, !1274, !608, !2061, !2074, !2079, !5, !2088, !2091, !2078, !906, !2094, !939, !1310}
!602 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !250, line: 181, size: 2496, elements: !606)
!606 = !{!607, !1787, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1927, !1981, !1991, !1995, !2021, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !605, file: !250, line: 182, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !609, line: 56, baseType: !610)
!609 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !612)
!612 = !{!613, !646, !652, !665, !672, !679, !684, !694, !700, !714, !726, !764, !772, !800, !817, !818, !823, !832, !838, !843, !847, !851, !1436, !1485, !1491, !1497, !1504, !1517, !1531, !1548, !1560, !1582, !1597, !1769}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !611, file: !6, line: 3372, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !614, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !614, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !614, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !614, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !614, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !614, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !614, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !614, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !614, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !614, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !614, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !614, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !614, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !614, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !614, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !614, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !614, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !614, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !614, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !614, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !614, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !614, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !614, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !614, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !614, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !614, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !614, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !614, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !614, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !614, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !6, line: 3373, baseType: !647, size: 192)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !647, file: !6, line: 403, baseType: !614, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !647, file: !6, line: 404, baseType: !608, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !6, line: 405, baseType: !608, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !611, file: !6, line: 3374, baseType: !653, size: 320)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !6, line: 1385, baseType: !647, size: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !653, file: !6, line: 1386, baseType: !657, size: 128, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !658, line: 58, baseType: !659)
!658 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 54, size: 128, elements: !660)
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !659, file: !658, line: 56, baseType: !662, size: 64)
!662 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !659, file: !658, line: 57, baseType: !664, size: 64, offset: 64)
!664 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !611, file: !6, line: 3375, baseType: !666, size: 256)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !666, file: !6, line: 1398, baseType: !647, size: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !666, file: !6, line: 1399, baseType: !670, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !611, file: !6, line: 3376, baseType: !673, size: 256)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !673, file: !6, line: 1409, baseType: !647, size: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !673, file: !6, line: 1410, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !611, file: !6, line: 3377, baseType: !680, size: 256)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !6, line: 1438, baseType: !647, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !680, file: !6, line: 1439, baseType: !608, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !611, file: !6, line: 3378, baseType: !685, size: 256)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !685, file: !6, line: 1419, baseType: !647, size: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !685, file: !6, line: 1420, baseType: !602, size: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !685, file: !6, line: 1421, baseType: !690, size: 8, offset: 224)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 8, elements: !692)
!691 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!692 = !{!693}
!693 = !DISubrange(count: 1)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !611, file: !6, line: 3379, baseType: !695, size: 320)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !6, line: 1429, baseType: !647, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !695, file: !6, line: 1430, baseType: !608, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !695, file: !6, line: 1431, baseType: !608, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !611, file: !6, line: 3380, baseType: !701, size: 320)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !701, file: !6, line: 1461, baseType: !647, size: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !701, file: !6, line: 1462, baseType: !705, size: 128, offset: 192)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !706, line: 31, size: 128, elements: !707)
!706 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!707 = !{!708, !712, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !705, file: !706, line: 32, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!711 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !705, file: !706, line: 33, baseType: !7, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !705, file: !706, line: 34, baseType: !7, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !611, file: !6, line: 3381, baseType: !715, size: 384)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !716)
!716 = !{!717, !718, !723, !724, !725}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !715, file: !6, line: 2508, baseType: !647, size: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !715, file: !6, line: 2509, baseType: !719, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !720, line: 58, baseType: !721)
!720 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !722, line: 44, baseType: !7)
!722 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!723 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !715, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !6, line: 2511, baseType: !608, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !715, file: !6, line: 2512, baseType: !608, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !611, file: !6, line: 3382, baseType: !727, size: 896)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !6, line: 2653, baseType: !715, size: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !727, file: !6, line: 2654, baseType: !608, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !727, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !727, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !727, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !727, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !727, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !727, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !727, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !727, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !727, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !727, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !727, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !727, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !727, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !727, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !727, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !727, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !727, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !727, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !727, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !727, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !727, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !727, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !727, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !727, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !727, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !727, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !727, file: !6, line: 2705, baseType: !608, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !727, file: !6, line: 2706, baseType: !608, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !727, file: !6, line: 2707, baseType: !608, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !727, file: !6, line: 2708, baseType: !608, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !727, file: !6, line: 2711, baseType: !762, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !611, file: !6, line: 3383, baseType: !765, size: 960)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !6, line: 2757, baseType: !727, size: 896)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !765, file: !6, line: 2758, baseType: !769, size: 64, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !609, line: 50, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !609, line: 49, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !611, file: !6, line: 3384, baseType: !773, size: 1472)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !774)
!774 = !{!775, !796, !797, !798, !799}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !6, line: 3115, baseType: !776, size: 1216)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !6, line: 2985, baseType: !765, size: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !776, file: !6, line: 2986, baseType: !608, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !776, file: !6, line: 2987, baseType: !608, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !776, file: !6, line: 2988, baseType: !608, size: 64, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !776, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !776, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !776, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !776, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !776, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !776, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !776, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !776, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !776, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !776, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !776, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !776, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !776, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !776, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !773, file: !6, line: 3117, baseType: !608, size: 64, offset: 1216)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !773, file: !6, line: 3119, baseType: !608, size: 64, offset: 1280)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !773, file: !6, line: 3121, baseType: !608, size: 64, offset: 1344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !773, file: !6, line: 3123, baseType: !608, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !611, file: !6, line: 3385, baseType: !801, size: 1088)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !6, line: 2875, baseType: !765, size: 960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !801, file: !6, line: 2876, baseType: !769, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !801, file: !6, line: 2877, baseType: !806, size: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !808, line: 172, size: 128, elements: !809)
!808 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!809 = !{!810, !811, !812, !813, !814, !815, !816}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !807, file: !808, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !807, file: !808, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !807, file: !808, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !807, file: !808, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !807, file: !808, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !807, file: !808, line: 195, baseType: !7, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !807, file: !808, line: 199, baseType: !608, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !611, file: !6, line: 3386, baseType: !776, size: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !611, file: !6, line: 3387, baseType: !819, size: 1280)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !6, line: 3094, baseType: !776, size: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !819, file: !6, line: 3095, baseType: !806, size: 64, offset: 1216)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !611, file: !6, line: 3388, baseType: !824, size: 1216)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !6, line: 2825, baseType: !727, size: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !824, file: !6, line: 2827, baseType: !608, size: 64, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !824, file: !6, line: 2828, baseType: !608, size: 64, offset: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !824, file: !6, line: 2829, baseType: !608, size: 64, offset: 1024)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !824, file: !6, line: 2830, baseType: !608, size: 64, offset: 1088)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !824, file: !6, line: 2831, baseType: !608, size: 64, offset: 1152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !611, file: !6, line: 3389, baseType: !833, size: 1024)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !833, file: !6, line: 2851, baseType: !765, size: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !833, file: !6, line: 2852, baseType: !602, size: 32, offset: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !833, file: !6, line: 2853, baseType: !602, size: 32, offset: 992)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !611, file: !6, line: 3390, baseType: !839, size: 1024)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !6, line: 2858, baseType: !765, size: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !839, file: !6, line: 2859, baseType: !806, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !611, file: !6, line: 3391, baseType: !844, size: 960)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !845)
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !6, line: 2863, baseType: !765, size: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !611, file: !6, line: 3392, baseType: !848, size: 1472)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !848, file: !6, line: 3305, baseType: !773, size: 1472)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !611, file: !6, line: 3393, baseType: !852, size: 1792)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !853)
!853 = !{!854, !855, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !852, file: !6, line: 3249, baseType: !773, size: 1472)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !852, file: !6, line: 3251, baseType: !856, size: 64, offset: 1472)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !858, line: 463, size: 1152, elements: !859)
!858 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!859 = !{!860, !863, !1182, !1183, !1356, !1359, !1360, !1361, !1362, !1363, !1364, !1388, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !857, file: !858, line: 464, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !858, line: 464, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !857, file: !858, line: 467, baseType: !864, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !866)
!866 = !{!867, !1157, !1158, !1171, !1172, !1173, !1174, !1175, !1176, !1178, !1180, !1181}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !865, file: !202, line: 377, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !609, line: 111, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !871)
!871 = !{!872, !1120, !1121, !1122, !1125, !1131, !1132, !1133, !1151, !1152, !1153, !1154, !1155, !1156}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !870, file: !202, line: 219, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !876)
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !875, file: !202, line: 151, baseType: !878, size: 128)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !879, file: !202, line: 150, baseType: !7, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !879, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !879, file: !202, line: 150, baseType: !884, size: 64, offset: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 64, elements: !692)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !609, line: 108, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !888)
!888 = !{!889, !890, !891, !1111, !1113, !1114, !1115, !1116, !1117, !1118}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !887, file: !202, line: 124, baseType: !869, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !887, file: !202, line: 125, baseType: !869, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !887, file: !202, line: 131, baseType: !892, size: 64, offset: 128)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !893)
!893 = !{!894, !1110}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !892, file: !202, line: 129, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !609, line: 66, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !513, line: 143, size: 192, elements: !898)
!898 = !{!899, !1108, !1109}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !897, file: !513, line: 145, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !609, line: 69, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !513, line: 136, size: 192, elements: !903)
!903 = !{!904, !1106, !1107}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !902, file: !513, line: 137, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !609, line: 58, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !513, line: 737, size: 768, elements: !908)
!908 = !{!909, !926, !959, !965, !970, !975, !982, !988, !994, !999, !1013, !1018, !1024, !1029, !1041, !1046, !1064, !1071, !1078, !1084, !1089, !1095, !1101}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !907, file: !513, line: 738, baseType: !910, size: 256)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !513, line: 271, size: 256, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !910, file: !513, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !910, file: !513, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !910, file: !513, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !910, file: !513, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !910, file: !513, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !910, file: !513, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !910, file: !513, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !910, file: !513, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !910, file: !513, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !910, file: !513, line: 312, baseType: !7, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !910, file: !513, line: 316, baseType: !719, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !910, file: !513, line: 319, baseType: !7, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !910, file: !513, line: 323, baseType: !869, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !910, file: !513, line: 327, baseType: !608, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !907, file: !513, line: 739, baseType: !927, size: 448)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !513, line: 350, size: 448, elements: !928)
!928 = !{!929, !957}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !927, file: !513, line: 353, baseType: !930, size: 384)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !513, line: 333, size: 384, elements: !931)
!931 = !{!932, !933, !940}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !930, file: !513, line: 336, baseType: !910, size: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !930, file: !513, line: 343, baseType: !934, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !492, line: 37, size: 128, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !492, line: 39, baseType: !934, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !935, file: !492, line: 40, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !930, file: !513, line: 344, baseType: !941, size: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !492, line: 45, size: 320, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !492, line: 47, baseType: !941, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !942, file: !492, line: 48, baseType: !946, size: 256, offset: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !947)
!947 = !{!948, !950, !951, !956}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !946, file: !6, line: 1884, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !6, line: 1885, baseType: !949, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !946, file: !6, line: 1891, baseType: !952, size: 64, offset: 128)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !946, file: !6, line: 1891, size: 64, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !952, file: !6, line: 1891, baseType: !905, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !952, file: !6, line: 1891, baseType: !608, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !946, file: !6, line: 1892, baseType: !939, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !927, file: !513, line: 359, baseType: !958, size: 64, offset: 384)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 64, elements: !692)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !907, file: !513, line: 740, baseType: !960, size: 512)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !513, line: 365, size: 512, elements: !961)
!961 = !{!962, !963, !964}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !960, file: !513, line: 368, baseType: !930, size: 384)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !960, file: !513, line: 373, baseType: !608, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !960, file: !513, line: 374, baseType: !608, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !907, file: !513, line: 741, baseType: !966, size: 576)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !513, line: 380, size: 576, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !966, file: !513, line: 383, baseType: !960, size: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !966, file: !513, line: 389, baseType: !958, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !907, file: !513, line: 742, baseType: !971, size: 320)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !513, line: 395, size: 320, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !971, file: !513, line: 397, baseType: !910, size: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !971, file: !513, line: 400, baseType: !895, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !907, file: !513, line: 743, baseType: !976, size: 448)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !513, line: 406, size: 448, elements: !977)
!977 = !{!978, !979, !980, !981}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !976, file: !513, line: 408, baseType: !910, size: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !976, file: !513, line: 412, baseType: !608, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !976, file: !513, line: 420, baseType: !608, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !976, file: !513, line: 423, baseType: !895, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !907, file: !513, line: 744, baseType: !983, size: 384)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !513, line: 429, size: 384, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !983, file: !513, line: 431, baseType: !910, size: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !983, file: !513, line: 434, baseType: !608, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !983, file: !513, line: 437, baseType: !895, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !907, file: !513, line: 745, baseType: !989, size: 384)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !513, line: 443, size: 384, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !989, file: !513, line: 445, baseType: !910, size: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !989, file: !513, line: 449, baseType: !608, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !989, file: !513, line: 453, baseType: !895, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !907, file: !513, line: 746, baseType: !995, size: 320)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !513, line: 459, size: 320, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !995, file: !513, line: 461, baseType: !910, size: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !995, file: !513, line: 464, baseType: !608, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !907, file: !513, line: 747, baseType: !1000, size: 768)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !513, line: 469, size: 768, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1000, file: !513, line: 471, baseType: !910, size: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1000, file: !513, line: 474, baseType: !7, size: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1000, file: !513, line: 475, baseType: !7, size: 32, offset: 288)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1000, file: !513, line: 478, baseType: !608, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1000, file: !513, line: 481, baseType: !1007, size: 384, offset: 384)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 384, elements: !692)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1008, file: !6, line: 1920, baseType: !946, size: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1008, file: !6, line: 1921, baseType: !608, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1008, file: !6, line: 1922, baseType: !719, size: 32, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !907, file: !513, line: 748, baseType: !1014, size: 320)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !513, line: 487, size: 320, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1014, file: !513, line: 490, baseType: !910, size: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1014, file: !513, line: 494, baseType: !602, size: 32, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !907, file: !513, line: 749, baseType: !1019, size: 384)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !513, line: 500, size: 384, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1019, file: !513, line: 502, baseType: !910, size: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1019, file: !513, line: 506, baseType: !895, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1019, file: !513, line: 510, baseType: !895, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !907, file: !513, line: 750, baseType: !1025, size: 320)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !513, line: 529, size: 320, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1025, file: !513, line: 531, baseType: !910, size: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1025, file: !513, line: 540, baseType: !895, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !907, file: !513, line: 751, baseType: !1030, size: 704)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !513, line: 546, size: 704, elements: !1031)
!1031 = !{!1032, !1033, !1036, !1037, !1038, !1039, !1040}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1030, file: !513, line: 549, baseType: !960, size: 512)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1030, file: !513, line: 553, baseType: !1034, size: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1030, file: !513, line: 557, baseType: !711, size: 8, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1030, file: !513, line: 558, baseType: !711, size: 8, offset: 584)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1030, file: !513, line: 559, baseType: !711, size: 8, offset: 592)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1030, file: !513, line: 560, baseType: !711, size: 8, offset: 600)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1030, file: !513, line: 566, baseType: !958, size: 64, offset: 640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !907, file: !513, line: 752, baseType: !1042, size: 384)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !513, line: 571, size: 384, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1042, file: !513, line: 573, baseType: !971, size: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !513, line: 577, baseType: !608, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !907, file: !513, line: 753, baseType: !1047, size: 576)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !513, line: 600, size: 576, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1054, !1063}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1047, file: !513, line: 602, baseType: !971, size: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1047, file: !513, line: 605, baseType: !608, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1047, file: !513, line: 609, baseType: !1052, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1053, line: 46, baseType: !662)
!1053 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1047, file: !513, line: 612, baseType: !1055, size: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !513, line: 581, size: 320, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1056, file: !513, line: 583, baseType: !5, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1056, file: !513, line: 586, baseType: !608, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1056, file: !513, line: 589, baseType: !608, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1056, file: !513, line: 592, baseType: !608, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1056, file: !513, line: 595, baseType: !608, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1047, file: !513, line: 616, baseType: !895, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !907, file: !513, line: 754, baseType: !1065, size: 512)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !513, line: 622, size: 512, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1065, file: !513, line: 624, baseType: !971, size: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1065, file: !513, line: 628, baseType: !608, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1065, file: !513, line: 632, baseType: !608, size: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1065, file: !513, line: 636, baseType: !608, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !907, file: !513, line: 755, baseType: !1072, size: 704)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !513, line: 642, size: 704, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1072, file: !513, line: 644, baseType: !1065, size: 512)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1072, file: !513, line: 648, baseType: !608, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1072, file: !513, line: 652, baseType: !608, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1072, file: !513, line: 653, baseType: !608, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !907, file: !513, line: 756, baseType: !1079, size: 448)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !513, line: 663, size: 448, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1079, file: !513, line: 665, baseType: !971, size: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1079, file: !513, line: 668, baseType: !608, size: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1079, file: !513, line: 673, baseType: !608, size: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !907, file: !513, line: 757, baseType: !1085, size: 384)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !513, line: 694, size: 384, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1085, file: !513, line: 696, baseType: !971, size: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1085, file: !513, line: 699, baseType: !608, size: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !907, file: !513, line: 758, baseType: !1090, size: 384)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !513, line: 681, size: 384, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1090, file: !513, line: 683, baseType: !910, size: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1090, file: !513, line: 686, baseType: !608, size: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1090, file: !513, line: 689, baseType: !608, size: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !907, file: !513, line: 759, baseType: !1096, size: 384)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !513, line: 707, size: 384, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1096, file: !513, line: 709, baseType: !910, size: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1096, file: !513, line: 712, baseType: !608, size: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1096, file: !513, line: 712, baseType: !608, size: 64, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !907, file: !513, line: 760, baseType: !1102, size: 320)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !513, line: 718, size: 320, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1102, file: !513, line: 720, baseType: !910, size: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1102, file: !513, line: 723, baseType: !608, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !902, file: !513, line: 138, baseType: !901, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !902, file: !513, line: 139, baseType: !901, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !897, file: !513, line: 146, baseType: !900, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !897, file: !513, line: 152, baseType: !895, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !892, file: !202, line: 130, baseType: !769, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !887, file: !202, line: 134, baseType: !1112, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !887, file: !202, line: 137, baseType: !608, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !887, file: !202, line: 138, baseType: !719, size: 32, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !887, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !887, file: !202, line: 144, baseType: !602, size: 32, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !887, file: !202, line: 145, baseType: !602, size: 32, offset: 416)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !887, file: !202, line: 146, baseType: !1119, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !664)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !870, file: !202, line: 220, baseType: !873, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !870, file: !202, line: 223, baseType: !1112, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !870, file: !202, line: 226, baseType: !1123, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !870, file: !202, line: 229, baseType: !1126, size: 128, offset: 256)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 128, elements: !1129)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1129 = !{!1130}
!1130 = !DISubrange(count: 2)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !870, file: !202, line: 232, baseType: !869, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !870, file: !202, line: 233, baseType: !869, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !870, file: !202, line: 238, baseType: !1134, size: 64, offset: 512)
!1134 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1135)
!1135 = !{!1136, !1142}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1134, file: !202, line: 236, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1138, file: !202, line: 275, baseType: !895, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1138, file: !202, line: 278, baseType: !895, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1134, file: !202, line: 237, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1144, file: !202, line: 261, baseType: !769, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1144, file: !202, line: 262, baseType: !769, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1144, file: !202, line: 266, baseType: !769, size: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1144, file: !202, line: 267, baseType: !769, size: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1144, file: !202, line: 270, baseType: !602, size: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !870, file: !202, line: 241, baseType: !1119, size: 64, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !870, file: !202, line: 244, baseType: !602, size: 32, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !870, file: !202, line: 247, baseType: !602, size: 32, offset: 672)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !870, file: !202, line: 250, baseType: !602, size: 32, offset: 704)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !870, file: !202, line: 253, baseType: !602, size: 32, offset: 736)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !870, file: !202, line: 256, baseType: !602, size: 32, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !865, file: !202, line: 378, baseType: !868, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !865, file: !202, line: 381, baseType: !1159, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1161, file: !202, line: 282, baseType: !1164, size: 128)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1165, file: !202, line: 281, baseType: !7, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1165, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1165, file: !202, line: 281, baseType: !1170, size: 64, offset: 64)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 64, elements: !692)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !865, file: !202, line: 384, baseType: !602, size: 32, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !865, file: !202, line: 387, baseType: !602, size: 32, offset: 224)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !865, file: !202, line: 390, baseType: !602, size: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !865, file: !202, line: 394, baseType: !1159, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !865, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !865, file: !202, line: 399, baseType: !1177, size: 64, offset: 416)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !1129)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !865, file: !202, line: 402, baseType: !1179, size: 64, offset: 480)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1129)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !865, file: !202, line: 406, baseType: !602, size: 32, offset: 544)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !865, file: !202, line: 409, baseType: !602, size: 32, offset: 576)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !857, file: !858, line: 470, baseType: !896, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !857, file: !858, line: 473, baseType: !1184, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !808, line: 39, size: 1152, elements: !1186)
!1186 = !{!1187, !1237, !1250, !1262, !1263, !1333, !1334, !1338, !1339, !1340, !1341, !1342}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1185, file: !808, line: 41, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1189, line: 144, baseType: !1190)
!1189 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1189, line: 100, size: 896, elements: !1192)
!1192 = !{!1193, !1201, !1206, !1211, !1213, !1214, !1215, !1216, !1217, !1218, !1223, !1225, !1226, !1231, !1236}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1191, file: !1189, line: 102, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1189, line: 52, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1189, line: 47, baseType: !7)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1191, file: !1189, line: 105, baseType: !1202, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1189, line: 59, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!602, !1199, !1199}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1191, file: !1189, line: 108, baseType: !1207, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1189, line: 63, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1112}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1191, file: !1189, line: 111, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !1189, line: 114, baseType: !1052, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1191, file: !1189, line: 117, baseType: !1052, size: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1191, file: !1189, line: 120, baseType: !1052, size: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1191, file: !1189, line: 124, baseType: !7, size: 32, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1191, file: !1189, line: 128, baseType: !7, size: 32, offset: 480)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1191, file: !1189, line: 131, baseType: !1219, size: 64, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1189, line: 75, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1112, !1052, !1052}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1191, file: !1189, line: 132, baseType: !1224, size: 64, offset: 576)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1189, line: 78, baseType: !1208)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1191, file: !1189, line: 135, baseType: !1112, size: 64, offset: 640)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1191, file: !1189, line: 136, baseType: !1227, size: 64, offset: 704)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1189, line: 82, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!1112, !1112, !1052, !1052}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1191, file: !1189, line: 137, baseType: !1232, size: 64, offset: 768)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1189, line: 83, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{null, !1112, !1112}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1191, file: !1189, line: 141, baseType: !7, size: 32, offset: 832)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1185, file: !808, line: 48, baseType: !1238, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !513, line: 35, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !513, line: 35, size: 128, elements: !1241)
!1241 = !{!1242}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1240, file: !513, line: 35, baseType: !1243, size: 128)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !513, line: 33, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !513, line: 33, size: 128, elements: !1245)
!1245 = !{!1246, !1247, !1248}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1244, file: !513, line: 33, baseType: !7, size: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1244, file: !513, line: 33, baseType: !7, size: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1244, file: !513, line: 33, baseType: !1249, size: 64, offset: 64)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 64, elements: !692)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1185, file: !808, line: 51, baseType: !1251, size: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1254)
!1254 = !{!1255}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1253, file: !6, line: 183, baseType: !1256, size: 128)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1257, file: !6, line: 182, baseType: !7, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1257, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1257, file: !6, line: 182, baseType: !958, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1185, file: !808, line: 54, baseType: !608, size: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1185, file: !808, line: 57, baseType: !1264, size: 128, offset: 256)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1265, line: 31, size: 128, elements: !1266)
!1265 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1264, file: !1265, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1264, file: !1265, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1264, file: !1265, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1264, file: !1265, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1264, file: !1265, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1264, file: !1265, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1264, file: !1265, line: 56, baseType: !1274, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !609, line: 47, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1277, line: 75, size: 256, elements: !1278)
!1277 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1278 = !{!1279, !1291, !1292, !1293}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1276, file: !1277, line: 76, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1277, line: 68, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1277, line: 63, size: 320, elements: !1283)
!1283 = !{!1284, !1286, !1287, !1288}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1282, file: !1277, line: 64, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1282, file: !1277, line: 65, baseType: !1285, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1282, file: !1277, line: 66, baseType: !7, size: 32, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1282, file: !1277, line: 67, baseType: !1289, size: 128, offset: 192)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1290, size: 128, elements: !1129)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1277, line: 29, baseType: !662)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1276, file: !1277, line: 77, baseType: !1280, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1276, file: !1277, line: 78, baseType: !7, size: 32, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1276, file: !1277, line: 79, baseType: !1294, size: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1277, line: 49, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1277, line: 45, size: 832, elements: !1297)
!1297 = !{!1298, !1299, !1300}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1296, file: !1277, line: 46, baseType: !1285, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1296, file: !1277, line: 47, baseType: !1275, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1296, file: !1277, line: 48, baseType: !1301, size: 704, offset: 128)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1302, line: 164, size: 704, elements: !1303)
!1302 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1303 = !{!1304, !1305, !1316, !1317, !1318, !1319, !1320, !1321, !1325, !1329, !1330, !1331, !1332}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1301, file: !1302, line: 166, baseType: !664, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1301, file: !1302, line: 167, baseType: !1306, size: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1302, line: 157, size: 192, elements: !1308)
!1308 = !{!1309, !1311, !1312}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1307, file: !1302, line: 159, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1307, file: !1302, line: 160, baseType: !1306, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1307, file: !1302, line: 161, baseType: !1313, size: 32, offset: 128)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 32, elements: !1314)
!1314 = !{!1315}
!1315 = !DISubrange(count: 4)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1301, file: !1302, line: 168, baseType: !1310, size: 64, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1301, file: !1302, line: 169, baseType: !1310, size: 64, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1301, file: !1302, line: 170, baseType: !1310, size: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1301, file: !1302, line: 171, baseType: !664, size: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1301, file: !1302, line: 172, baseType: !602, size: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1301, file: !1302, line: 176, baseType: !1322, size: 64, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!1306, !1112, !664}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1301, file: !1302, line: 177, baseType: !1326, size: 64, offset: 512)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !1112, !1306}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1301, file: !1302, line: 178, baseType: !1112, size: 64, offset: 576)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1301, file: !1302, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1301, file: !1302, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1301, file: !1302, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1185, file: !808, line: 60, baseType: !1264, size: 128, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1185, file: !808, line: 64, baseType: !1335, size: 64, offset: 512)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1337, line: 33, flags: DIFlagFwdDecl)
!1337 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1185, file: !808, line: 67, baseType: !608, size: 64, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1185, file: !808, line: 73, baseType: !1188, size: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1185, file: !808, line: 77, baseType: !1274, size: 64, offset: 704)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1185, file: !808, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1185, file: !808, line: 82, baseType: !1343, size: 320, offset: 832)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !492, line: 62, size: 320, elements: !1344)
!1344 = !{!1345, !1351, !1352, !1353, !1354, !1355}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1343, file: !492, line: 63, baseType: !1346, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !492, line: 56, size: 128, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1347, file: !492, line: 57, baseType: !1346, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1347, file: !492, line: 58, baseType: !690, size: 8, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1343, file: !492, line: 64, baseType: !7, size: 32, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1343, file: !492, line: 66, baseType: !7, size: 32, offset: 96)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1343, file: !492, line: 68, baseType: !711, size: 8, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1343, file: !492, line: 70, baseType: !934, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1343, file: !492, line: 71, baseType: !941, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !857, file: !858, line: 476, baseType: !1357, size: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !858, line: 476, flags: DIFlagFwdDecl)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !857, file: !858, line: 479, baseType: !1188, size: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !857, file: !858, line: 484, baseType: !608, size: 64, offset: 384)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !857, file: !858, line: 488, baseType: !608, size: 64, offset: 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !857, file: !858, line: 493, baseType: !608, size: 64, offset: 512)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !857, file: !858, line: 496, baseType: !608, size: 64, offset: 576)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !857, file: !858, line: 501, baseType: !1365, size: 64, offset: 640)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1367)
!1367 = !{!1368, !1371, !1372, !1373, !1374, !1376, !1377, !1382, !1383, !1384, !1385, !1386, !1387}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1366, file: !213, line: 2356, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1366, file: !213, line: 2357, baseType: !1034, size: 64, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1366, file: !213, line: 2358, baseType: !602, size: 32, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1366, file: !213, line: 2359, baseType: !602, size: 32, offset: 160)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1366, file: !213, line: 2360, baseType: !1375, size: 128, offset: 192)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 128, elements: !1314)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1366, file: !213, line: 2364, baseType: !602, size: 32, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1366, file: !213, line: 2367, baseType: !1378, size: 128, offset: 384)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1379)
!1379 = !{!1380, !1381}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1378, file: !213, line: 2351, baseType: !769, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1378, file: !213, line: 2352, baseType: !664, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1366, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1366, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1366, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1366, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1366, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1366, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !857, file: !858, line: 504, baseType: !1389, size: 64, offset: 704)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !858, line: 504, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !857, file: !858, line: 507, baseType: !1188, size: 64, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !857, file: !858, line: 510, baseType: !602, size: 32, offset: 832)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !857, file: !858, line: 513, baseType: !602, size: 32, offset: 864)
