; ModuleID = 'tree-tailcall.c'
source_filename = "tree-tailcall.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }

!805 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!806 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!807 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!808 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!809 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!810 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!811 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!812 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !610, line: 727, baseType: !7, size: 32, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!815 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!816 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!817 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!818 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!819 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!820 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!821 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!822 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!823 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!824 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!825 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!826 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!827 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!828 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!829 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!830 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!831 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!832 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!833 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!834 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!835 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!836 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!837 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!838 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !610, line: 80, baseType: !7, size: 32, elements: !840)
!840 = !{!841, !842, !843, !844}
!841 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!842 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!843 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!844 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gsi_iterator_update", file: !610, line: 4603, baseType: !7, size: 32, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIEnumerator(name: "GSI_NEW_STMT", value: 0, isUnsigned: true)
!848 = !DIEnumerator(name: "GSI_SAME_STMT", value: 1, isUnsigned: true)
!849 = !DIEnumerator(name: "GSI_CONTINUE_LINKING", value: 2, isUnsigned: true)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gf_mask", file: !610, line: 100, baseType: !7, size: 32, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!852 = !DIEnumerator(name: "GF_ASM_INPUT", value: 1, isUnsigned: true)
!853 = !DIEnumerator(name: "GF_ASM_VOLATILE", value: 2, isUnsigned: true)
!854 = !DIEnumerator(name: "GF_CALL_CANNOT_INLINE", value: 1, isUnsigned: true)
!855 = !DIEnumerator(name: "GF_CALL_FROM_THUNK", value: 2, isUnsigned: true)
!856 = !DIEnumerator(name: "GF_CALL_RETURN_SLOT_OPT", value: 4, isUnsigned: true)
!857 = !DIEnumerator(name: "GF_CALL_TAILCALL", value: 8, isUnsigned: true)
!858 = !DIEnumerator(name: "GF_CALL_VA_ARG_PACK", value: 16, isUnsigned: true)
!859 = !DIEnumerator(name: "GF_OMP_PARALLEL_COMBINED", value: 1, isUnsigned: true)
!860 = !DIEnumerator(name: "GF_OMP_RETURN_NOWAIT", value: 1, isUnsigned: true)
!861 = !DIEnumerator(name: "GF_OMP_SECTION_LAST", value: 1, isUnsigned: true)
!862 = !DIEnumerator(name: "GF_PREDICT_TAKEN", value: 32768, isUnsigned: true)
!863 = !{!864, !1148, !961, !415, !994, !2264, !1196, !2278, !1230, !1133, !839}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !865, line: 56, baseType: !866)
!865 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !383, line: 3371, size: 1792, elements: !868)
!868 = !{!869, !902, !908, !921, !940, !951, !956, !967, !973, !987, !999, !1037, !1499, !1527, !1544, !1545, !1550, !1559, !1565, !1570, !1574, !1578, !1915, !1962, !1968, !1974, !1981, !1994, !2008, !2025, !2037, !2059, !2074, !2246}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !867, file: !383, line: 3372, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !383, line: 360, size: 64, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !870, file: !383, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !870, file: !383, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !870, file: !383, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !870, file: !383, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !870, file: !383, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !870, file: !383, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !870, file: !383, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !870, file: !383, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !870, file: !383, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !870, file: !383, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !870, file: !383, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !870, file: !383, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !870, file: !383, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !870, file: !383, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !870, file: !383, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !870, file: !383, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !870, file: !383, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !870, file: !383, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !870, file: !383, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !870, file: !383, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !870, file: !383, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !870, file: !383, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !870, file: !383, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !870, file: !383, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !870, file: !383, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !870, file: !383, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !870, file: !383, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !870, file: !383, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !870, file: !383, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !870, file: !383, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !383, line: 3373, baseType: !903, size: 192)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !383, line: 402, size: 192, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !903, file: !383, line: 403, baseType: !870, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !903, file: !383, line: 404, baseType: !864, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !383, line: 405, baseType: !864, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !867, file: !383, line: 3374, baseType: !909, size: 320)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !383, line: 1384, size: 320, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !383, line: 1385, baseType: !903, size: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !909, file: !383, line: 1386, baseType: !913, size: 128, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !914, line: 58, baseType: !915)
!914 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !914, line: 54, size: 128, elements: !916)
!916 = !{!917, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !915, file: !914, line: 56, baseType: !918, size: 64)
!918 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !915, file: !914, line: 57, baseType: !920, size: 64, offset: 64)
!920 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !867, file: !383, line: 3375, baseType: !922, size: 256)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !383, line: 1397, size: 256, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !383, line: 1398, baseType: !903, size: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !922, file: !383, line: 1399, baseType: !926, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !928, line: 52, size: 256, elements: !929)
!928 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !927, file: !928, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !927, file: !928, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !927, file: !928, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !927, file: !928, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !927, file: !928, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !927, file: !928, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !927, file: !928, line: 62, baseType: !937, size: 192, offset: 64)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 192, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 3)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !867, file: !383, line: 3376, baseType: !941, size: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !383, line: 1408, size: 256, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !383, line: 1409, baseType: !903, size: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !941, file: !383, line: 1410, baseType: !945, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !947, line: 27, size: 192, elements: !948)
!947 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !947, line: 29, baseType: !913, size: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !946, file: !947, line: 30, baseType: !231, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !867, file: !383, line: 3377, baseType: !952, size: 256)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !383, line: 1437, size: 256, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !383, line: 1438, baseType: !903, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !952, file: !383, line: 1439, baseType: !864, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !867, file: !383, line: 3378, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !383, line: 1418, size: 256, elements: !958)
!958 = !{!959, !960, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !383, line: 1419, baseType: !903, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !957, file: !383, line: 1420, baseType: !961, size: 32, offset: 192)
!961 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !957, file: !383, line: 1421, baseType: !963, size: 8, offset: 224)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 8, elements: !965)
!964 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!965 = !{!966}
!966 = !DISubrange(count: 1)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !867, file: !383, line: 3379, baseType: !968, size: 320)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !383, line: 1428, size: 320, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !968, file: !383, line: 1429, baseType: !903, size: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !968, file: !383, line: 1430, baseType: !864, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !968, file: !383, line: 1431, baseType: !864, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !867, file: !383, line: 3380, baseType: !974, size: 320)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !383, line: 1460, size: 320, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !383, line: 1461, baseType: !903, size: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !974, file: !383, line: 1462, baseType: !978, size: 128, offset: 192)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !979, line: 31, size: 128, elements: !980)
!979 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!980 = !{!981, !985, !986}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !978, file: !979, line: 32, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !978, file: !979, line: 33, baseType: !7, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !978, file: !979, line: 34, baseType: !7, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !867, file: !383, line: 3381, baseType: !988, size: 384)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !383, line: 2507, size: 384, elements: !989)
!989 = !{!990, !991, !996, !997, !998}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !383, line: 2508, baseType: !903, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !988, file: !383, line: 2509, baseType: !992, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !993, line: 58, baseType: !994)
!993 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !995, line: 44, baseType: !7)
!995 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !988, file: !383, line: 2510, baseType: !7, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !383, line: 2511, baseType: !864, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !988, file: !383, line: 2512, baseType: !864, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !867, file: !383, line: 3382, baseType: !1000, size: 896)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !383, line: 2652, size: 896, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !383, line: 2653, baseType: !988, size: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !383, line: 2654, baseType: !864, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1000, file: !383, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1000, file: !383, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1000, file: !383, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1000, file: !383, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1000, file: !383, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1000, file: !383, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1000, file: !383, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1000, file: !383, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1000, file: !383, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1000, file: !383, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1000, file: !383, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1000, file: !383, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1000, file: !383, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1000, file: !383, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1000, file: !383, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1000, file: !383, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1000, file: !383, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1000, file: !383, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1000, file: !383, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1000, file: !383, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1000, file: !383, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1000, file: !383, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1000, file: !383, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1000, file: !383, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1000, file: !383, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1000, file: !383, line: 2703, baseType: !7, size: 32, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1000, file: !383, line: 2705, baseType: !864, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1000, file: !383, line: 2706, baseType: !864, size: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1000, file: !383, line: 2707, baseType: !864, size: 64, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1000, file: !383, line: 2708, baseType: !864, size: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1000, file: !383, line: 2711, baseType: !1035, size: 64, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !383, line: 2711, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !867, file: !383, line: 3383, baseType: !1038, size: 960)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !383, line: 2756, size: 960, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !383, line: 2757, baseType: !1000, size: 896)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1038, file: !383, line: 2758, baseType: !1042, size: 64, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !865, line: 50, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1045, line: 240, size: 384, elements: !1046)
!1045 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1044, file: !1045, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1044, file: !1045, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1044, file: !1045, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1044, file: !1045, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1044, file: !1045, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1044, file: !1045, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1044, file: !1045, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1044, file: !1045, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1044, file: !1045, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1044, file: !1045, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1044, file: !1045, line: 321, baseType: !1058, size: 320, offset: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1045, line: 315, size: 320, elements: !1059)
!1059 = !{!1060, !1466, !1468, !1497, !1498}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1058, file: !1045, line: 316, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 64, elements: !965)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1045, line: 183, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1045, line: 166, size: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1070, !1071, !1079, !1080, !1092, !1095, !1157, !1158, !1443, !1456, !1463}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1063, file: !1045, line: 168, baseType: !961, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1063, file: !1045, line: 169, baseType: !7, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1063, file: !1045, line: 170, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1063, file: !1045, line: 171, baseType: !1042, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1063, file: !1045, line: 172, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !865, line: 53, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1045, line: 359, size: 128, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1074, file: !1045, line: 360, baseType: !961, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1074, file: !1045, line: 361, baseType: !1078, size: 64, offset: 64)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 64, elements: !965)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1063, file: !1045, line: 173, baseType: !231, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1063, file: !1045, line: 174, baseType: !1081, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1045, line: 133, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1045, line: 115, size: 32, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1082, file: !1045, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1082, file: !1045, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1082, file: !1045, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1082, file: !1045, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1082, file: !1045, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1082, file: !1045, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1082, file: !1045, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1082, file: !1045, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1063, file: !1045, line: 175, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1045, line: 175, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1063, file: !1045, line: 176, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1098, line: 75, size: 256, elements: !1099)
!1098 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1099 = !{!1100, !1114, !1115, !1116}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1097, file: !1098, line: 76, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1098, line: 68, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1098, line: 63, size: 320, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !1098, line: 64, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1103, file: !1098, line: 65, baseType: !1106, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1103, file: !1098, line: 66, baseType: !7, size: 32, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1103, file: !1098, line: 67, baseType: !1110, size: 128, offset: 192)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 128, elements: !1112)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1098, line: 29, baseType: !918)
!1112 = !{!1113}
!1113 = !DISubrange(count: 2)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1097, file: !1098, line: 77, baseType: !1101, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1097, file: !1098, line: 78, baseType: !7, size: 32, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1097, file: !1098, line: 79, baseType: !1117, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1098, line: 49, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1098, line: 45, size: 832, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1119, file: !1098, line: 46, baseType: !1106, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1119, file: !1098, line: 47, baseType: !1096, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1119, file: !1098, line: 48, baseType: !1124, size: 704, offset: 128)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1125, line: 164, size: 704, elements: !1126)
!1125 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1126 = !{!1127, !1128, !1139, !1140, !1141, !1142, !1143, !1144, !1149, !1153, !1154, !1155, !1156}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1124, file: !1125, line: 166, baseType: !920, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1124, file: !1125, line: 167, baseType: !1129, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1125, line: 157, size: 192, elements: !1131)
!1131 = !{!1132, !1134, !1135}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1130, file: !1125, line: 159, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1130, file: !1125, line: 160, baseType: !1129, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1130, file: !1125, line: 161, baseType: !1136, size: 32, offset: 128)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 32, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 4)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1124, file: !1125, line: 168, baseType: !1133, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1124, file: !1125, line: 169, baseType: !1133, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1124, file: !1125, line: 170, baseType: !1133, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1124, file: !1125, line: 171, baseType: !920, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1124, file: !1125, line: 172, baseType: !961, size: 32, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1124, file: !1125, line: 176, baseType: !1145, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!1129, !1148, !920}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1124, file: !1125, line: 177, baseType: !1150, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1148, !1129}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1124, file: !1125, line: 178, baseType: !1148, size: 64, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1124, file: !1125, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1124, file: !1125, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1124, file: !1125, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1063, file: !1045, line: 177, baseType: !864, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1063, file: !1045, line: 178, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !367, line: 217, size: 832, elements: !1161)
!1161 = !{!1162, !1408, !1409, !1410, !1413, !1417, !1418, !1419, !1437, !1438, !1439, !1440, !1441, !1442}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1160, file: !367, line: 219, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !367, line: 151, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !367, line: 151, size: 128, elements: !1166)
!1166 = !{!1167}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1165, file: !367, line: 151, baseType: !1168, size: 128)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !367, line: 150, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !367, line: 150, size: 128, elements: !1170)
!1170 = !{!1171, !1172, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1169, file: !367, line: 150, baseType: !7, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1169, file: !367, line: 150, baseType: !7, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1169, file: !367, line: 150, baseType: !1174, size: 64, offset: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 64, elements: !965)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !865, line: 108, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !367, line: 122, size: 512, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1177, file: !367, line: 124, baseType: !1159, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1177, file: !367, line: 125, baseType: !1159, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1177, file: !367, line: 131, baseType: !1182, size: 64, offset: 128)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !367, line: 128, size: 64, elements: !1183)
!1183 = !{!1184, !1399}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1182, file: !367, line: 129, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !865, line: 66, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !610, line: 143, size: 192, elements: !1188)
!1188 = !{!1189, !1397, !1398}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1187, file: !610, line: 145, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !865, line: 69, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !610, line: 136, size: 192, elements: !1193)
!1193 = !{!1194, !1395, !1396}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1192, file: !610, line: 137, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !865, line: 58, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !610, line: 737, size: 768, elements: !1198)
!1198 = !{!1199, !1216, !1250, !1256, !1261, !1266, !1273, !1279, !1285, !1290, !1304, !1309, !1315, !1320, !1330, !1335, !1353, !1360, !1367, !1373, !1378, !1384, !1390}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1197, file: !610, line: 738, baseType: !1200, size: 256)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !610, line: 271, size: 256, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1200, file: !610, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1200, file: !610, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1200, file: !610, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1200, file: !610, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1200, file: !610, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1200, file: !610, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1200, file: !610, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1200, file: !610, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1200, file: !610, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1200, file: !610, line: 312, baseType: !7, size: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1200, file: !610, line: 316, baseType: !992, size: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1200, file: !610, line: 319, baseType: !7, size: 32, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1200, file: !610, line: 323, baseType: !1159, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1200, file: !610, line: 327, baseType: !864, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1197, file: !610, line: 739, baseType: !1217, size: 448)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !610, line: 350, size: 448, elements: !1218)
!1218 = !{!1219, !1248}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1217, file: !610, line: 353, baseType: !1220, size: 384)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !610, line: 333, size: 384, elements: !1221)
!1221 = !{!1222, !1223, !1231}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1220, file: !610, line: 336, baseType: !1200, size: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1220, file: !610, line: 343, baseType: !1224, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1226, line: 37, size: 128, elements: !1227)
!1226 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1227 = !{!1228, !1229}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1225, file: !1226, line: 39, baseType: !1224, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1225, file: !1226, line: 40, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1220, file: !610, line: 344, baseType: !1232, size: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1226, line: 45, size: 320, elements: !1234)
!1234 = !{!1235, !1236}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1233, file: !1226, line: 47, baseType: !1232, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1233, file: !1226, line: 48, baseType: !1237, size: 256, offset: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !383, line: 1883, size: 256, elements: !1238)
!1238 = !{!1239, !1241, !1242, !1247}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1237, file: !383, line: 1884, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1237, file: !383, line: 1885, baseType: !1240, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1237, file: !383, line: 1891, baseType: !1243, size: 64, offset: 128)
!1243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1237, file: !383, line: 1891, size: 64, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1243, file: !383, line: 1891, baseType: !1195, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1243, file: !383, line: 1891, baseType: !864, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1237, file: !383, line: 1892, baseType: !1230, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1217, file: !610, line: 359, baseType: !1249, size: 64, offset: 384)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 64, elements: !965)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1197, file: !610, line: 740, baseType: !1251, size: 512)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !610, line: 365, size: 512, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1251, file: !610, line: 368, baseType: !1220, size: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1251, file: !610, line: 373, baseType: !864, size: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1251, file: !610, line: 374, baseType: !864, size: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1197, file: !610, line: 741, baseType: !1257, size: 576)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !610, line: 380, size: 576, elements: !1258)
!1258 = !{!1259, !1260}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1257, file: !610, line: 383, baseType: !1251, size: 512)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1257, file: !610, line: 389, baseType: !1249, size: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1197, file: !610, line: 742, baseType: !1262, size: 320)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !610, line: 395, size: 320, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1262, file: !610, line: 397, baseType: !1200, size: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1262, file: !610, line: 400, baseType: !1185, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1197, file: !610, line: 743, baseType: !1267, size: 448)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !610, line: 406, size: 448, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1267, file: !610, line: 408, baseType: !1200, size: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1267, file: !610, line: 412, baseType: !864, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1267, file: !610, line: 420, baseType: !864, size: 64, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1267, file: !610, line: 423, baseType: !1185, size: 64, offset: 384)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1197, file: !610, line: 744, baseType: !1274, size: 384)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !610, line: 429, size: 384, elements: !1275)
!1275 = !{!1276, !1277, !1278}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1274, file: !610, line: 431, baseType: !1200, size: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1274, file: !610, line: 434, baseType: !864, size: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1274, file: !610, line: 437, baseType: !1185, size: 64, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1197, file: !610, line: 745, baseType: !1280, size: 384)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !610, line: 443, size: 384, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1280, file: !610, line: 445, baseType: !1200, size: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1280, file: !610, line: 449, baseType: !864, size: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1280, file: !610, line: 453, baseType: !1185, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1197, file: !610, line: 746, baseType: !1286, size: 320)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !610, line: 459, size: 320, elements: !1287)
!1287 = !{!1288, !1289}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1286, file: !610, line: 461, baseType: !1200, size: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1286, file: !610, line: 464, baseType: !864, size: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1197, file: !610, line: 747, baseType: !1291, size: 768)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !610, line: 469, size: 768, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1291, file: !610, line: 471, baseType: !1200, size: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1291, file: !610, line: 474, baseType: !7, size: 32, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1291, file: !610, line: 475, baseType: !7, size: 32, offset: 288)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1291, file: !610, line: 478, baseType: !864, size: 64, offset: 320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1291, file: !610, line: 481, baseType: !1298, size: 384, offset: 384)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1299, size: 384, elements: !965)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !383, line: 1917, size: 384, elements: !1300)
!1300 = !{!1301, !1302, !1303}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1299, file: !383, line: 1920, baseType: !1237, size: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1299, file: !383, line: 1921, baseType: !864, size: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1299, file: !383, line: 1922, baseType: !992, size: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1197, file: !610, line: 748, baseType: !1305, size: 320)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !610, line: 487, size: 320, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1305, file: !610, line: 490, baseType: !1200, size: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1305, file: !610, line: 494, baseType: !961, size: 32, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1197, file: !610, line: 749, baseType: !1310, size: 384)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !610, line: 500, size: 384, elements: !1311)
!1311 = !{!1312, !1313, !1314}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1310, file: !610, line: 502, baseType: !1200, size: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1310, file: !610, line: 506, baseType: !1185, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1310, file: !610, line: 510, baseType: !1185, size: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1197, file: !610, line: 750, baseType: !1316, size: 320)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !610, line: 529, size: 320, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1316, file: !610, line: 531, baseType: !1200, size: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1316, file: !610, line: 540, baseType: !1185, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1197, file: !610, line: 751, baseType: !1321, size: 704)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !610, line: 546, size: 704, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1329}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1321, file: !610, line: 549, baseType: !1251, size: 512)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1321, file: !610, line: 553, baseType: !1068, size: 64, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1321, file: !610, line: 557, baseType: !984, size: 8, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1321, file: !610, line: 558, baseType: !984, size: 8, offset: 584)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1321, file: !610, line: 559, baseType: !984, size: 8, offset: 592)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1321, file: !610, line: 560, baseType: !984, size: 8, offset: 600)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1321, file: !610, line: 566, baseType: !1249, size: 64, offset: 640)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1197, file: !610, line: 752, baseType: !1331, size: 384)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !610, line: 571, size: 384, elements: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1331, file: !610, line: 573, baseType: !1262, size: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1331, file: !610, line: 577, baseType: !864, size: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1197, file: !610, line: 753, baseType: !1336, size: 576)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !610, line: 600, size: 576, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1343, !1352}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1336, file: !610, line: 602, baseType: !1262, size: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1336, file: !610, line: 605, baseType: !864, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1336, file: !610, line: 609, baseType: !1341, size: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1342, line: 46, baseType: !918)
!1342 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1336, file: !610, line: 612, baseType: !1344, size: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !610, line: 581, size: 320, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1345, file: !610, line: 583, baseType: !415, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1345, file: !610, line: 586, baseType: !864, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1345, file: !610, line: 589, baseType: !864, size: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1345, file: !610, line: 592, baseType: !864, size: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1345, file: !610, line: 595, baseType: !864, size: 64, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1336, file: !610, line: 616, baseType: !1185, size: 64, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1197, file: !610, line: 754, baseType: !1354, size: 512)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !610, line: 622, size: 512, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1354, file: !610, line: 624, baseType: !1262, size: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1354, file: !610, line: 628, baseType: !864, size: 64, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1354, file: !610, line: 632, baseType: !864, size: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1354, file: !610, line: 636, baseType: !864, size: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1197, file: !610, line: 755, baseType: !1361, size: 704)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !610, line: 642, size: 704, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1361, file: !610, line: 644, baseType: !1354, size: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1361, file: !610, line: 648, baseType: !864, size: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1361, file: !610, line: 652, baseType: !864, size: 64, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1361, file: !610, line: 653, baseType: !864, size: 64, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1197, file: !610, line: 756, baseType: !1368, size: 448)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !610, line: 663, size: 448, elements: !1369)
!1369 = !{!1370, !1371, !1372}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1368, file: !610, line: 665, baseType: !1262, size: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1368, file: !610, line: 668, baseType: !864, size: 64, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1368, file: !610, line: 673, baseType: !864, size: 64, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1197, file: !610, line: 757, baseType: !1374, size: 384)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !610, line: 694, size: 384, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1374, file: !610, line: 696, baseType: !1262, size: 320)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1374, file: !610, line: 699, baseType: !864, size: 64, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1197, file: !610, line: 758, baseType: !1379, size: 384)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !610, line: 681, size: 384, elements: !1380)
!1380 = !{!1381, !1382, !1383}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1379, file: !610, line: 683, baseType: !1200, size: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1379, file: !610, line: 686, baseType: !864, size: 64, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1379, file: !610, line: 689, baseType: !864, size: 64, offset: 320)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1197, file: !610, line: 759, baseType: !1385, size: 384)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !610, line: 707, size: 384, elements: !1386)
!1386 = !{!1387, !1388, !1389}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1385, file: !610, line: 709, baseType: !1200, size: 256)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1385, file: !610, line: 712, baseType: !864, size: 64, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1385, file: !610, line: 712, baseType: !864, size: 64, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1197, file: !610, line: 760, baseType: !1391, size: 320)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !610, line: 718, size: 320, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1391, file: !610, line: 720, baseType: !1200, size: 256)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1391, file: !610, line: 723, baseType: !864, size: 64, offset: 256)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1192, file: !610, line: 138, baseType: !1191, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1192, file: !610, line: 139, baseType: !1191, size: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1187, file: !610, line: 146, baseType: !1190, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1187, file: !610, line: 152, baseType: !1185, size: 64, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1182, file: !367, line: 130, baseType: !1042, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1177, file: !367, line: 134, baseType: !1148, size: 64, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1177, file: !367, line: 137, baseType: !864, size: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1177, file: !367, line: 138, baseType: !992, size: 32, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1177, file: !367, line: 142, baseType: !7, size: 32, offset: 352)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !367, line: 144, baseType: !961, size: 32, offset: 384)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1177, file: !367, line: 145, baseType: !961, size: 32, offset: 416)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1177, file: !367, line: 146, baseType: !1407, size: 64, offset: 448)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !367, line: 119, baseType: !920)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1160, file: !367, line: 220, baseType: !1163, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1160, file: !367, line: 223, baseType: !1148, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1160, file: !367, line: 226, baseType: !1411, size: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !367, line: 185, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1160, file: !367, line: 229, baseType: !1414, size: 128, offset: 256)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 128, elements: !1112)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !367, line: 229, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1160, file: !367, line: 232, baseType: !1159, size: 64, offset: 384)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1160, file: !367, line: 233, baseType: !1159, size: 64, offset: 448)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1160, file: !367, line: 238, baseType: !1420, size: 64, offset: 512)
!1420 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !367, line: 235, size: 64, elements: !1421)
!1421 = !{!1422, !1428}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1420, file: !367, line: 236, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !367, line: 273, size: 128, elements: !1425)
!1425 = !{!1426, !1427}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1424, file: !367, line: 275, baseType: !1185, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1424, file: !367, line: 278, baseType: !1185, size: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1420, file: !367, line: 237, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !367, line: 259, size: 320, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435, !1436}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1430, file: !367, line: 261, baseType: !1042, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1430, file: !367, line: 262, baseType: !1042, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1430, file: !367, line: 266, baseType: !1042, size: 64, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1430, file: !367, line: 267, baseType: !1042, size: 64, offset: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1430, file: !367, line: 270, baseType: !961, size: 32, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1160, file: !367, line: 241, baseType: !1407, size: 64, offset: 576)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1160, file: !367, line: 244, baseType: !961, size: 32, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1160, file: !367, line: 247, baseType: !961, size: 32, offset: 672)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1160, file: !367, line: 250, baseType: !961, size: 32, offset: 704)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1160, file: !367, line: 253, baseType: !961, size: 32, offset: 736)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !367, line: 256, baseType: !961, size: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1063, file: !1045, line: 179, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1045, line: 150, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1045, line: 142, size: 320, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1454, !1455}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1446, file: !1045, line: 144, baseType: !864, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1446, file: !1045, line: 145, baseType: !1042, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1446, file: !1045, line: 146, baseType: !1042, size: 64, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1446, file: !1045, line: 147, baseType: !1452, size: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1453, line: 31, baseType: !961)
!1453 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1446, file: !1045, line: 148, baseType: !7, size: 32, offset: 224)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1446, file: !1045, line: 149, baseType: !984, size: 8, offset: 256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1063, file: !1045, line: 180, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1045, line: 162, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1045, line: 159, size: 128, elements: !1460)
!1460 = !{!1461, !1462}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1459, file: !1045, line: 160, baseType: !864, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1459, file: !1045, line: 161, baseType: !920, size: 64, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1063, file: !1045, line: 181, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1045, line: 181, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1058, file: !1045, line: 317, baseType: !1467, size: 64)
!1467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 64, elements: !965)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1058, file: !1045, line: 318, baseType: !1469, size: 320)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1045, line: 188, size: 320, elements: !1470)
!1470 = !{!1471, !1473, !1496}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1469, file: !1045, line: 190, baseType: !1472, size: 192)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 192, elements: !938)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1469, file: !1045, line: 193, baseType: !1474, size: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1045, line: 206, size: 320, elements: !1476)
!1476 = !{!1477, !1481, !1482, !1483, !1495}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1475, file: !1045, line: 208, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !865, line: 62, baseType: !1480)
!1480 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !865, line: 61, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1475, file: !1045, line: 211, baseType: !7, size: 32, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1475, file: !1045, line: 214, baseType: !920, size: 64, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1475, file: !1045, line: 224, baseType: !1484, size: 64, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1045, line: 202, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1045, line: 202, size: 128, elements: !1487)
!1487 = !{!1488}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1486, file: !1045, line: 202, baseType: !1489, size: 128)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1045, line: 200, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1045, line: 200, size: 128, elements: !1491)
!1491 = !{!1492, !1493, !1494}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1490, file: !1045, line: 200, baseType: !7, size: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1490, file: !1045, line: 200, baseType: !7, size: 32, offset: 32)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1490, file: !1045, line: 200, baseType: !1078, size: 64, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1475, file: !1045, line: 234, baseType: !1484, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1469, file: !1045, line: 197, baseType: !920, size: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1058, file: !1045, line: 319, baseType: !927, size: 256)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1058, file: !1045, line: 320, baseType: !946, size: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !867, file: !383, line: 3384, baseType: !1500, size: 1472)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !383, line: 3114, size: 1472, elements: !1501)
!1501 = !{!1502, !1523, !1524, !1525, !1526}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1500, file: !383, line: 3115, baseType: !1503, size: 1216)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !383, line: 2984, size: 1216, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1503, file: !383, line: 2985, baseType: !1038, size: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1503, file: !383, line: 2986, baseType: !864, size: 64, offset: 960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1503, file: !383, line: 2987, baseType: !864, size: 64, offset: 1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1503, file: !383, line: 2988, baseType: !864, size: 64, offset: 1088)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1503, file: !383, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1503, file: !383, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1503, file: !383, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1503, file: !383, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1503, file: !383, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1503, file: !383, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1503, file: !383, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1503, file: !383, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1503, file: !383, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1503, file: !383, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1503, file: !383, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1503, file: !383, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1503, file: !383, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1503, file: !383, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1500, file: !383, line: 3117, baseType: !864, size: 64, offset: 1216)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1500, file: !383, line: 3119, baseType: !864, size: 64, offset: 1280)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1500, file: !383, line: 3121, baseType: !864, size: 64, offset: 1344)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1500, file: !383, line: 3123, baseType: !864, size: 64, offset: 1408)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !867, file: !383, line: 3385, baseType: !1528, size: 1088)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !383, line: 2874, size: 1088, elements: !1529)
!1529 = !{!1530, !1531, !1532}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1528, file: !383, line: 2875, baseType: !1038, size: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1528, file: !383, line: 2876, baseType: !1042, size: 64, offset: 960)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1528, file: !383, line: 2877, baseType: !1533, size: 64, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1535, line: 172, size: 128, elements: !1536)
!1535 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1536 = !{!1537, !1538, !1539, !1540, !1541, !1542, !1543}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1534, file: !1535, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1534, file: !1535, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1534, file: !1535, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1534, file: !1535, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1534, file: !1535, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1534, file: !1535, line: 195, baseType: !7, size: 32, offset: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1534, file: !1535, line: 199, baseType: !864, size: 64, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !867, file: !383, line: 3386, baseType: !1503, size: 1216)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !867, file: !383, line: 3387, baseType: !1546, size: 1280)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !383, line: 3093, size: 1280, elements: !1547)
!1547 = !{!1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1546, file: !383, line: 3094, baseType: !1503, size: 1216)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1546, file: !383, line: 3095, baseType: !1533, size: 64, offset: 1216)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !867, file: !383, line: 3388, baseType: !1551, size: 1216)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !383, line: 2824, size: 1216, elements: !1552)
!1552 = !{!1553, !1554, !1555, !1556, !1557, !1558}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1551, file: !383, line: 2825, baseType: !1000, size: 896)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1551, file: !383, line: 2827, baseType: !864, size: 64, offset: 896)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1551, file: !383, line: 2828, baseType: !864, size: 64, offset: 960)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1551, file: !383, line: 2829, baseType: !864, size: 64, offset: 1024)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1551, file: !383, line: 2830, baseType: !864, size: 64, offset: 1088)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1551, file: !383, line: 2831, baseType: !864, size: 64, offset: 1152)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !867, file: !383, line: 3389, baseType: !1560, size: 1024)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !383, line: 2850, size: 1024, elements: !1561)
!1561 = !{!1562, !1563, !1564}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1560, file: !383, line: 2851, baseType: !1038, size: 960)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1560, file: !383, line: 2852, baseType: !961, size: 32, offset: 960)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1560, file: !383, line: 2853, baseType: !961, size: 32, offset: 992)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !867, file: !383, line: 3390, baseType: !1566, size: 1024)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !383, line: 2857, size: 1024, elements: !1567)
!1567 = !{!1568, !1569}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1566, file: !383, line: 2858, baseType: !1038, size: 960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1566, file: !383, line: 2859, baseType: !1533, size: 64, offset: 960)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !867, file: !383, line: 3391, baseType: !1571, size: 960)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !383, line: 2862, size: 960, elements: !1572)
!1572 = !{!1573}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1571, file: !383, line: 2863, baseType: !1038, size: 960)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !867, file: !383, line: 3392, baseType: !1575, size: 1472)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !383, line: 3304, size: 1472, elements: !1576)
!1576 = !{!1577}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1575, file: !383, line: 3305, baseType: !1500, size: 1472)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !867, file: !383, line: 3393, baseType: !1579, size: 1792)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !383, line: 3248, size: 1792, elements: !1580)
!1580 = !{!1581, !1582, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1579, file: !383, line: 3249, baseType: !1500, size: 1472)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1579, file: !383, line: 3251, baseType: !1583, size: 64, offset: 1472)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1585, line: 463, size: 1152, elements: !1586)
!1585 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1586 = !{!1587, !1748, !1779, !1780, !1835, !1838, !1839, !1840, !1841, !1842, !1843, !1867, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1584, file: !1585, line: 464, baseType: !1588, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !360, line: 194, size: 384, elements: !1590)
!1590 = !{!1591, !1640, !1653, !1667, !1717, !1729}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1589, file: !360, line: 197, baseType: !1592, size: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !360, line: 182, baseType: !1593)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !360, line: 116, size: 704, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600, !1601, !1628, !1637, !1638, !1639}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1594, file: !360, line: 119, baseType: !1593, size: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1594, file: !360, line: 122, baseType: !1593, size: 64, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1594, file: !360, line: 123, baseType: !1593, size: 64, offset: 128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1594, file: !360, line: 126, baseType: !961, size: 32, offset: 192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1594, file: !360, line: 129, baseType: !359, size: 32, offset: 224)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1594, file: !360, line: 165, baseType: !1602, size: 192, offset: 256)
!1602 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !360, line: 132, size: 192, elements: !1603)
!1603 = !{!1604, !1617, !1623}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1602, file: !360, line: 137, baseType: !1605, size: 128)
!1605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !360, line: 133, size: 128, elements: !1606)
!1606 = !{!1607, !1616}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1605, file: !360, line: 135, baseType: !1608, size: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !360, line: 93, size: 320, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1609, file: !360, line: 96, baseType: !1608, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1609, file: !360, line: 97, baseType: !1608, size: 64, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1609, file: !360, line: 101, baseType: !864, size: 64, offset: 128)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1609, file: !360, line: 106, baseType: !864, size: 64, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1609, file: !360, line: 111, baseType: !864, size: 64, offset: 256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1605, file: !360, line: 136, baseType: !1608, size: 64, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1602, file: !360, line: 151, baseType: !1618, size: 192)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !360, line: 139, size: 192, elements: !1619)
!1619 = !{!1620, !1621, !1622}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1618, file: !360, line: 141, baseType: !864, size: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1618, file: !360, line: 145, baseType: !864, size: 64, offset: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1618, file: !360, line: 150, baseType: !961, size: 32, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1602, file: !360, line: 164, baseType: !1624, size: 128)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !360, line: 153, size: 128, elements: !1625)
!1625 = !{!1626, !1627}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1624, file: !360, line: 161, baseType: !864, size: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1624, file: !360, line: 163, baseType: !992, size: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1594, file: !360, line: 168, baseType: !1629, size: 64, offset: 448)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !360, line: 67, size: 320, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1636}
