; ModuleID = 'ipa-pure-const.c'
source_filename = "ipa-pure-const.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }

!717 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!718 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!719 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!720 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!721 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!722 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!723 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!724 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!725 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!726 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!727 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!728 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!729 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!730 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!731 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gf_mask", file: !649, line: 100, baseType: !7, size: 32, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!734 = !DIEnumerator(name: "GF_ASM_INPUT", value: 1, isUnsigned: true)
!735 = !DIEnumerator(name: "GF_ASM_VOLATILE", value: 2, isUnsigned: true)
!736 = !DIEnumerator(name: "GF_CALL_CANNOT_INLINE", value: 1, isUnsigned: true)
!737 = !DIEnumerator(name: "GF_CALL_FROM_THUNK", value: 2, isUnsigned: true)
!738 = !DIEnumerator(name: "GF_CALL_RETURN_SLOT_OPT", value: 4, isUnsigned: true)
!739 = !DIEnumerator(name: "GF_CALL_TAILCALL", value: 8, isUnsigned: true)
!740 = !DIEnumerator(name: "GF_CALL_VA_ARG_PACK", value: 16, isUnsigned: true)
!741 = !DIEnumerator(name: "GF_OMP_PARALLEL_COMBINED", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "GF_OMP_RETURN_NOWAIT", value: 1, isUnsigned: true)
!743 = !DIEnumerator(name: "GF_OMP_SECTION_LAST", value: 1, isUnsigned: true)
!744 = !DIEnumerator(name: "GF_PREDICT_TAKEN", value: 32768, isUnsigned: true)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "li_flags", file: !513, line: 498, baseType: !7, size: 32, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIEnumerator(name: "LI_INCLUDE_ROOT", value: 1, isUnsigned: true)
!748 = !DIEnumerator(name: "LI_FROM_INNERMOST", value: 2, isUnsigned: true)
!749 = !DIEnumerator(name: "LI_ONLY_INNERMOST", value: 4, isUnsigned: true)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !751, line: 256, baseType: !7, size: 32, elements: !752)
!751 = !DIFile(filename: "./lto-streamer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!753 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!754 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!755 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!756 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!757 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!758 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!759 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!760 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!761 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!762 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!763 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!764 = !{!765, !766, !2419, !1054, !7, !2429, !2437, !317, !2449, !974, !771, !1102, !2450, !1136, !1039, !2452, !1344, !612}
!765 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !574, line: 181, size: 2496, elements: !769)
!769 = !{!770, !2162, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2302, !2356, !2366, !2370, !2396, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !768, file: !574, line: 182, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !772, line: 56, baseType: !773)
!772 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !775)
!775 = !{!776, !809, !815, !828, !847, !858, !863, !873, !879, !893, !905, !943, !1492, !1520, !1537, !1538, !1543, !1552, !1558, !1563, !1567, !1571, !1813, !1860, !1866, !1872, !1879, !1892, !1906, !1923, !1935, !1957, !1972, !2144}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !774, file: !318, line: 3372, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !777, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !777, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !777, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !777, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !777, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !777, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !777, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !777, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !777, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !777, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !777, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !777, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !777, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !777, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !777, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !777, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !777, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !777, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !777, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !777, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !777, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !777, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !777, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !777, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !777, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !777, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !777, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !777, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !777, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !777, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !318, line: 3373, baseType: !810, size: 192)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !810, file: !318, line: 403, baseType: !777, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !810, file: !318, line: 404, baseType: !771, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !318, line: 405, baseType: !771, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !774, file: !318, line: 3374, baseType: !816, size: 320)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !318, line: 1385, baseType: !810, size: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !816, file: !318, line: 1386, baseType: !820, size: 128, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !821, line: 58, baseType: !822)
!821 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !821, line: 54, size: 128, elements: !823)
!823 = !{!824, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !822, file: !821, line: 56, baseType: !825, size: 64)
!825 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !822, file: !821, line: 57, baseType: !827, size: 64, offset: 64)
!827 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !774, file: !318, line: 3375, baseType: !829, size: 256)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !829, file: !318, line: 1398, baseType: !810, size: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !829, file: !318, line: 1399, baseType: !833, size: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !835, line: 52, size: 256, elements: !836)
!835 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!836 = !{!837, !838, !839, !840, !841, !842, !843}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !834, file: !835, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !834, file: !835, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !834, file: !835, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !834, file: !835, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !834, file: !835, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !834, file: !835, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !834, file: !835, line: 62, baseType: !844, size: 192, offset: 64)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 192, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 3)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !774, file: !318, line: 3376, baseType: !848, size: 256)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !848, file: !318, line: 1409, baseType: !810, size: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !848, file: !318, line: 1410, baseType: !852, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !854, line: 27, size: 192, elements: !855)
!854 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !853, file: !854, line: 29, baseType: !820, size: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !853, file: !854, line: 30, baseType: !189, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !774, file: !318, line: 3377, baseType: !859, size: 256)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !318, line: 1438, baseType: !810, size: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !859, file: !318, line: 1439, baseType: !771, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !774, file: !318, line: 3378, baseType: !864, size: 256)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !864, file: !318, line: 1419, baseType: !810, size: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !864, file: !318, line: 1420, baseType: !765, size: 32, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !864, file: !318, line: 1421, baseType: !869, size: 8, offset: 224)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 8, elements: !871)
!870 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!871 = !{!872}
!872 = !DISubrange(count: 1)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !774, file: !318, line: 3379, baseType: !874, size: 320)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !318, line: 1429, baseType: !810, size: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !874, file: !318, line: 1430, baseType: !771, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !874, file: !318, line: 1431, baseType: !771, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !774, file: !318, line: 3380, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !318, line: 1461, baseType: !810, size: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !880, file: !318, line: 1462, baseType: !884, size: 128, offset: 192)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !885, line: 31, size: 128, elements: !886)
!885 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!886 = !{!887, !891, !892}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !884, file: !885, line: 32, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !884, file: !885, line: 33, baseType: !7, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !884, file: !885, line: 34, baseType: !7, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !774, file: !318, line: 3381, baseType: !894, size: 384)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !895)
!895 = !{!896, !897, !902, !903, !904}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !894, file: !318, line: 2508, baseType: !810, size: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !894, file: !318, line: 2509, baseType: !898, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !899, line: 58, baseType: !900)
!899 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !901, line: 44, baseType: !7)
!901 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!902 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !894, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !894, file: !318, line: 2511, baseType: !771, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !894, file: !318, line: 2512, baseType: !771, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !774, file: !318, line: 3382, baseType: !906, size: 896)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !906, file: !318, line: 2653, baseType: !894, size: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !906, file: !318, line: 2654, baseType: !771, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !906, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !906, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !906, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !906, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !906, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !906, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !906, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !906, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !906, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !906, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !906, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !906, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !906, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !906, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !906, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !906, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !906, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !906, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !906, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !906, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !906, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !906, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !906, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !906, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !906, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !906, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !906, file: !318, line: 2705, baseType: !771, size: 64, offset: 576)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !906, file: !318, line: 2706, baseType: !771, size: 64, offset: 640)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !906, file: !318, line: 2707, baseType: !771, size: 64, offset: 704)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !906, file: !318, line: 2708, baseType: !771, size: 64, offset: 768)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !906, file: !318, line: 2711, baseType: !941, size: 64, offset: 832)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !774, file: !318, line: 3383, baseType: !944, size: 960)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !318, line: 2757, baseType: !906, size: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !944, file: !318, line: 2758, baseType: !948, size: 64, offset: 896)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !772, line: 50, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !951, line: 240, size: 384, elements: !952)
!951 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!952 = !{!953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !950, file: !951, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !950, file: !951, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !950, file: !951, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !950, file: !951, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !950, file: !951, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !950, file: !951, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !950, file: !951, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !950, file: !951, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !950, file: !951, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !950, file: !951, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !950, file: !951, line: 321, baseType: !964, size: 320, offset: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !951, line: 315, size: 320, elements: !965)
!965 = !{!966, !1425, !1427, !1490, !1491}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !964, file: !951, line: 316, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 64, elements: !871)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !951, line: 183, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !951, line: 166, size: 64, elements: !970)
!970 = !{!971, !972, !973, !976, !977, !985, !986, !998, !1001, !1063, !1064, !1402, !1415, !1422}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !969, file: !951, line: 168, baseType: !765, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !969, file: !951, line: 169, baseType: !7, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !969, file: !951, line: 170, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !969, file: !951, line: 171, baseType: !948, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !969, file: !951, line: 172, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !772, line: 53, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !951, line: 359, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !980, file: !951, line: 360, baseType: !765, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !980, file: !951, line: 361, baseType: !984, size: 64, offset: 64)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 64, elements: !871)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !969, file: !951, line: 173, baseType: !189, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !969, file: !951, line: 174, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !951, line: 133, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !951, line: 115, size: 32, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !988, file: !951, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !988, file: !951, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !988, file: !951, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !988, file: !951, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !988, file: !951, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !988, file: !951, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !988, file: !951, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !988, file: !951, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !969, file: !951, line: 175, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !951, line: 175, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !969, file: !951, line: 176, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1004, line: 75, size: 256, elements: !1005)
!1004 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1005 = !{!1006, !1020, !1021, !1022}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1003, file: !1004, line: 76, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1004, line: 68, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1004, line: 63, size: 320, elements: !1010)
!1010 = !{!1011, !1013, !1014, !1015}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !1004, line: 64, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1009, file: !1004, line: 65, baseType: !1012, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1009, file: !1004, line: 66, baseType: !7, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1009, file: !1004, line: 67, baseType: !1016, size: 128, offset: 192)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 128, elements: !1018)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1004, line: 29, baseType: !825)
!1018 = !{!1019}
!1019 = !DISubrange(count: 2)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1003, file: !1004, line: 77, baseType: !1007, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1003, file: !1004, line: 78, baseType: !7, size: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1003, file: !1004, line: 79, baseType: !1023, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1004, line: 49, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1004, line: 45, size: 832, elements: !1026)
!1026 = !{!1027, !1028, !1029}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1025, file: !1004, line: 46, baseType: !1012, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1025, file: !1004, line: 47, baseType: !1002, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1025, file: !1004, line: 48, baseType: !1030, size: 704, offset: 128)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1031, line: 164, size: 704, elements: !1032)
!1031 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = !{!1033, !1034, !1045, !1046, !1047, !1048, !1049, !1050, !1055, !1059, !1060, !1061, !1062}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1030, file: !1031, line: 166, baseType: !827, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1030, file: !1031, line: 167, baseType: !1035, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1031, line: 157, size: 192, elements: !1037)
!1037 = !{!1038, !1040, !1041}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1036, file: !1031, line: 159, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1036, file: !1031, line: 160, baseType: !1035, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1036, file: !1031, line: 161, baseType: !1042, size: 32, offset: 128)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 32, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 4)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1030, file: !1031, line: 168, baseType: !1039, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1030, file: !1031, line: 169, baseType: !1039, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1030, file: !1031, line: 170, baseType: !1039, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1030, file: !1031, line: 171, baseType: !827, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1030, file: !1031, line: 172, baseType: !765, size: 32, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1030, file: !1031, line: 176, baseType: !1051, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1035, !1054, !827}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1030, file: !1031, line: 177, baseType: !1056, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1054, !1035}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1030, file: !1031, line: 178, baseType: !1054, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1030, file: !1031, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1030, file: !1031, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1030, file: !1031, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !969, file: !951, line: 177, baseType: !771, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !969, file: !951, line: 178, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !526, line: 217, size: 832, elements: !1067)
!1067 = !{!1068, !1314, !1315, !1316, !1372, !1376, !1377, !1378, !1396, !1397, !1398, !1399, !1400, !1401}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1066, file: !526, line: 219, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !526, line: 151, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !526, line: 151, size: 128, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1071, file: !526, line: 151, baseType: !1074, size: 128)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !526, line: 150, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !526, line: 150, size: 128, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1075, file: !526, line: 150, baseType: !7, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1075, file: !526, line: 150, baseType: !7, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1075, file: !526, line: 150, baseType: !1080, size: 64, offset: 64)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 64, elements: !871)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !772, line: 108, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !526, line: 122, size: 512, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1306, !1307, !1308, !1309, !1310, !1311, !1312}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1083, file: !526, line: 124, baseType: !1065, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1083, file: !526, line: 125, baseType: !1065, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1083, file: !526, line: 131, baseType: !1088, size: 64, offset: 128)
!1088 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !526, line: 128, size: 64, elements: !1089)
!1089 = !{!1090, !1305}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1088, file: !526, line: 129, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !772, line: 66, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !649, line: 143, size: 192, elements: !1094)
!1094 = !{!1095, !1303, !1304}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1093, file: !649, line: 145, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !772, line: 69, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !649, line: 136, size: 192, elements: !1099)
!1099 = !{!1100, !1301, !1302}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1098, file: !649, line: 137, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !772, line: 58, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !649, line: 737, size: 768, elements: !1104)
!1104 = !{!1105, !1122, !1156, !1162, !1167, !1172, !1179, !1185, !1191, !1196, !1210, !1215, !1221, !1226, !1236, !1241, !1259, !1266, !1273, !1279, !1284, !1290, !1296}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1103, file: !649, line: 738, baseType: !1106, size: 256)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !649, line: 271, size: 256, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1106, file: !649, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1106, file: !649, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1106, file: !649, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1106, file: !649, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1106, file: !649, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1106, file: !649, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1106, file: !649, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1106, file: !649, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1106, file: !649, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1106, file: !649, line: 312, baseType: !7, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1106, file: !649, line: 316, baseType: !898, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1106, file: !649, line: 319, baseType: !7, size: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1106, file: !649, line: 323, baseType: !1065, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1106, file: !649, line: 327, baseType: !771, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1103, file: !649, line: 739, baseType: !1123, size: 448)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !649, line: 350, size: 448, elements: !1124)
!1124 = !{!1125, !1154}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1123, file: !649, line: 353, baseType: !1126, size: 384)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !649, line: 333, size: 384, elements: !1127)
!1127 = !{!1128, !1129, !1137}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1126, file: !649, line: 336, baseType: !1106, size: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1126, file: !649, line: 343, baseType: !1130, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1132, line: 37, size: 128, elements: !1133)
!1132 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !1132, line: 39, baseType: !1130, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1131, file: !1132, line: 40, baseType: !1136, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1126, file: !649, line: 344, baseType: !1138, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1132, line: 45, size: 320, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1139, file: !1132, line: 47, baseType: !1138, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1139, file: !1132, line: 48, baseType: !1143, size: 256, offset: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1144)
!1144 = !{!1145, !1147, !1148, !1153}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1143, file: !318, line: 1884, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1143, file: !318, line: 1885, baseType: !1146, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1143, file: !318, line: 1891, baseType: !1149, size: 64, offset: 128)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1143, file: !318, line: 1891, size: 64, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1149, file: !318, line: 1891, baseType: !1101, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1149, file: !318, line: 1891, baseType: !771, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1143, file: !318, line: 1892, baseType: !1136, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1123, file: !649, line: 359, baseType: !1155, size: 64, offset: 384)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 64, elements: !871)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1103, file: !649, line: 740, baseType: !1157, size: 512)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !649, line: 365, size: 512, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1157, file: !649, line: 368, baseType: !1126, size: 384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1157, file: !649, line: 373, baseType: !771, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1157, file: !649, line: 374, baseType: !771, size: 64, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1103, file: !649, line: 741, baseType: !1163, size: 576)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !649, line: 380, size: 576, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1163, file: !649, line: 383, baseType: !1157, size: 512)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1163, file: !649, line: 389, baseType: !1155, size: 64, offset: 512)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1103, file: !649, line: 742, baseType: !1168, size: 320)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !649, line: 395, size: 320, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !649, line: 397, baseType: !1106, size: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1168, file: !649, line: 400, baseType: !1091, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1103, file: !649, line: 743, baseType: !1173, size: 448)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !649, line: 406, size: 448, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1173, file: !649, line: 408, baseType: !1106, size: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1173, file: !649, line: 412, baseType: !771, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1173, file: !649, line: 420, baseType: !771, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1173, file: !649, line: 423, baseType: !1091, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1103, file: !649, line: 744, baseType: !1180, size: 384)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !649, line: 429, size: 384, elements: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1180, file: !649, line: 431, baseType: !1106, size: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1180, file: !649, line: 434, baseType: !771, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1180, file: !649, line: 437, baseType: !1091, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1103, file: !649, line: 745, baseType: !1186, size: 384)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !649, line: 443, size: 384, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1186, file: !649, line: 445, baseType: !1106, size: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1186, file: !649, line: 449, baseType: !771, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1186, file: !649, line: 453, baseType: !1091, size: 64, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1103, file: !649, line: 746, baseType: !1192, size: 320)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !649, line: 459, size: 320, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1192, file: !649, line: 461, baseType: !1106, size: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1192, file: !649, line: 464, baseType: !771, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1103, file: !649, line: 747, baseType: !1197, size: 768)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !649, line: 469, size: 768, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1197, file: !649, line: 471, baseType: !1106, size: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1197, file: !649, line: 474, baseType: !7, size: 32, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1197, file: !649, line: 475, baseType: !7, size: 32, offset: 288)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1197, file: !649, line: 478, baseType: !771, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1197, file: !649, line: 481, baseType: !1204, size: 384, offset: 384)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 384, elements: !871)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1205, file: !318, line: 1920, baseType: !1143, size: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1205, file: !318, line: 1921, baseType: !771, size: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1205, file: !318, line: 1922, baseType: !898, size: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1103, file: !649, line: 748, baseType: !1211, size: 320)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !649, line: 487, size: 320, elements: !1212)
!1212 = !{!1213, !1214}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1211, file: !649, line: 490, baseType: !1106, size: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1211, file: !649, line: 494, baseType: !765, size: 32, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1103, file: !649, line: 749, baseType: !1216, size: 384)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !649, line: 500, size: 384, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1216, file: !649, line: 502, baseType: !1106, size: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1216, file: !649, line: 506, baseType: !1091, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1216, file: !649, line: 510, baseType: !1091, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1103, file: !649, line: 750, baseType: !1222, size: 320)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !649, line: 529, size: 320, elements: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1222, file: !649, line: 531, baseType: !1106, size: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1222, file: !649, line: 540, baseType: !1091, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1103, file: !649, line: 751, baseType: !1227, size: 704)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !649, line: 546, size: 704, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1227, file: !649, line: 549, baseType: !1157, size: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1227, file: !649, line: 553, baseType: !974, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1227, file: !649, line: 557, baseType: !890, size: 8, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1227, file: !649, line: 558, baseType: !890, size: 8, offset: 584)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1227, file: !649, line: 559, baseType: !890, size: 8, offset: 592)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1227, file: !649, line: 560, baseType: !890, size: 8, offset: 600)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1227, file: !649, line: 566, baseType: !1155, size: 64, offset: 640)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1103, file: !649, line: 752, baseType: !1237, size: 384)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !649, line: 571, size: 384, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1237, file: !649, line: 573, baseType: !1168, size: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1237, file: !649, line: 577, baseType: !771, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1103, file: !649, line: 753, baseType: !1242, size: 576)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !649, line: 600, size: 576, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1249, !1258}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1242, file: !649, line: 602, baseType: !1168, size: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1242, file: !649, line: 605, baseType: !771, size: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1242, file: !649, line: 609, baseType: !1247, size: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1248, line: 46, baseType: !825)
!1248 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1242, file: !649, line: 612, baseType: !1250, size: 64, offset: 448)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !649, line: 581, size: 320, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1251, file: !649, line: 583, baseType: !317, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1251, file: !649, line: 586, baseType: !771, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1251, file: !649, line: 589, baseType: !771, size: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1251, file: !649, line: 592, baseType: !771, size: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1251, file: !649, line: 595, baseType: !771, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1242, file: !649, line: 616, baseType: !1091, size: 64, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1103, file: !649, line: 754, baseType: !1260, size: 512)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !649, line: 622, size: 512, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1260, file: !649, line: 624, baseType: !1168, size: 320)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1260, file: !649, line: 628, baseType: !771, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1260, file: !649, line: 632, baseType: !771, size: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1260, file: !649, line: 636, baseType: !771, size: 64, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1103, file: !649, line: 755, baseType: !1267, size: 704)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !649, line: 642, size: 704, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1267, file: !649, line: 644, baseType: !1260, size: 512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1267, file: !649, line: 648, baseType: !771, size: 64, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1267, file: !649, line: 652, baseType: !771, size: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1267, file: !649, line: 653, baseType: !771, size: 64, offset: 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1103, file: !649, line: 756, baseType: !1274, size: 448)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !649, line: 663, size: 448, elements: !1275)
!1275 = !{!1276, !1277, !1278}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1274, file: !649, line: 665, baseType: !1168, size: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1274, file: !649, line: 668, baseType: !771, size: 64, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1274, file: !649, line: 673, baseType: !771, size: 64, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1103, file: !649, line: 757, baseType: !1280, size: 384)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !649, line: 694, size: 384, elements: !1281)
!1281 = !{!1282, !1283}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1280, file: !649, line: 696, baseType: !1168, size: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1280, file: !649, line: 699, baseType: !771, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1103, file: !649, line: 758, baseType: !1285, size: 384)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !649, line: 681, size: 384, elements: !1286)
!1286 = !{!1287, !1288, !1289}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1285, file: !649, line: 683, baseType: !1106, size: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1285, file: !649, line: 686, baseType: !771, size: 64, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1285, file: !649, line: 689, baseType: !771, size: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1103, file: !649, line: 759, baseType: !1291, size: 384)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !649, line: 707, size: 384, elements: !1292)
!1292 = !{!1293, !1294, !1295}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1291, file: !649, line: 709, baseType: !1106, size: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1291, file: !649, line: 712, baseType: !771, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1291, file: !649, line: 712, baseType: !771, size: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1103, file: !649, line: 760, baseType: !1297, size: 320)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !649, line: 718, size: 320, elements: !1298)
!1298 = !{!1299, !1300}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1297, file: !649, line: 720, baseType: !1106, size: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1297, file: !649, line: 723, baseType: !771, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1098, file: !649, line: 138, baseType: !1097, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1098, file: !649, line: 139, baseType: !1097, size: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1093, file: !649, line: 146, baseType: !1096, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1093, file: !649, line: 152, baseType: !1091, size: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1088, file: !526, line: 130, baseType: !948, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1083, file: !526, line: 134, baseType: !1054, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1083, file: !526, line: 137, baseType: !771, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1083, file: !526, line: 138, baseType: !898, size: 32, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1083, file: !526, line: 142, baseType: !7, size: 32, offset: 352)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !526, line: 144, baseType: !765, size: 32, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1083, file: !526, line: 145, baseType: !765, size: 32, offset: 416)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1083, file: !526, line: 146, baseType: !1313, size: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !526, line: 119, baseType: !827)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1066, file: !526, line: 220, baseType: !1069, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1066, file: !526, line: 223, baseType: !1054, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1066, file: !526, line: 226, baseType: !1317, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 100, size: 1216, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1329, !1330, !1331, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1362, !1370, !1371}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1318, file: !513, line: 102, baseType: !765, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1318, file: !513, line: 105, baseType: !7, size: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1318, file: !513, line: 108, baseType: !1065, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1318, file: !513, line: 111, baseType: !1065, size: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1318, file: !513, line: 114, baseType: !1325, size: 64, offset: 192)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !513, line: 41, size: 64, elements: !1326)
!1326 = !{!1327, !1328}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1325, file: !513, line: 42, baseType: !512, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1325, file: !513, line: 43, baseType: !7, size: 32, offset: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1318, file: !513, line: 117, baseType: !7, size: 32, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1318, file: !513, line: 120, baseType: !7, size: 32, offset: 288)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1318, file: !513, line: 123, baseType: !1332, size: 64, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !513, line: 87, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !513, line: 87, size: 128, elements: !1335)
!1335 = !{!1336}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1334, file: !513, line: 87, baseType: !1337, size: 128)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !513, line: 85, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !513, line: 85, size: 128, elements: !1339)
!1339 = !{!1340, !1341, !1342}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1338, file: !513, line: 85, baseType: !7, size: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1338, file: !513, line: 85, baseType: !7, size: 32, offset: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1338, file: !513, line: 85, baseType: !1343, size: 64, offset: 64)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 64, elements: !871)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !513, line: 84, baseType: !1317)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1318, file: !513, line: 126, baseType: !1317, size: 64, offset: 384)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1318, file: !513, line: 129, baseType: !1317, size: 64, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1318, file: !513, line: 132, baseType: !1054, size: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1318, file: !513, line: 139, baseType: !771, size: 64, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1318, file: !513, line: 143, baseType: !820, size: 128, offset: 640)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1318, file: !513, line: 146, baseType: !820, size: 128, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1318, file: !513, line: 148, baseType: !890, size: 8, offset: 896)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1318, file: !513, line: 149, baseType: !890, size: 8, offset: 904)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1318, file: !513, line: 153, baseType: !521, size: 32, offset: 928)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1318, file: !513, line: 156, baseType: !1355, size: 64, offset: 960)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !513, line: 48, size: 320, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1356, file: !513, line: 50, baseType: !1101, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1356, file: !513, line: 59, baseType: !820, size: 128, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1356, file: !513, line: 64, baseType: !890, size: 8, offset: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1356, file: !513, line: 67, baseType: !1355, size: 64, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1318, file: !513, line: 159, baseType: !1363, size: 64, offset: 1024)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !513, line: 72, size: 256, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1364, file: !513, line: 74, baseType: !1082, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1364, file: !513, line: 77, baseType: !1363, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1364, file: !513, line: 78, baseType: !1363, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1364, file: !513, line: 81, baseType: !1363, size: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1318, file: !513, line: 162, baseType: !890, size: 8, offset: 1088)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1318, file: !513, line: 166, baseType: !771, size: 64, offset: 1152)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1066, file: !526, line: 229, baseType: !1373, size: 128, offset: 256)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1374, size: 128, elements: !1018)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !526, line: 229, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1066, file: !526, line: 232, baseType: !1065, size: 64, offset: 384)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1066, file: !526, line: 233, baseType: !1065, size: 64, offset: 448)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1066, file: !526, line: 238, baseType: !1379, size: 64, offset: 512)
!1379 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !526, line: 235, size: 64, elements: !1380)
!1380 = !{!1381, !1387}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1379, file: !526, line: 236, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !526, line: 273, size: 128, elements: !1384)
!1384 = !{!1385, !1386}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1383, file: !526, line: 275, baseType: !1091, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1383, file: !526, line: 278, baseType: !1091, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1379, file: !526, line: 237, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !526, line: 259, size: 320, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !1395}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1389, file: !526, line: 261, baseType: !948, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1389, file: !526, line: 262, baseType: !948, size: 64, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1389, file: !526, line: 266, baseType: !948, size: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1389, file: !526, line: 267, baseType: !948, size: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1389, file: !526, line: 270, baseType: !765, size: 32, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1066, file: !526, line: 241, baseType: !1313, size: 64, offset: 576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1066, file: !526, line: 244, baseType: !765, size: 32, offset: 640)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1066, file: !526, line: 247, baseType: !765, size: 32, offset: 672)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1066, file: !526, line: 250, baseType: !765, size: 32, offset: 704)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1066, file: !526, line: 253, baseType: !765, size: 32, offset: 736)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1066, file: !526, line: 256, baseType: !765, size: 32, offset: 768)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !969, file: !951, line: 179, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !951, line: 150, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !951, line: 142, size: 320, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1413, !1414}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1405, file: !951, line: 144, baseType: !771, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1405, file: !951, line: 145, baseType: !948, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1405, file: !951, line: 146, baseType: !948, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1405, file: !951, line: 147, baseType: !1411, size: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1412, line: 31, baseType: !765)
!1412 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1405, file: !951, line: 148, baseType: !7, size: 32, offset: 224)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1405, file: !951, line: 149, baseType: !890, size: 8, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !969, file: !951, line: 180, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !951, line: 162, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !951, line: 159, size: 128, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1418, file: !951, line: 160, baseType: !771, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1418, file: !951, line: 161, baseType: !827, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !969, file: !951, line: 181, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !951, line: 181, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !964, file: !951, line: 317, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 64, elements: !871)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !964, file: !951, line: 318, baseType: !1428, size: 320)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !951, line: 188, size: 320, elements: !1429)
!1429 = !{!1430, !1432, !1489}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1428, file: !951, line: 190, baseType: !1431, size: 192)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 192, elements: !845)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1428, file: !951, line: 193, baseType: !1433, size: 64, offset: 192)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !951, line: 206, size: 320, elements: !1435)
!1435 = !{!1436, !1474, !1475, !1476, !1488}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1434, file: !951, line: 208, baseType: !1437, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !772, line: 62, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1440, line: 538, size: 256, elements: !1441)
!1440 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1441 = !{!1442, !1446, !1452, !1465}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !1440, line: 539, baseType: !1443, size: 32)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1440, line: 482, size: 32, elements: !1444)
!1444 = !{!1445}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1443, file: !1440, line: 484, baseType: !7, size: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1439, file: !1440, line: 540, baseType: !1447, size: 192)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1440, line: 488, size: 192, elements: !1448)
!1448 = !{!1449, !1450, !1451}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1447, file: !1440, line: 489, baseType: !1443, size: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1447, file: !1440, line: 492, baseType: !974, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1447, file: !1440, line: 496, baseType: !771, size: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1439, file: !1440, line: 541, baseType: !1453, size: 256)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1440, line: 504, size: 256, elements: !1454)
!1454 = !{!1455, !1456, !1463, !1464}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1453, file: !1440, line: 505, baseType: !1443, size: 32)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1453, file: !1440, line: 509, baseType: !1457, size: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1440, line: 501, baseType: !1458)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1461}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1453, file: !1440, line: 510, baseType: !1461, size: 64, offset: 128)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1453, file: !1440, line: 513, baseType: !1437, size: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1439, file: !1440, line: 542, baseType: !1466, size: 128)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1440, line: 530, size: 128, elements: !1467)
!1467 = !{!1468, !1469}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1466, file: !1440, line: 531, baseType: !1443, size: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1466, file: !1440, line: 534, baseType: !1470, size: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1440, line: 525, baseType: !1471)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!890, !771, !974, !825, !825}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1434, file: !951, line: 211, baseType: !7, size: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1434, file: !951, line: 214, baseType: !827, size: 64, offset: 128)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1434, file: !951, line: 224, baseType: !1477, size: 64, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !951, line: 202, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !951, line: 202, size: 128, elements: !1480)
!1480 = !{!1481}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1479, file: !951, line: 202, baseType: !1482, size: 128)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !951, line: 200, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !951, line: 200, size: 128, elements: !1484)
!1484 = !{!1485, !1486, !1487}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1483, file: !951, line: 200, baseType: !7, size: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1483, file: !951, line: 200, baseType: !7, size: 32, offset: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1483, file: !951, line: 200, baseType: !984, size: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1434, file: !951, line: 234, baseType: !1477, size: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1428, file: !951, line: 197, baseType: !827, size: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !964, file: !951, line: 319, baseType: !834, size: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !964, file: !951, line: 320, baseType: !853, size: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !774, file: !318, line: 3384, baseType: !1493, size: 1472)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1494)
!1494 = !{!1495, !1516, !1517, !1518, !1519}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1493, file: !318, line: 3115, baseType: !1496, size: 1216)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1497)
!1497 = !{!1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1496, file: !318, line: 2985, baseType: !944, size: 960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1496, file: !318, line: 2986, baseType: !771, size: 64, offset: 960)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1496, file: !318, line: 2987, baseType: !771, size: 64, offset: 1024)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1496, file: !318, line: 2988, baseType: !771, size: 64, offset: 1088)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1496, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1496, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1496, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1496, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1496, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1496, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1496, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1496, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1496, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1496, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1496, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1496, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1496, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1496, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1493, file: !318, line: 3117, baseType: !771, size: 64, offset: 1216)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1493, file: !318, line: 3119, baseType: !771, size: 64, offset: 1280)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1493, file: !318, line: 3121, baseType: !771, size: 64, offset: 1344)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1493, file: !318, line: 3123, baseType: !771, size: 64, offset: 1408)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !774, file: !318, line: 3385, baseType: !1521, size: 1088)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1522)
!1522 = !{!1523, !1524, !1525}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1521, file: !318, line: 2875, baseType: !944, size: 960)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1521, file: !318, line: 2876, baseType: !948, size: 64, offset: 960)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1521, file: !318, line: 2877, baseType: !1526, size: 64, offset: 1024)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1528, line: 172, size: 128, elements: !1529)
!1528 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1529 = !{!1530, !1531, !1532, !1533, !1534, !1535, !1536}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1527, file: !1528, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1527, file: !1528, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1527, file: !1528, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1527, file: !1528, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1527, file: !1528, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1527, file: !1528, line: 195, baseType: !7, size: 32, offset: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1527, file: !1528, line: 199, baseType: !771, size: 64, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !774, file: !318, line: 3386, baseType: !1496, size: 1216)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !774, file: !318, line: 3387, baseType: !1539, size: 1280)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1540)
!1540 = !{!1541, !1542}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1539, file: !318, line: 3094, baseType: !1496, size: 1216)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1539, file: !318, line: 3095, baseType: !1526, size: 64, offset: 1216)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !774, file: !318, line: 3388, baseType: !1544, size: 1216)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551}
