; ModuleID = 'c-convert.c'
source_filename = "c-convert.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type opaque
%struct.function = type opaque

!326 = !DIEnumerator(name: "TI_SAT_ULLACCUM_TYPE", value: 80, isUnsigned: true)
!327 = !DIEnumerator(name: "TI_SACCUM_TYPE", value: 81, isUnsigned: true)
!328 = !DIEnumerator(name: "TI_ACCUM_TYPE", value: 82, isUnsigned: true)
!329 = !DIEnumerator(name: "TI_LACCUM_TYPE", value: 83, isUnsigned: true)
!330 = !DIEnumerator(name: "TI_LLACCUM_TYPE", value: 84, isUnsigned: true)
!331 = !DIEnumerator(name: "TI_USACCUM_TYPE", value: 85, isUnsigned: true)
!332 = !DIEnumerator(name: "TI_UACCUM_TYPE", value: 86, isUnsigned: true)
!333 = !DIEnumerator(name: "TI_ULACCUM_TYPE", value: 87, isUnsigned: true)
!334 = !DIEnumerator(name: "TI_ULLACCUM_TYPE", value: 88, isUnsigned: true)
!335 = !DIEnumerator(name: "TI_QQ_TYPE", value: 89, isUnsigned: true)
!336 = !DIEnumerator(name: "TI_HQ_TYPE", value: 90, isUnsigned: true)
!337 = !DIEnumerator(name: "TI_SQ_TYPE", value: 91, isUnsigned: true)
!338 = !DIEnumerator(name: "TI_DQ_TYPE", value: 92, isUnsigned: true)
!339 = !DIEnumerator(name: "TI_TQ_TYPE", value: 93, isUnsigned: true)
!340 = !DIEnumerator(name: "TI_UQQ_TYPE", value: 94, isUnsigned: true)
!341 = !DIEnumerator(name: "TI_UHQ_TYPE", value: 95, isUnsigned: true)
!342 = !DIEnumerator(name: "TI_USQ_TYPE", value: 96, isUnsigned: true)
!343 = !DIEnumerator(name: "TI_UDQ_TYPE", value: 97, isUnsigned: true)
!344 = !DIEnumerator(name: "TI_UTQ_TYPE", value: 98, isUnsigned: true)
!345 = !DIEnumerator(name: "TI_SAT_QQ_TYPE", value: 99, isUnsigned: true)
!346 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!347 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!348 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!349 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!350 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!351 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!352 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!353 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!354 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!355 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!356 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!357 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!358 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!359 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!360 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!361 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!362 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!363 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!364 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!365 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!366 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!367 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!368 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!369 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!370 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!371 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!372 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!373 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!374 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!375 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!376 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!377 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!378 = !{!37, !379, !380}
!379 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !381, line: 44, baseType: !5)
!381 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!382 = !{i32 7, !"Dwarf Version", i32 4}
!383 = !{i32 2, !"Debug Info Version", i32 3}
!384 = !{i32 1, !"wchar_size", i32 4}
!385 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!386 = distinct !DISubprogram(name: "convert", scope: !1, file: !1, line: 68, type: !387, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1031)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !389, !389}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !390, line: 56, baseType: !391)
!390 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !393)
!393 = !{!394, !427, !433, !446, !453, !460, !465, !475, !481, !495, !505, !543, !551, !579, !587, !588, !593, !602, !608, !613, !617, !621, !650, !701, !707, !714, !721, !747, !772, !789, !801, !823, !841, !1013}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !392, file: !4, line: 3372, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !395, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !395, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !395, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !395, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !395, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !395, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !395, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !395, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !395, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !395, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !395, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !395, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !395, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !395, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !395, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !395, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !395, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !395, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !395, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !395, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !395, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !395, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !395, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !395, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !395, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !395, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !395, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !395, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !395, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !395, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !392, file: !4, line: 3373, baseType: !428, size: 192)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !428, file: !4, line: 403, baseType: !395, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !428, file: !4, line: 404, baseType: !389, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !4, line: 405, baseType: !389, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !392, file: !4, line: 3374, baseType: !434, size: 320)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !434, file: !4, line: 1385, baseType: !428, size: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !434, file: !4, line: 1386, baseType: !438, size: 128, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !439, line: 58, baseType: !440)
!439 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 54, size: 128, elements: !441)
!441 = !{!442, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !440, file: !439, line: 56, baseType: !443, size: 64)
!443 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !440, file: !439, line: 57, baseType: !445, size: 64, offset: 64)
!445 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !392, file: !4, line: 3375, baseType: !447, size: 256)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !447, file: !4, line: 1398, baseType: !428, size: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !447, file: !4, line: 1399, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !392, file: !4, line: 3376, baseType: !454, size: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !454, file: !4, line: 1409, baseType: !428, size: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !454, file: !4, line: 1410, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !392, file: !4, line: 3377, baseType: !461, size: 256)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !461, file: !4, line: 1438, baseType: !428, size: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !461, file: !4, line: 1439, baseType: !389, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !392, file: !4, line: 3378, baseType: !466, size: 256)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !466, file: !4, line: 1419, baseType: !428, size: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !466, file: !4, line: 1420, baseType: !379, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !466, file: !4, line: 1421, baseType: !471, size: 8, offset: 224)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 8, elements: !473)
!472 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!473 = !{!474}
!474 = !DISubrange(count: 1)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !392, file: !4, line: 3379, baseType: !476, size: 320)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !476, file: !4, line: 1429, baseType: !428, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !476, file: !4, line: 1430, baseType: !389, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !476, file: !4, line: 1431, baseType: !389, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !392, file: !4, line: 3380, baseType: !482, size: 320)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !4, line: 1461, baseType: !428, size: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !482, file: !4, line: 1462, baseType: !486, size: 128, offset: 192)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !487, line: 31, size: 128, elements: !488)
!487 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!488 = !{!489, !493, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !486, file: !487, line: 32, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !486, file: !487, line: 33, baseType: !5, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !486, file: !487, line: 34, baseType: !5, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !392, file: !4, line: 3381, baseType: !496, size: 384)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !497)
!497 = !{!498, !499, !502, !503, !504}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !4, line: 2508, baseType: !428, size: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !496, file: !4, line: 2509, baseType: !500, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !501, line: 58, baseType: !380)
!501 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !496, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !496, file: !4, line: 2511, baseType: !389, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !496, file: !4, line: 2512, baseType: !389, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !392, file: !4, line: 3382, baseType: !506, size: 896)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !4, line: 2653, baseType: !496, size: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !4, line: 2654, baseType: !389, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !506, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !506, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !506, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !506, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !506, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !506, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !506, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !506, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !506, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !506, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !506, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !506, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !506, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !506, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !506, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !506, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !506, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !506, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !506, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !506, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !506, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !506, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !506, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !506, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !506, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !506, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !506, file: !4, line: 2705, baseType: !389, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !506, file: !4, line: 2706, baseType: !389, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !506, file: !4, line: 2707, baseType: !389, size: 64, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !506, file: !4, line: 2708, baseType: !389, size: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !506, file: !4, line: 2711, baseType: !541, size: 64, offset: 832)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !392, file: !4, line: 3383, baseType: !544, size: 960)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !544, file: !4, line: 2757, baseType: !506, size: 896)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !544, file: !4, line: 2758, baseType: !548, size: 64, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !390, line: 50, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !390, line: 49, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !392, file: !4, line: 3384, baseType: !552, size: 1472)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !553)
!553 = !{!554, !575, !576, !577, !578}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !4, line: 3115, baseType: !555, size: 1216)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !555, file: !4, line: 2985, baseType: !544, size: 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !555, file: !4, line: 2986, baseType: !389, size: 64, offset: 960)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !555, file: !4, line: 2987, baseType: !389, size: 64, offset: 1024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !555, file: !4, line: 2988, baseType: !389, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !555, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !555, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !555, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !555, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !555, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !555, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !555, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !555, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !555, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !555, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !555, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !555, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !555, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !555, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !552, file: !4, line: 3117, baseType: !389, size: 64, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !552, file: !4, line: 3119, baseType: !389, size: 64, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !552, file: !4, line: 3121, baseType: !389, size: 64, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !552, file: !4, line: 3123, baseType: !389, size: 64, offset: 1408)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !392, file: !4, line: 3385, baseType: !580, size: 1088)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !4, line: 2875, baseType: !544, size: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !580, file: !4, line: 2876, baseType: !548, size: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !580, file: !4, line: 2877, baseType: !585, size: 64, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !392, file: !4, line: 3386, baseType: !555, size: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !392, file: !4, line: 3387, baseType: !589, size: 1280)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !4, line: 3094, baseType: !555, size: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !589, file: !4, line: 3095, baseType: !585, size: 64, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !392, file: !4, line: 3388, baseType: !594, size: 1216)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !594, file: !4, line: 2825, baseType: !506, size: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !594, file: !4, line: 2827, baseType: !389, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !594, file: !4, line: 2828, baseType: !389, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !594, file: !4, line: 2829, baseType: !389, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !594, file: !4, line: 2830, baseType: !389, size: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !594, file: !4, line: 2831, baseType: !389, size: 64, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !392, file: !4, line: 3389, baseType: !603, size: 1024)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !4, line: 2851, baseType: !544, size: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !603, file: !4, line: 2852, baseType: !379, size: 32, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !603, file: !4, line: 2853, baseType: !379, size: 32, offset: 992)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !392, file: !4, line: 3390, baseType: !609, size: 1024)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !4, line: 2858, baseType: !544, size: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !609, file: !4, line: 2859, baseType: !585, size: 64, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !392, file: !4, line: 3391, baseType: !614, size: 960)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !614, file: !4, line: 2863, baseType: !544, size: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !392, file: !4, line: 3392, baseType: !618, size: 1472)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !4, line: 3305, baseType: !552, size: 1472)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !392, file: !4, line: 3393, baseType: !622, size: 1792)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !623)
!623 = !{!624, !625, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !4, line: 3249, baseType: !552, size: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !622, file: !4, line: 3251, baseType: !626, size: 64, offset: 1472)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !628, line: 41, flags: DIFlagFwdDecl)
!628 = !DIFile(filename: "./statistics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!629 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !622, file: !4, line: 3254, baseType: !389, size: 64, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !622, file: !4, line: 3257, baseType: !389, size: 64, offset: 1600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !622, file: !4, line: 3258, baseType: !389, size: 64, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !622, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !622, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !622, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !622, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !622, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !622, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !622, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !622, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !622, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !622, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !622, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !622, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !622, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !622, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !622, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !622, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !622, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !622, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !392, file: !4, line: 3394, baseType: !651, size: 1344)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !678, !679, !680, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !4, line: 2280, baseType: !428, size: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !651, file: !4, line: 2281, baseType: !389, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !651, file: !4, line: 2282, baseType: !389, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !651, file: !4, line: 2283, baseType: !389, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !651, file: !4, line: 2284, baseType: !389, size: 64, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !651, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !651, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !651, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !651, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !651, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !651, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !651, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !651, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !651, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !651, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !651, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !651, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !651, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !651, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !651, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !651, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !651, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !651, file: !4, line: 2306, baseType: !676, size: 32, offset: 544)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !677, line: 31, baseType: !379)
!677 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !651, file: !4, line: 2307, baseType: !389, size: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !651, file: !4, line: 2308, baseType: !389, size: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !651, file: !4, line: 2314, baseType: !681, size: 64, offset: 704)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !682)
!682 = !{!683, !684, !687}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !681, file: !4, line: 2310, baseType: !379, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !681, file: !4, line: 2311, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !681, file: !4, line: 2312, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !4, line: 2315, baseType: !389, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !651, file: !4, line: 2316, baseType: !389, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !651, file: !4, line: 2317, baseType: !389, size: 64, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !651, file: !4, line: 2318, baseType: !389, size: 64, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !651, file: !4, line: 2319, baseType: !389, size: 64, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !651, file: !4, line: 2320, baseType: !389, size: 64, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !651, file: !4, line: 2321, baseType: !389, size: 64, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !651, file: !4, line: 2322, baseType: !389, size: 64, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !651, file: !4, line: 2324, baseType: !699, size: 64, offset: 1280)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !392, file: !4, line: 3395, baseType: !702, size: 320)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !702, file: !4, line: 1470, baseType: !428, size: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !702, file: !4, line: 1471, baseType: !389, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !702, file: !4, line: 1472, baseType: !389, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !392, file: !4, line: 3396, baseType: !708, size: 320)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !4, line: 1483, baseType: !428, size: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !708, file: !4, line: 1484, baseType: !379, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !708, file: !4, line: 1485, baseType: !713, size: 64, offset: 256)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !473)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !392, file: !4, line: 3397, baseType: !715, size: 384)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !715, file: !4, line: 1830, baseType: !428, size: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !715, file: !4, line: 1831, baseType: !500, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !715, file: !4, line: 1832, baseType: !389, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !715, file: !4, line: 1835, baseType: !713, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !392, file: !4, line: 3398, baseType: !722, size: 704)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !723)
!723 = !{!724, !725, !726, !730, !731, !734}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !4, line: 1899, baseType: !428, size: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !722, file: !4, line: 1902, baseType: !389, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !722, file: !4, line: 1905, baseType: !727, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !390, line: 58, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !390, line: 57, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !722, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !722, file: !4, line: 1911, baseType: !732, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !722, file: !4, line: 1914, baseType: !735, size: 256, offset: 448)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !736)
!736 = !{!737, !739, !740, !745}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !735, file: !4, line: 1884, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !4, line: 1885, baseType: !738, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !735, file: !4, line: 1891, baseType: !741, size: 64, offset: 128)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !735, file: !4, line: 1891, size: 64, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !741, file: !4, line: 1891, baseType: !727, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !741, file: !4, line: 1891, baseType: !389, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !735, file: !4, line: 1892, baseType: !746, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !392, file: !4, line: 3399, baseType: !748, size: 704)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !767, !768, !769, !770, !771}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !4, line: 2009, baseType: !428, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !748, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !748, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !748, file: !4, line: 2014, baseType: !500, size: 32, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !748, file: !4, line: 2016, baseType: !389, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !748, file: !4, line: 2017, baseType: !756, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !758, file: !4, line: 183, baseType: !761, size: 128)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !762, file: !4, line: 182, baseType: !5, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !762, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !762, file: !4, line: 182, baseType: !713, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !748, file: !4, line: 2019, baseType: !389, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !748, file: !4, line: 2020, baseType: !389, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !748, file: !4, line: 2021, baseType: !389, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !748, file: !4, line: 2022, baseType: !389, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !748, file: !4, line: 2023, baseType: !389, size: 64, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !392, file: !4, line: 3400, baseType: !773, size: 832)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !4, line: 2430, size: 832, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !4, line: 2431, baseType: !428, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !773, file: !4, line: 2433, baseType: !389, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !773, file: !4, line: 2434, baseType: !389, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !773, file: !4, line: 2435, baseType: !389, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !773, file: !4, line: 2436, baseType: !389, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !773, file: !4, line: 2437, baseType: !756, size: 64, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !773, file: !4, line: 2438, baseType: !389, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !773, file: !4, line: 2440, baseType: !389, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !773, file: !4, line: 2441, baseType: !389, size: 64, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !773, file: !4, line: 2443, baseType: !785, size: 128, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !4, line: 182, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !4, line: 182, size: 128, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !786, file: !4, line: 182, baseType: !761, size: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !392, file: !4, line: 3401, baseType: !790, size: 320)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !4, line: 3327, size: 320, elements: !791)
!791 = !{!792, !793, !800}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !4, line: 3329, baseType: !428, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !790, file: !4, line: 3330, baseType: !794, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !4, line: 3320, size: 192, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !795, file: !4, line: 3322, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !4, line: 3323, baseType: !794, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !795, file: !4, line: 3324, baseType: !389, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !790, file: !4, line: 3331, baseType: !794, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !392, file: !4, line: 3402, baseType: !802, size: 256)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !4, line: 1540, size: 256, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !4, line: 1541, baseType: !428, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !802, file: !4, line: 1542, baseType: !806, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !4, line: 1538, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !4, line: 1538, size: 192, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !808, file: !4, line: 1538, baseType: !811, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !4, line: 1537, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !4, line: 1537, size: 192, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !812, file: !4, line: 1537, baseType: !5, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !812, file: !4, line: 1537, baseType: !5, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !812, file: !4, line: 1537, baseType: !817, size: 128, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 128, elements: !473)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !4, line: 1535, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !4, line: 1532, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !819, file: !4, line: 1533, baseType: !389, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !819, file: !4, line: 1534, baseType: !389, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !392, file: !4, line: 3403, baseType: !824, size: 512)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !4, line: 1938, size: 512, elements: !825)
!825 = !{!826, !827, !828, !829, !835, !839, !840}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !4, line: 1939, baseType: !428, size: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !824, file: !4, line: 1940, baseType: !500, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !824, file: !4, line: 1941, baseType: !3, size: 32, offset: 224)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !824, file: !4, line: 1946, baseType: !830, size: 32, offset: 256)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !4, line: 1942, size: 32, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !830, file: !4, line: 1943, baseType: !23, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !830, file: !4, line: 1944, baseType: !30, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !830, file: !4, line: 1945, baseType: !37, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !824, file: !4, line: 1950, baseType: !836, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !390, line: 66, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !390, line: 65, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !824, file: !4, line: 1951, baseType: !836, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !824, file: !4, line: 1953, baseType: !713, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !392, file: !4, line: 3404, baseType: !842, size: 1664)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !4, line: 3337, size: 1664, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !4, line: 3338, baseType: !428, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !842, file: !4, line: 3341, baseType: !846, size: 1472, offset: 192)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !847, line: 410, size: 1472, elements: !848)
!847 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !846, file: !847, line: 412, baseType: !379, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !846, file: !847, line: 413, baseType: !379, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !846, file: !847, line: 414, baseType: !379, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !846, file: !847, line: 415, baseType: !379, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !846, file: !847, line: 416, baseType: !379, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !846, file: !847, line: 417, baseType: !379, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !846, file: !847, line: 418, baseType: !492, size: 8, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !846, file: !847, line: 419, baseType: !492, size: 8, offset: 200)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !846, file: !847, line: 420, baseType: !858, size: 8, offset: 208)
!858 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !846, file: !847, line: 421, baseType: !858, size: 8, offset: 216)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !846, file: !847, line: 422, baseType: !858, size: 8, offset: 224)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !846, file: !847, line: 423, baseType: !858, size: 8, offset: 232)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !846, file: !847, line: 424, baseType: !858, size: 8, offset: 240)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !846, file: !847, line: 425, baseType: !858, size: 8, offset: 248)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !846, file: !847, line: 426, baseType: !858, size: 8, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !846, file: !847, line: 427, baseType: !858, size: 8, offset: 264)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !846, file: !847, line: 428, baseType: !858, size: 8, offset: 272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !846, file: !847, line: 429, baseType: !858, size: 8, offset: 280)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !846, file: !847, line: 430, baseType: !858, size: 8, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !846, file: !847, line: 431, baseType: !858, size: 8, offset: 296)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !846, file: !847, line: 432, baseType: !858, size: 8, offset: 304)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !846, file: !847, line: 433, baseType: !858, size: 8, offset: 312)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !846, file: !847, line: 434, baseType: !858, size: 8, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !846, file: !847, line: 435, baseType: !858, size: 8, offset: 328)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !846, file: !847, line: 436, baseType: !858, size: 8, offset: 336)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !846, file: !847, line: 437, baseType: !858, size: 8, offset: 344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !846, file: !847, line: 438, baseType: !858, size: 8, offset: 352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !846, file: !847, line: 439, baseType: !858, size: 8, offset: 360)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !846, file: !847, line: 440, baseType: !858, size: 8, offset: 368)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !846, file: !847, line: 441, baseType: !858, size: 8, offset: 376)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !846, file: !847, line: 442, baseType: !858, size: 8, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !846, file: !847, line: 443, baseType: !858, size: 8, offset: 392)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !846, file: !847, line: 444, baseType: !858, size: 8, offset: 400)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !846, file: !847, line: 445, baseType: !858, size: 8, offset: 408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !846, file: !847, line: 446, baseType: !858, size: 8, offset: 416)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !846, file: !847, line: 447, baseType: !858, size: 8, offset: 424)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !846, file: !847, line: 448, baseType: !858, size: 8, offset: 432)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !846, file: !847, line: 449, baseType: !858, size: 8, offset: 440)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !846, file: !847, line: 450, baseType: !858, size: 8, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !846, file: !847, line: 451, baseType: !858, size: 8, offset: 456)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !846, file: !847, line: 452, baseType: !858, size: 8, offset: 464)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !846, file: !847, line: 453, baseType: !858, size: 8, offset: 472)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !846, file: !847, line: 454, baseType: !858, size: 8, offset: 480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !846, file: !847, line: 455, baseType: !858, size: 8, offset: 488)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !846, file: !847, line: 456, baseType: !858, size: 8, offset: 496)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !846, file: !847, line: 457, baseType: !858, size: 8, offset: 504)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !846, file: !847, line: 458, baseType: !858, size: 8, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !846, file: !847, line: 459, baseType: !858, size: 8, offset: 520)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !846, file: !847, line: 460, baseType: !858, size: 8, offset: 528)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !846, file: !847, line: 461, baseType: !858, size: 8, offset: 536)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !846, file: !847, line: 462, baseType: !858, size: 8, offset: 544)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !846, file: !847, line: 463, baseType: !858, size: 8, offset: 552)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !846, file: !847, line: 464, baseType: !858, size: 8, offset: 560)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !846, file: !847, line: 465, baseType: !858, size: 8, offset: 568)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !846, file: !847, line: 466, baseType: !858, size: 8, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !846, file: !847, line: 467, baseType: !858, size: 8, offset: 584)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !846, file: !847, line: 468, baseType: !858, size: 8, offset: 592)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !846, file: !847, line: 469, baseType: !858, size: 8, offset: 600)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !846, file: !847, line: 470, baseType: !858, size: 8, offset: 608)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !846, file: !847, line: 471, baseType: !858, size: 8, offset: 616)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !846, file: !847, line: 472, baseType: !858, size: 8, offset: 624)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !846, file: !847, line: 473, baseType: !858, size: 8, offset: 632)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !846, file: !847, line: 474, baseType: !858, size: 8, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !846, file: !847, line: 475, baseType: !858, size: 8, offset: 648)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !846, file: !847, line: 476, baseType: !858, size: 8, offset: 656)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !846, file: !847, line: 477, baseType: !858, size: 8, offset: 664)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !846, file: !847, line: 478, baseType: !858, size: 8, offset: 672)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !846, file: !847, line: 479, baseType: !858, size: 8, offset: 680)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !846, file: !847, line: 480, baseType: !858, size: 8, offset: 688)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !846, file: !847, line: 481, baseType: !858, size: 8, offset: 696)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !846, file: !847, line: 482, baseType: !858, size: 8, offset: 704)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !846, file: !847, line: 483, baseType: !858, size: 8, offset: 712)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !846, file: !847, line: 484, baseType: !858, size: 8, offset: 720)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !846, file: !847, line: 485, baseType: !858, size: 8, offset: 728)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !846, file: !847, line: 486, baseType: !858, size: 8, offset: 736)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !846, file: !847, line: 487, baseType: !858, size: 8, offset: 744)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !846, file: !847, line: 488, baseType: !858, size: 8, offset: 752)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !846, file: !847, line: 489, baseType: !858, size: 8, offset: 760)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !846, file: !847, line: 490, baseType: !858, size: 8, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !846, file: !847, line: 491, baseType: !858, size: 8, offset: 776)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !846, file: !847, line: 492, baseType: !858, size: 8, offset: 784)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !846, file: !847, line: 493, baseType: !858, size: 8, offset: 792)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !846, file: !847, line: 494, baseType: !858, size: 8, offset: 800)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !846, file: !847, line: 495, baseType: !858, size: 8, offset: 808)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !846, file: !847, line: 496, baseType: !858, size: 8, offset: 816)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !846, file: !847, line: 497, baseType: !858, size: 8, offset: 824)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !846, file: !847, line: 498, baseType: !858, size: 8, offset: 832)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !846, file: !847, line: 499, baseType: !858, size: 8, offset: 840)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !846, file: !847, line: 500, baseType: !858, size: 8, offset: 848)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !846, file: !847, line: 501, baseType: !858, size: 8, offset: 856)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !846, file: !847, line: 502, baseType: !858, size: 8, offset: 864)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !846, file: !847, line: 503, baseType: !858, size: 8, offset: 872)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !846, file: !847, line: 504, baseType: !858, size: 8, offset: 880)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !846, file: !847, line: 505, baseType: !858, size: 8, offset: 888)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !846, file: !847, line: 506, baseType: !858, size: 8, offset: 896)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !846, file: !847, line: 507, baseType: !858, size: 8, offset: 904)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !846, file: !847, line: 508, baseType: !858, size: 8, offset: 912)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !846, file: !847, line: 509, baseType: !858, size: 8, offset: 920)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !846, file: !847, line: 510, baseType: !858, size: 8, offset: 928)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !846, file: !847, line: 511, baseType: !858, size: 8, offset: 936)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !846, file: !847, line: 512, baseType: !858, size: 8, offset: 944)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !846, file: !847, line: 513, baseType: !858, size: 8, offset: 952)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !846, file: !847, line: 514, baseType: !858, size: 8, offset: 960)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !846, file: !847, line: 515, baseType: !858, size: 8, offset: 968)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !846, file: !847, line: 516, baseType: !858, size: 8, offset: 976)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !846, file: !847, line: 517, baseType: !858, size: 8, offset: 984)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !846, file: !847, line: 518, baseType: !858, size: 8, offset: 992)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !846, file: !847, line: 519, baseType: !858, size: 8, offset: 1000)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !846, file: !847, line: 520, baseType: !858, size: 8, offset: 1008)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !846, file: !847, line: 521, baseType: !858, size: 8, offset: 1016)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !846, file: !847, line: 522, baseType: !858, size: 8, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !846, file: !847, line: 523, baseType: !858, size: 8, offset: 1032)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !846, file: !847, line: 524, baseType: !858, size: 8, offset: 1040)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !846, file: !847, line: 525, baseType: !858, size: 8, offset: 1048)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !846, file: !847, line: 526, baseType: !858, size: 8, offset: 1056)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !846, file: !847, line: 527, baseType: !858, size: 8, offset: 1064)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !846, file: !847, line: 528, baseType: !858, size: 8, offset: 1072)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !846, file: !847, line: 529, baseType: !858, size: 8, offset: 1080)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !846, file: !847, line: 530, baseType: !858, size: 8, offset: 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !846, file: !847, line: 531, baseType: !858, size: 8, offset: 1096)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !846, file: !847, line: 532, baseType: !858, size: 8, offset: 1104)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !846, file: !847, line: 533, baseType: !858, size: 8, offset: 1112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !846, file: !847, line: 534, baseType: !858, size: 8, offset: 1120)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !846, file: !847, line: 535, baseType: !858, size: 8, offset: 1128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !846, file: !847, line: 536, baseType: !858, size: 8, offset: 1136)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !846, file: !847, line: 537, baseType: !858, size: 8, offset: 1144)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !846, file: !847, line: 538, baseType: !858, size: 8, offset: 1152)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !846, file: !847, line: 539, baseType: !858, size: 8, offset: 1160)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !846, file: !847, line: 540, baseType: !858, size: 8, offset: 1168)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !846, file: !847, line: 541, baseType: !858, size: 8, offset: 1176)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !846, file: !847, line: 542, baseType: !858, size: 8, offset: 1184)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !846, file: !847, line: 543, baseType: !858, size: 8, offset: 1192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !846, file: !847, line: 544, baseType: !858, size: 8, offset: 1200)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !846, file: !847, line: 545, baseType: !858, size: 8, offset: 1208)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !846, file: !847, line: 546, baseType: !858, size: 8, offset: 1216)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !846, file: !847, line: 547, baseType: !858, size: 8, offset: 1224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !846, file: !847, line: 548, baseType: !858, size: 8, offset: 1232)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !846, file: !847, line: 549, baseType: !858, size: 8, offset: 1240)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !846, file: !847, line: 550, baseType: !858, size: 8, offset: 1248)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !846, file: !847, line: 551, baseType: !858, size: 8, offset: 1256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !846, file: !847, line: 552, baseType: !858, size: 8, offset: 1264)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !846, file: !847, line: 553, baseType: !858, size: 8, offset: 1272)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !846, file: !847, line: 554, baseType: !858, size: 8, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !846, file: !847, line: 555, baseType: !858, size: 8, offset: 1288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !846, file: !847, line: 556, baseType: !858, size: 8, offset: 1296)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !846, file: !847, line: 557, baseType: !858, size: 8, offset: 1304)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !846, file: !847, line: 558, baseType: !858, size: 8, offset: 1312)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !846, file: !847, line: 559, baseType: !858, size: 8, offset: 1320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !846, file: !847, line: 560, baseType: !858, size: 8, offset: 1328)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !846, file: !847, line: 561, baseType: !858, size: 8, offset: 1336)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !846, file: !847, line: 562, baseType: !858, size: 8, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !846, file: !847, line: 563, baseType: !858, size: 8, offset: 1352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !846, file: !847, line: 564, baseType: !858, size: 8, offset: 1360)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !846, file: !847, line: 565, baseType: !858, size: 8, offset: 1368)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !846, file: !847, line: 566, baseType: !858, size: 8, offset: 1376)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !846, file: !847, line: 567, baseType: !858, size: 8, offset: 1384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !846, file: !847, line: 568, baseType: !858, size: 8, offset: 1392)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !846, file: !847, line: 569, baseType: !858, size: 8, offset: 1400)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !846, file: !847, line: 570, baseType: !858, size: 8, offset: 1408)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !846, file: !847, line: 571, baseType: !858, size: 8, offset: 1416)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !846, file: !847, line: 572, baseType: !858, size: 8, offset: 1424)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !846, file: !847, line: 573, baseType: !858, size: 8, offset: 1432)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !846, file: !847, line: 574, baseType: !858, size: 8, offset: 1440)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !392, file: !4, line: 3405, baseType: !1014, size: 384)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !4, line: 3352, size: 384, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !4, line: 3353, baseType: !428, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1014, file: !4, line: 3356, baseType: !1018, size: 192, offset: 192)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !847, line: 578, size: 192, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !1018, file: !847, line: 580, baseType: !379, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !1018, file: !847, line: 581, baseType: !379, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !1018, file: !847, line: 582, baseType: !379, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !1018, file: !847, line: 583, baseType: !379, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !1018, file: !847, line: 584, baseType: !492, size: 8, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !1018, file: !847, line: 585, baseType: !492, size: 8, offset: 136)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !1018, file: !847, line: 586, baseType: !492, size: 8, offset: 144)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !1018, file: !847, line: 587, baseType: !492, size: 8, offset: 152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !1018, file: !847, line: 588, baseType: !492, size: 8, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !1018, file: !847, line: 589, baseType: !492, size: 8, offset: 168)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !1018, file: !847, line: 590, baseType: !492, size: 8, offset: 176)
!1031 = !{}
!1032 = !DILocalVariable(name: "type", arg: 1, scope: !386, file: !1, line: 68, type: !389)
!1033 = !DILocation(line: 68, column: 15, scope: !386)
!1034 = !DILocalVariable(name: "expr", arg: 2, scope: !386, file: !1, line: 68, type: !389)
!1035 = !DILocation(line: 68, column: 26, scope: !386)
!1036 = !DILocalVariable(name: "e", scope: !386, file: !1, line: 70, type: !389)
!1037 = !DILocation(line: 70, column: 8, scope: !386)
!1038 = !DILocation(line: 70, column: 12, scope: !386)
!1039 = !DILocalVariable(name: "code", scope: !386, file: !1, line: 71, type: !37)
!1040 = !DILocation(line: 71, column: 18, scope: !386)
!1041 = !DILocation(line: 71, column: 25, scope: !386)
!1042 = !DILocalVariable(name: "invalid_conv_diag", scope: !386, file: !1, line: 72, type: !685)
!1043 = !DILocation(line: 72, column: 15, scope: !386)
!1044 = !DILocalVariable(name: "ret", scope: !386, file: !1, line: 73, type: !389)
!1045 = !DILocation(line: 73, column: 8, scope: !386)
!1046 = !DILocalVariable(name: "loc", scope: !386, file: !1, line: 74, type: !500)
!1047 = !DILocation(line: 74, column: 14, scope: !386)
!1048 = !DILocation(line: 74, column: 20, scope: !386)
!1049 = !DILocation(line: 76, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !386, file: !1, line: 76, column: 7)
!1051 = !DILocation(line: 76, column: 15, scope: !1050)
!1052 = !DILocation(line: 76, column: 12, scope: !1050)
!1053 = !DILocation(line: 77, column: 7, scope: !1050)
!1054 = !DILocation(line: 77, column: 10, scope: !1050)
!1055 = !DILocation(line: 77, column: 18, scope: !1050)
!1056 = !DILocation(line: 77, column: 15, scope: !1050)
!1057 = !DILocation(line: 78, column: 7, scope: !1050)
!1058 = !DILocation(line: 78, column: 10, scope: !1050)
!1059 = !DILocation(line: 78, column: 30, scope: !1050)
!1060 = !DILocation(line: 78, column: 27, scope: !1050)
!1061 = !DILocation(line: 76, column: 7, scope: !386)
!1062 = !DILocation(line: 79, column: 12, scope: !1050)
!1063 = !DILocation(line: 79, column: 5, scope: !1050)
!1064 = !DILocation(line: 82, column: 18, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !386, file: !1, line: 81, column: 7)
!1066 = !DILocation(line: 82, column: 38, scope: !1065)
!1067 = !DILocation(line: 82, column: 56, scope: !1065)
!1068 = !DILocation(line: 82, column: 10, scope: !1065)
!1069 = !DILocation(line: 82, column: 8, scope: !1065)
!1070 = !DILocation(line: 81, column: 7, scope: !386)
!1071 = !DILocation(line: 84, column: 14, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1065, file: !1, line: 83, column: 5)
!1073 = !DILocation(line: 84, column: 7, scope: !1072)
!1074 = !DILocation(line: 85, column: 14, scope: !1072)
!1075 = !DILocation(line: 85, column: 7, scope: !1072)
!1076 = !DILocation(line: 88, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !386, file: !1, line: 88, column: 7)
!1078 = !DILocation(line: 88, column: 15, scope: !1077)
!1079 = !DILocation(line: 88, column: 12, scope: !1077)
!1080 = !DILocation(line: 88, column: 7, scope: !386)
!1081 = !DILocation(line: 89, column: 12, scope: !1077)
!1082 = !DILocation(line: 89, column: 5, scope: !1077)
!1083 = !DILocation(line: 90, column: 17, scope: !386)
!1084 = !DILocation(line: 90, column: 34, scope: !386)
!1085 = !DILocation(line: 90, column: 40, scope: !386)
!1086 = !DILocation(line: 90, column: 9, scope: !386)
!1087 = !DILocation(line: 90, column: 7, scope: !386)
!1088 = !DILocation(line: 91, column: 7, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !386, file: !1, line: 91, column: 7)
!1090 = !DILocation(line: 91, column: 7, scope: !386)
!1091 = !DILocation(line: 92, column: 14, scope: !1089)
!1092 = !DILocation(line: 92, column: 7, scope: !1089)
!1093 = !DILocation(line: 94, column: 3, scope: !386)
!1094 = !DILocation(line: 0, scope: !386)
!1095 = distinct !{!1095, !1093, !1093}
