; ModuleID = 'builtins.c'
source_filename = "builtins.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!3243 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!3244 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!3245 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!3246 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!3247 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!3248 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!3249 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!3250 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!3251 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!3252 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!3253 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!3254 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!3255 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!3256 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!3257 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!3258 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!3259 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!3260 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!3261 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!3262 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!3263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !1437, line: 727, baseType: !7, size: 32, elements: !3264)
!3264 = !{!3265, !3266, !3267, !3268, !3269, !3270, !3271, !3272, !3273, !3274, !3275, !3276, !3277, !3278, !3279, !3280, !3281, !3282, !3283, !3284, !3285, !3286, !3287, !3288}
!3265 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!3266 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!3267 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!3268 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!3269 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!3270 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!3271 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!3272 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!3273 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!3274 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!3275 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!3276 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!3277 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!3278 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!3279 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!3280 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!3281 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!3282 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!3283 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!3284 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!3285 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!3286 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!3287 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!3288 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!3289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gf_mask", file: !1437, line: 100, baseType: !7, size: 32, elements: !3290)
!3290 = !{!3291, !3292, !3293, !3294, !3295, !3296, !3297, !3298, !3299, !3300, !3301}
!3291 = !DIEnumerator(name: "GF_ASM_INPUT", value: 1, isUnsigned: true)
!3292 = !DIEnumerator(name: "GF_ASM_VOLATILE", value: 2, isUnsigned: true)
!3293 = !DIEnumerator(name: "GF_CALL_CANNOT_INLINE", value: 1, isUnsigned: true)
!3294 = !DIEnumerator(name: "GF_CALL_FROM_THUNK", value: 2, isUnsigned: true)
!3295 = !DIEnumerator(name: "GF_CALL_RETURN_SLOT_OPT", value: 4, isUnsigned: true)
!3296 = !DIEnumerator(name: "GF_CALL_TAILCALL", value: 8, isUnsigned: true)
!3297 = !DIEnumerator(name: "GF_CALL_VA_ARG_PACK", value: 16, isUnsigned: true)
!3298 = !DIEnumerator(name: "GF_OMP_PARALLEL_COMBINED", value: 1, isUnsigned: true)
!3299 = !DIEnumerator(name: "GF_OMP_RETURN_NOWAIT", value: 1, isUnsigned: true)
!3300 = !DIEnumerator(name: "GF_OMP_SECTION_LAST", value: 1, isUnsigned: true)
!3301 = !DIEnumerator(name: "GF_PREDICT_TAKEN", value: 32768, isUnsigned: true)
!3302 = !{!134, !7, !1445, !3303, !4732, !3431, !3344, !3584, !3504, !3479, !4734, !410, !3357, !3569, !3666, !1520, !3421, !5, !3359, !3632, !4735}
!3303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3304, size: 64)
!3304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !3305)
!3305 = !{!3306, !3339, !3347, !3360, !3378, !3389, !3394, !3404, !3410, !3424, !3436, !3474, !3969, !3997, !4014, !4015, !4020, !4029, !4035, !4040, !4044, !4048, !4383, !4430, !4436, !4442, !4449, !4462, !4476, !4493, !4505, !4527, !4542, !4714}
!3306 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3304, file: !135, line: 3372, baseType: !3307, size: 64)
!3307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !3308)
!3308 = !{!3309, !3310, !3311, !3312, !3313, !3314, !3315, !3316, !3317, !3318, !3319, !3320, !3321, !3322, !3323, !3324, !3325, !3326, !3327, !3328, !3329, !3330, !3331, !3332, !3333, !3334, !3335, !3336, !3337, !3338}
!3309 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3307, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3310 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !3307, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3311 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !3307, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!3312 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !3307, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!3313 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !3307, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!3314 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !3307, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!3315 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !3307, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!3316 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !3307, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!3317 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !3307, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!3318 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !3307, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3319 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !3307, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3320 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !3307, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3321 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !3307, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3322 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !3307, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3323 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !3307, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3324 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !3307, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3325 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !3307, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3326 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !3307, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!3327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3307, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!3328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3307, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!3329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3307, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!3330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3307, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!3331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3307, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!3332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3307, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!3333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3307, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!3334 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3307, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!3335 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !3307, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!3336 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !3307, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!3337 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !3307, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!3338 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !3307, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!3339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3304, file: !135, line: 3373, baseType: !3340, size: 192)
!3340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !3341)
!3341 = !{!3342, !3343, !3346}
!3342 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3340, file: !135, line: 403, baseType: !3307, size: 64)
!3343 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !3340, file: !135, line: 404, baseType: !3344, size: 64, offset: 64)
!3344 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !3345, line: 56, baseType: !3303)
!3345 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3340, file: !135, line: 405, baseType: !3344, size: 64, offset: 128)
!3347 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3304, file: !135, line: 3374, baseType: !3348, size: 320)
!3348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !3349)
!3349 = !{!3350, !3351}
!3350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3348, file: !135, line: 1385, baseType: !3340, size: 192)
!3351 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3348, file: !135, line: 1386, baseType: !3352, size: 128, offset: 192)
!3352 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !3353, line: 58, baseType: !3354)
!3353 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3353, line: 54, size: 128, elements: !3355)
!3355 = !{!3356, !3358}
!3356 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !3354, file: !3353, line: 56, baseType: !3357, size: 64)
!3357 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!3358 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !3354, file: !3353, line: 57, baseType: !3359, size: 64, offset: 64)
!3359 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!3360 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !3304, file: !135, line: 3375, baseType: !3361, size: 256)
!3361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !3362)
!3362 = !{!3363, !3364}
!3363 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3361, file: !135, line: 1398, baseType: !3340, size: 192)
!3364 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !3361, file: !135, line: 1399, baseType: !3365, size: 64, offset: 192)
!3365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3366, size: 64)
!3366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !3219, line: 52, size: 256, elements: !3367)
!3367 = !{!3368, !3369, !3370, !3371, !3372, !3373, !3374}
!3368 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !3366, file: !3219, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!3369 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !3366, file: !3219, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!3370 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !3366, file: !3219, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!3371 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !3366, file: !3219, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!3372 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !3366, file: !3219, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!3373 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !3366, file: !3219, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!3374 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !3366, file: !3219, line: 62, baseType: !3375, size: 192, offset: 64)
!3375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3357, size: 192, elements: !3376)
!3376 = !{!3377}
!3377 = !DISubrange(count: 3)
!3378 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !3304, file: !135, line: 3376, baseType: !3379, size: 256)
!3379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !3380)
!3380 = !{!3381, !3382}
!3381 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3379, file: !135, line: 1409, baseType: !3340, size: 192)
!3382 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !3379, file: !135, line: 1410, baseType: !3383, size: 64, offset: 192)
!3383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3384, size: 64)
!3384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !3385, line: 27, size: 192, elements: !3386)
!3385 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3386 = !{!3387, !3388}
!3387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3384, file: !3385, line: 29, baseType: !3352, size: 128)
!3388 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3384, file: !3385, line: 30, baseType: !5, size: 32, offset: 128)
!3389 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !3304, file: !135, line: 3377, baseType: !3390, size: 256)
!3390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !3391)
!3391 = !{!3392, !3393}
!3392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3390, file: !135, line: 1438, baseType: !3340, size: 192)
!3393 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3390, file: !135, line: 1439, baseType: !3344, size: 64, offset: 192)
!3394 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3304, file: !135, line: 3378, baseType: !3395, size: 256)
!3395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !3396)
!3396 = !{!3397, !3398, !3399}
!3397 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3395, file: !135, line: 1419, baseType: !3340, size: 192)
!3398 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !3395, file: !135, line: 1420, baseType: !1445, size: 32, offset: 192)
!3399 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3395, file: !135, line: 1421, baseType: !3400, size: 8, offset: 224)
!3400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3401, size: 8, elements: !3402)
!3401 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!3402 = !{!3403}
!3403 = !DISubrange(count: 1)
!3404 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !3304, file: !135, line: 3379, baseType: !3405, size: 320)
!3405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !3406)
!3406 = !{!3407, !3408, !3409}
!3407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3405, file: !135, line: 1429, baseType: !3340, size: 192)
!3408 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !3405, file: !135, line: 1430, baseType: !3344, size: 64, offset: 192)
!3409 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !3405, file: !135, line: 1431, baseType: !3344, size: 64, offset: 256)
!3410 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !3304, file: !135, line: 3380, baseType: !3411, size: 320)
!3411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !3412)
!3412 = !{!3413, !3414}
!3413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3411, file: !135, line: 1461, baseType: !3340, size: 192)
!3414 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !3411, file: !135, line: 1462, baseType: !3415, size: 128, offset: 192)
!3415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !3416, line: 31, size: 128, elements: !3417)
!3416 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3417 = !{!3418, !3422, !3423}
!3418 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3415, file: !3416, line: 32, baseType: !3419, size: 64)
!3419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3420, size: 64)
!3420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3421)
!3421 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!3422 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !3415, file: !3416, line: 33, baseType: !7, size: 32, offset: 64)
!3423 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !3415, file: !3416, line: 34, baseType: !7, size: 32, offset: 96)
!3424 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !3304, file: !135, line: 3381, baseType: !3425, size: 384)
!3425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !3426)
!3426 = !{!3427, !3428, !3433, !3434, !3435}
!3427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3425, file: !135, line: 2508, baseType: !3340, size: 192)
!3428 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3425, file: !135, line: 2509, baseType: !3429, size: 32, offset: 192)
!3429 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !3430, line: 58, baseType: !3431)
!3430 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3431 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !3432, line: 44, baseType: !7)
!3432 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3433 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3425, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!3434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3425, file: !135, line: 2511, baseType: !3344, size: 64, offset: 256)
!3435 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !3425, file: !135, line: 2512, baseType: !3344, size: 64, offset: 320)
!3436 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !3304, file: !135, line: 3382, baseType: !3437, size: 896)
!3437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !3438)
!3438 = !{!3439, !3440, !3441, !3442, !3443, !3444, !3445, !3446, !3447, !3448, !3449, !3450, !3451, !3452, !3453, !3454, !3455, !3456, !3457, !3458, !3459, !3460, !3461, !3462, !3463, !3464, !3465, !3466, !3467, !3468, !3469, !3470, !3471}
!3439 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3437, file: !135, line: 2653, baseType: !3425, size: 384)
!3440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3437, file: !135, line: 2654, baseType: !3344, size: 64, offset: 384)
!3441 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3437, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!3442 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !3437, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!3443 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !3437, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!3444 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !3437, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!3445 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3437, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!3446 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !3437, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!3447 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !3437, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!3448 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !3437, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!3449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3437, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!3450 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3437, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!3451 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3437, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!3452 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3437, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!3453 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3437, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!3454 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3437, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!3455 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3437, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!3456 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !3437, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!3457 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !3437, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!3458 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !3437, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!3459 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !3437, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!3460 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !3437, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!3461 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !3437, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!3462 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !3437, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!3463 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !3437, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!3464 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !3437, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!3465 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !3437, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!3466 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3437, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!3467 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3437, file: !135, line: 2705, baseType: !3344, size: 64, offset: 576)
!3468 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3437, file: !135, line: 2706, baseType: !3344, size: 64, offset: 640)
!3469 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3437, file: !135, line: 2707, baseType: !3344, size: 64, offset: 704)
!3470 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3437, file: !135, line: 2708, baseType: !3344, size: 64, offset: 768)
!3471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3437, file: !135, line: 2711, baseType: !3472, size: 64, offset: 832)
!3472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3473, size: 64)
!3473 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!3474 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !3304, file: !135, line: 3383, baseType: !3475, size: 960)
!3475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !3476)
!3476 = !{!3477, !3478}
!3477 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3475, file: !135, line: 2757, baseType: !3437, size: 896)
!3478 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3475, file: !135, line: 2758, baseType: !3479, size: 64, offset: 896)
!3479 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !3345, line: 50, baseType: !3480)
!3480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3481, size: 64)
!3481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !411, line: 240, size: 384, elements: !3482)
!3482 = !{!3483, !3484, !3485, !3486, !3487, !3488, !3489, !3490, !3491, !3492, !3493}
!3483 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3481, file: !411, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3484 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3481, file: !411, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3485 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !3481, file: !411, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3486 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !3481, file: !411, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3487 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !3481, file: !411, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3488 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !3481, file: !411, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3489 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !3481, file: !411, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3490 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3481, file: !411, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !3481, file: !411, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3492 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !3481, file: !411, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3493 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3481, file: !411, line: 321, baseType: !3494, size: 320, offset: 64)
!3494 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !411, line: 315, size: 320, elements: !3495)
!3495 = !{!3496, !3902, !3904, !3967, !3968}
!3496 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3494, file: !411, line: 316, baseType: !3497, size: 64)
!3497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3498, size: 64, elements: !3402)
!3498 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !411, line: 183, baseType: !3499)
!3499 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !411, line: 166, size: 64, elements: !3500)
!3500 = !{!3501, !3502, !3503, !3506, !3507, !3515, !3516, !3528, !3531, !3593, !3594, !3879, !3892, !3899}
!3501 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !3499, file: !411, line: 168, baseType: !1445, size: 32)
!3502 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !3499, file: !411, line: 169, baseType: !7, size: 32)
!3503 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !3499, file: !411, line: 170, baseType: !3504, size: 64)
!3504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3505, size: 64)
!3505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3401)
!3506 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !3499, file: !411, line: 171, baseType: !3479, size: 64)
!3507 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !3499, file: !411, line: 172, baseType: !3508, size: 64)
!3508 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !3345, line: 53, baseType: !3509)
!3509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3510, size: 64)
!3510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !411, line: 359, size: 128, elements: !3511)
!3511 = !{!3512, !3513}
!3512 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !3510, file: !411, line: 360, baseType: !1445, size: 32)
!3513 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !3510, file: !411, line: 361, baseType: !3514, size: 64, offset: 64)
!3514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3479, size: 64, elements: !3402)
!3515 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !3499, file: !411, line: 173, baseType: !5, size: 32)
!3516 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !3499, file: !411, line: 174, baseType: !3517, size: 32)
!3517 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !411, line: 133, baseType: !3518)
!3518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 115, size: 32, elements: !3519)
!3519 = !{!3520, !3521, !3522, !3523, !3524, !3525, !3526, !3527}
!3520 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !3518, file: !411, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3521 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !3518, file: !411, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3522 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !3518, file: !411, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3523 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !3518, file: !411, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3524 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !3518, file: !411, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3525 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !3518, file: !411, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!3526 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !3518, file: !411, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3527 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !3518, file: !411, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3528 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !3499, file: !411, line: 175, baseType: !3529, size: 64)
!3529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3530, size: 64)
!3530 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !411, line: 175, flags: DIFlagFwdDecl)
!3531 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !3499, file: !411, line: 176, baseType: !3532, size: 64)
!3532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3533, size: 64)
!3533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !3534, line: 75, size: 256, elements: !3535)
!3534 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3535 = !{!3536, !3550, !3551, !3552}
!3536 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3533, file: !3534, line: 76, baseType: !3537, size: 64)
!3537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3538, size: 64)
!3538 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !3534, line: 68, baseType: !3539)
!3539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !3534, line: 63, size: 320, elements: !3540)
!3540 = !{!3541, !3543, !3544, !3545}
!3541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3539, file: !3534, line: 64, baseType: !3542, size: 64)
!3542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3539, size: 64)
!3543 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3539, file: !3534, line: 65, baseType: !3542, size: 64, offset: 64)
!3544 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3539, file: !3534, line: 66, baseType: !7, size: 32, offset: 128)
!3545 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !3539, file: !3534, line: 67, baseType: !3546, size: 128, offset: 192)
!3546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3547, size: 128, elements: !3548)
!3547 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !3534, line: 29, baseType: !3357)
!3548 = !{!3549}
!3549 = !DISubrange(count: 2)
!3550 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !3533, file: !3534, line: 77, baseType: !3537, size: 64, offset: 64)
!3551 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3533, file: !3534, line: 78, baseType: !7, size: 32, offset: 128)
!3552 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3533, file: !3534, line: 79, baseType: !3553, size: 64, offset: 192)
!3553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3554, size: 64)
!3554 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !3534, line: 49, baseType: !3555)
!3555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !3534, line: 45, size: 832, elements: !3556)
!3556 = !{!3557, !3558, !3559}
!3557 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3555, file: !3534, line: 46, baseType: !3542, size: 64)
!3558 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !3555, file: !3534, line: 47, baseType: !3532, size: 64, offset: 64)
!3559 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3555, file: !3534, line: 48, baseType: !3560, size: 704, offset: 128)
!3560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !3561, line: 164, size: 704, elements: !3562)
!3561 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3562 = !{!3563, !3564, !3575, !3576, !3577, !3578, !3579, !3580, !3585, !3589, !3590, !3591, !3592}
!3563 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !3560, file: !3561, line: 166, baseType: !3359, size: 64)
!3564 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !3560, file: !3561, line: 167, baseType: !3565, size: 64, offset: 64)
!3565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3566, size: 64)
!3566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !3561, line: 157, size: 192, elements: !3567)
!3567 = !{!3568, !3570, !3571}
!3568 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !3566, file: !3561, line: 159, baseType: !3569, size: 64)
!3569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3401, size: 64)
!3570 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3566, file: !3561, line: 160, baseType: !3565, size: 64, offset: 64)
!3571 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !3566, file: !3561, line: 161, baseType: !3572, size: 32, offset: 128)
!3572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3401, size: 32, elements: !3573)
!3573 = !{!3574}
!3574 = !DISubrange(count: 4)
!3575 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !3560, file: !3561, line: 168, baseType: !3569, size: 64, offset: 128)
!3576 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3560, file: !3561, line: 169, baseType: !3569, size: 64, offset: 192)
!3577 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !3560, file: !3561, line: 170, baseType: !3569, size: 64, offset: 256)
!3578 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !3560, file: !3561, line: 171, baseType: !3359, size: 64, offset: 320)
!3579 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !3560, file: !3561, line: 172, baseType: !1445, size: 32, offset: 384)
!3580 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !3560, file: !3561, line: 176, baseType: !3581, size: 64, offset: 448)
!3581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3582, size: 64)
!3582 = !DISubroutineType(types: !3583)
!3583 = !{!3565, !3584, !3359}
!3584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!3585 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !3560, file: !3561, line: 177, baseType: !3586, size: 64, offset: 512)
!3586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3587, size: 64)
!3587 = !DISubroutineType(types: !3588)
!3588 = !{null, !3584, !3565}
!3589 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !3560, file: !3561, line: 178, baseType: !3584, size: 64, offset: 576)
!3590 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !3560, file: !3561, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!3591 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !3560, file: !3561, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!3592 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !3560, file: !3561, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!3593 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !3499, file: !411, line: 177, baseType: !3344, size: 64)
!3594 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !3499, file: !411, line: 178, baseType: !3595, size: 64)
!3595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3596, size: 64)
!3596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !3597)
!3597 = !{!3598, !3844, !3845, !3846, !3849, !3853, !3854, !3855, !3873, !3874, !3875, !3876, !3877, !3878}
!3598 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !3596, file: !337, line: 219, baseType: !3599, size: 64)
!3599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3600, size: 64)
!3600 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !3601)
!3601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !3602)
!3602 = !{!3603}
!3603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3601, file: !337, line: 151, baseType: !3604, size: 128)
!3604 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !3605)
!3605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !3606)
!3606 = !{!3607, !3608, !3609}
!3607 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3605, file: !337, line: 150, baseType: !7, size: 32)
!3608 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3605, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!3609 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3605, file: !337, line: 150, baseType: !3610, size: 64, offset: 64)
!3610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3611, size: 64, elements: !3402)
!3611 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !3345, line: 108, baseType: !3612)
!3612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3613, size: 64)
!3613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !3614)
!3614 = !{!3615, !3616, !3617, !3836, !3837, !3838, !3839, !3840, !3841, !3842}
!3615 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !3613, file: !337, line: 124, baseType: !3595, size: 64)
!3616 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !3613, file: !337, line: 125, baseType: !3595, size: 64, offset: 64)
!3617 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !3613, file: !337, line: 131, baseType: !3618, size: 64, offset: 128)
!3618 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !3619)
!3619 = !{!3620, !3835}
!3620 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !3618, file: !337, line: 129, baseType: !3621, size: 64)
!3621 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !3345, line: 66, baseType: !3622)
!3622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3623, size: 64)
!3623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1437, line: 143, size: 192, elements: !3624)
!3624 = !{!3625, !3833, !3834}
!3625 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3623, file: !1437, line: 145, baseType: !3626, size: 64)
!3626 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !3345, line: 69, baseType: !3627)
!3627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3628, size: 64)
!3628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1437, line: 136, size: 192, elements: !3629)
!3629 = !{!3630, !3831, !3832}
!3630 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3628, file: !1437, line: 137, baseType: !3631, size: 64)
!3631 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !3345, line: 58, baseType: !3632)
!3632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3633, size: 64)
!3633 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1437, line: 737, size: 768, elements: !3634)
!3634 = !{!3635, !3652, !3686, !3692, !3697, !3702, !3709, !3715, !3721, !3726, !3740, !3745, !3751, !3756, !3766, !3771, !3789, !3796, !3803, !3809, !3814, !3820, !3826}
!3635 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3633, file: !1437, line: 738, baseType: !3636, size: 256)
!3636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1437, line: 271, size: 256, elements: !3637)
!3637 = !{!3638, !3639, !3640, !3641, !3642, !3643, !3644, !3645, !3646, !3647, !3648, !3649, !3650, !3651}
!3638 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3636, file: !1437, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3639 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !3636, file: !1437, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3640 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3636, file: !1437, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3641 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !3636, file: !1437, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3642 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !3636, file: !1437, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3643 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !3636, file: !1437, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3644 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !3636, file: !1437, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!3645 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !3636, file: !1437, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!3646 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !3636, file: !1437, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3647 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3636, file: !1437, line: 312, baseType: !7, size: 32, offset: 32)
!3648 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !3636, file: !1437, line: 316, baseType: !3429, size: 32, offset: 64)
!3649 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !3636, file: !1437, line: 319, baseType: !7, size: 32, offset: 96)
!3650 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !3636, file: !1437, line: 323, baseType: !3595, size: 64, offset: 128)
!3651 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3636, file: !1437, line: 327, baseType: !3344, size: 64, offset: 192)
!3652 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !3633, file: !1437, line: 739, baseType: !3653, size: 448)
!3653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1437, line: 350, size: 448, elements: !3654)
!3654 = !{!3655, !3684}
!3655 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3653, file: !1437, line: 353, baseType: !3656, size: 384)
!3656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1437, line: 333, size: 384, elements: !3657)
!3657 = !{!3658, !3659, !3667}
!3658 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3656, file: !1437, line: 336, baseType: !3636, size: 256)
!3659 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !3656, file: !1437, line: 343, baseType: !3660, size: 64, offset: 256)
!3660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3661, size: 64)
!3661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !3662, line: 37, size: 128, elements: !3663)
!3662 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3663 = !{!3664, !3665}
!3664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3661, file: !3662, line: 39, baseType: !3660, size: 64)
!3665 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !3661, file: !3662, line: 40, baseType: !3666, size: 64, offset: 64)
!3666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3344, size: 64)
!3667 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !3656, file: !1437, line: 344, baseType: !3668, size: 64, offset: 320)
!3668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3669, size: 64)
!3669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !3662, line: 45, size: 320, elements: !3670)
!3670 = !{!3671, !3672}
!3671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3669, file: !3662, line: 47, baseType: !3668, size: 64)
!3672 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !3669, file: !3662, line: 48, baseType: !3673, size: 256, offset: 64)
!3673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !3674)
!3674 = !{!3675, !3677, !3678, !3683}
!3675 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3673, file: !135, line: 1884, baseType: !3676, size: 64)
!3676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3673, size: 64)
!3677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3673, file: !135, line: 1885, baseType: !3676, size: 64, offset: 64)
!3678 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !3673, file: !135, line: 1891, baseType: !3679, size: 64, offset: 128)
!3679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3673, file: !135, line: 1891, size: 64, elements: !3680)
!3680 = !{!3681, !3682}
!3681 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3679, file: !135, line: 1891, baseType: !3631, size: 64)
!3682 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3679, file: !135, line: 1891, baseType: !3344, size: 64)
!3683 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !3673, file: !135, line: 1892, baseType: !3666, size: 64, offset: 192)
!3684 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3653, file: !1437, line: 359, baseType: !3685, size: 64, offset: 384)
!3685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3344, size: 64, elements: !3402)
!3686 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !3633, file: !1437, line: 740, baseType: !3687, size: 512)
!3687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1437, line: 365, size: 512, elements: !3688)
!3688 = !{!3689, !3690, !3691}
!3689 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3687, file: !1437, line: 368, baseType: !3656, size: 384)
!3690 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !3687, file: !1437, line: 373, baseType: !3344, size: 64, offset: 384)
!3691 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !3687, file: !1437, line: 374, baseType: !3344, size: 64, offset: 448)
!3692 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !3633, file: !1437, line: 741, baseType: !3693, size: 576)
!3693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1437, line: 380, size: 576, elements: !3694)
!3694 = !{!3695, !3696}
!3695 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3693, file: !1437, line: 383, baseType: !3687, size: 512)
!3696 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3693, file: !1437, line: 389, baseType: !3685, size: 64, offset: 512)
!3697 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3633, file: !1437, line: 742, baseType: !3698, size: 320)
!3698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1437, line: 395, size: 320, elements: !3699)
!3699 = !{!3700, !3701}
!3700 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3698, file: !1437, line: 397, baseType: !3636, size: 256)
!3701 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3698, file: !1437, line: 400, baseType: !3621, size: 64, offset: 256)
!3702 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !3633, file: !1437, line: 743, baseType: !3703, size: 448)
!3703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1437, line: 406, size: 448, elements: !3704)
!3704 = !{!3705, !3706, !3707, !3708}
!3705 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3703, file: !1437, line: 408, baseType: !3636, size: 256)
!3706 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !3703, file: !1437, line: 412, baseType: !3344, size: 64, offset: 256)
!3707 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3703, file: !1437, line: 420, baseType: !3344, size: 64, offset: 320)
!3708 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3703, file: !1437, line: 423, baseType: !3621, size: 64, offset: 384)
!3709 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !3633, file: !1437, line: 744, baseType: !3710, size: 384)
!3710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1437, line: 429, size: 384, elements: !3711)
!3711 = !{!3712, !3713, !3714}
!3712 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3710, file: !1437, line: 431, baseType: !3636, size: 256)
!3713 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3710, file: !1437, line: 434, baseType: !3344, size: 64, offset: 256)
!3714 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !3710, file: !1437, line: 437, baseType: !3621, size: 64, offset: 320)
!3715 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !3633, file: !1437, line: 745, baseType: !3716, size: 384)
!3716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1437, line: 443, size: 384, elements: !3717)
!3717 = !{!3718, !3719, !3720}
!3718 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3716, file: !1437, line: 445, baseType: !3636, size: 256)
!3719 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3716, file: !1437, line: 449, baseType: !3344, size: 64, offset: 256)
!3720 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !3716, file: !1437, line: 453, baseType: !3621, size: 64, offset: 320)
!3721 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !3633, file: !1437, line: 746, baseType: !3722, size: 320)
!3722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1437, line: 459, size: 320, elements: !3723)
!3723 = !{!3724, !3725}
!3724 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3722, file: !1437, line: 461, baseType: !3636, size: 256)
!3725 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !3722, file: !1437, line: 464, baseType: !3344, size: 64, offset: 256)
!3726 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !3633, file: !1437, line: 747, baseType: !3727, size: 768)
!3727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1437, line: 469, size: 768, elements: !3728)
!3728 = !{!3729, !3730, !3731, !3732, !3733}
!3729 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3727, file: !1437, line: 471, baseType: !3636, size: 256)
!3730 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !3727, file: !1437, line: 474, baseType: !7, size: 32, offset: 256)
!3731 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !3727, file: !1437, line: 475, baseType: !7, size: 32, offset: 288)
!3732 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3727, file: !1437, line: 478, baseType: !3344, size: 64, offset: 320)
!3733 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !3727, file: !1437, line: 481, baseType: !3734, size: 384, offset: 384)
!3734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3735, size: 384, elements: !3402)
!3735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !3736)
!3736 = !{!3737, !3738, !3739}
!3737 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !3735, file: !135, line: 1920, baseType: !3673, size: 256)
!3738 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !3735, file: !135, line: 1921, baseType: !3344, size: 64, offset: 256)
!3739 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3735, file: !135, line: 1922, baseType: !3429, size: 32, offset: 320)
!3740 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !3633, file: !1437, line: 748, baseType: !3741, size: 320)
!3741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1437, line: 487, size: 320, elements: !3742)
!3742 = !{!3743, !3744}
!3743 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3741, file: !1437, line: 490, baseType: !3636, size: 256)
!3744 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !3741, file: !1437, line: 494, baseType: !1445, size: 32, offset: 256)
!3745 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !3633, file: !1437, line: 749, baseType: !3746, size: 384)
!3746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1437, line: 500, size: 384, elements: !3747)
!3747 = !{!3748, !3749, !3750}
!3748 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3746, file: !1437, line: 502, baseType: !3636, size: 256)
!3749 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !3746, file: !1437, line: 506, baseType: !3621, size: 64, offset: 256)
!3750 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3746, file: !1437, line: 510, baseType: !3621, size: 64, offset: 320)
!3751 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !3633, file: !1437, line: 750, baseType: !3752, size: 320)
!3752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1437, line: 529, size: 320, elements: !3753)
!3753 = !{!3754, !3755}
!3754 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3752, file: !1437, line: 531, baseType: !3636, size: 256)
!3755 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3752, file: !1437, line: 540, baseType: !3621, size: 64, offset: 256)
!3756 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !3633, file: !1437, line: 751, baseType: !3757, size: 704)
!3757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1437, line: 546, size: 704, elements: !3758)
!3758 = !{!3759, !3760, !3761, !3762, !3763, !3764, !3765}
!3759 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3757, file: !1437, line: 549, baseType: !3687, size: 512)
!3760 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3757, file: !1437, line: 553, baseType: !3504, size: 64, offset: 512)
!3761 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !3757, file: !1437, line: 557, baseType: !3421, size: 8, offset: 576)
!3762 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !3757, file: !1437, line: 558, baseType: !3421, size: 8, offset: 584)
!3763 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !3757, file: !1437, line: 559, baseType: !3421, size: 8, offset: 592)
!3764 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !3757, file: !1437, line: 560, baseType: !3421, size: 8, offset: 600)
!3765 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3757, file: !1437, line: 566, baseType: !3685, size: 64, offset: 640)
!3766 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !3633, file: !1437, line: 752, baseType: !3767, size: 384)
!3767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1437, line: 571, size: 384, elements: !3768)
!3768 = !{!3769, !3770}
!3769 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3767, file: !1437, line: 573, baseType: !3698, size: 320)
!3770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3767, file: !1437, line: 577, baseType: !3344, size: 64, offset: 320)
!3771 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !3633, file: !1437, line: 753, baseType: !3772, size: 576)
!3772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1437, line: 600, size: 576, elements: !3773)
!3773 = !{!3774, !3775, !3776, !3779, !3788}
!3774 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3772, file: !1437, line: 602, baseType: !3698, size: 320)
!3775 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3772, file: !1437, line: 605, baseType: !3344, size: 64, offset: 320)
!3776 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !3772, file: !1437, line: 609, baseType: !3777, size: 64, offset: 384)
!3777 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !3778, line: 46, baseType: !3357)
!3778 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!3779 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !3772, file: !1437, line: 612, baseType: !3780, size: 64, offset: 448)
!3780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3781, size: 64)
!3781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1437, line: 581, size: 320, elements: !3782)
!3782 = !{!3783, !3784, !3785, !3786, !3787}
!3783 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !3781, file: !1437, line: 583, baseType: !134, size: 32)
!3784 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3781, file: !1437, line: 586, baseType: !3344, size: 64, offset: 64)
!3785 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3781, file: !1437, line: 589, baseType: !3344, size: 64, offset: 128)
!3786 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !3781, file: !1437, line: 592, baseType: !3344, size: 64, offset: 192)
!3787 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !3781, file: !1437, line: 595, baseType: !3344, size: 64, offset: 256)
!3788 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !3772, file: !1437, line: 616, baseType: !3621, size: 64, offset: 512)
!3789 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !3633, file: !1437, line: 754, baseType: !3790, size: 512)
!3790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1437, line: 622, size: 512, elements: !3791)
!3791 = !{!3792, !3793, !3794, !3795}
!3792 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3790, file: !1437, line: 624, baseType: !3698, size: 320)
!3793 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3790, file: !1437, line: 628, baseType: !3344, size: 64, offset: 320)
!3794 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !3790, file: !1437, line: 632, baseType: !3344, size: 64, offset: 384)
!3795 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !3790, file: !1437, line: 636, baseType: !3344, size: 64, offset: 448)
!3796 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !3633, file: !1437, line: 755, baseType: !3797, size: 704)
!3797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1437, line: 642, size: 704, elements: !3798)
!3798 = !{!3799, !3800, !3801, !3802}
!3799 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !3797, file: !1437, line: 644, baseType: !3790, size: 512)
!3800 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !3797, file: !1437, line: 648, baseType: !3344, size: 64, offset: 512)
!3801 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !3797, file: !1437, line: 652, baseType: !3344, size: 64, offset: 576)
!3802 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !3797, file: !1437, line: 653, baseType: !3344, size: 64, offset: 640)
!3803 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !3633, file: !1437, line: 756, baseType: !3804, size: 448)
!3804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1437, line: 663, size: 448, elements: !3805)
!3805 = !{!3806, !3807, !3808}
!3806 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3804, file: !1437, line: 665, baseType: !3698, size: 320)
!3807 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3804, file: !1437, line: 668, baseType: !3344, size: 64, offset: 320)
!3808 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !3804, file: !1437, line: 673, baseType: !3344, size: 64, offset: 384)
!3809 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !3633, file: !1437, line: 757, baseType: !3810, size: 384)
!3810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1437, line: 694, size: 384, elements: !3811)
!3811 = !{!3812, !3813}
!3812 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3810, file: !1437, line: 696, baseType: !3698, size: 320)
!3813 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3810, file: !1437, line: 699, baseType: !3344, size: 64, offset: 320)
!3814 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !3633, file: !1437, line: 758, baseType: !3815, size: 384)
!3815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1437, line: 681, size: 384, elements: !3816)
!3816 = !{!3817, !3818, !3819}
!3817 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3815, file: !1437, line: 683, baseType: !3636, size: 256)
!3818 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !3815, file: !1437, line: 686, baseType: !3344, size: 64, offset: 256)
!3819 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !3815, file: !1437, line: 689, baseType: !3344, size: 64, offset: 320)
!3820 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !3633, file: !1437, line: 759, baseType: !3821, size: 384)
!3821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1437, line: 707, size: 384, elements: !3822)
!3822 = !{!3823, !3824, !3825}
!3823 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3821, file: !1437, line: 709, baseType: !3636, size: 256)
!3824 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !3821, file: !1437, line: 712, baseType: !3344, size: 64, offset: 256)
!3825 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !3821, file: !1437, line: 712, baseType: !3344, size: 64, offset: 320)
!3826 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !3633, file: !1437, line: 760, baseType: !3827, size: 320)
!3827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1437, line: 718, size: 320, elements: !3828)
!3828 = !{!3829, !3830}
!3829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3827, file: !1437, line: 720, baseType: !3636, size: 256)
!3830 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !3827, file: !1437, line: 723, baseType: !3344, size: 64, offset: 256)
!3831 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3628, file: !1437, line: 138, baseType: !3627, size: 64, offset: 64)
!3832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3628, file: !1437, line: 139, baseType: !3627, size: 64, offset: 128)
!3833 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !3623, file: !1437, line: 146, baseType: !3626, size: 64, offset: 64)
!3834 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3623, file: !1437, line: 152, baseType: !3621, size: 64, offset: 128)
!3835 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !3618, file: !337, line: 130, baseType: !3479, size: 64)
!3836 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3613, file: !337, line: 134, baseType: !3584, size: 64, offset: 192)
!3837 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !3613, file: !337, line: 137, baseType: !3344, size: 64, offset: 256)
!3838 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !3613, file: !337, line: 138, baseType: !3429, size: 32, offset: 320)
!3839 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !3613, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!3840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3613, file: !337, line: 144, baseType: !1445, size: 32, offset: 384)
!3841 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !3613, file: !337, line: 145, baseType: !1445, size: 32, offset: 416)
!3842 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3613, file: !337, line: 146, baseType: !3843, size: 64, offset: 448)
!3843 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !3359)
!3844 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !3596, file: !337, line: 220, baseType: !3599, size: 64, offset: 64)
!3845 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3596, file: !337, line: 223, baseType: !3584, size: 64, offset: 128)
!3846 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !3596, file: !337, line: 226, baseType: !3847, size: 64, offset: 192)
!3847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3848, size: 64)
!3848 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!3849 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !3596, file: !337, line: 229, baseType: !3850, size: 128, offset: 256)
!3850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3851, size: 128, elements: !3548)
!3851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3852, size: 64)
!3852 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!3853 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !3596, file: !337, line: 232, baseType: !3595, size: 64, offset: 384)
!3854 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !3596, file: !337, line: 233, baseType: !3595, size: 64, offset: 448)
!3855 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !3596, file: !337, line: 238, baseType: !3856, size: 64, offset: 512)
!3856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !3857)
!3857 = !{!3858, !3864}
!3858 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !3856, file: !337, line: 236, baseType: !3859, size: 64)
!3859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3860, size: 64)
!3860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !3861)
!3861 = !{!3862, !3863}
!3862 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !3860, file: !337, line: 275, baseType: !3621, size: 64)
!3863 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !3860, file: !337, line: 278, baseType: !3621, size: 64, offset: 64)
!3864 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3856, file: !337, line: 237, baseType: !3865, size: 64)
!3865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3866, size: 64)
!3866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !3867)
!3867 = !{!3868, !3869, !3870, !3871, !3872}
!3868 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !3866, file: !337, line: 261, baseType: !3479, size: 64)
!3869 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !3866, file: !337, line: 262, baseType: !3479, size: 64, offset: 64)
!3870 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !3866, file: !337, line: 266, baseType: !3479, size: 64, offset: 128)
!3871 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !3866, file: !337, line: 267, baseType: !3479, size: 64, offset: 192)
!3872 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3866, file: !337, line: 270, baseType: !1445, size: 32, offset: 256)
!3873 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3596, file: !337, line: 241, baseType: !3843, size: 64, offset: 576)
!3874 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3596, file: !337, line: 244, baseType: !1445, size: 32, offset: 640)
!3875 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !3596, file: !337, line: 247, baseType: !1445, size: 32, offset: 672)
!3876 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !3596, file: !337, line: 250, baseType: !1445, size: 32, offset: 704)
!3877 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !3596, file: !337, line: 253, baseType: !1445, size: 32, offset: 736)
!3878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3596, file: !337, line: 256, baseType: !1445, size: 32, offset: 768)
!3879 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !3499, file: !411, line: 179, baseType: !3880, size: 64)
!3880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3881, size: 64)
!3881 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !411, line: 150, baseType: !3882)
!3882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !411, line: 142, size: 320, elements: !3883)
!3883 = !{!3884, !3885, !3886, !3887, !3890, !3891}
!3884 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !3882, file: !411, line: 144, baseType: !3344, size: 64)
!3885 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3882, file: !411, line: 145, baseType: !3479, size: 64, offset: 64)
!3886 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3882, file: !411, line: 146, baseType: !3479, size: 64, offset: 128)
!3887 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !3882, file: !411, line: 147, baseType: !3888, size: 32, offset: 192)
!3888 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !3889, line: 31, baseType: !1445)
!3889 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3890 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3882, file: !411, line: 148, baseType: !7, size: 32, offset: 224)
!3891 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !3882, file: !411, line: 149, baseType: !3421, size: 8, offset: 256)
!3892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !3499, file: !411, line: 180, baseType: !3893, size: 64)
!3893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3894, size: 64)
!3894 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !411, line: 162, baseType: !3895)
!3895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !411, line: 159, size: 128, elements: !3896)
!3896 = !{!3897, !3898}
!3897 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3895, file: !411, line: 160, baseType: !3344, size: 64)
!3898 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3895, file: !411, line: 161, baseType: !3359, size: 64, offset: 64)
!3899 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !3499, file: !411, line: 181, baseType: !3900, size: 64)
!3900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3901, size: 64)
!3901 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !411, line: 181, flags: DIFlagFwdDecl)
!3902 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !3494, file: !411, line: 317, baseType: !3903, size: 64)
!3903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3359, size: 64, elements: !3402)
!3904 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !3494, file: !411, line: 318, baseType: !3905, size: 320)
!3905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !411, line: 188, size: 320, elements: !3906)
!3906 = !{!3907, !3909, !3966}
!3907 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3905, file: !411, line: 190, baseType: !3908, size: 192)
!3908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3498, size: 192, elements: !3376)
!3909 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3905, file: !411, line: 193, baseType: !3910, size: 64, offset: 192)
!3910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3911, size: 64)
!3911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !411, line: 206, size: 320, elements: !3912)
!3912 = !{!3913, !3951, !3952, !3953, !3965}
!3913 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !3911, file: !411, line: 208, baseType: !3914, size: 64)
!3914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3915, size: 64)
!3915 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !3345, line: 62, baseType: !3916)
!3916 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !3917, line: 538, size: 256, elements: !3918)
!3917 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3918 = !{!3919, !3923, !3929, !3942}
!3919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3916, file: !3917, line: 539, baseType: !3920, size: 32)
!3920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !3917, line: 482, size: 32, elements: !3921)
!3921 = !{!3922}
!3922 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3920, file: !3917, line: 484, baseType: !7, size: 32)
!3923 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !3916, file: !3917, line: 540, baseType: !3924, size: 192)
!3924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !3917, line: 488, size: 192, elements: !3925)
!3925 = !{!3926, !3927, !3928}
!3926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3924, file: !3917, line: 489, baseType: !3920, size: 32)
!3927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3924, file: !3917, line: 492, baseType: !3504, size: 64, offset: 64)
!3928 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3924, file: !3917, line: 496, baseType: !3344, size: 64, offset: 128)
!3929 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !3916, file: !3917, line: 541, baseType: !3930, size: 256)
!3930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !3917, line: 504, size: 256, elements: !3931)
!3931 = !{!3932, !3933, !3940, !3941}
!3932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3930, file: !3917, line: 505, baseType: !3920, size: 32)
!3933 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3930, file: !3917, line: 509, baseType: !3934, size: 64, offset: 64)
!3934 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !3917, line: 501, baseType: !3935)
!3935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3936, size: 64)
!3936 = !DISubroutineType(types: !3937)
!3937 = !{null, !3938}
!3938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3939, size: 64)
!3939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!3940 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3930, file: !3917, line: 510, baseType: !3938, size: 64, offset: 128)
!3941 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3930, file: !3917, line: 513, baseType: !3914, size: 64, offset: 192)
!3942 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !3916, file: !3917, line: 542, baseType: !3943, size: 128)
!3943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !3917, line: 530, size: 128, elements: !3944)
!3944 = !{!3945, !3946}
!3945 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3943, file: !3917, line: 531, baseType: !3920, size: 32)
!3946 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3943, file: !3917, line: 534, baseType: !3947, size: 64, offset: 64)
!3947 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !3917, line: 525, baseType: !3948)
!3948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3949, size: 64)
!3949 = !DISubroutineType(types: !3950)
!3950 = !{!3421, !3344, !3504, !3357, !3357}
!3951 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !3911, file: !411, line: 211, baseType: !7, size: 32, offset: 64)
!3952 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3911, file: !411, line: 214, baseType: !3359, size: 64, offset: 128)
!3953 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !3911, file: !411, line: 224, baseType: !3954, size: 64, offset: 192)
!3954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3955, size: 64)
!3955 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !411, line: 202, baseType: !3956)
!3956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !411, line: 202, size: 128, elements: !3957)
!3957 = !{!3958}
!3958 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3956, file: !411, line: 202, baseType: !3959, size: 128)
!3959 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !411, line: 200, baseType: !3960)
!3960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !411, line: 200, size: 128, elements: !3961)
!3961 = !{!3962, !3963, !3964}
!3962 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3960, file: !411, line: 200, baseType: !7, size: 32)
!3963 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3960, file: !411, line: 200, baseType: !7, size: 32, offset: 32)
!3964 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3960, file: !411, line: 200, baseType: !3514, size: 64, offset: 64)
!3965 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !3911, file: !411, line: 234, baseType: !3954, size: 64, offset: 256)
!3966 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3905, file: !411, line: 197, baseType: !3359, size: 64, offset: 256)
!3967 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !3494, file: !411, line: 319, baseType: !3366, size: 256)
!3968 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !3494, file: !411, line: 320, baseType: !3384, size: 192)
!3969 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !3304, file: !135, line: 3384, baseType: !3970, size: 1472)
!3970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !3971)
!3971 = !{!3972, !3993, !3994, !3995, !3996}
!3972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3970, file: !135, line: 3115, baseType: !3973, size: 1216)
!3973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !3974)
!3974 = !{!3975, !3976, !3977, !3978, !3979, !3980, !3981, !3982, !3983, !3984, !3985, !3986, !3987, !3988, !3989, !3990, !3991, !3992}
!3975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3973, file: !135, line: 2985, baseType: !3475, size: 960)
!3976 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !3973, file: !135, line: 2986, baseType: !3344, size: 64, offset: 960)
!3977 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !3973, file: !135, line: 2987, baseType: !3344, size: 64, offset: 1024)
!3978 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !3973, file: !135, line: 2988, baseType: !3344, size: 64, offset: 1088)
!3979 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !3973, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!3980 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !3973, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!3981 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !3973, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!3982 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !3973, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!3983 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !3973, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!3984 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !3973, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!3985 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !3973, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!3986 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !3973, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!3987 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !3973, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!3988 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !3973, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!3989 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !3973, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!3990 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !3973, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!3991 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !3973, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!3992 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !3973, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!3993 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !3970, file: !135, line: 3117, baseType: !3344, size: 64, offset: 1216)
!3994 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !3970, file: !135, line: 3119, baseType: !3344, size: 64, offset: 1280)
!3995 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3970, file: !135, line: 3121, baseType: !3344, size: 64, offset: 1344)
!3996 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !3970, file: !135, line: 3123, baseType: !3344, size: 64, offset: 1408)
!3997 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !3304, file: !135, line: 3385, baseType: !3998, size: 1088)
!3998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !3999)
!3999 = !{!4000, !4001, !4002}
!4000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3998, file: !135, line: 2875, baseType: !3475, size: 960)
!4001 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !3998, file: !135, line: 2876, baseType: !3479, size: 64, offset: 960)
!4002 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3998, file: !135, line: 2877, baseType: !4003, size: 64, offset: 1024)
!4003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4004, size: 64)
!4004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4005, line: 172, size: 128, elements: !4006)
!4005 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4006 = !{!4007, !4008, !4009, !4010, !4011, !4012, !4013}
!4007 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !4004, file: !4005, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!4008 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !4004, file: !4005, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!4009 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !4004, file: !4005, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!4010 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !4004, file: !4005, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!4011 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !4004, file: !4005, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!4012 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !4004, file: !4005, line: 195, baseType: !7, size: 32, offset: 32)
!4013 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !4004, file: !4005, line: 199, baseType: !3344, size: 64, offset: 64)
!4014 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !3304, file: !135, line: 3386, baseType: !3973, size: 1216)
!4015 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !3304, file: !135, line: 3387, baseType: !4016, size: 1280)
!4016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !4017)
!4017 = !{!4018, !4019}
!4018 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4016, file: !135, line: 3094, baseType: !3973, size: 1216)
!4019 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !4016, file: !135, line: 3095, baseType: !4003, size: 64, offset: 1216)
!4020 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !3304, file: !135, line: 3388, baseType: !4021, size: 1216)
!4021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !4022)
!4022 = !{!4023, !4024, !4025, !4026, !4027, !4028}
!4023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4021, file: !135, line: 2825, baseType: !3437, size: 896)
!4024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !4021, file: !135, line: 2827, baseType: !3344, size: 64, offset: 896)
!4025 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !4021, file: !135, line: 2828, baseType: !3344, size: 64, offset: 960)
!4026 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !4021, file: !135, line: 2829, baseType: !3344, size: 64, offset: 1024)
!4027 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !4021, file: !135, line: 2830, baseType: !3344, size: 64, offset: 1088)
!4028 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !4021, file: !135, line: 2831, baseType: !3344, size: 64, offset: 1152)
!4029 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !3304, file: !135, line: 3389, baseType: !4030, size: 1024)
!4030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !4031)
!4031 = !{!4032, !4033, !4034}
!4032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4030, file: !135, line: 2851, baseType: !3475, size: 960)
!4033 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !4030, file: !135, line: 2852, baseType: !1445, size: 32, offset: 960)
!4034 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !4030, file: !135, line: 2853, baseType: !1445, size: 32, offset: 992)
!4035 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !3304, file: !135, line: 3390, baseType: !4036, size: 1024)
!4036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !4037)
!4037 = !{!4038, !4039}
!4038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4036, file: !135, line: 2858, baseType: !3475, size: 960)
!4039 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !4036, file: !135, line: 2859, baseType: !4003, size: 64, offset: 960)
!4040 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !3304, file: !135, line: 3391, baseType: !4041, size: 960)
!4041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !4042)
!4042 = !{!4043}
!4043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4041, file: !135, line: 2863, baseType: !3475, size: 960)
!4044 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !3304, file: !135, line: 3392, baseType: !4045, size: 1472)
!4045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !4046)
!4046 = !{!4047}
!4047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4045, file: !135, line: 3305, baseType: !3970, size: 1472)
!4048 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !3304, file: !135, line: 3393, baseType: !4049, size: 1792)
!4049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !4050)
!4050 = !{!4051, !4052, !4362, !4363, !4364, !4365, !4366, !4367, !4368, !4369, !4370, !4371, !4372, !4373, !4374, !4375, !4376, !4377, !4378, !4379, !4380, !4381, !4382}
!4051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4049, file: !135, line: 3249, baseType: !3970, size: 1472)
!4052 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !4049, file: !135, line: 3251, baseType: !4053, size: 64, offset: 1472)
!4053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4054, size: 64)
!4054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !4055, line: 463, size: 1152, elements: !4056)
!4055 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4056 = !{!4057, !4216, !4247, !4248, !4303, !4306, !4307, !4308, !4309, !4310, !4311, !4335, !4338, !4339, !4340, !4341, !4342, !4343, !4344, !4345, !4346, !4347, !4348, !4349, !4350, !4351, !4352, !4353, !4354, !4355, !4356, !4357, !4358, !4359, !4360, !4361}
!4057 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !4054, file: !4055, line: 464, baseType: !4058, size: 64)
!4058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4059, size: 64)
!4059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !4060)
!4060 = !{!4061, !4110, !4123, !4137, !4185, !4197}
!4061 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !4059, file: !330, line: 197, baseType: !4062, size: 64)
!4062 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !4063)
!4063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4064, size: 64)
!4064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !4065)
!4065 = !{!4066, !4067, !4068, !4069, !4070, !4071, !4098, !4107, !4108, !4109}
!4066 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !4064, file: !330, line: 119, baseType: !4063, size: 64)
!4067 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !4064, file: !330, line: 122, baseType: !4063, size: 64, offset: 64)
!4068 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !4064, file: !330, line: 123, baseType: !4063, size: 64, offset: 128)
!4069 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !4064, file: !330, line: 126, baseType: !1445, size: 32, offset: 192)
!4070 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !4064, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!4071 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !4064, file: !330, line: 165, baseType: !4072, size: 192, offset: 256)
!4072 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !4073)
!4073 = !{!4074, !4087, !4093}
!4074 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !4072, file: !330, line: 137, baseType: !4075, size: 128)
!4075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !4076)
!4076 = !{!4077, !4086}
!4077 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !4075, file: !330, line: 135, baseType: !4078, size: 64)
!4078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4079, size: 64)
!4079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !4080)
!4080 = !{!4081, !4082, !4083, !4084, !4085}
