; ModuleID = 'function.c'
source_filename = "function.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }

!2855 = !DIEnumerator(name: "gt_e_P21pending_abstract_type4htab", value: 181, isUnsigned: true)
!2856 = !DIEnumerator(name: "gt_e_P10spec_entry4htab", value: 182, isUnsigned: true)
!2857 = !DIEnumerator(name: "gt_e_P16cxx_int_tree_map4htab", value: 183, isUnsigned: true)
!2858 = !DIEnumerator(name: "gt_e_P17named_label_entry4htab", value: 184, isUnsigned: true)
!2859 = !DIEnumerator(name: "gt_e_P12tree_int_map4htab", value: 185, isUnsigned: true)
!2860 = !DIEnumerator(name: "gt_e_P20lto_symtab_entry_def4htab", value: 186, isUnsigned: true)
!2861 = !DIEnumerator(name: "gt_e_IP9tree_node12splay_tree_s", value: 187, isUnsigned: true)
!2862 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node12splay_tree_s", value: 188, isUnsigned: true)
!2863 = !DIEnumerator(name: "gt_e_P12varpool_node4htab", value: 189, isUnsigned: true)
!2864 = !DIEnumerator(name: "gt_e_P13scev_info_str4htab", value: 190, isUnsigned: true)
!2865 = !DIEnumerator(name: "gt_e_P23constant_descriptor_rtx4htab", value: 191, isUnsigned: true)
!2866 = !DIEnumerator(name: "gt_e_P24constant_descriptor_tree4htab", value: 192, isUnsigned: true)
!2867 = !DIEnumerator(name: "gt_e_P12object_block4htab", value: 193, isUnsigned: true)
!2868 = !DIEnumerator(name: "gt_e_P7section4htab", value: 194, isUnsigned: true)
!2869 = !DIEnumerator(name: "gt_e_P17tree_priority_map4htab", value: 195, isUnsigned: true)
!2870 = !DIEnumerator(name: "gt_e_P8tree_map4htab", value: 196, isUnsigned: true)
!2871 = !DIEnumerator(name: "gt_e_P9type_hash4htab", value: 197, isUnsigned: true)
!2872 = !DIEnumerator(name: "gt_e_P13libfunc_entry4htab", value: 198, isUnsigned: true)
!2873 = !DIEnumerator(name: "gt_e_P23temp_slot_address_entry4htab", value: 199, isUnsigned: true)
!2874 = !DIEnumerator(name: "gt_e_P15throw_stmt_node4htab", value: 200, isUnsigned: true)
!2875 = !DIEnumerator(name: "gt_e_P9reg_attrs4htab", value: 201, isUnsigned: true)
!2876 = !DIEnumerator(name: "gt_e_P9mem_attrs4htab", value: 202, isUnsigned: true)
!2877 = !DIEnumerator(name: "gt_e_P7rtx_def4htab", value: 203, isUnsigned: true)
!2878 = !DIEnumerator(name: "gt_e_SP9tree_node12splay_tree_s", value: 204, isUnsigned: true)
!2879 = !DIEnumerator(name: "gt_e_P10vcall_insn4htab", value: 205, isUnsigned: true)
!2880 = !DIEnumerator(name: "gt_e_P16var_loc_list_def4htab", value: 206, isUnsigned: true)
!2881 = !DIEnumerator(name: "gt_e_P10die_struct4htab", value: 207, isUnsigned: true)
!2882 = !DIEnumerator(name: "gt_e_P15dwarf_file_data4htab", value: 208, isUnsigned: true)
!2883 = !DIEnumerator(name: "gt_e_P20indirect_string_node4htab", value: 209, isUnsigned: true)
!2884 = !DIEnumerator(name: "gt_e_P11cgraph_node4htab", value: 210, isUnsigned: true)
!2885 = !DIEnumerator(name: "gt_e_II12splay_tree_s", value: 211, isUnsigned: true)
!2886 = !DIEnumerator(name: "gt_e_P27cgraph_node_set_element_def4htab", value: 212, isUnsigned: true)
!2887 = !DIEnumerator(name: "gt_e_P11cgraph_edge4htab", value: 213, isUnsigned: true)
!2888 = !DIEnumerator(name: "gt_e_P9loop_exit4htab", value: 214, isUnsigned: true)
!2889 = !DIEnumerator(name: "gt_e_P24types_used_by_vars_entry4htab", value: 215, isUnsigned: true)
!2890 = !DIEnumerator(name: "gt_e_P9tree_node4htab", value: 216, isUnsigned: true)
!2891 = !DIEnumerator(name: "gt_types_enum_last", value: 217, isUnsigned: true)
!2892 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "optab_methods", file: !753, line: 291, baseType: !7, size: 32, elements: !2893)
!2893 = !{!2894, !2895, !2896, !2897, !2898}
!2894 = !DIEnumerator(name: "OPTAB_DIRECT", value: 0, isUnsigned: true)
!2895 = !DIEnumerator(name: "OPTAB_LIB", value: 1, isUnsigned: true)
!2896 = !DIEnumerator(name: "OPTAB_WIDEN", value: 2, isUnsigned: true)
!2897 = !DIEnumerator(name: "OPTAB_LIB_WIDEN", value: 3, isUnsigned: true)
!2898 = !DIEnumerator(name: "OPTAB_MUST_WIDEN", value: 4, isUnsigned: true)
!2899 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "block_op_methods", file: !753, line: 412, baseType: !7, size: 32, elements: !2900)
!2900 = !{!2901, !2902, !2903, !2904}
!2901 = !DIEnumerator(name: "BLOCK_OP_NORMAL", value: 0, isUnsigned: true)
!2902 = !DIEnumerator(name: "BLOCK_OP_NO_LIBCALL", value: 1, isUnsigned: true)
!2903 = !DIEnumerator(name: "BLOCK_OP_CALL_PARM", value: 2, isUnsigned: true)
!2904 = !DIEnumerator(name: "BLOCK_OP_TAILCALL", value: 3, isUnsigned: true)
!2905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_changeable_flags", file: !2906, line: 463, baseType: !7, size: 32, elements: !2907)
!2906 = !DIFile(filename: "./df.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2907 = !{!2908, !2909, !2910, !2911, !2912, !2913, !2914}
!2908 = !DIEnumerator(name: "DF_LR_RUN_DCE", value: 1, isUnsigned: true)
!2909 = !DIEnumerator(name: "DF_NO_HARD_REGS", value: 2, isUnsigned: true)
!2910 = !DIEnumerator(name: "DF_EQ_NOTES", value: 4, isUnsigned: true)
!2911 = !DIEnumerator(name: "DF_NO_REGS_EVER_LIVE", value: 8, isUnsigned: true)
!2912 = !DIEnumerator(name: "DF_NO_INSN_RESCAN", value: 16, isUnsigned: true)
!2913 = !DIEnumerator(name: "DF_DEFER_INSN_RESCAN", value: 32, isUnsigned: true)
!2914 = !DIEnumerator(name: "DF_VERIFY_SCHEDULED", value: 64, isUnsigned: true)
!2915 = !{!2916, !2917, !7, !13, !2918, !2948, !141, !3045, !3035, !399, !3168, !3291, !2924, !2638, !4298, !4304, !4305, !3376, !3400, !4311, !4324, !4337, !4339, !4340, !4345, !3535}
!2916 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2917 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!2918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2919, size: 64)
!2919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "temp_slot", file: !3, line: 456, size: 576, elements: !2920)
!2920 = !{!2921, !2922, !2923, !4289, !4290, !4291, !4292, !4293, !4294, !4295, !4296, !4297}
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2919, file: !3, line: 458, baseType: !2918, size: 64)
!2922 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2919, file: !3, line: 460, baseType: !2918, size: 64, offset: 64)
!2923 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !2919, file: !3, line: 462, baseType: !2924, size: 64, offset: 128)
!2924 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2925, line: 50, baseType: !2926)
!2925 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2927, size: 64)
!2927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !2928)
!2928 = !{!2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939}
!2929 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2927, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2930 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2927, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2931 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2927, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2932 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2927, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2933 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2927, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2927, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2935 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2927, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2936 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2927, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2937 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2927, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2938 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2927, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2939 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2927, file: !385, line: 321, baseType: !2940, size: 320, offset: 64)
!2940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !2941)
!2941 = !{!2942, !4224, !4226, !4287, !4288}
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2940, file: !385, line: 316, baseType: !2943, size: 64)
!2943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2944, size: 64, elements: !2963)
!2944 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !2945)
!2945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !2946)
!2946 = !{!2947, !2949, !2950, !2954, !2955, !2965, !2966, !2978, !2981, !3044, !4202, !4203, !4214, !4221}
!2947 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2945, file: !385, line: 168, baseType: !2948, size: 32)
!2948 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2949 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2945, file: !385, line: 169, baseType: !7, size: 32)
!2950 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2945, file: !385, line: 170, baseType: !2951, size: 64)
!2951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2952, size: 64)
!2952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2953)
!2953 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2945, file: !385, line: 171, baseType: !2924, size: 64)
!2955 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2945, file: !385, line: 172, baseType: !2956, size: 64)
!2956 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2925, line: 53, baseType: !2957)
!2957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2958, size: 64)
!2958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !2959)
!2959 = !{!2960, !2961}
!2960 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2958, file: !385, line: 360, baseType: !2948, size: 32)
!2961 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2958, file: !385, line: 361, baseType: !2962, size: 64, offset: 64)
!2962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2924, size: 64, elements: !2963)
!2963 = !{!2964}
!2964 = !DISubrange(count: 1)
!2965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2945, file: !385, line: 173, baseType: !13, size: 32)
!2966 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2945, file: !385, line: 174, baseType: !2967, size: 32)
!2967 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !2968)
!2968 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !2969)
!2969 = !{!2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977}
!2970 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2968, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2971 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2968, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2972 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2968, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2973 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2968, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2974 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2968, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2975 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2968, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2976 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2968, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2977 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2968, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2978 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2945, file: !385, line: 175, baseType: !2979, size: 64)
!2979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2980, size: 64)
!2980 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!2981 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2945, file: !385, line: 176, baseType: !2982, size: 64)
!2982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2983, size: 64)
!2983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2984, line: 75, size: 256, elements: !2985)
!2984 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2985 = !{!2986, !3000, !3001, !3002}
!2986 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2983, file: !2984, line: 76, baseType: !2987, size: 64)
!2987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2988, size: 64)
!2988 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2984, line: 68, baseType: !2989)
!2989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2984, line: 63, size: 320, elements: !2990)
!2990 = !{!2991, !2993, !2994, !2995}
!2991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2989, file: !2984, line: 64, baseType: !2992, size: 64)
!2992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2989, size: 64)
!2993 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2989, file: !2984, line: 65, baseType: !2992, size: 64, offset: 64)
!2994 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2989, file: !2984, line: 66, baseType: !7, size: 32, offset: 128)
!2995 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2989, file: !2984, line: 67, baseType: !2996, size: 128, offset: 192)
!2996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2997, size: 128, elements: !2998)
!2997 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2984, line: 29, baseType: !2916)
!2998 = !{!2999}
!2999 = !DISubrange(count: 2)
!3000 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2983, file: !2984, line: 77, baseType: !2987, size: 64, offset: 64)
!3001 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2983, file: !2984, line: 78, baseType: !7, size: 32, offset: 128)
!3002 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2983, file: !2984, line: 79, baseType: !3003, size: 64, offset: 192)
!3003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3004, size: 64)
!3004 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2984, line: 49, baseType: !3005)
!3005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2984, line: 45, size: 832, elements: !3006)
!3006 = !{!3007, !3008, !3009}
!3007 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3005, file: !2984, line: 46, baseType: !2992, size: 64)
!3008 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !3005, file: !2984, line: 47, baseType: !2982, size: 64, offset: 64)
!3009 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3005, file: !2984, line: 48, baseType: !3010, size: 704, offset: 128)
!3010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !3011, line: 164, size: 704, elements: !3012)
!3011 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3012 = !{!3013, !3015, !3026, !3027, !3028, !3029, !3030, !3031, !3036, !3040, !3041, !3042, !3043}
!3013 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !3010, file: !3011, line: 166, baseType: !3014, size: 64)
!3014 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!3015 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !3010, file: !3011, line: 167, baseType: !3016, size: 64, offset: 64)
!3016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3017, size: 64)
!3017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !3011, line: 157, size: 192, elements: !3018)
!3018 = !{!3019, !3021, !3022}
!3019 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !3017, file: !3011, line: 159, baseType: !3020, size: 64)
!3020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2953, size: 64)
!3021 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3017, file: !3011, line: 160, baseType: !3016, size: 64, offset: 64)
!3022 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !3017, file: !3011, line: 161, baseType: !3023, size: 32, offset: 128)
!3023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2953, size: 32, elements: !3024)
!3024 = !{!3025}
!3025 = !DISubrange(count: 4)
!3026 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !3010, file: !3011, line: 168, baseType: !3020, size: 64, offset: 128)
!3027 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3010, file: !3011, line: 169, baseType: !3020, size: 64, offset: 192)
!3028 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !3010, file: !3011, line: 170, baseType: !3020, size: 64, offset: 256)
!3029 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !3010, file: !3011, line: 171, baseType: !3014, size: 64, offset: 320)
!3030 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !3010, file: !3011, line: 172, baseType: !2948, size: 32, offset: 384)
!3031 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !3010, file: !3011, line: 176, baseType: !3032, size: 64, offset: 448)
!3032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3033, size: 64)
!3033 = !DISubroutineType(types: !3034)
!3034 = !{!3016, !3035, !3014}
!3035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!3036 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !3010, file: !3011, line: 177, baseType: !3037, size: 64, offset: 512)
!3037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3038, size: 64)
!3038 = !DISubroutineType(types: !3039)
!3039 = !{null, !3035, !3016}
!3040 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !3010, file: !3011, line: 178, baseType: !3035, size: 64, offset: 576)
!3041 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !3010, file: !3011, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!3042 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !3010, file: !3011, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!3043 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !3010, file: !3011, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!3044 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2945, file: !385, line: 177, baseType: !3045, size: 64)
!3045 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2925, line: 56, baseType: !3046)
!3046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3047, size: 64)
!3047 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !3048)
!3048 = !{!3049, !3082, !3088, !3099, !3118, !3129, !3134, !3141, !3147, !3161, !3173, !3211, !3216, !3244, !3252, !3253, !3258, !3267, !3273, !3278, !3282, !3286, !3854, !3903, !3909, !3915, !3922, !3933, !3947, !3964, !3976, !3998, !4013, !4184}
!3049 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3047, file: !142, line: 3372, baseType: !3050, size: 64)
!3050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !3051)
!3051 = !{!3052, !3053, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3061, !3062, !3063, !3064, !3065, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081}
!3052 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3050, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3053 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !3050, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3054 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !3050, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!3055 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !3050, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!3056 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !3050, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!3057 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !3050, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!3058 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !3050, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!3059 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !3050, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!3060 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !3050, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!3061 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !3050, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3062 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !3050, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3063 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !3050, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3064 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !3050, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3065 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !3050, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3066 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !3050, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3067 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !3050, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3068 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !3050, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3069 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !3050, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!3070 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3050, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!3071 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3050, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!3072 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3050, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!3073 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3050, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!3074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3050, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!3075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3050, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!3076 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3050, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!3077 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3050, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!3078 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !3050, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!3079 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !3050, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!3080 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !3050, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!3081 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !3050, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!3082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3047, file: !142, line: 3373, baseType: !3083, size: 192)
!3083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !3084)
!3084 = !{!3085, !3086, !3087}
!3085 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3083, file: !142, line: 403, baseType: !3050, size: 64)
!3086 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !3083, file: !142, line: 404, baseType: !3045, size: 64, offset: 64)
!3087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3083, file: !142, line: 405, baseType: !3045, size: 64, offset: 128)
!3088 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3047, file: !142, line: 3374, baseType: !3089, size: 320)
!3089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !3090)
!3090 = !{!3091, !3092}
!3091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3089, file: !142, line: 1385, baseType: !3083, size: 192)
!3092 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3089, file: !142, line: 1386, baseType: !3093, size: 128, offset: 192)
!3093 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !3094, line: 58, baseType: !3095)
!3094 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3095 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3094, line: 54, size: 128, elements: !3096)
!3096 = !{!3097, !3098}
!3097 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !3095, file: !3094, line: 56, baseType: !2916, size: 64)
!3098 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !3095, file: !3094, line: 57, baseType: !3014, size: 64, offset: 64)
!3099 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !3047, file: !142, line: 3375, baseType: !3100, size: 256)
!3100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !3101)
!3101 = !{!3102, !3103}
!3102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3100, file: !142, line: 1398, baseType: !3083, size: 192)
!3103 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !3100, file: !142, line: 1399, baseType: !3104, size: 64, offset: 192)
!3104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3105, size: 64)
!3105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !3106, line: 52, size: 256, elements: !3107)
!3106 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3107 = !{!3108, !3109, !3110, !3111, !3112, !3113, !3114}
!3108 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !3105, file: !3106, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!3109 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !3105, file: !3106, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!3110 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !3105, file: !3106, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!3111 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !3105, file: !3106, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!3112 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !3105, file: !3106, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!3113 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !3105, file: !3106, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!3114 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !3105, file: !3106, line: 62, baseType: !3115, size: 192, offset: 64)
!3115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2916, size: 192, elements: !3116)
!3116 = !{!3117}
!3117 = !DISubrange(count: 3)
!3118 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !3047, file: !142, line: 3376, baseType: !3119, size: 256)
!3119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !3120)
!3120 = !{!3121, !3122}
!3121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3119, file: !142, line: 1409, baseType: !3083, size: 192)
!3122 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !3119, file: !142, line: 1410, baseType: !3123, size: 64, offset: 192)
!3123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3124, size: 64)
!3124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !3125, line: 27, size: 192, elements: !3126)
!3125 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3126 = !{!3127, !3128}
!3127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3124, file: !3125, line: 29, baseType: !3093, size: 128)
!3128 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3124, file: !3125, line: 30, baseType: !13, size: 32, offset: 128)
!3129 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !3047, file: !142, line: 3377, baseType: !3130, size: 256)
!3130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !3131)
!3131 = !{!3132, !3133}
!3132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3130, file: !142, line: 1438, baseType: !3083, size: 192)
!3133 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3130, file: !142, line: 1439, baseType: !3045, size: 64, offset: 192)
!3134 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3047, file: !142, line: 3378, baseType: !3135, size: 256)
!3135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !3136)
!3136 = !{!3137, !3138, !3139}
!3137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3135, file: !142, line: 1419, baseType: !3083, size: 192)
!3138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !3135, file: !142, line: 1420, baseType: !2948, size: 32, offset: 192)
!3139 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3135, file: !142, line: 1421, baseType: !3140, size: 8, offset: 224)
!3140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2953, size: 8, elements: !2963)
!3141 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !3047, file: !142, line: 3379, baseType: !3142, size: 320)
!3142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !3143)
!3143 = !{!3144, !3145, !3146}
!3144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3142, file: !142, line: 1429, baseType: !3083, size: 192)
!3145 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !3142, file: !142, line: 1430, baseType: !3045, size: 64, offset: 192)
!3146 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !3142, file: !142, line: 1431, baseType: !3045, size: 64, offset: 256)
!3147 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !3047, file: !142, line: 3380, baseType: !3148, size: 320)
!3148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !3149)
!3149 = !{!3150, !3151}
!3150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3148, file: !142, line: 1461, baseType: !3083, size: 192)
!3151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !3148, file: !142, line: 1462, baseType: !3152, size: 128, offset: 192)
!3152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !3153, line: 31, size: 128, elements: !3154)
!3153 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3154 = !{!3155, !3159, !3160}
!3155 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3152, file: !3153, line: 32, baseType: !3156, size: 64)
!3156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3157, size: 64)
!3157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3158)
!3158 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!3159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !3152, file: !3153, line: 33, baseType: !7, size: 32, offset: 64)
!3160 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !3152, file: !3153, line: 34, baseType: !7, size: 32, offset: 96)
!3161 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !3047, file: !142, line: 3381, baseType: !3162, size: 384)
!3162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !3163)
!3163 = !{!3164, !3165, !3170, !3171, !3172}
!3164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3162, file: !142, line: 2508, baseType: !3083, size: 192)
!3165 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3162, file: !142, line: 2509, baseType: !3166, size: 32, offset: 192)
!3166 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !3167, line: 58, baseType: !3168)
!3167 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3168 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !3169, line: 44, baseType: !7)
!3169 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3170 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3162, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!3171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3162, file: !142, line: 2511, baseType: !3045, size: 64, offset: 256)
!3172 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !3162, file: !142, line: 2512, baseType: !3045, size: 64, offset: 320)
!3173 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !3047, file: !142, line: 3382, baseType: !3174, size: 896)
!3174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !3175)
!3175 = !{!3176, !3177, !3178, !3179, !3180, !3181, !3182, !3183, !3184, !3185, !3186, !3187, !3188, !3189, !3190, !3191, !3192, !3193, !3194, !3195, !3196, !3197, !3198, !3199, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208}
!3176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3174, file: !142, line: 2653, baseType: !3162, size: 384)
!3177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3174, file: !142, line: 2654, baseType: !3045, size: 64, offset: 384)
!3178 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3174, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!3179 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !3174, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!3180 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !3174, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!3181 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !3174, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!3182 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3174, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!3183 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !3174, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!3184 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !3174, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!3185 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !3174, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!3186 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3174, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!3187 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3174, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!3188 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3174, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!3189 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3174, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!3190 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3174, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!3191 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3174, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!3192 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3174, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!3193 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !3174, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!3194 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !3174, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!3195 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !3174, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!3196 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !3174, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!3197 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !3174, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!3198 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !3174, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!3199 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !3174, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!3200 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !3174, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!3201 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !3174, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!3202 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !3174, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!3203 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3174, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!3204 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3174, file: !142, line: 2705, baseType: !3045, size: 64, offset: 576)
!3205 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3174, file: !142, line: 2706, baseType: !3045, size: 64, offset: 640)
!3206 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3174, file: !142, line: 2707, baseType: !3045, size: 64, offset: 704)
!3207 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3174, file: !142, line: 2708, baseType: !3045, size: 64, offset: 768)
!3208 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3174, file: !142, line: 2711, baseType: !3209, size: 64, offset: 832)
!3209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3210, size: 64)
!3210 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!3211 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !3047, file: !142, line: 3383, baseType: !3212, size: 960)
!3212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !3213)
!3213 = !{!3214, !3215}
!3214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3212, file: !142, line: 2757, baseType: !3174, size: 896)
!3215 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3212, file: !142, line: 2758, baseType: !2924, size: 64, offset: 896)
!3216 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !3047, file: !142, line: 3384, baseType: !3217, size: 1472)
!3217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !3218)
!3218 = !{!3219, !3240, !3241, !3242, !3243}
!3219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3217, file: !142, line: 3115, baseType: !3220, size: 1216)
!3220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !3221)
!3221 = !{!3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3239}
!3222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3220, file: !142, line: 2985, baseType: !3212, size: 960)
!3223 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !3220, file: !142, line: 2986, baseType: !3045, size: 64, offset: 960)
!3224 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !3220, file: !142, line: 2987, baseType: !3045, size: 64, offset: 1024)
!3225 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !3220, file: !142, line: 2988, baseType: !3045, size: 64, offset: 1088)
!3226 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !3220, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!3227 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !3220, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!3228 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !3220, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!3229 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !3220, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!3230 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !3220, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!3231 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !3220, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!3232 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !3220, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!3233 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !3220, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!3234 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !3220, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!3235 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !3220, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!3236 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !3220, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!3237 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !3220, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!3238 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !3220, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!3239 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !3220, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!3240 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !3217, file: !142, line: 3117, baseType: !3045, size: 64, offset: 1216)
!3241 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !3217, file: !142, line: 3119, baseType: !3045, size: 64, offset: 1280)
!3242 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3217, file: !142, line: 3121, baseType: !3045, size: 64, offset: 1344)
!3243 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !3217, file: !142, line: 3123, baseType: !3045, size: 64, offset: 1408)
!3244 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !3047, file: !142, line: 3385, baseType: !3245, size: 1088)
!3245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !3246)
!3246 = !{!3247, !3248, !3249}
!3247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3245, file: !142, line: 2875, baseType: !3212, size: 960)
!3248 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !3245, file: !142, line: 2876, baseType: !2924, size: 64, offset: 960)
!3249 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3245, file: !142, line: 2877, baseType: !3250, size: 64, offset: 1024)
!3250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3251, size: 64)
!3251 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !142, line: 2856, flags: DIFlagFwdDecl)
!3252 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !3047, file: !142, line: 3386, baseType: !3220, size: 1216)
!3253 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !3047, file: !142, line: 3387, baseType: !3254, size: 1280)
!3254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !3255)
!3255 = !{!3256, !3257}
!3256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3254, file: !142, line: 3094, baseType: !3220, size: 1216)
!3257 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3254, file: !142, line: 3095, baseType: !3250, size: 64, offset: 1216)
!3258 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !3047, file: !142, line: 3388, baseType: !3259, size: 1216)
!3259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !3260)
!3260 = !{!3261, !3262, !3263, !3264, !3265, !3266}
!3261 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3259, file: !142, line: 2825, baseType: !3174, size: 896)
!3262 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3259, file: !142, line: 2827, baseType: !3045, size: 64, offset: 896)
!3263 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !3259, file: !142, line: 2828, baseType: !3045, size: 64, offset: 960)
!3264 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !3259, file: !142, line: 2829, baseType: !3045, size: 64, offset: 1024)
!3265 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !3259, file: !142, line: 2830, baseType: !3045, size: 64, offset: 1088)
!3266 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !3259, file: !142, line: 2831, baseType: !3045, size: 64, offset: 1152)
!3267 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !3047, file: !142, line: 3389, baseType: !3268, size: 1024)
!3268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !3269)
!3269 = !{!3270, !3271, !3272}
!3270 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3268, file: !142, line: 2851, baseType: !3212, size: 960)
!3271 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !3268, file: !142, line: 2852, baseType: !2948, size: 32, offset: 960)
!3272 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !3268, file: !142, line: 2853, baseType: !2948, size: 32, offset: 992)
!3273 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !3047, file: !142, line: 3390, baseType: !3274, size: 1024)
!3274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !3275)
!3275 = !{!3276, !3277}
!3276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3274, file: !142, line: 2858, baseType: !3212, size: 960)
!3277 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3274, file: !142, line: 2859, baseType: !3250, size: 64, offset: 960)
!3278 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !3047, file: !142, line: 3391, baseType: !3279, size: 960)
!3279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !3280)
!3280 = !{!3281}
!3281 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3279, file: !142, line: 2863, baseType: !3212, size: 960)
!3282 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !3047, file: !142, line: 3392, baseType: !3283, size: 1472)
!3283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !3284)
!3284 = !{!3285}
!3285 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3283, file: !142, line: 3305, baseType: !3217, size: 1472)
!3286 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !3047, file: !142, line: 3393, baseType: !3287, size: 1792)
!3287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !3288)
!3288 = !{!3289, !3290, !3833, !3834, !3835, !3836, !3837, !3838, !3839, !3840, !3841, !3842, !3843, !3844, !3845, !3846, !3847, !3848, !3849, !3850, !3851, !3852, !3853}
!3289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3287, file: !142, line: 3249, baseType: !3217, size: 1472)
!3290 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !3287, file: !142, line: 3251, baseType: !3291, size: 64, offset: 1472)
!3291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3292, size: 64)
!3292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1493, line: 463, size: 1152, elements: !3293)
!3293 = !{!3294, !3457, !3770, !3771, !3774, !3777, !3778, !3779, !3780, !3781, !3782, !3806, !3809, !3810, !3811, !3812, !3813, !3814, !3815, !3816, !3817, !3818, !3819, !3820, !3821, !3822, !3823, !3824, !3825, !3826, !3827, !3828, !3829, !3830, !3831, !3832}
!3294 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !3292, file: !1493, line: 464, baseType: !3295, size: 64)
!3295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3296, size: 64)
!3296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !6, line: 194, size: 384, elements: !3297)
!3297 = !{!3298, !3347, !3360, !3374, !3425, !3438}
!3298 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !3296, file: !6, line: 197, baseType: !3299, size: 64)
!3299 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !6, line: 182, baseType: !3300)
!3300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3301, size: 64)
!3301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !6, line: 116, size: 704, elements: !3302)
!3302 = !{!3303, !3304, !3305, !3306, !3307, !3308, !3335, !3344, !3345, !3346}
!3303 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !3301, file: !6, line: 119, baseType: !3300, size: 64)
!3304 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !3301, file: !6, line: 122, baseType: !3300, size: 64, offset: 64)
!3305 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !3301, file: !6, line: 123, baseType: !3300, size: 64, offset: 128)
!3306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3301, file: !6, line: 126, baseType: !2948, size: 32, offset: 192)
!3307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3301, file: !6, line: 129, baseType: !5, size: 32, offset: 224)
!3308 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3301, file: !6, line: 165, baseType: !3309, size: 192, offset: 256)
!3309 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !6, line: 132, size: 192, elements: !3310)
!3310 = !{!3311, !3324, !3330}
!3311 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !3309, file: !6, line: 137, baseType: !3312, size: 128)
!3312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !6, line: 133, size: 128, elements: !3313)
!3313 = !{!3314, !3323}
!3314 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !3312, file: !6, line: 135, baseType: !3315, size: 64)
!3315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3316, size: 64)
!3316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !6, line: 93, size: 320, elements: !3317)
!3317 = !{!3318, !3319, !3320, !3321, !3322}
!3318 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !3316, file: !6, line: 96, baseType: !3315, size: 64)
!3319 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !3316, file: !6, line: 97, baseType: !3315, size: 64, offset: 64)
!3320 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !3316, file: !6, line: 101, baseType: !3045, size: 64, offset: 128)
!3321 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !3316, file: !6, line: 106, baseType: !3045, size: 64, offset: 192)
!3322 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !3316, file: !6, line: 111, baseType: !3045, size: 64, offset: 256)
!3323 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !3312, file: !6, line: 136, baseType: !3315, size: 64, offset: 64)
!3324 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !3309, file: !6, line: 151, baseType: !3325, size: 192)
!3325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !6, line: 139, size: 192, elements: !3326)
!3326 = !{!3327, !3328, !3329}
!3327 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !3325, file: !6, line: 141, baseType: !3045, size: 64)
!3328 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !3325, file: !6, line: 145, baseType: !3045, size: 64, offset: 64)
!3329 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !3325, file: !6, line: 150, baseType: !2948, size: 32, offset: 128)
!3330 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !3309, file: !6, line: 164, baseType: !3331, size: 128)
!3331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !6, line: 153, size: 128, elements: !3332)
!3332 = !{!3333, !3334}
!3333 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !3331, file: !6, line: 161, baseType: !3045, size: 64)
!3334 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !3331, file: !6, line: 163, baseType: !3166, size: 32, offset: 64)
!3335 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !3301, file: !6, line: 168, baseType: !3336, size: 64, offset: 448)
!3336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3337, size: 64)
!3337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !6, line: 67, size: 320, elements: !3338)
!3338 = !{!3339, !3340, !3341, !3342, !3343}
!3339 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !3337, file: !6, line: 70, baseType: !3336, size: 64)
!3340 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !3337, file: !6, line: 73, baseType: !3300, size: 64, offset: 64)
!3341 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !3337, file: !6, line: 78, baseType: !3045, size: 64, offset: 128)
!3342 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !3337, file: !6, line: 85, baseType: !2924, size: 64, offset: 192)
!3343 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3337, file: !6, line: 88, baseType: !2948, size: 32, offset: 256)
!3344 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !3301, file: !6, line: 173, baseType: !2924, size: 64, offset: 512)
!3345 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !3301, file: !6, line: 173, baseType: !2924, size: 64, offset: 576)
!3346 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !3301, file: !6, line: 177, baseType: !3158, size: 8, offset: 640)
!3347 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !3296, file: !6, line: 200, baseType: !3348, size: 64, offset: 64)
!3348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3349, size: 64)
!3349 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !6, line: 185, baseType: !3350)
!3350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !6, line: 185, size: 128, elements: !3351)
!3351 = !{!3352}
!3352 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3350, file: !6, line: 185, baseType: !3353, size: 128)
!3353 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !6, line: 184, baseType: !3354)
!3354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !6, line: 184, size: 128, elements: !3355)
!3355 = !{!3356, !3357, !3358}
!3356 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3354, file: !6, line: 184, baseType: !7, size: 32)
!3357 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3354, file: !6, line: 184, baseType: !7, size: 32, offset: 32)
!3358 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3354, file: !6, line: 184, baseType: !3359, size: 64, offset: 64)
!3359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3299, size: 64, elements: !2963)
!3360 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !3296, file: !6, line: 203, baseType: !3361, size: 64, offset: 128)
!3361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3362, size: 64)
!3362 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, baseType: !3363)
!3363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, size: 128, elements: !3364)
!3364 = !{!3365}
!3365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3363, file: !6, line: 189, baseType: !3366, size: 128)
!3366 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !6, line: 188, baseType: !3367)
!3367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !6, line: 188, size: 128, elements: !3368)
!3368 = !{!3369, !3370, !3371}
!3369 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3367, file: !6, line: 188, baseType: !7, size: 32)
!3370 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3367, file: !6, line: 188, baseType: !7, size: 32, offset: 32)
!3371 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3367, file: !6, line: 188, baseType: !3372, size: 64, offset: 64)
!3372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3373, size: 64, elements: !2963)
!3373 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !6, line: 180, baseType: !3336)
!3374 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !3296, file: !6, line: 207, baseType: !3375, size: 64, offset: 192)
!3375 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2661, line: 144, baseType: !3376)
!3376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3377, size: 64)
!3377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2661, line: 100, size: 896, elements: !3378)
!3378 = !{!3379, !3387, !3392, !3397, !3399, !3402, !3403, !3404, !3405, !3406, !3411, !3413, !3414, !3419, !3424}
!3379 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !3377, file: !2661, line: 102, baseType: !3380, size: 64)
!3380 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2661, line: 52, baseType: !3381)
!3381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3382, size: 64)
!3382 = !DISubroutineType(types: !3383)
!3383 = !{!3384, !3385}
!3384 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2661, line: 47, baseType: !7)
!3385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3386, size: 64)
!3386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!3387 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !3377, file: !2661, line: 105, baseType: !3388, size: 64, offset: 64)
!3388 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2661, line: 59, baseType: !3389)
!3389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3390, size: 64)
!3390 = !DISubroutineType(types: !3391)
!3391 = !{!2948, !3385, !3385}
!3392 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !3377, file: !2661, line: 108, baseType: !3393, size: 64, offset: 128)
!3393 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2661, line: 63, baseType: !3394)
!3394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3395, size: 64)
!3395 = !DISubroutineType(types: !3396)
!3396 = !{null, !3035}
!3397 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !3377, file: !2661, line: 111, baseType: !3398, size: 64, offset: 192)
!3398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3035, size: 64)
!3399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3377, file: !2661, line: 114, baseType: !3400, size: 64, offset: 256)
!3400 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !3401, line: 46, baseType: !2916)
!3401 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!3402 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !3377, file: !2661, line: 117, baseType: !3400, size: 64, offset: 320)
!3403 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !3377, file: !2661, line: 120, baseType: !3400, size: 64, offset: 384)
!3404 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !3377, file: !2661, line: 124, baseType: !7, size: 32, offset: 448)
!3405 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !3377, file: !2661, line: 128, baseType: !7, size: 32, offset: 480)
!3406 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !3377, file: !2661, line: 131, baseType: !3407, size: 64, offset: 512)
!3407 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2661, line: 75, baseType: !3408)
!3408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3409, size: 64)
!3409 = !DISubroutineType(types: !3410)
!3410 = !{!3035, !3400, !3400}
!3411 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !3377, file: !2661, line: 132, baseType: !3412, size: 64, offset: 576)
!3412 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2661, line: 78, baseType: !3394)
!3413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !3377, file: !2661, line: 135, baseType: !3035, size: 64, offset: 640)
!3414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !3377, file: !2661, line: 136, baseType: !3415, size: 64, offset: 704)
!3415 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2661, line: 82, baseType: !3416)
!3416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3417, size: 64)
!3417 = !DISubroutineType(types: !3418)
!3418 = !{!3035, !3035, !3400, !3400}
!3419 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !3377, file: !2661, line: 137, baseType: !3420, size: 64, offset: 768)
!3420 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2661, line: 83, baseType: !3421)
!3421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3422, size: 64)
!3422 = !DISubroutineType(types: !3423)
!3423 = !{null, !3035, !3035}
!3424 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !3377, file: !2661, line: 141, baseType: !7, size: 32, offset: 832)
!3425 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !3296, file: !6, line: 211, baseType: !3426, size: 64, offset: 256)
!3426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3427, size: 64)
!3427 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !142, line: 183, baseType: !3428)
!3428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !142, line: 183, size: 128, elements: !3429)
!3429 = !{!3430}
!3430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3428, file: !142, line: 183, baseType: !3431, size: 128)
!3431 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !142, line: 182, baseType: !3432)
!3432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !142, line: 182, size: 128, elements: !3433)
!3433 = !{!3434, !3435, !3436}
!3434 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3432, file: !142, line: 182, baseType: !7, size: 32)
!3435 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3432, file: !142, line: 182, baseType: !7, size: 32, offset: 32)
!3436 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3432, file: !142, line: 182, baseType: !3437, size: 64, offset: 64)
!3437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3045, size: 64, elements: !2963)
!3438 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !3296, file: !6, line: 220, baseType: !3439, size: 64, offset: 320)
!3439 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !6, line: 217, size: 64, elements: !3440)
!3440 = !{!3441, !3442}
!3441 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !3439, file: !6, line: 218, baseType: !3426, size: 64)
!3442 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !3439, file: !6, line: 219, baseType: !3443, size: 64)
!3443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3444, size: 64)
!3444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !3445, line: 29, baseType: !3446)
!3445 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !3445, line: 29, size: 96, elements: !3447)
!3447 = !{!3448}
!3448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3446, file: !3445, line: 29, baseType: !3449, size: 96)
!3449 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !3445, line: 27, baseType: !3450)
!3450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !3445, line: 27, size: 96, elements: !3451)
!3451 = !{!3452, !3453, !3454}
!3452 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3450, file: !3445, line: 27, baseType: !7, size: 32)
!3453 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3450, file: !3445, line: 27, baseType: !7, size: 32, offset: 32)
!3454 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3450, file: !3445, line: 27, baseType: !3455, size: 8, offset: 64)
!3455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3456, size: 8, elements: !2963)
!3456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !3445, line: 26, baseType: !3158)
!3457 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !3292, file: !1493, line: 467, baseType: !3458, size: 64, offset: 64)
!3458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3459, size: 64)
!3459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !369, line: 374, size: 640, elements: !3460)
!3460 = !{!3461, !3745, !3746, !3759, !3760, !3761, !3762, !3763, !3764, !3766, !3768, !3769}
!3461 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !3459, file: !369, line: 377, baseType: !3462, size: 64)
!3462 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2925, line: 111, baseType: !3463)
!3463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3464, size: 64)
!3464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !369, line: 217, size: 832, elements: !3465)
!3465 = !{!3466, !3710, !3711, !3712, !3715, !3719, !3720, !3721, !3739, !3740, !3741, !3742, !3743, !3744}
!3466 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !3464, file: !369, line: 219, baseType: !3467, size: 64)
!3467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3468, size: 64)
!3468 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !369, line: 151, baseType: !3469)
!3469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !369, line: 151, size: 128, elements: !3470)
!3470 = !{!3471}
!3471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3469, file: !369, line: 151, baseType: !3472, size: 128)
!3472 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !369, line: 150, baseType: !3473)
!3473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !369, line: 150, size: 128, elements: !3474)
!3474 = !{!3475, !3476, !3477}
!3475 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3473, file: !369, line: 150, baseType: !7, size: 32)
!3476 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3473, file: !369, line: 150, baseType: !7, size: 32, offset: 32)
!3477 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3473, file: !369, line: 150, baseType: !3478, size: 64, offset: 64)
!3478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3479, size: 64, elements: !2963)
!3479 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2925, line: 108, baseType: !3480)
!3480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3481, size: 64)
!3481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !369, line: 122, size: 512, elements: !3482)
!3482 = !{!3483, !3484, !3485, !3702, !3703, !3704, !3705, !3706, !3707, !3708}
!3483 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !3481, file: !369, line: 124, baseType: !3463, size: 64)
!3484 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !3481, file: !369, line: 125, baseType: !3463, size: 64, offset: 64)
!3485 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !3481, file: !369, line: 131, baseType: !3486, size: 64, offset: 128)
!3486 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !369, line: 128, size: 64, elements: !3487)
!3487 = !{!3488, !3701}
!3488 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !3486, file: !369, line: 129, baseType: !3489, size: 64)
!3489 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2925, line: 66, baseType: !3490)
!3490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3491, size: 64)
!3491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !3492, line: 143, size: 192, elements: !3493)
!3492 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3493 = !{!3494, !3699, !3700}
!3494 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3491, file: !3492, line: 145, baseType: !3495, size: 64)
!3495 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2925, line: 69, baseType: !3496)
!3496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3497, size: 64)
!3497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !3492, line: 136, size: 192, elements: !3498)
!3498 = !{!3499, !3697, !3698}
!3499 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3497, file: !3492, line: 137, baseType: !3500, size: 64)
!3500 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2925, line: 58, baseType: !3501)
!3501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3502, size: 64)
!3502 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !3492, line: 737, size: 768, elements: !3503)
!3503 = !{!3504, !3521, !3554, !3560, !3565, !3570, !3577, !3583, !3589, !3594, !3608, !3613, !3619, !3624, !3634, !3639, !3655, !3662, !3669, !3675, !3680, !3686, !3692}
!3504 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3502, file: !3492, line: 738, baseType: !3505, size: 256)
!3505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !3492, line: 271, size: 256, elements: !3506)
!3506 = !{!3507, !3508, !3509, !3510, !3511, !3512, !3513, !3514, !3515, !3516, !3517, !3518, !3519, !3520}
!3507 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3505, file: !3492, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3508 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !3505, file: !3492, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3509 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3505, file: !3492, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3510 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !3505, file: !3492, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3511 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !3505, file: !3492, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3512 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !3505, file: !3492, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3513 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !3505, file: !3492, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!3514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !3505, file: !3492, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!3515 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !3505, file: !3492, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3516 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3505, file: !3492, line: 312, baseType: !7, size: 32, offset: 32)
!3517 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !3505, file: !3492, line: 316, baseType: !3166, size: 32, offset: 64)
!3518 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !3505, file: !3492, line: 319, baseType: !7, size: 32, offset: 96)
!3519 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !3505, file: !3492, line: 323, baseType: !3463, size: 64, offset: 128)
!3520 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3505, file: !3492, line: 327, baseType: !3045, size: 64, offset: 192)
!3521 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !3502, file: !3492, line: 739, baseType: !3522, size: 448)
!3522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !3492, line: 350, size: 448, elements: !3523)
!3523 = !{!3524, !3553}
!3524 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3522, file: !3492, line: 353, baseType: !3525, size: 384)
!3525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !3492, line: 333, size: 384, elements: !3526)
!3526 = !{!3527, !3528, !3536}
!3527 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3525, file: !3492, line: 336, baseType: !3505, size: 256)
!3528 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !3525, file: !3492, line: 343, baseType: !3529, size: 64, offset: 256)
!3529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3530, size: 64)
!3530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !3531, line: 37, size: 128, elements: !3532)
!3531 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3532 = !{!3533, !3534}
!3533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3530, file: !3531, line: 39, baseType: !3529, size: 64)
!3534 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !3530, file: !3531, line: 40, baseType: !3535, size: 64, offset: 64)
!3535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3045, size: 64)
!3536 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !3525, file: !3492, line: 344, baseType: !3537, size: 64, offset: 320)
!3537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3538, size: 64)
!3538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !3531, line: 45, size: 320, elements: !3539)
!3539 = !{!3540, !3541}
!3540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3538, file: !3531, line: 47, baseType: !3537, size: 64)
!3541 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !3538, file: !3531, line: 48, baseType: !3542, size: 256, offset: 64)
!3542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !3543)
!3543 = !{!3544, !3546, !3547, !3552}
!3544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3542, file: !142, line: 1884, baseType: !3545, size: 64)
!3545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3542, size: 64)
!3546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3542, file: !142, line: 1885, baseType: !3545, size: 64, offset: 64)
!3547 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !3542, file: !142, line: 1891, baseType: !3548, size: 64, offset: 128)
!3548 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3542, file: !142, line: 1891, size: 64, elements: !3549)
!3549 = !{!3550, !3551}
!3550 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3548, file: !142, line: 1891, baseType: !3500, size: 64)
!3551 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3548, file: !142, line: 1891, baseType: !3045, size: 64)
!3552 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !3542, file: !142, line: 1892, baseType: !3535, size: 64, offset: 192)
!3553 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3522, file: !3492, line: 359, baseType: !3437, size: 64, offset: 384)
!3554 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !3502, file: !3492, line: 740, baseType: !3555, size: 512)
!3555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !3492, line: 365, size: 512, elements: !3556)
!3556 = !{!3557, !3558, !3559}
!3557 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3555, file: !3492, line: 368, baseType: !3525, size: 384)
!3558 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !3555, file: !3492, line: 373, baseType: !3045, size: 64, offset: 384)
!3559 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !3555, file: !3492, line: 374, baseType: !3045, size: 64, offset: 448)
!3560 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !3502, file: !3492, line: 741, baseType: !3561, size: 576)
!3561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !3492, line: 380, size: 576, elements: !3562)
!3562 = !{!3563, !3564}
!3563 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3561, file: !3492, line: 383, baseType: !3555, size: 512)
!3564 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3561, file: !3492, line: 389, baseType: !3437, size: 64, offset: 512)
!3565 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3502, file: !3492, line: 742, baseType: !3566, size: 320)
!3566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !3492, line: 395, size: 320, elements: !3567)
!3567 = !{!3568, !3569}
!3568 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3566, file: !3492, line: 397, baseType: !3505, size: 256)
!3569 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3566, file: !3492, line: 400, baseType: !3489, size: 64, offset: 256)
!3570 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !3502, file: !3492, line: 743, baseType: !3571, size: 448)
!3571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !3492, line: 406, size: 448, elements: !3572)
!3572 = !{!3573, !3574, !3575, !3576}
!3573 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3571, file: !3492, line: 408, baseType: !3505, size: 256)
!3574 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !3571, file: !3492, line: 412, baseType: !3045, size: 64, offset: 256)
!3575 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3571, file: !3492, line: 420, baseType: !3045, size: 64, offset: 320)
!3576 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3571, file: !3492, line: 423, baseType: !3489, size: 64, offset: 384)
!3577 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !3502, file: !3492, line: 744, baseType: !3578, size: 384)
!3578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !3492, line: 429, size: 384, elements: !3579)
!3579 = !{!3580, !3581, !3582}
!3580 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3578, file: !3492, line: 431, baseType: !3505, size: 256)
!3581 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3578, file: !3492, line: 434, baseType: !3045, size: 64, offset: 256)
!3582 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !3578, file: !3492, line: 437, baseType: !3489, size: 64, offset: 320)
!3583 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !3502, file: !3492, line: 745, baseType: !3584, size: 384)
!3584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !3492, line: 443, size: 384, elements: !3585)
!3585 = !{!3586, !3587, !3588}
!3586 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3584, file: !3492, line: 445, baseType: !3505, size: 256)
!3587 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3584, file: !3492, line: 449, baseType: !3045, size: 64, offset: 256)
!3588 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !3584, file: !3492, line: 453, baseType: !3489, size: 64, offset: 320)
!3589 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !3502, file: !3492, line: 746, baseType: !3590, size: 320)
!3590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !3492, line: 459, size: 320, elements: !3591)
!3591 = !{!3592, !3593}
!3592 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3590, file: !3492, line: 461, baseType: !3505, size: 256)
!3593 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !3590, file: !3492, line: 464, baseType: !3045, size: 64, offset: 256)
!3594 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !3502, file: !3492, line: 747, baseType: !3595, size: 768)
!3595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !3492, line: 469, size: 768, elements: !3596)
!3596 = !{!3597, !3598, !3599, !3600, !3601}
!3597 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3595, file: !3492, line: 471, baseType: !3505, size: 256)
!3598 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !3595, file: !3492, line: 474, baseType: !7, size: 32, offset: 256)
!3599 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !3595, file: !3492, line: 475, baseType: !7, size: 32, offset: 288)
!3600 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3595, file: !3492, line: 478, baseType: !3045, size: 64, offset: 320)
!3601 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !3595, file: !3492, line: 481, baseType: !3602, size: 384, offset: 384)
!3602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3603, size: 384, elements: !2963)
!3603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !142, line: 1917, size: 384, elements: !3604)
!3604 = !{!3605, !3606, !3607}
!3605 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !3603, file: !142, line: 1920, baseType: !3542, size: 256)
!3606 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !3603, file: !142, line: 1921, baseType: !3045, size: 64, offset: 256)
!3607 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3603, file: !142, line: 1922, baseType: !3166, size: 32, offset: 320)
!3608 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !3502, file: !3492, line: 748, baseType: !3609, size: 320)
!3609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !3492, line: 487, size: 320, elements: !3610)
!3610 = !{!3611, !3612}
!3611 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3609, file: !3492, line: 490, baseType: !3505, size: 256)
!3612 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !3609, file: !3492, line: 494, baseType: !2948, size: 32, offset: 256)
!3613 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !3502, file: !3492, line: 749, baseType: !3614, size: 384)
!3614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !3492, line: 500, size: 384, elements: !3615)
!3615 = !{!3616, !3617, !3618}
!3616 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3614, file: !3492, line: 502, baseType: !3505, size: 256)
!3617 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !3614, file: !3492, line: 506, baseType: !3489, size: 64, offset: 256)
!3618 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3614, file: !3492, line: 510, baseType: !3489, size: 64, offset: 320)
!3619 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !3502, file: !3492, line: 750, baseType: !3620, size: 320)
!3620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !3492, line: 529, size: 320, elements: !3621)
!3621 = !{!3622, !3623}
!3622 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3620, file: !3492, line: 531, baseType: !3505, size: 256)
!3623 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3620, file: !3492, line: 540, baseType: !3489, size: 64, offset: 256)
!3624 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !3502, file: !3492, line: 751, baseType: !3625, size: 704)
!3625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !3492, line: 546, size: 704, elements: !3626)
!3626 = !{!3627, !3628, !3629, !3630, !3631, !3632, !3633}
!3627 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3625, file: !3492, line: 549, baseType: !3555, size: 512)
!3628 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3625, file: !3492, line: 553, baseType: !2951, size: 64, offset: 512)
!3629 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !3625, file: !3492, line: 557, baseType: !3158, size: 8, offset: 576)
!3630 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !3625, file: !3492, line: 558, baseType: !3158, size: 8, offset: 584)
!3631 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !3625, file: !3492, line: 559, baseType: !3158, size: 8, offset: 592)
!3632 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !3625, file: !3492, line: 560, baseType: !3158, size: 8, offset: 600)
!3633 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3625, file: !3492, line: 566, baseType: !3437, size: 64, offset: 640)
!3634 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !3502, file: !3492, line: 752, baseType: !3635, size: 384)
!3635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !3492, line: 571, size: 384, elements: !3636)
!3636 = !{!3637, !3638}
!3637 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3635, file: !3492, line: 573, baseType: !3566, size: 320)
!3638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3635, file: !3492, line: 577, baseType: !3045, size: 64, offset: 320)
!3639 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !3502, file: !3492, line: 753, baseType: !3640, size: 576)
!3640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !3492, line: 600, size: 576, elements: !3641)
!3641 = !{!3642, !3643, !3644, !3645, !3654}
!3642 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3640, file: !3492, line: 602, baseType: !3566, size: 320)
!3643 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3640, file: !3492, line: 605, baseType: !3045, size: 64, offset: 320)
!3644 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !3640, file: !3492, line: 609, baseType: !3400, size: 64, offset: 384)
!3645 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !3640, file: !3492, line: 612, baseType: !3646, size: 64, offset: 448)
!3646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3647, size: 64)
!3647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !3492, line: 581, size: 320, elements: !3648)
!3648 = !{!3649, !3650, !3651, !3652, !3653}
!3649 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !3647, file: !3492, line: 583, baseType: !141, size: 32)
!3650 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3647, file: !3492, line: 586, baseType: !3045, size: 64, offset: 64)
!3651 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3647, file: !3492, line: 589, baseType: !3045, size: 64, offset: 128)
!3652 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !3647, file: !3492, line: 592, baseType: !3045, size: 64, offset: 192)
!3653 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !3647, file: !3492, line: 595, baseType: !3045, size: 64, offset: 256)
!3654 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !3640, file: !3492, line: 616, baseType: !3489, size: 64, offset: 512)
!3655 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !3502, file: !3492, line: 754, baseType: !3656, size: 512)
!3656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !3492, line: 622, size: 512, elements: !3657)
!3657 = !{!3658, !3659, !3660, !3661}
!3658 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3656, file: !3492, line: 624, baseType: !3566, size: 320)
!3659 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3656, file: !3492, line: 628, baseType: !3045, size: 64, offset: 320)
!3660 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !3656, file: !3492, line: 632, baseType: !3045, size: 64, offset: 384)
!3661 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !3656, file: !3492, line: 636, baseType: !3045, size: 64, offset: 448)
!3662 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !3502, file: !3492, line: 755, baseType: !3663, size: 704)
!3663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !3492, line: 642, size: 704, elements: !3664)
!3664 = !{!3665, !3666, !3667, !3668}
!3665 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !3663, file: !3492, line: 644, baseType: !3656, size: 512)
!3666 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !3663, file: !3492, line: 648, baseType: !3045, size: 64, offset: 512)
!3667 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !3663, file: !3492, line: 652, baseType: !3045, size: 64, offset: 576)
!3668 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !3663, file: !3492, line: 653, baseType: !3045, size: 64, offset: 640)
!3669 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !3502, file: !3492, line: 756, baseType: !3670, size: 448)
!3670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !3492, line: 663, size: 448, elements: !3671)
!3671 = !{!3672, !3673, !3674}
!3672 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3670, file: !3492, line: 665, baseType: !3566, size: 320)
!3673 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3670, file: !3492, line: 668, baseType: !3045, size: 64, offset: 320)
!3674 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !3670, file: !3492, line: 673, baseType: !3045, size: 64, offset: 384)
!3675 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !3502, file: !3492, line: 757, baseType: !3676, size: 384)
!3676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !3492, line: 694, size: 384, elements: !3677)
!3677 = !{!3678, !3679}
!3678 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3676, file: !3492, line: 696, baseType: !3566, size: 320)
!3679 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3676, file: !3492, line: 699, baseType: !3045, size: 64, offset: 320)
!3680 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !3502, file: !3492, line: 758, baseType: !3681, size: 384)
!3681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !3492, line: 681, size: 384, elements: !3682)
!3682 = !{!3683, !3684, !3685}
!3683 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3681, file: !3492, line: 683, baseType: !3505, size: 256)
!3684 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !3681, file: !3492, line: 686, baseType: !3045, size: 64, offset: 256)
!3685 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !3681, file: !3492, line: 689, baseType: !3045, size: 64, offset: 320)
!3686 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !3502, file: !3492, line: 759, baseType: !3687, size: 384)
!3687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !3492, line: 707, size: 384, elements: !3688)
!3688 = !{!3689, !3690, !3691}
!3689 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3687, file: !3492, line: 709, baseType: !3505, size: 256)
