; ModuleID = 'regstat.c'
source_filename = "regstat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.regstat_n_sets_and_refs_t = type { i32, i32 }
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }
%struct.df_problem = type { i32, i32, void (%struct.bitmap_head_def*)*, void (%struct.bitmap_head_def*)*, void (%struct.basic_block_def*, i8*)*, void (%struct.bitmap_head_def*)*, void (%struct.bitmap_head_def*)*, void (%struct.dataflow*, %struct.bitmap_head_def*, i32*, i32)*, void (%struct.basic_block_def*)*, void (%struct.edge_def*)*, i8 (i32)*, void (%struct.bitmap_head_def*)*, void ()*, void ()*, void (%struct._IO_FILE*)*, void (%struct.basic_block_def*, %struct._IO_FILE*)*, void (%struct.basic_block_def*, %struct._IO_FILE*)*, void ()*, void ()*, %struct.df_problem*, i32, i8 }

!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_flags", file: !704, line: 84, baseType: !7, size: 32, elements: !705)
!704 = !DIFile(filename: "./df.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!706 = !DIEnumerator(name: "DF_REF_CONDITIONAL", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "DF_REF_AT_TOP", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "DF_REF_IN_NOTE", value: 4, isUnsigned: true)
!709 = !DIEnumerator(name: "DF_HARD_REG_LIVE", value: 8, isUnsigned: true)
!710 = !DIEnumerator(name: "DF_REF_PARTIAL", value: 16, isUnsigned: true)
!711 = !DIEnumerator(name: "DF_REF_READ_WRITE", value: 32, isUnsigned: true)
!712 = !DIEnumerator(name: "DF_REF_MAY_CLOBBER", value: 64, isUnsigned: true)
!713 = !DIEnumerator(name: "DF_REF_MUST_CLOBBER", value: 128, isUnsigned: true)
!714 = !DIEnumerator(name: "DF_REF_SIGN_EXTRACT", value: 256, isUnsigned: true)
!715 = !DIEnumerator(name: "DF_REF_ZERO_EXTRACT", value: 512, isUnsigned: true)
!716 = !DIEnumerator(name: "DF_REF_STRICT_LOW_PART", value: 1024, isUnsigned: true)
!717 = !DIEnumerator(name: "DF_REF_SUBREG", value: 2048, isUnsigned: true)
!718 = !DIEnumerator(name: "DF_REF_MW_HARDREG", value: 4096, isUnsigned: true)
!719 = !DIEnumerator(name: "DF_REF_CALL_STACK_USAGE", value: 8192, isUnsigned: true)
!720 = !DIEnumerator(name: "DF_REF_REG_MARKER", value: 16384, isUnsigned: true)
!721 = !DIEnumerator(name: "DF_REF_PRE_POST_MODIFY", value: 32768, isUnsigned: true)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !561, line: 836, baseType: !7, size: 32, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!724 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!756 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "df_ref_type", file: !704, line: 81, baseType: !7, size: 32, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIEnumerator(name: "DF_REF_REG_DEF", value: 0, isUnsigned: true)
!759 = !DIEnumerator(name: "DF_REF_REG_USE", value: 1, isUnsigned: true)
!760 = !DIEnumerator(name: "DF_REF_REG_MEM_LOAD", value: 2, isUnsigned: true)
!761 = !DIEnumerator(name: "DF_REF_REG_MEM_STORE", value: 3, isUnsigned: true)
!762 = !{!763, !560, !770, !780, !837, !722, !182, !846}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regstat_n_sets_and_refs_t", file: !765, line: 69, size: 64, elements: !766)
!765 = !DIFile(filename: "./regs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !{!767, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sets", scope: !764, file: !765, line: 71, baseType: !768, size: 32)
!768 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !764, file: !765, line: 72, baseType: !768, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_info_t", file: !765, line: 113, size: 224, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !771, file: !765, line: 115, baseType: !768, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "deaths", scope: !771, file: !765, line: 116, baseType: !768, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "live_length", scope: !771, file: !765, line: 117, baseType: !768, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "calls_crossed", scope: !771, file: !765, line: 118, baseType: !768, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "freq_calls_crossed", scope: !771, file: !765, line: 119, baseType: !768, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "throw_calls_crossed", scope: !771, file: !765, line: 120, baseType: !768, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "basic_block", scope: !771, file: !765, line: 121, baseType: !768, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !781, line: 47, baseType: !782)
!781 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !784, line: 75, size: 256, elements: !785)
!784 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!785 = !{!786, !801, !802, !803}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !783, file: !784, line: 76, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !784, line: 68, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !784, line: 63, size: 320, elements: !790)
!790 = !{!791, !793, !794, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !784, line: 64, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !789, file: !784, line: 65, baseType: !792, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !789, file: !784, line: 66, baseType: !7, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !789, file: !784, line: 67, baseType: !796, size: 128, offset: 192)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 128, elements: !799)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !784, line: 29, baseType: !798)
!798 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!799 = !{!800}
!800 = !DISubrange(count: 2)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !783, file: !784, line: 77, baseType: !787, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !783, file: !784, line: 78, baseType: !7, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !783, file: !784, line: 79, baseType: !804, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !784, line: 49, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !784, line: 45, size: 832, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !806, file: !784, line: 46, baseType: !792, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !806, file: !784, line: 47, baseType: !782, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !806, file: !784, line: 48, baseType: !811, size: 704, offset: 128)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !812, line: 164, size: 704, elements: !813)
!812 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !{!814, !816, !828, !829, !830, !831, !832, !833, !838, !842, !843, !844, !845}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !811, file: !812, line: 166, baseType: !815, size: 64)
!815 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !811, file: !812, line: 167, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !812, line: 157, size: 192, elements: !819)
!819 = !{!820, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !818, file: !812, line: 159, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !818, file: !812, line: 160, baseType: !817, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !818, file: !812, line: 161, baseType: !825, size: 32, offset: 128)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 32, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 4)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !811, file: !812, line: 168, baseType: !821, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !811, file: !812, line: 169, baseType: !821, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !811, file: !812, line: 170, baseType: !821, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !811, file: !812, line: 171, baseType: !815, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !811, file: !812, line: 172, baseType: !768, size: 32, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !811, file: !812, line: 176, baseType: !834, size: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!817, !837, !815}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !811, file: !812, line: 177, baseType: !839, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !837, !817}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !811, file: !812, line: 178, baseType: !837, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !811, file: !812, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !811, file: !812, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !811, file: !812, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_scan_bb_info", file: !704, line: 771, size: 128, elements: !848)
!848 = !{!849, !2020}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_defs", scope: !847, file: !704, line: 782, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !704, line: 429, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !704, line: 422, size: 704, elements: !854)
!854 = !{!855, !2002, !2008, !2013}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !853, file: !704, line: 424, baseType: !856, size: 512)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !704, line: 356, size: 512, elements: !857)
!857 = !{!858, !859, !860, !861, !1971, !1977, !1997, !1998, !1999, !2000, !2001}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !856, file: !704, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !856, file: !704, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !856, file: !704, line: 364, baseType: !768, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !856, file: !704, line: 365, baseType: !862, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !781, line: 50, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !864, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !864, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !864, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !864, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !864, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !864, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !864, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !864, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !864, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !864, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !864, file: !561, line: 321, baseType: !877, size: 320, offset: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !878)
!878 = !{!879, !1906, !1908, !1969, !1970}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !877, file: !561, line: 316, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 64, elements: !898)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !883)
!883 = !{!884, !885, !886, !889, !890, !900, !901, !913, !916, !917, !1884, !1885, !1896, !1903}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !882, file: !561, line: 168, baseType: !768, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !882, file: !561, line: 169, baseType: !7, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !882, file: !561, line: 170, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !882, file: !561, line: 171, baseType: !862, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !882, file: !561, line: 172, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !781, line: 53, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !893, file: !561, line: 360, baseType: !768, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !893, file: !561, line: 361, baseType: !897, size: 64, offset: 64)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 1)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !882, file: !561, line: 173, baseType: !182, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !882, file: !561, line: 174, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !903, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !903, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !903, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !903, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !903, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !903, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !903, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !903, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !882, file: !561, line: 175, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !882, file: !561, line: 176, baseType: !782, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !882, file: !561, line: 177, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !781, line: 56, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !921)
!921 = !{!922, !955, !961, !972, !991, !1002, !1007, !1014, !1020, !1034, !1046, !1084, !1089, !1117, !1125, !1126, !1131, !1140, !1146, !1151, !1155, !1159, !1520, !1569, !1575, !1581, !1588, !1614, !1628, !1645, !1657, !1679, !1694, !1866}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !920, file: !334, line: 3372, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !924)
!924 = !{!925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !923, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !923, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !923, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !923, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !923, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !923, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !923, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !923, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !923, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !923, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !923, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !923, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !923, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !923, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !923, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !923, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !923, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !923, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !923, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !923, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !923, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !923, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !923, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !923, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !923, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !923, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !923, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !923, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !923, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !923, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !334, line: 3373, baseType: !956, size: 192)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !956, file: !334, line: 403, baseType: !923, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !956, file: !334, line: 404, baseType: !918, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !334, line: 405, baseType: !918, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !920, file: !334, line: 3374, baseType: !962, size: 320)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !334, line: 1385, baseType: !956, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !962, file: !334, line: 1386, baseType: !966, size: 128, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !967, line: 58, baseType: !968)
!967 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !967, line: 54, size: 128, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !968, file: !967, line: 56, baseType: !798, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !968, file: !967, line: 57, baseType: !815, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !920, file: !334, line: 3375, baseType: !973, size: 256)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !973, file: !334, line: 1398, baseType: !956, size: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !973, file: !334, line: 1399, baseType: !977, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !979, line: 52, size: 256, elements: !980)
!979 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!980 = !{!981, !982, !983, !984, !985, !986, !987}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !978, file: !979, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !978, file: !979, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !978, file: !979, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !978, file: !979, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !978, file: !979, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !978, file: !979, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !978, file: !979, line: 62, baseType: !988, size: 192, offset: 64)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 192, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 3)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !920, file: !334, line: 3376, baseType: !992, size: 256)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !334, line: 1409, baseType: !956, size: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !992, file: !334, line: 1410, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !998, line: 27, size: 192, elements: !999)
!998 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !997, file: !998, line: 29, baseType: !966, size: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !997, file: !998, line: 30, baseType: !182, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !920, file: !334, line: 3377, baseType: !1003, size: 256)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !334, line: 1438, baseType: !956, size: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1003, file: !334, line: 1439, baseType: !918, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !920, file: !334, line: 3378, baseType: !1008, size: 256)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1008, file: !334, line: 1419, baseType: !956, size: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1008, file: !334, line: 1420, baseType: !768, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1008, file: !334, line: 1421, baseType: !1013, size: 8, offset: 224)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 8, elements: !898)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !920, file: !334, line: 3379, baseType: !1015, size: 320)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !334, line: 1429, baseType: !956, size: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1015, file: !334, line: 1430, baseType: !918, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1015, file: !334, line: 1431, baseType: !918, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !920, file: !334, line: 3380, baseType: !1021, size: 320)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !334, line: 1461, baseType: !956, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1021, file: !334, line: 1462, baseType: !1025, size: 128, offset: 192)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1026, line: 31, size: 128, elements: !1027)
!1026 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1027 = !{!1028, !1032, !1033}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1025, file: !1026, line: 32, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1025, file: !1026, line: 33, baseType: !7, size: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1025, file: !1026, line: 34, baseType: !7, size: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !920, file: !334, line: 3381, baseType: !1035, size: 384)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1036)
!1036 = !{!1037, !1038, !1043, !1044, !1045}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !334, line: 2508, baseType: !956, size: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1035, file: !334, line: 2509, baseType: !1039, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1040, line: 58, baseType: !1041)
!1040 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1042, line: 44, baseType: !7)
!1042 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1035, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1035, file: !334, line: 2511, baseType: !918, size: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1035, file: !334, line: 2512, baseType: !918, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !920, file: !334, line: 3382, baseType: !1047, size: 896)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !334, line: 2653, baseType: !1035, size: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1047, file: !334, line: 2654, baseType: !918, size: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1047, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1047, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1047, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1047, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1047, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1047, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1047, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1047, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1047, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1047, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1047, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1047, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1047, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1047, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1047, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1047, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1047, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1047, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1047, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1047, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1047, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1047, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1047, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1047, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1047, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1047, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1047, file: !334, line: 2705, baseType: !918, size: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1047, file: !334, line: 2706, baseType: !918, size: 64, offset: 640)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1047, file: !334, line: 2707, baseType: !918, size: 64, offset: 704)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1047, file: !334, line: 2708, baseType: !918, size: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1047, file: !334, line: 2711, baseType: !1082, size: 64, offset: 832)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !920, file: !334, line: 3383, baseType: !1085, size: 960)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !334, line: 2757, baseType: !1047, size: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1085, file: !334, line: 2758, baseType: !862, size: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !920, file: !334, line: 3384, baseType: !1090, size: 1472)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1091)
!1091 = !{!1092, !1113, !1114, !1115, !1116}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !334, line: 3115, baseType: !1093, size: 1216)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !334, line: 2985, baseType: !1085, size: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1093, file: !334, line: 2986, baseType: !918, size: 64, offset: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1093, file: !334, line: 2987, baseType: !918, size: 64, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1093, file: !334, line: 2988, baseType: !918, size: 64, offset: 1088)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1093, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1093, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1093, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1093, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1093, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1093, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1093, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1093, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1093, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1093, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1093, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1093, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1093, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1093, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1090, file: !334, line: 3117, baseType: !918, size: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1090, file: !334, line: 3119, baseType: !918, size: 64, offset: 1280)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1090, file: !334, line: 3121, baseType: !918, size: 64, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1090, file: !334, line: 3123, baseType: !918, size: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !920, file: !334, line: 3385, baseType: !1118, size: 1088)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !334, line: 2875, baseType: !1085, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1118, file: !334, line: 2876, baseType: !862, size: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1118, file: !334, line: 2877, baseType: !1123, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !920, file: !334, line: 3386, baseType: !1093, size: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !920, file: !334, line: 3387, baseType: !1127, size: 1280)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !334, line: 3094, baseType: !1093, size: 1216)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1127, file: !334, line: 3095, baseType: !1123, size: 64, offset: 1216)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !920, file: !334, line: 3388, baseType: !1132, size: 1216)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !334, line: 2825, baseType: !1047, size: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1132, file: !334, line: 2827, baseType: !918, size: 64, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1132, file: !334, line: 2828, baseType: !918, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1132, file: !334, line: 2829, baseType: !918, size: 64, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1132, file: !334, line: 2830, baseType: !918, size: 64, offset: 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1132, file: !334, line: 2831, baseType: !918, size: 64, offset: 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !920, file: !334, line: 3389, baseType: !1141, size: 1024)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !334, line: 2851, baseType: !1085, size: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1141, file: !334, line: 2852, baseType: !768, size: 32, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1141, file: !334, line: 2853, baseType: !768, size: 32, offset: 992)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !920, file: !334, line: 3390, baseType: !1147, size: 1024)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !334, line: 2858, baseType: !1085, size: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1147, file: !334, line: 2859, baseType: !1123, size: 64, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !920, file: !334, line: 3391, baseType: !1152, size: 960)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1153)
!1153 = !{!1154}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !334, line: 2863, baseType: !1085, size: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !920, file: !334, line: 3392, baseType: !1156, size: 1472)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !334, line: 3305, baseType: !1090, size: 1472)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !920, file: !334, line: 3393, baseType: !1160, size: 1792)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1161)
!1161 = !{!1162, !1163, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !334, line: 3249, baseType: !1090, size: 1472)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1160, file: !334, line: 3251, baseType: !1164, size: 64, offset: 1472)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1166, line: 463, size: 1152, elements: !1167)
!1166 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1167 = !{!1168, !1332, !1436, !1437, !1440, !1443, !1444, !1445, !1446, !1447, !1448, !1472, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1165, file: !1166, line: 464, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !311, line: 194, size: 384, elements: !1171)
!1171 = !{!1172, !1221, !1234, !1248, !1300, !1313}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1170, file: !311, line: 197, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !311, line: 182, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !311, line: 116, size: 704, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1209, !1218, !1219, !1220}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1175, file: !311, line: 119, baseType: !1174, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1175, file: !311, line: 122, baseType: !1174, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1175, file: !311, line: 123, baseType: !1174, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1175, file: !311, line: 126, baseType: !768, size: 32, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1175, file: !311, line: 129, baseType: !310, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1175, file: !311, line: 165, baseType: !1183, size: 192, offset: 256)
!1183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !311, line: 132, size: 192, elements: !1184)
!1184 = !{!1185, !1198, !1204}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1183, file: !311, line: 137, baseType: !1186, size: 128)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !311, line: 133, size: 128, elements: !1187)
!1187 = !{!1188, !1197}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1186, file: !311, line: 135, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !311, line: 93, size: 320, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1190, file: !311, line: 96, baseType: !1189, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1190, file: !311, line: 97, baseType: !1189, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1190, file: !311, line: 101, baseType: !918, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1190, file: !311, line: 106, baseType: !918, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1190, file: !311, line: 111, baseType: !918, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1186, file: !311, line: 136, baseType: !1189, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1183, file: !311, line: 151, baseType: !1199, size: 192)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !311, line: 139, size: 192, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1199, file: !311, line: 141, baseType: !918, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1199, file: !311, line: 145, baseType: !918, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1199, file: !311, line: 150, baseType: !768, size: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1183, file: !311, line: 164, baseType: !1205, size: 128)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !311, line: 153, size: 128, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1205, file: !311, line: 161, baseType: !918, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1205, file: !311, line: 163, baseType: !1039, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1175, file: !311, line: 168, baseType: !1210, size: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !311, line: 67, size: 320, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1211, file: !311, line: 70, baseType: !1210, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1211, file: !311, line: 73, baseType: !1174, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1211, file: !311, line: 78, baseType: !918, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1211, file: !311, line: 85, baseType: !862, size: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1211, file: !311, line: 88, baseType: !768, size: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1175, file: !311, line: 173, baseType: !862, size: 64, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1175, file: !311, line: 173, baseType: !862, size: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1175, file: !311, line: 177, baseType: !1031, size: 8, offset: 640)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1170, file: !311, line: 200, baseType: !1222, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !311, line: 185, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !311, line: 185, size: 128, elements: !1225)
!1225 = !{!1226}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1224, file: !311, line: 185, baseType: !1227, size: 128)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !311, line: 184, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !311, line: 184, size: 128, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1228, file: !311, line: 184, baseType: !7, size: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1228, file: !311, line: 184, baseType: !7, size: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1228, file: !311, line: 184, baseType: !1233, size: 64, offset: 64)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 64, elements: !898)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1170, file: !311, line: 203, baseType: !1235, size: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !311, line: 189, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !311, line: 189, size: 128, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1237, file: !311, line: 189, baseType: !1240, size: 128)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !311, line: 188, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !311, line: 188, size: 128, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1241, file: !311, line: 188, baseType: !7, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1241, file: !311, line: 188, baseType: !7, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1241, file: !311, line: 188, baseType: !1246, size: 64, offset: 64)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1247, size: 64, elements: !898)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !311, line: 180, baseType: !1210)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1170, file: !311, line: 207, baseType: !1249, size: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1250, line: 144, baseType: !1251)
!1250 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1250, line: 100, size: 896, elements: !1253)
!1253 = !{!1254, !1262, !1267, !1272, !1274, !1277, !1278, !1279, !1280, !1281, !1286, !1288, !1289, !1294, !1299}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1252, file: !1250, line: 102, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1250, line: 52, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!1259, !1260}
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1250, line: 47, baseType: !7)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1252, file: !1250, line: 105, baseType: !1263, size: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1250, line: 59, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!768, !1260, !1260}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1252, file: !1250, line: 108, baseType: !1268, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1250, line: 63, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !837}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1252, file: !1250, line: 111, baseType: !1273, size: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1252, file: !1250, line: 114, baseType: !1275, size: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1276, line: 46, baseType: !798)
!1276 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1252, file: !1250, line: 117, baseType: !1275, size: 64, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1252, file: !1250, line: 120, baseType: !1275, size: 64, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1252, file: !1250, line: 124, baseType: !7, size: 32, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1252, file: !1250, line: 128, baseType: !7, size: 32, offset: 480)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1252, file: !1250, line: 131, baseType: !1282, size: 64, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1250, line: 75, baseType: !1283)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!837, !1275, !1275}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1252, file: !1250, line: 132, baseType: !1287, size: 64, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1250, line: 78, baseType: !1269)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1252, file: !1250, line: 135, baseType: !837, size: 64, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1252, file: !1250, line: 136, baseType: !1290, size: 64, offset: 704)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1250, line: 82, baseType: !1291)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!837, !837, !1275, !1275}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1252, file: !1250, line: 137, baseType: !1295, size: 64, offset: 768)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1250, line: 83, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !837, !837}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1252, file: !1250, line: 141, baseType: !7, size: 32, offset: 832)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1170, file: !311, line: 211, baseType: !1301, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1304)
!1304 = !{!1305}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1303, file: !334, line: 183, baseType: !1306, size: 128)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1307, file: !334, line: 182, baseType: !7, size: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1307, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1307, file: !334, line: 182, baseType: !1312, size: 64, offset: 64)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 64, elements: !898)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1170, file: !311, line: 220, baseType: !1314, size: 64, offset: 320)
!1314 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !311, line: 217, size: 64, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1314, file: !311, line: 218, baseType: !1301, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1314, file: !311, line: 219, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1320, line: 29, baseType: !1321)
!1320 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1320, line: 29, size: 96, elements: !1322)
!1322 = !{!1323}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1321, file: !1320, line: 29, baseType: !1324, size: 96)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1320, line: 27, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1320, line: 27, size: 96, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1325, file: !1320, line: 27, baseType: !7, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1325, file: !1320, line: 27, baseType: !7, size: 32, offset: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1325, file: !1320, line: 27, baseType: !1330, size: 8, offset: 64)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1331, size: 8, elements: !898)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1320, line: 26, baseType: !1031)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1165, file: !1166, line: 467, baseType: !1333, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1335)
!1335 = !{!1336, !1411, !1412, !1425, !1426, !1427, !1428, !1429, !1430, !1432, !1434, !1435}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1334, file: !318, line: 377, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !781, line: 111, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1340)
!1340 = !{!1341, !1376, !1377, !1378, !1381, !1385, !1386, !1387, !1405, !1406, !1407, !1408, !1409, !1410}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1339, file: !318, line: 219, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1345)
!1345 = !{!1346}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1344, file: !318, line: 151, baseType: !1347, size: 128)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1349)
!1349 = !{!1350, !1351, !1352}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1348, file: !318, line: 150, baseType: !7, size: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1348, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1348, file: !318, line: 150, baseType: !1353, size: 64, offset: 64)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1354, size: 64, elements: !898)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !781, line: 108, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1356, file: !318, line: 124, baseType: !1338, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1356, file: !318, line: 125, baseType: !1338, size: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1356, file: !318, line: 131, baseType: !1361, size: 64, offset: 128)
!1361 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1362)
!1362 = !{!1363, !1367}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1361, file: !318, line: 129, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !781, line: 66, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !781, line: 65, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1361, file: !318, line: 130, baseType: !862, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1356, file: !318, line: 134, baseType: !837, size: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1356, file: !318, line: 137, baseType: !918, size: 64, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1356, file: !318, line: 138, baseType: !1039, size: 32, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1356, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1356, file: !318, line: 144, baseType: !768, size: 32, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1356, file: !318, line: 145, baseType: !768, size: 32, offset: 416)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1356, file: !318, line: 146, baseType: !1375, size: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !815)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1339, file: !318, line: 220, baseType: !1342, size: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1339, file: !318, line: 223, baseType: !837, size: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1339, file: !318, line: 226, baseType: !1379, size: 64, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1339, file: !318, line: 229, baseType: !1382, size: 128, offset: 256)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1383, size: 128, elements: !799)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1339, file: !318, line: 232, baseType: !1338, size: 64, offset: 384)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1339, file: !318, line: 233, baseType: !1338, size: 64, offset: 448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1339, file: !318, line: 238, baseType: !1388, size: 64, offset: 512)
!1388 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1389)
!1389 = !{!1390, !1396}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1388, file: !318, line: 236, baseType: !1391, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1393)
!1393 = !{!1394, !1395}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1392, file: !318, line: 275, baseType: !1364, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1392, file: !318, line: 278, baseType: !1364, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1388, file: !318, line: 237, baseType: !1397, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1399)
!1399 = !{!1400, !1401, !1402, !1403, !1404}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1398, file: !318, line: 261, baseType: !862, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1398, file: !318, line: 262, baseType: !862, size: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1398, file: !318, line: 266, baseType: !862, size: 64, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1398, file: !318, line: 267, baseType: !862, size: 64, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1398, file: !318, line: 270, baseType: !768, size: 32, offset: 256)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1339, file: !318, line: 241, baseType: !1375, size: 64, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1339, file: !318, line: 244, baseType: !768, size: 32, offset: 640)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1339, file: !318, line: 247, baseType: !768, size: 32, offset: 672)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1339, file: !318, line: 250, baseType: !768, size: 32, offset: 704)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1339, file: !318, line: 253, baseType: !768, size: 32, offset: 736)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1339, file: !318, line: 256, baseType: !768, size: 32, offset: 768)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1334, file: !318, line: 378, baseType: !1337, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1334, file: !318, line: 381, baseType: !1413, size: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1416)
!1416 = !{!1417}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1415, file: !318, line: 282, baseType: !1418, size: 128)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1420)
!1420 = !{!1421, !1422, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1419, file: !318, line: 281, baseType: !7, size: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1419, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1419, file: !318, line: 281, baseType: !1424, size: 64, offset: 64)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1337, size: 64, elements: !898)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1334, file: !318, line: 384, baseType: !768, size: 32, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1334, file: !318, line: 387, baseType: !768, size: 32, offset: 224)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1334, file: !318, line: 390, baseType: !768, size: 32, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1334, file: !318, line: 394, baseType: !1413, size: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1334, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1334, file: !318, line: 399, baseType: !1431, size: 64, offset: 416)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !799)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1334, file: !318, line: 402, baseType: !1433, size: 64, offset: 480)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !799)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1334, file: !318, line: 406, baseType: !768, size: 32, offset: 544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1334, file: !318, line: 409, baseType: !768, size: 32, offset: 576)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1165, file: !1166, line: 470, baseType: !1365, size: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1165, file: !1166, line: 473, baseType: !1438, size: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1166, line: 166, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1165, file: !1166, line: 476, baseType: !1441, size: 64, offset: 256)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1166, line: 476, flags: DIFlagFwdDecl)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1165, file: !1166, line: 479, baseType: !1249, size: 64, offset: 320)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1165, file: !1166, line: 484, baseType: !918, size: 64, offset: 384)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1165, file: !1166, line: 488, baseType: !918, size: 64, offset: 448)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1165, file: !1166, line: 493, baseType: !918, size: 64, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1165, file: !1166, line: 496, baseType: !918, size: 64, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1165, file: !1166, line: 501, baseType: !1449, size: 64, offset: 640)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1451)
!1451 = !{!1452, !1455, !1456, !1457, !1458, !1460, !1461, !1466, !1467, !1468, !1469, !1470, !1471}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1450, file: !329, line: 2356, baseType: !1453, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1450, file: !329, line: 2357, baseType: !887, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1450, file: !329, line: 2358, baseType: !768, size: 32, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1450, file: !329, line: 2359, baseType: !768, size: 32, offset: 160)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1450, file: !329, line: 2360, baseType: !1459, size: 128, offset: 192)
!1459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 128, elements: !826)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1450, file: !329, line: 2364, baseType: !768, size: 32, offset: 320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1450, file: !329, line: 2367, baseType: !1462, size: 128, offset: 384)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1463)
!1463 = !{!1464, !1465}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1462, file: !329, line: 2351, baseType: !862, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1462, file: !329, line: 2352, baseType: !815, size: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1450, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1450, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1450, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1450, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1450, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1450, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1165, file: !1166, line: 504, baseType: !1473, size: 64, offset: 704)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1166, line: 504, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1165, file: !1166, line: 507, baseType: !1249, size: 64, offset: 768)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1165, file: !1166, line: 510, baseType: !768, size: 32, offset: 832)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1165, file: !1166, line: 513, baseType: !768, size: 32, offset: 864)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1165, file: !1166, line: 516, baseType: !1039, size: 32, offset: 896)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1165, file: !1166, line: 519, baseType: !1039, size: 32, offset: 928)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1165, file: !1166, line: 522, baseType: !7, size: 32, offset: 960)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1165, file: !1166, line: 523, baseType: !7, size: 32, offset: 992)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1165, file: !1166, line: 528, baseType: !887, size: 64, offset: 1024)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1165, file: !1166, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1165, file: !1166, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1165, file: !1166, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1165, file: !1166, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1165, file: !1166, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1165, file: !1166, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1165, file: !1166, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1165, file: !1166, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1165, file: !1166, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1165, file: !1166, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1165, file: !1166, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1165, file: !1166, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1165, file: !1166, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1165, file: !1166, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1165, file: !1166, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1165, file: !1166, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1160, file: !334, line: 3254, baseType: !918, size: 64, offset: 1536)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1160, file: !334, line: 3257, baseType: !918, size: 64, offset: 1600)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1160, file: !334, line: 3258, baseType: !918, size: 64, offset: 1664)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1160, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1160, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1160, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1160, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1160, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1160, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1160, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1160, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1160, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1160, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1160, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1160, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1160, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1160, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1160, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
