; ModuleID = 'cpp_line-map.c'
source_filename = "cpp_line-map.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.line_maps = type { %struct.line_map*, i32, i32, i32, i32, i32, i8, i32, i32, i32, i8* (i8*, i64)* }
%struct.line_map = type { i8*, i32, i32, i32, i8, i8, i8 }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [44 x i8] c"line-map.c: file \22%s\22 entered but not left\0A\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"<stdin>\00", align 1
@.str.2 = private unnamed_addr constant [44 x i8] c"line-map.c: file \22%s\22 left but not entered\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c" %s\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @linemap_init(%struct.line_maps* %set) #0 !dbg !34 {
entry:
  %set.addr = alloca %struct.line_maps*, align 8
  store %struct.line_maps* %set, %struct.line_maps** %set.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cpp_line-map.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lc_reason", file: !4, line: 36, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LC_ENTER", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LC_LEAVE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LC_RENAME", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LC_RENAME_VERBATIM", value: 3, isUnsigned: true)
!11 = !{!12, !29, !24}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !4, line: 61, size: 192, elements: !14)
!14 = !{!15, !19, !21, !23, !25, !26, !28}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !13, file: !4, line: 62, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !13, file: !4, line: 63, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !4, line: 39, baseType: !5)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !13, file: !4, line: 64, baseType: !22, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !4, line: 44, baseType: !5)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !13, file: !4, line: 65, baseType: !24, size: 32, offset: 128)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !13, file: !4, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !13, file: !4, line: 68, baseType: !27, size: 8, offset: 168)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !13, file: !4, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !{i32 7, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 1, !"wchar_size", i32 4}
!33 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!34 = distinct !DISubprogram(name: "linemap_init", scope: !1, file: !1, line: 33, type: !35, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !58)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !4, line: 74, size: 448, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !38, file: !4, line: 75, baseType: !12, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !38, file: !4, line: 76, baseType: !5, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !38, file: !4, line: 77, baseType: !5, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !38, file: !4, line: 79, baseType: !5, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !38, file: !4, line: 84, baseType: !24, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !38, file: !4, line: 87, baseType: !5, size: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !38, file: !4, line: 90, baseType: !27, size: 8, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !38, file: !4, line: 93, baseType: !22, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !38, file: !4, line: 96, baseType: !22, size: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !38, file: !4, line: 100, baseType: !5, size: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !38, file: !4, line: 104, baseType: !51, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !4, line: 47, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!29, !29, !55}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !{}
!59 = !DILocalVariable(name: "set", arg: 1, scope: !34, file: !1, line: 33, type: !37)
!60 = !DILocation(line: 33, column: 33, scope: !34)
!61 = !DILocation(line: 35, column: 3, scope: !34)
!62 = !DILocation(line: 35, column: 8, scope: !34)
!63 = !DILocation(line: 35, column: 13, scope: !34)
!64 = !DILocation(line: 36, column: 3, scope: !34)
!65 = !DILocation(line: 36, column: 8, scope: !34)
!66 = !DILocation(line: 36, column: 18, scope: !34)
!67 = !DILocation(line: 37, column: 3, scope: !34)
!68 = !DILocation(line: 37, column: 8, scope: !34)
!69 = !DILocation(line: 37, column: 13, scope: !34)
!70 = !DILocation(line: 38, column: 3, scope: !34)
!71 = !DILocation(line: 38, column: 8, scope: !34)
!72 = !DILocation(line: 38, column: 20, scope: !34)
!73 = !DILocation(line: 39, column: 3, scope: !34)
!74 = !DILocation(line: 39, column: 8, scope: !34)
!75 = !DILocation(line: 39, column: 23, scope: !34)
!76 = !DILocation(line: 40, column: 3, scope: !34)
!77 = !DILocation(line: 40, column: 8, scope: !34)
!78 = !DILocation(line: 40, column: 14, scope: !34)
!79 = !DILocation(line: 41, column: 3, scope: !34)
!80 = !DILocation(line: 41, column: 8, scope: !34)
!81 = !DILocation(line: 41, column: 14, scope: !34)
!82 = !DILocation(line: 42, column: 3, scope: !34)
!83 = !DILocation(line: 42, column: 8, scope: !34)
!84 = !DILocation(line: 42, column: 25, scope: !34)
!85 = !DILocation(line: 43, column: 3, scope: !34)
!86 = !DILocation(line: 43, column: 8, scope: !34)
!87 = !DILocation(line: 43, column: 21, scope: !34)
!88 = !DILocation(line: 44, column: 3, scope: !34)
!89 = !DILocation(line: 44, column: 8, scope: !34)
!90 = !DILocation(line: 44, column: 24, scope: !34)
!91 = !DILocation(line: 45, column: 3, scope: !34)
!92 = !DILocation(line: 45, column: 8, scope: !34)
!93 = !DILocation(line: 45, column: 20, scope: !34)
!94 = !DILocation(line: 46, column: 1, scope: !34)
!95 = distinct !DISubprogram(name: "linemap_check_files_exited", scope: !1, file: !1, line: 51, type: !35, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !58)
!96 = !DILocalVariable(name: "set", arg: 1, scope: !95, file: !1, line: 51, type: !37)
!97 = !DILocation(line: 51, column: 47, scope: !95)
!98 = !DILocalVariable(name: "map", scope: !95, file: !1, line: 53, type: !12)
!99 = !DILocation(line: 53, column: 20, scope: !95)
!100 = !DILocation(line: 56, column: 15, scope: !101)
!101 = distinct !DILexicalBlock(scope: !95, file: !1, line: 56, column: 3)
!102 = !DILocation(line: 56, column: 20, scope: !101)
!103 = !DILocation(line: 56, column: 25, scope: !101)
!104 = !DILocation(line: 56, column: 30, scope: !101)
!105 = !DILocation(line: 56, column: 35, scope: !101)
!106 = !DILocation(line: 56, column: 12, scope: !101)
!107 = !DILocation(line: 56, column: 8, scope: !101)
!108 = !DILocation(line: 56, column: 43, scope: !109)
!109 = distinct !DILexicalBlock(scope: !101, file: !1, line: 56, column: 3)
!110 = !DILocation(line: 56, column: 41, scope: !109)
!111 = !DILocation(line: 56, column: 3, scope: !101)
!112 = !DILocation(line: 58, column: 14, scope: !109)
!113 = !DILocation(line: 59, column: 7, scope: !109)
!114 = !DILocation(line: 59, column: 12, scope: !109)
!115 = !DILocation(line: 58, column: 5, scope: !109)
!116 = !DILocation(line: 57, column: 14, scope: !109)
