; ModuleID = 'splay-tree.c'
source_filename = "splay-tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.splay_tree_s = type { %struct.splay_tree_node_s*, i32 (i64, i64)*, void (i64)*, void (i64)*, i8* (i32, i8*)*, void (i8*, i8*)*, i8* }
%struct.splay_tree_node_s = type { i64, i64, %struct.splay_tree_node_s*, %struct.splay_tree_node_s* }

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.splay_tree_s* @splay_tree_new(i32 (i64, i64)* %compare_fn, void (i64)* %delete_key_fn, void (i64)* %delete_value_fn) #0 !dbg !56 {
entry:
  %compare_fn.addr = alloca i32 (i64, i64)*, align 8
  %delete_key_fn.addr = alloca void (i64)*, align 8
  %delete_value_fn.addr = alloca void (i64)*, align 8
  store i32 (i64, i64)* %compare_fn, i32 (i64, i64)** %compare_fn.addr, align 8
  call void @llvm.dbg.declare(metadata i32 (i64, i64)** %compare_fn.addr, metadata !59, metadata !DIExpression()), !dbg !60
  store void (i64)* %delete_key_fn, void (i64)** %delete_key_fn.addr, align 8
  call void @llvm.dbg.declare(metadata void (i64)** %delete_key_fn.addr, metadata !61, metadata !DIExpression()), !dbg !62
  store void (i64)* %delete_value_fn, void (i64)** %delete_value_fn.addr, align 8
  call void @llvm.dbg.declare(metadata void (i64)** %delete_value_fn.addr, metadata !63, metadata !DIExpression()), !dbg !64

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "splay-tree.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !50, !10, !27, !43, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree", file: !5, line: 128, baseType: !6)
!5 = !DIFile(filename: "./include/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "splay_tree_s", file: !5, line: 109, size: 448, elements: !8)
!8 = !{!9, !22, !28, !33, !38, !44, !49}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !7, file: !5, line: 111, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_node", file: !5, line: 66, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "splay_tree_node_s", file: !5, line: 96, size: 256, elements: !13)
!13 = !{!14, !18, !20, !21}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !12, file: !5, line: 98, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !5, line: 62, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !5, line: 41, baseType: !17)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !12, file: !5, line: 101, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_value", file: !5, line: 63, baseType: !16)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !12, file: !5, line: 104, baseType: !10, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !12, file: !5, line: 105, baseType: !10, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !7, file: !5, line: 114, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_compare_fn", file: !5, line: 70, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !15, !15}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "delete_key", scope: !7, file: !5, line: 117, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_delete_key_fn", file: !5, line: 74, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !15}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "delete_value", scope: !7, file: !5, line: 120, baseType: !34, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_delete_value_fn", file: !5, line: 78, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !19}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !7, file: !5, line: 123, baseType: !39, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_allocate_fn", file: !5, line: 87, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !27, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate", scope: !7, file: !5, line: 124, baseType: !45, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_deallocate_fn", file: !5, line: 93, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !43, !43}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_data", scope: !7, file: !5, line: 125, baseType: !43, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!56 = distinct !DISubprogram(name: "splay_tree_new", scope: !1, file: !1, line: 246, type: !57, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!4, !23, !29, !34}
!59 = !DILocalVariable(name: "compare_fn", arg: 1, scope: !56, file: !1, line: 246, type: !23)
!60 = !DILocation(line: 246, column: 39, scope: !56)
!61 = !DILocalVariable(name: "delete_key_fn", arg: 2, scope: !56, file: !1, line: 247, type: !29)
!62 = !DILocation(line: 247, column: 42, scope: !56)
!63 = !DILocalVariable(name: "delete_value_fn", arg: 3, scope: !56, file: !1, line: 248, type: !34)
!64 = !DILocation(line: 248, column: 44, scope: !56)
!65 = !DILocation(line: 251, column: 12, scope: !56)
!66 = !DILocation(line: 251, column: 24, scope: !56)
!67 = !DILocation(line: 251, column: 39, scope: !56)
!68 = !DILocation(line: 250, column: 11, scope: !56)
!69 = !DILocation(line: 250, column: 3, scope: !56)
!70 = distinct !DISubprogram(name: "splay_tree_new_with_allocator", scope: !1, file: !1, line: 261, type: !71, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!71 = !DISubroutineType(types: !72)
!72 = !{!4, !23, !29, !34, !39, !45, !43}
!73 = !DILocalVariable(name: "compare_fn", arg: 1, scope: !70, file: !1, line: 261, type: !23)
!74 = !DILocation(line: 261, column: 54, scope: !70)
!75 = !DILocalVariable(name: "delete_key_fn", arg: 2, scope: !70, file: !1, line: 262, type: !29)
!76 = !DILocation(line: 262, column: 57, scope: !70)
!77 = !DILocalVariable(name: "delete_value_fn", arg: 3, scope: !70, file: !1, line: 263, type: !34)
!78 = !DILocation(line: 263, column: 59, scope: !70)
!79 = !DILocalVariable(name: "allocate_fn", arg: 4, scope: !70, file: !1, line: 264, type: !39)
!80 = !DILocation(line: 264, column: 55, scope: !70)
!81 = !DILocalVariable(name: "deallocate_fn", arg: 5, scope: !70, file: !1, line: 265, type: !45)
!82 = !DILocation(line: 265, column: 57, scope: !70)
!83 = !DILocalVariable(name: "allocate_data", arg: 6, scope: !70, file: !1, line: 266, type: !43)
!84 = !DILocation(line: 266, column: 38, scope: !70)
!85 = !DILocalVariable(name: "sp", scope: !70, file: !1, line: 268, type: !4)
!86 = !DILocation(line: 268, column: 14, scope: !70)
!87 = !DILocation(line: 268, column: 34, scope: !70)
!88 = !DILocation(line: 269, column: 48, scope: !70)
!89 = !DILocation(line: 268, column: 32, scope: !70)
!90 = !DILocation(line: 268, column: 19, scope: !70)
!91 = !DILocation(line: 270, column: 3, scope: !70)
!92 = !DILocation(line: 270, column: 7, scope: !70)
!93 = !DILocation(line: 270, column: 12, scope: !70)
!94 = !DILocation(line: 271, column: 14, scope: !70)
!95 = !DILocation(line: 271, column: 3, scope: !70)
!96 = !DILocation(line: 271, column: 7, scope: !70)
!97 = !DILocation(line: 271, column: 12, scope: !70)
!98 = !DILocation(line: 272, column: 20, scope: !70)
!99 = !DILocation(line: 272, column: 3, scope: !70)
!100 = !DILocation(line: 272, column: 7, scope: !70)
!101 = !DILocation(line: 272, column: 18, scope: !70)
!102 = !DILocation(line: 273, column: 22, scope: !70)
!103 = !DILocation(line: 273, column: 3, scope: !70)
!104 = !DILocation(line: 273, column: 7, scope: !70)
!105 = !DILocation(line: 273, column: 20, scope: !70)
!106 = !DILocation(line: 274, column: 18, scope: !70)
!107 = !DILocation(line: 274, column: 3, scope: !70)
!108 = !DILocation(line: 274, column: 7, scope: !70)
