; ModuleID = 'double-int.c'
source_filename = "double-int.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.double_int = type { i64, i64 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type opaque
%struct.function = type opaque
%struct.tree_int_cst = type { %struct.tree_common, %struct.double_int }

!169 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!170 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!171 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!172 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!173 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!174 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!175 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!176 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!177 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!178 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!179 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!180 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!181 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!182 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!183 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!184 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!185 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!186 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!187 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!188 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!189 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!190 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!191 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!192 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!193 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!194 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!195 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!196 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!197 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!198 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!199 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!200 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!201 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!202 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!203 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!204 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!205 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!206 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!207 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!208 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!209 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!210 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!224 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!225 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!226 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!227 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!228 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!229 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!231 = !{!232, !233, !37, !234}
!232 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!233 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!235 = !{i32 7, !"Dwarf Version", i32 4}
!236 = !{i32 2, !"Debug Info Version", i32 3}
!237 = !{i32 1, !"wchar_size", i32 4}
!238 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!239 = distinct !DISubprogram(name: "double_int_mask", scope: !1, file: !1, line: 29, type: !240, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !5}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !243, line: 58, baseType: !244)
!243 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 54, size: 128, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !244, file: !243, line: 56, baseType: !232, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !244, file: !243, line: 57, baseType: !233, size: 64, offset: 64)
!248 = !{}
!249 = !DILocalVariable(name: "prec", arg: 1, scope: !239, file: !1, line: 29, type: !5)
!250 = !DILocation(line: 29, column: 27, scope: !239)
!251 = !DILocalVariable(name: "m", scope: !239, file: !1, line: 31, type: !232)
!252 = !DILocation(line: 31, column: 26, scope: !239)
!253 = !DILocalVariable(name: "mask", scope: !239, file: !1, line: 32, type: !242)
!254 = !DILocation(line: 32, column: 14, scope: !239)
!255 = !DILocation(line: 34, column: 7, scope: !256)
!256 = distinct !DILexicalBlock(scope: !239, file: !1, line: 34, column: 7)
!257 = !DILocation(line: 34, column: 12, scope: !256)
!258 = !DILocation(line: 34, column: 7, scope: !239)
!259 = !DILocation(line: 36, column: 12, scope: !260)
!260 = distinct !DILexicalBlock(scope: !256, file: !1, line: 35, column: 5)
!261 = !DILocation(line: 37, column: 43, scope: !260)
!262 = !DILocation(line: 37, column: 48, scope: !260)
!263 = !DILocation(line: 37, column: 39, scope: !260)
!264 = !DILocation(line: 37, column: 54, scope: !260)
!265 = !DILocation(line: 37, column: 9, scope: !260)
!266 = !DILocation(line: 38, column: 35, scope: !260)
!267 = !DILocation(line: 38, column: 12, scope: !260)
!268 = !DILocation(line: 38, column: 17, scope: !260)
!269 = !DILocation(line: 39, column: 12, scope: !260)
!270 = !DILocation(line: 39, column: 16, scope: !260)
!271 = !DILocation(line: 40, column: 5, scope: !260)
!272 = !DILocation(line: 43, column: 12, scope: !273)
!273 = distinct !DILexicalBlock(scope: !256, file: !1, line: 42, column: 5)
!274 = !DILocation(line: 43, column: 17, scope: !273)
!275 = !DILocation(line: 44, column: 50, scope: !273)
!276 = !DILocation(line: 44, column: 55, scope: !273)
!277 = !DILocation(line: 44, column: 46, scope: !273)
!278 = !DILocation(line: 44, column: 61, scope: !273)
!279 = !DILocation(line: 44, column: 12, scope: !273)
!280 = !DILocation(line: 44, column: 16, scope: !273)
!281 = !DILocation(line: 47, column: 3, scope: !239)
!282 = distinct !DISubprogram(name: "double_int_ext", scope: !1, file: !1, line: 58, type: !283, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!283 = !DISubroutineType(types: !284)
!284 = !{!242, !242, !5, !285}
!285 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!286 = !DILocalVariable(name: "cst", arg: 1, scope: !282, file: !1, line: 58, type: !242)
!287 = !DILocation(line: 58, column: 28, scope: !282)
!288 = !DILocalVariable(name: "prec", arg: 2, scope: !282, file: !1, line: 58, type: !5)
!289 = !DILocation(line: 58, column: 42, scope: !282)
!290 = !DILocalVariable(name: "uns", arg: 3, scope: !282, file: !1, line: 58, type: !285)
!291 = !DILocation(line: 58, column: 53, scope: !282)
!292 = !DILocation(line: 60, column: 7, scope: !293)
!293 = distinct !DILexicalBlock(scope: !282, file: !1, line: 60, column: 7)
!294 = !DILocation(line: 60, column: 7, scope: !282)
!295 = !DILocation(line: 61, column: 34, scope: !293)
!296 = !DILocation(line: 61, column: 12, scope: !293)
!297 = !DILocation(line: 61, column: 5, scope: !293)
!298 = !DILocation(line: 63, column: 34, scope: !293)
!299 = !DILocation(line: 63, column: 12, scope: !293)
!300 = !DILocation(line: 63, column: 5, scope: !293)
!301 = !DILocation(line: 64, column: 1, scope: !282)
!302 = distinct !DISubprogram(name: "double_int_zext", scope: !1, file: !1, line: 69, type: !303, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!303 = !DISubroutineType(types: !304)
!304 = !{!242, !242, !5}
!305 = !DILocalVariable(name: "cst", arg: 1, scope: !302, file: !1, line: 69, type: !242)
!306 = !DILocation(line: 69, column: 29, scope: !302)
!307 = !DILocalVariable(name: "prec", arg: 2, scope: !302, file: !1, line: 69, type: !5)
!308 = !DILocation(line: 69, column: 43, scope: !302)
!309 = !DILocalVariable(name: "mask", scope: !302, file: !1, line: 71, type: !242)
!310 = !DILocation(line: 71, column: 14, scope: !302)
!311 = !DILocation(line: 71, column: 38, scope: !302)
!312 = !DILocation(line: 71, column: 21, scope: !302)
!313 = !DILocalVariable(name: "r", scope: !302, file: !1, line: 72, type: !242)
!314 = !DILocation(line: 72, column: 14, scope: !302)
!315 = !DILocation(line: 74, column: 15, scope: !302)
!316 = !DILocation(line: 74, column: 26, scope: !302)
!317 = !DILocation(line: 74, column: 19, scope: !302)
!318 = !DILocation(line: 74, column: 5, scope: !302)
!319 = !DILocation(line: 74, column: 9, scope: !302)
!320 = !DILocation(line: 75, column: 16, scope: !302)
!321 = !DILocation(line: 75, column: 28, scope: !302)
!322 = !DILocation(line: 75, column: 21, scope: !302)
!323 = !DILocation(line: 75, column: 5, scope: !302)
!324 = !DILocation(line: 75, column: 10, scope: !302)
!325 = !DILocation(line: 77, column: 3, scope: !302)
!326 = distinct !DISubprogram(name: "double_int_sext", scope: !1, file: !1, line: 83, type: !303, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!327 = !DILocalVariable(name: "cst", arg: 1, scope: !326, file: !1, line: 83, type: !242)
!328 = !DILocation(line: 83, column: 29, scope: !326)
!329 = !DILocalVariable(name: "prec", arg: 2, scope: !326, file: !1, line: 83, type: !5)
!330 = !DILocation(line: 83, column: 43, scope: !326)
!331 = !DILocalVariable(name: "mask", scope: !326, file: !1, line: 85, type: !242)
!332 = !DILocation(line: 85, column: 14, scope: !326)
!333 = !DILocation(line: 85, column: 38, scope: !326)
!334 = !DILocation(line: 85, column: 21, scope: !326)
!335 = !DILocalVariable(name: "r", scope: !326, file: !1, line: 86, type: !242)
!336 = !DILocation(line: 86, column: 14, scope: !326)
!337 = !DILocalVariable(name: "snum", scope: !326, file: !1, line: 87, type: !232)
!338 = !DILocation(line: 87, column: 26, scope: !326)
!339 = !DILocation(line: 89, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !326, file: !1, line: 89, column: 7)
!341 = !DILocation(line: 89, column: 12, scope: !340)
!342 = !DILocation(line: 89, column: 7, scope: !326)
!343 = !DILocation(line: 90, column: 16, scope: !340)
!344 = !DILocation(line: 90, column: 10, scope: !340)
!345 = !DILocation(line: 90, column: 5, scope: !340)
!346 = !DILocation(line: 93, column: 12, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !1, line: 92, column: 5)
!348 = !DILocation(line: 94, column: 43, scope: !347)
!349 = !DILocation(line: 94, column: 12, scope: !347)
!350 = !DILocation(line: 96, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !326, file: !1, line: 96, column: 7)
!352 = !DILocation(line: 96, column: 18, scope: !351)
!353 = !DILocation(line: 96, column: 23, scope: !351)
!354 = !DILocation(line: 96, column: 14, scope: !351)
!355 = !DILocation(line: 96, column: 29, scope: !351)
!356 = !DILocation(line: 96, column: 34, scope: !351)
!357 = !DILocation(line: 96, column: 7, scope: !326)
!358 = !DILocation(line: 98, column: 19, scope: !359)
!359 = distinct !DILexicalBlock(scope: !351, file: !1, line: 97, column: 5)
!360 = !DILocation(line: 98, column: 31, scope: !359)
!361 = !DILocation(line: 98, column: 25, scope: !359)
!362 = !DILocation(line: 98, column: 23, scope: !359)
!363 = !DILocation(line: 98, column: 9, scope: !359)
!364 = !DILocation(line: 98, column: 13, scope: !359)
!365 = !DILocation(line: 99, column: 20, scope: !359)
!366 = !DILocation(line: 99, column: 33, scope: !359)
!367 = !DILocation(line: 99, column: 27, scope: !359)
!368 = !DILocation(line: 99, column: 25, scope: !359)
!369 = !DILocation(line: 99, column: 9, scope: !359)
!370 = !DILocation(line: 99, column: 14, scope: !359)
!371 = !DILocation(line: 100, column: 5, scope: !359)
!372 = !DILocation(line: 103, column: 19, scope: !373)
!373 = distinct !DILexicalBlock(scope: !351, file: !1, line: 102, column: 5)
!374 = !DILocation(line: 103, column: 30, scope: !373)
!375 = !DILocation(line: 103, column: 23, scope: !373)
!376 = !DILocation(line: 103, column: 9, scope: !373)
!377 = !DILocation(line: 103, column: 13, scope: !373)
!378 = !DILocation(line: 104, column: 20, scope: !373)
!379 = !DILocation(line: 104, column: 32, scope: !373)
!380 = !DILocation(line: 104, column: 25, scope: !373)
!381 = !DILocation(line: 104, column: 9, scope: !373)
!382 = !DILocation(line: 104, column: 14, scope: !373)
!383 = !DILocation(line: 107, column: 3, scope: !326)
!384 = distinct !DISubprogram(name: "tree_to_double_int", scope: !1, file: !1, line: 115, type: !385, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!385 = !DISubroutineType(types: !386)
!386 = !{!242, !387}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_tree", file: !388, line: 59, baseType: !389)
!388 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !392)
!392 = !{!393, !426, !434, !439, !446, !453, !458, !469, !475, !488, !500, !538, !546, !574, !582, !583, !588, !597, !603, !608, !612, !616, !645, !696, !702, !709, !716, !742, !767, !784, !796, !818, !836, !1008}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !4, line: 3372, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !394, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !394, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !394, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !394, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !394, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !394, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !394, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !394, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !394, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !394, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !394, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !394, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !394, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !394, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !394, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !394, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !394, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !394, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !394, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !394, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !394, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !394, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !394, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !394, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !394, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !394, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !394, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !394, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !394, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !394, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !391, file: !4, line: 3373, baseType: !427, size: 192)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !428)
!428 = !{!429, !430, !433}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !427, file: !4, line: 403, baseType: !394, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !427, file: !4, line: 404, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !388, line: 56, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !4, line: 405, baseType: !431, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !391, file: !4, line: 3374, baseType: !435, size: 320)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !435, file: !4, line: 1385, baseType: !427, size: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !435, file: !4, line: 1386, baseType: !242, size: 128, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !391, file: !4, line: 3375, baseType: !440, size: 256)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !440, file: !4, line: 1398, baseType: !427, size: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !440, file: !4, line: 1399, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !391, file: !4, line: 3376, baseType: !447, size: 256)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !447, file: !4, line: 1409, baseType: !427, size: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !447, file: !4, line: 1410, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !391, file: !4, line: 3377, baseType: !454, size: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !454, file: !4, line: 1438, baseType: !427, size: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !454, file: !4, line: 1439, baseType: !431, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !391, file: !4, line: 3378, baseType: !459, size: 256)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !460)
!460 = !{!461, !462, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !4, line: 1419, baseType: !427, size: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !459, file: !4, line: 1420, baseType: !463, size: 32, offset: 192)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !459, file: !4, line: 1421, baseType: !465, size: 8, offset: 224)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8, elements: !467)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !{!468}
!468 = !DISubrange(count: 1)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !391, file: !4, line: 3379, baseType: !470, size: 320)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !470, file: !4, line: 1429, baseType: !427, size: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !470, file: !4, line: 1430, baseType: !431, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !470, file: !4, line: 1431, baseType: !431, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !391, file: !4, line: 3380, baseType: !476, size: 320)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !476, file: !4, line: 1461, baseType: !427, size: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !476, file: !4, line: 1462, baseType: !480, size: 128, offset: 192)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !481, line: 31, size: 128, elements: !482)
!481 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!482 = !{!483, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !480, file: !481, line: 32, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !480, file: !481, line: 33, baseType: !5, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !480, file: !481, line: 34, baseType: !5, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !391, file: !4, line: 3381, baseType: !489, size: 384)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !490)
!490 = !{!491, !492, !497, !498, !499}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !489, file: !4, line: 2508, baseType: !427, size: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !489, file: !4, line: 2509, baseType: !493, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !494, line: 58, baseType: !495)
!494 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !496, line: 44, baseType: !5)
!496 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !489, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !4, line: 2511, baseType: !431, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !489, file: !4, line: 2512, baseType: !431, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !391, file: !4, line: 3382, baseType: !501, size: 896)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !501, file: !4, line: 2653, baseType: !489, size: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !501, file: !4, line: 2654, baseType: !431, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !501, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !501, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !501, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !501, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !501, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !501, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !501, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !501, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !501, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !501, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !501, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !501, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !501, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !501, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !501, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !501, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !501, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !501, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !501, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !501, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !501, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !501, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !501, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !501, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !501, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !501, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !501, file: !4, line: 2705, baseType: !431, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !501, file: !4, line: 2706, baseType: !431, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !501, file: !4, line: 2707, baseType: !431, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !501, file: !4, line: 2708, baseType: !431, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !501, file: !4, line: 2711, baseType: !536, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !391, file: !4, line: 3383, baseType: !539, size: 960)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !539, file: !4, line: 2757, baseType: !501, size: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !539, file: !4, line: 2758, baseType: !543, size: 64, offset: 896)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !388, line: 50, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !388, line: 49, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !391, file: !4, line: 3384, baseType: !547, size: 1472)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !548)
!548 = !{!549, !570, !571, !572, !573}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !547, file: !4, line: 3115, baseType: !550, size: 1216)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !550, file: !4, line: 2985, baseType: !539, size: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !550, file: !4, line: 2986, baseType: !431, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !550, file: !4, line: 2987, baseType: !431, size: 64, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !550, file: !4, line: 2988, baseType: !431, size: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !550, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !550, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !550, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !550, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !550, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !550, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !550, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !550, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !550, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !550, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !550, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !550, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !550, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !550, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !547, file: !4, line: 3117, baseType: !431, size: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !547, file: !4, line: 3119, baseType: !431, size: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !547, file: !4, line: 3121, baseType: !431, size: 64, offset: 1344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !547, file: !4, line: 3123, baseType: !431, size: 64, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !391, file: !4, line: 3385, baseType: !575, size: 1088)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !575, file: !4, line: 2875, baseType: !539, size: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !575, file: !4, line: 2876, baseType: !543, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !575, file: !4, line: 2877, baseType: !580, size: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !391, file: !4, line: 3386, baseType: !550, size: 1216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !391, file: !4, line: 3387, baseType: !584, size: 1280)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !4, line: 3094, baseType: !550, size: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !584, file: !4, line: 3095, baseType: !580, size: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !391, file: !4, line: 3388, baseType: !589, size: 1216)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !4, line: 2825, baseType: !501, size: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !589, file: !4, line: 2827, baseType: !431, size: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !589, file: !4, line: 2828, baseType: !431, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !589, file: !4, line: 2829, baseType: !431, size: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !589, file: !4, line: 2830, baseType: !431, size: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !589, file: !4, line: 2831, baseType: !431, size: 64, offset: 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !391, file: !4, line: 3389, baseType: !598, size: 1024)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !4, line: 2851, baseType: !539, size: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !598, file: !4, line: 2852, baseType: !463, size: 32, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !598, file: !4, line: 2853, baseType: !463, size: 32, offset: 992)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !391, file: !4, line: 3390, baseType: !604, size: 1024)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !4, line: 2858, baseType: !539, size: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !604, file: !4, line: 2859, baseType: !580, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !391, file: !4, line: 3391, baseType: !609, size: 960)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !4, line: 2863, baseType: !539, size: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !391, file: !4, line: 3392, baseType: !613, size: 1472)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !4, line: 3305, baseType: !547, size: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !391, file: !4, line: 3393, baseType: !617, size: 1792)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !618)
!618 = !{!619, !620, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !617, file: !4, line: 3249, baseType: !547, size: 1472)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !617, file: !4, line: 3251, baseType: !621, size: 64, offset: 1472)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !623, line: 41, flags: DIFlagFwdDecl)
!623 = !DIFile(filename: "./statistics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!624 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !617, file: !4, line: 3254, baseType: !431, size: 64, offset: 1536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !617, file: !4, line: 3257, baseType: !431, size: 64, offset: 1600)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !617, file: !4, line: 3258, baseType: !431, size: 64, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !617, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !617, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !617, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !617, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !617, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !617, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !617, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !617, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !617, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !617, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !617, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !617, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !617, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !617, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !617, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !617, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !617, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !617, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !4, line: 3394, baseType: !646, size: 1344)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !673, !674, !675, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !4, line: 2280, baseType: !427, size: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !646, file: !4, line: 2281, baseType: !431, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !4, line: 2282, baseType: !431, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !646, file: !4, line: 2283, baseType: !431, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !646, file: !4, line: 2284, baseType: !431, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !646, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !646, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !646, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !646, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !646, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !646, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !646, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !646, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !646, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !646, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !646, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !646, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !646, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !646, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !646, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !646, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !646, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !646, file: !4, line: 2306, baseType: !671, size: 32, offset: 544)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !672, line: 31, baseType: !463)
!672 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !646, file: !4, line: 2307, baseType: !431, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !646, file: !4, line: 2308, baseType: !431, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !646, file: !4, line: 2314, baseType: !676, size: 64, offset: 704)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !677)
!677 = !{!678, !679, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !676, file: !4, line: 2310, baseType: !463, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !676, file: !4, line: 2311, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !676, file: !4, line: 2312, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !4, line: 2315, baseType: !431, size: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !646, file: !4, line: 2316, baseType: !431, size: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !646, file: !4, line: 2317, baseType: !431, size: 64, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !646, file: !4, line: 2318, baseType: !431, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !646, file: !4, line: 2319, baseType: !431, size: 64, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !646, file: !4, line: 2320, baseType: !431, size: 64, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !646, file: !4, line: 2321, baseType: !431, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !646, file: !4, line: 2322, baseType: !431, size: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !646, file: !4, line: 2324, baseType: !694, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !391, file: !4, line: 3395, baseType: !697, size: 320)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !4, line: 1470, baseType: !427, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !697, file: !4, line: 1471, baseType: !431, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !697, file: !4, line: 1472, baseType: !431, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !4, line: 3396, baseType: !703, size: 320)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !703, file: !4, line: 1483, baseType: !427, size: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !703, file: !4, line: 1484, baseType: !463, size: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !703, file: !4, line: 1485, baseType: !708, size: 64, offset: 256)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !467)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !391, file: !4, line: 3397, baseType: !710, size: 384)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !710, file: !4, line: 1830, baseType: !427, size: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !710, file: !4, line: 1831, baseType: !493, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !710, file: !4, line: 1832, baseType: !431, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !710, file: !4, line: 1835, baseType: !708, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !391, file: !4, line: 3398, baseType: !717, size: 704)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !718)
!718 = !{!719, !720, !721, !725, !726, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !4, line: 1899, baseType: !427, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !717, file: !4, line: 1902, baseType: !431, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !717, file: !4, line: 1905, baseType: !722, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !388, line: 58, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !388, line: 57, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !717, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !717, file: !4, line: 1911, baseType: !727, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !717, file: !4, line: 1914, baseType: !730, size: 256, offset: 448)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !731)
!731 = !{!732, !734, !735, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !730, file: !4, line: 1884, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !730, file: !4, line: 1885, baseType: !733, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !730, file: !4, line: 1891, baseType: !736, size: 64, offset: 128)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !730, file: !4, line: 1891, size: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !736, file: !4, line: 1891, baseType: !722, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !736, file: !4, line: 1891, baseType: !431, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !730, file: !4, line: 1892, baseType: !741, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !391, file: !4, line: 3399, baseType: !743, size: 704)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !762, !763, !764, !765, !766}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !4, line: 2009, baseType: !427, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !743, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !743, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !743, file: !4, line: 2014, baseType: !493, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !743, file: !4, line: 2016, baseType: !431, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !743, file: !4, line: 2017, baseType: !751, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !4, line: 183, baseType: !756, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !757, file: !4, line: 182, baseType: !5, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !757, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !757, file: !4, line: 182, baseType: !708, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !743, file: !4, line: 2019, baseType: !431, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !743, file: !4, line: 2020, baseType: !431, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !743, file: !4, line: 2021, baseType: !431, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !743, file: !4, line: 2022, baseType: !431, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !743, file: !4, line: 2023, baseType: !431, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !391, file: !4, line: 3400, baseType: !768, size: 832)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !4, line: 2430, size: 832, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !4, line: 2431, baseType: !427, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !768, file: !4, line: 2433, baseType: !431, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !768, file: !4, line: 2434, baseType: !431, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !768, file: !4, line: 2435, baseType: !431, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !768, file: !4, line: 2436, baseType: !431, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !768, file: !4, line: 2437, baseType: !751, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !768, file: !4, line: 2438, baseType: !431, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !768, file: !4, line: 2440, baseType: !431, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !768, file: !4, line: 2441, baseType: !431, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !768, file: !4, line: 2443, baseType: !780, size: 128, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !4, line: 182, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !4, line: 182, size: 128, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !781, file: !4, line: 182, baseType: !756, size: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !391, file: !4, line: 3401, baseType: !785, size: 320)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !4, line: 3327, size: 320, elements: !786)
!786 = !{!787, !788, !795}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !4, line: 3329, baseType: !427, size: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !785, file: !4, line: 3330, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !4, line: 3320, size: 192, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !790, file: !4, line: 3322, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !4, line: 3323, baseType: !789, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !790, file: !4, line: 3324, baseType: !431, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !785, file: !4, line: 3331, baseType: !789, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !391, file: !4, line: 3402, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !4, line: 1540, size: 256, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !4, line: 1541, baseType: !427, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !797, file: !4, line: 1542, baseType: !801, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !4, line: 1538, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !4, line: 1538, size: 192, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !803, file: !4, line: 1538, baseType: !806, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !4, line: 1537, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !4, line: 1537, size: 192, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !807, file: !4, line: 1537, baseType: !5, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !807, file: !4, line: 1537, baseType: !5, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !807, file: !4, line: 1537, baseType: !812, size: 128, offset: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 128, elements: !467)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !4, line: 1535, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !4, line: 1532, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !814, file: !4, line: 1533, baseType: !431, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !814, file: !4, line: 1534, baseType: !431, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !391, file: !4, line: 3403, baseType: !819, size: 512)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !4, line: 1938, size: 512, elements: !820)
!820 = !{!821, !822, !823, !824, !830, !834, !835}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !4, line: 1939, baseType: !427, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !819, file: !4, line: 1940, baseType: !493, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !819, file: !4, line: 1941, baseType: !3, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !819, file: !4, line: 1946, baseType: !825, size: 32, offset: 256)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !4, line: 1942, size: 32, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !825, file: !4, line: 1943, baseType: !23, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !825, file: !4, line: 1944, baseType: !30, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !825, file: !4, line: 1945, baseType: !37, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !819, file: !4, line: 1950, baseType: !831, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !388, line: 66, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !388, line: 65, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !819, file: !4, line: 1951, baseType: !831, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !819, file: !4, line: 1953, baseType: !708, size: 64, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !391, file: !4, line: 3404, baseType: !837, size: 1664)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !4, line: 3337, size: 1664, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !4, line: 3338, baseType: !427, size: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !837, file: !4, line: 3341, baseType: !841, size: 1472, offset: 192)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !842, line: 410, size: 1472, elements: !843)
!842 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !841, file: !842, line: 412, baseType: !463, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !841, file: !842, line: 413, baseType: !463, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !841, file: !842, line: 414, baseType: !463, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !841, file: !842, line: 415, baseType: !463, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !841, file: !842, line: 416, baseType: !463, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !841, file: !842, line: 417, baseType: !463, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !841, file: !842, line: 418, baseType: !285, size: 8, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !841, file: !842, line: 419, baseType: !285, size: 8, offset: 200)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !841, file: !842, line: 420, baseType: !853, size: 8, offset: 208)
!853 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !841, file: !842, line: 421, baseType: !853, size: 8, offset: 216)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !841, file: !842, line: 422, baseType: !853, size: 8, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !841, file: !842, line: 423, baseType: !853, size: 8, offset: 232)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !841, file: !842, line: 424, baseType: !853, size: 8, offset: 240)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !841, file: !842, line: 425, baseType: !853, size: 8, offset: 248)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !841, file: !842, line: 426, baseType: !853, size: 8, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !841, file: !842, line: 427, baseType: !853, size: 8, offset: 264)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !841, file: !842, line: 428, baseType: !853, size: 8, offset: 272)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !841, file: !842, line: 429, baseType: !853, size: 8, offset: 280)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !841, file: !842, line: 430, baseType: !853, size: 8, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !841, file: !842, line: 431, baseType: !853, size: 8, offset: 296)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !841, file: !842, line: 432, baseType: !853, size: 8, offset: 304)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !841, file: !842, line: 433, baseType: !853, size: 8, offset: 312)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !841, file: !842, line: 434, baseType: !853, size: 8, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !841, file: !842, line: 435, baseType: !853, size: 8, offset: 328)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !841, file: !842, line: 436, baseType: !853, size: 8, offset: 336)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !841, file: !842, line: 437, baseType: !853, size: 8, offset: 344)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !841, file: !842, line: 438, baseType: !853, size: 8, offset: 352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !841, file: !842, line: 439, baseType: !853, size: 8, offset: 360)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !841, file: !842, line: 440, baseType: !853, size: 8, offset: 368)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !841, file: !842, line: 441, baseType: !853, size: 8, offset: 376)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !841, file: !842, line: 442, baseType: !853, size: 8, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !841, file: !842, line: 443, baseType: !853, size: 8, offset: 392)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !841, file: !842, line: 444, baseType: !853, size: 8, offset: 400)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !841, file: !842, line: 445, baseType: !853, size: 8, offset: 408)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !841, file: !842, line: 446, baseType: !853, size: 8, offset: 416)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !841, file: !842, line: 447, baseType: !853, size: 8, offset: 424)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !841, file: !842, line: 448, baseType: !853, size: 8, offset: 432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !841, file: !842, line: 449, baseType: !853, size: 8, offset: 440)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !841, file: !842, line: 450, baseType: !853, size: 8, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !841, file: !842, line: 451, baseType: !853, size: 8, offset: 456)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !841, file: !842, line: 452, baseType: !853, size: 8, offset: 464)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !841, file: !842, line: 453, baseType: !853, size: 8, offset: 472)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !841, file: !842, line: 454, baseType: !853, size: 8, offset: 480)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !841, file: !842, line: 455, baseType: !853, size: 8, offset: 488)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !841, file: !842, line: 456, baseType: !853, size: 8, offset: 496)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !841, file: !842, line: 457, baseType: !853, size: 8, offset: 504)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !841, file: !842, line: 458, baseType: !853, size: 8, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !841, file: !842, line: 459, baseType: !853, size: 8, offset: 520)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !841, file: !842, line: 460, baseType: !853, size: 8, offset: 528)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !841, file: !842, line: 461, baseType: !853, size: 8, offset: 536)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !841, file: !842, line: 462, baseType: !853, size: 8, offset: 544)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !841, file: !842, line: 463, baseType: !853, size: 8, offset: 552)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !841, file: !842, line: 464, baseType: !853, size: 8, offset: 560)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !841, file: !842, line: 465, baseType: !853, size: 8, offset: 568)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !841, file: !842, line: 466, baseType: !853, size: 8, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !841, file: !842, line: 467, baseType: !853, size: 8, offset: 584)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !841, file: !842, line: 468, baseType: !853, size: 8, offset: 592)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !841, file: !842, line: 469, baseType: !853, size: 8, offset: 600)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !841, file: !842, line: 470, baseType: !853, size: 8, offset: 608)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !841, file: !842, line: 471, baseType: !853, size: 8, offset: 616)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !841, file: !842, line: 472, baseType: !853, size: 8, offset: 624)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !841, file: !842, line: 473, baseType: !853, size: 8, offset: 632)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !841, file: !842, line: 474, baseType: !853, size: 8, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !841, file: !842, line: 475, baseType: !853, size: 8, offset: 648)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !841, file: !842, line: 476, baseType: !853, size: 8, offset: 656)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !841, file: !842, line: 477, baseType: !853, size: 8, offset: 664)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !841, file: !842, line: 478, baseType: !853, size: 8, offset: 672)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !841, file: !842, line: 479, baseType: !853, size: 8, offset: 680)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !841, file: !842, line: 480, baseType: !853, size: 8, offset: 688)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !841, file: !842, line: 481, baseType: !853, size: 8, offset: 696)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !841, file: !842, line: 482, baseType: !853, size: 8, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !841, file: !842, line: 483, baseType: !853, size: 8, offset: 712)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !841, file: !842, line: 484, baseType: !853, size: 8, offset: 720)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !841, file: !842, line: 485, baseType: !853, size: 8, offset: 728)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !841, file: !842, line: 486, baseType: !853, size: 8, offset: 736)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !841, file: !842, line: 487, baseType: !853, size: 8, offset: 744)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !841, file: !842, line: 488, baseType: !853, size: 8, offset: 752)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !841, file: !842, line: 489, baseType: !853, size: 8, offset: 760)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !841, file: !842, line: 490, baseType: !853, size: 8, offset: 768)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !841, file: !842, line: 491, baseType: !853, size: 8, offset: 776)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !841, file: !842, line: 492, baseType: !853, size: 8, offset: 784)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !841, file: !842, line: 493, baseType: !853, size: 8, offset: 792)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !841, file: !842, line: 494, baseType: !853, size: 8, offset: 800)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !841, file: !842, line: 495, baseType: !853, size: 8, offset: 808)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !841, file: !842, line: 496, baseType: !853, size: 8, offset: 816)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !841, file: !842, line: 497, baseType: !853, size: 8, offset: 824)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !841, file: !842, line: 498, baseType: !853, size: 8, offset: 832)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !841, file: !842, line: 499, baseType: !853, size: 8, offset: 840)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !841, file: !842, line: 500, baseType: !853, size: 8, offset: 848)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !841, file: !842, line: 501, baseType: !853, size: 8, offset: 856)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !841, file: !842, line: 502, baseType: !853, size: 8, offset: 864)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !841, file: !842, line: 503, baseType: !853, size: 8, offset: 872)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !841, file: !842, line: 504, baseType: !853, size: 8, offset: 880)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !841, file: !842, line: 505, baseType: !853, size: 8, offset: 888)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !841, file: !842, line: 506, baseType: !853, size: 8, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !841, file: !842, line: 507, baseType: !853, size: 8, offset: 904)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !841, file: !842, line: 508, baseType: !853, size: 8, offset: 912)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !841, file: !842, line: 509, baseType: !853, size: 8, offset: 920)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !841, file: !842, line: 510, baseType: !853, size: 8, offset: 928)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !841, file: !842, line: 511, baseType: !853, size: 8, offset: 936)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !841, file: !842, line: 512, baseType: !853, size: 8, offset: 944)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !841, file: !842, line: 513, baseType: !853, size: 8, offset: 952)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !841, file: !842, line: 514, baseType: !853, size: 8, offset: 960)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !841, file: !842, line: 515, baseType: !853, size: 8, offset: 968)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !841, file: !842, line: 516, baseType: !853, size: 8, offset: 976)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !841, file: !842, line: 517, baseType: !853, size: 8, offset: 984)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !841, file: !842, line: 518, baseType: !853, size: 8, offset: 992)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !841, file: !842, line: 519, baseType: !853, size: 8, offset: 1000)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !841, file: !842, line: 520, baseType: !853, size: 8, offset: 1008)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !841, file: !842, line: 521, baseType: !853, size: 8, offset: 1016)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !841, file: !842, line: 522, baseType: !853, size: 8, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !841, file: !842, line: 523, baseType: !853, size: 8, offset: 1032)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !841, file: !842, line: 524, baseType: !853, size: 8, offset: 1040)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !841, file: !842, line: 525, baseType: !853, size: 8, offset: 1048)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !841, file: !842, line: 526, baseType: !853, size: 8, offset: 1056)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !841, file: !842, line: 527, baseType: !853, size: 8, offset: 1064)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !841, file: !842, line: 528, baseType: !853, size: 8, offset: 1072)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !841, file: !842, line: 529, baseType: !853, size: 8, offset: 1080)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !841, file: !842, line: 530, baseType: !853, size: 8, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !841, file: !842, line: 531, baseType: !853, size: 8, offset: 1096)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !841, file: !842, line: 532, baseType: !853, size: 8, offset: 1104)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !841, file: !842, line: 533, baseType: !853, size: 8, offset: 1112)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !841, file: !842, line: 534, baseType: !853, size: 8, offset: 1120)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !841, file: !842, line: 535, baseType: !853, size: 8, offset: 1128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !841, file: !842, line: 536, baseType: !853, size: 8, offset: 1136)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !841, file: !842, line: 537, baseType: !853, size: 8, offset: 1144)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !841, file: !842, line: 538, baseType: !853, size: 8, offset: 1152)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !841, file: !842, line: 539, baseType: !853, size: 8, offset: 1160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !841, file: !842, line: 540, baseType: !853, size: 8, offset: 1168)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !841, file: !842, line: 541, baseType: !853, size: 8, offset: 1176)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !841, file: !842, line: 542, baseType: !853, size: 8, offset: 1184)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !841, file: !842, line: 543, baseType: !853, size: 8, offset: 1192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !841, file: !842, line: 544, baseType: !853, size: 8, offset: 1200)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !841, file: !842, line: 545, baseType: !853, size: 8, offset: 1208)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !841, file: !842, line: 546, baseType: !853, size: 8, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !841, file: !842, line: 547, baseType: !853, size: 8, offset: 1224)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !841, file: !842, line: 548, baseType: !853, size: 8, offset: 1232)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !841, file: !842, line: 549, baseType: !853, size: 8, offset: 1240)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !841, file: !842, line: 550, baseType: !853, size: 8, offset: 1248)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !841, file: !842, line: 551, baseType: !853, size: 8, offset: 1256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !841, file: !842, line: 552, baseType: !853, size: 8, offset: 1264)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !841, file: !842, line: 553, baseType: !853, size: 8, offset: 1272)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !841, file: !842, line: 554, baseType: !853, size: 8, offset: 1280)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !841, file: !842, line: 555, baseType: !853, size: 8, offset: 1288)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !841, file: !842, line: 556, baseType: !853, size: 8, offset: 1296)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !841, file: !842, line: 557, baseType: !853, size: 8, offset: 1304)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !841, file: !842, line: 558, baseType: !853, size: 8, offset: 1312)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !841, file: !842, line: 559, baseType: !853, size: 8, offset: 1320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !841, file: !842, line: 560, baseType: !853, size: 8, offset: 1328)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !841, file: !842, line: 561, baseType: !853, size: 8, offset: 1336)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !841, file: !842, line: 562, baseType: !853, size: 8, offset: 1344)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !841, file: !842, line: 563, baseType: !853, size: 8, offset: 1352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !841, file: !842, line: 564, baseType: !853, size: 8, offset: 1360)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !841, file: !842, line: 565, baseType: !853, size: 8, offset: 1368)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !841, file: !842, line: 566, baseType: !853, size: 8, offset: 1376)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !841, file: !842, line: 567, baseType: !853, size: 8, offset: 1384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !841, file: !842, line: 568, baseType: !853, size: 8, offset: 1392)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !841, file: !842, line: 569, baseType: !853, size: 8, offset: 1400)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !841, file: !842, line: 570, baseType: !853, size: 8, offset: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !841, file: !842, line: 571, baseType: !853, size: 8, offset: 1416)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !841, file: !842, line: 572, baseType: !853, size: 8, offset: 1424)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !841, file: !842, line: 573, baseType: !853, size: 8, offset: 1432)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !841, file: !842, line: 574, baseType: !853, size: 8, offset: 1440)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !391, file: !4, line: 3405, baseType: !1009, size: 384)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !4, line: 3352, size: 384, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !4, line: 3353, baseType: !427, size: 192)
