; ModuleID = 'opts-common.c'
source_filename = "opts-common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cl_option = type { i8*, i8*, i16, i8, i32, i32, i8*, i32, i32 }

@cl_options_count = external dso_local constant i32, align 4
@cl_options = external dso_local constant [0 x %struct.cl_option], align 8

; Function Attrs: noinline nounwind uwtable
define dso_local i64 @find_opt(i8* %input, i32 %lang_mask) #0 !dbg !22 {
entry:
  %retval = alloca i64, align 8
  %input.addr = alloca i8*, align 8
  %lang_mask.addr = alloca i32, align 4
  %mn = alloca i64, align 8
  %mx = alloca i64, align 8
  %md = alloca i64, align 8
  %opt_len = alloca i64, align 8
  %match_wrong_lang = alloca i64, align 8
  %comp = alloca i32, align 4
  %opt = alloca %struct.cl_option*, align 8
  store i8* %input, i8** %input.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %input.addr, metadata !31, metadata !DIExpression()), !dbg !32
  store i32 %lang_mask, i32* %lang_mask.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %lang_mask.addr, metadata !33, metadata !DIExpression()), !dbg !34
  call void @llvm.dbg.declare(metadata i64* %mn, metadata !35, metadata !DIExpression()), !dbg !36
  call void @llvm.dbg.declare(metadata i64* %mx, metadata !37, metadata !DIExpression()), !dbg !38
  call void @llvm.dbg.declare(metadata i64* %md, metadata !39, metadata !DIExpression()), !dbg !40

!1 = !DIFile(filename: "opts-common.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cl_var_type", file: !4, line: 25, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./opts.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "CLVC_BOOLEAN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "CLVC_EQUAL", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "CLVC_BIT_CLEAR", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "CLVC_BIT_SET", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "CLVC_STRING", value: 4, isUnsigned: true)
!12 = !{!13, !15, !16, !14}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !{i32 7, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{i32 1, !"wchar_size", i32 4}
!21 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!22 = distinct !DISubprogram(name: "find_opt", scope: !1, file: !1, line: 51, type: !23, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !28, !14}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 46, baseType: !27)
!26 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!30 = !{}
!31 = !DILocalVariable(name: "input", arg: 1, scope: !22, file: !1, line: 51, type: !28)
!32 = !DILocation(line: 51, column: 23, scope: !22)
!33 = !DILocalVariable(name: "lang_mask", arg: 2, scope: !22, file: !1, line: 51, type: !14)
!34 = !DILocation(line: 51, column: 34, scope: !22)
!35 = !DILocalVariable(name: "mn", scope: !22, file: !1, line: 53, type: !25)
!36 = !DILocation(line: 53, column: 10, scope: !22)
!37 = !DILocalVariable(name: "mx", scope: !22, file: !1, line: 53, type: !25)
!38 = !DILocation(line: 53, column: 14, scope: !22)
!39 = !DILocalVariable(name: "md", scope: !22, file: !1, line: 53, type: !25)
!40 = !DILocation(line: 53, column: 18, scope: !22)
!41 = !DILocalVariable(name: "opt_len", scope: !22, file: !1, line: 53, type: !25)
!42 = !DILocation(line: 53, column: 22, scope: !22)
!43 = !DILocalVariable(name: "match_wrong_lang", scope: !22, file: !1, line: 54, type: !25)
!44 = !DILocation(line: 54, column: 10, scope: !22)
!45 = !DILocalVariable(name: "comp", scope: !22, file: !1, line: 55, type: !14)
!46 = !DILocation(line: 55, column: 7, scope: !22)
!47 = !DILocation(line: 57, column: 6, scope: !22)
!48 = !DILocation(line: 58, column: 8, scope: !22)
!49 = !DILocation(line: 58, column: 6, scope: !22)
!50 = !DILocation(line: 62, column: 3, scope: !22)
!51 = !DILocation(line: 62, column: 10, scope: !22)
!52 = !DILocation(line: 62, column: 15, scope: !22)
!53 = !DILocation(line: 62, column: 13, scope: !22)
!54 = !DILocation(line: 62, column: 18, scope: !22)
!55 = !DILocation(line: 64, column: 13, scope: !56)
!56 = distinct !DILexicalBlock(scope: !22, file: !1, line: 63, column: 5)
!57 = !DILocation(line: 64, column: 18, scope: !56)
!58 = !DILocation(line: 64, column: 16, scope: !56)
!59 = !DILocation(line: 64, column: 22, scope: !56)
!60 = !DILocation(line: 64, column: 10, scope: !56)
!61 = !DILocation(line: 65, column: 28, scope: !56)
!62 = !DILocation(line: 65, column: 17, scope: !56)
!63 = !DILocation(line: 65, column: 32, scope: !56)
!64 = !DILocation(line: 65, column: 15, scope: !56)
!65 = !DILocation(line: 66, column: 23, scope: !56)
!66 = !DILocation(line: 66, column: 41, scope: !56)
!67 = !DILocation(line: 66, column: 30, scope: !56)
!68 = !DILocation(line: 66, column: 45, scope: !56)
!69 = !DILocation(line: 66, column: 54, scope: !56)
!70 = !DILocation(line: 66, column: 59, scope: !56)
!71 = !DILocation(line: 66, column: 14, scope: !56)
!72 = !DILocation(line: 66, column: 12, scope: !56)
!73 = !DILocation(line: 68, column: 11, scope: !74)
!74 = distinct !DILexicalBlock(scope: !56, file: !1, line: 68, column: 11)
!75 = !DILocation(line: 68, column: 16, scope: !74)
!76 = !DILocation(line: 68, column: 11, scope: !56)
!77 = !DILocation(line: 69, column: 7, scope: !74)
!78 = !DILocation(line: 69, column: 5, scope: !74)
!79 = !DILocation(line: 69, column: 2, scope: !74)
!80 = !DILocation(line: 71, column: 7, scope: !74)
!81 = !DILocation(line: 71, column: 5, scope: !74)
!82 = distinct !{!82, !50, !83}
!83 = !DILocation(line: 72, column: 5, scope: !22)
!84 = !DILocation(line: 76, column: 22, scope: !22)
!85 = !DILocation(line: 76, column: 20, scope: !22)
!86 = !DILocation(line: 81, column: 3, scope: !22)
!87 = !DILocalVariable(name: "opt", scope: !88, file: !1, line: 83, type: !89)
!88 = distinct !DILexicalBlock(scope: !22, file: !1, line: 82, column: 5)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_option", file: !4, line: 43, size: 384, elements: !92)
!92 = !{!93, !94, !95, !97, !99, !100, !101, !103, !104}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "opt_text", scope: !91, file: !4, line: 45, baseType: !28, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !91, file: !4, line: 46, baseType: !28, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "back_chain", scope: !91, file: !4, line: 47, baseType: !96, size: 16, offset: 128)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !91, file: !4, line: 48, baseType: !98, size: 8, offset: 144)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "neg_index", scope: !91, file: !4, line: 49, baseType: !14, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !4, line: 50, baseType: !5, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var", scope: !91, file: !4, line: 51, baseType: !102, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "var_type", scope: !91, file: !4, line: 52, baseType: !3, size: 32, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "var_value", scope: !91, file: !4, line: 53, baseType: !14, size: 32, offset: 352)
!105 = !DILocation(line: 83, column: 31, scope: !88)
!106 = !DILocation(line: 83, column: 49, scope: !88)
!107 = !DILocation(line: 83, column: 38, scope: !88)
!108 = !DILocation(line: 87, column: 21, scope: !109)
!109 = distinct !DILexicalBlock(scope: !88, file: !1, line: 87, column: 11)
!110 = !DILocation(line: 87, column: 28, scope: !109)
!111 = !DILocation(line: 87, column: 33, scope: !109)
!112 = !DILocation(line: 87, column: 42, scope: !109)
!113 = !DILocation(line: 87, column: 47, scope: !109)
!114 = !DILocation(line: 87, column: 52, scope: !109)
!115 = !DILocation(line: 87, column: 12, scope: !109)
!116 = !DILocation(line: 88, column: 4, scope: !109)
!117 = !DILocation(line: 88, column: 8, scope: !109)
!118 = !DILocation(line: 88, column: 14, scope: !109)
!119 = !DILocation(line: 88, column: 19, scope: !109)
!120 = !DILocation(line: 88, column: 28, scope: !109)
!121 = !DILocation(line: 88, column: 36, scope: !109)
!122 = !DILocation(line: 88, column: 40, scope: !109)
!123 = !DILocation(line: 88, column: 45, scope: !109)
!124 = !DILocation(line: 88, column: 51, scope: !109)
!125 = !DILocation(line: 87, column: 11, scope: !88)
!126 = !DILocation(line: 91, column: 8, scope: !127)
!127 = distinct !DILexicalBlock(scope: !128, file: !1, line: 91, column: 8)
!128 = distinct !DILexicalBlock(scope: !109, file: !1, line: 89, column: 2)
!129 = !DILocation(line: 91, column: 13, scope: !127)
!130 = !DILocation(line: 91, column: 21, scope: !127)
!131 = !DILocation(line: 91, column: 19, scope: !127)
!132 = !DILocation(line: 91, column: 8, scope: !128)
!133 = !DILocation(line: 92, column: 13, scope: !127)
!134 = !DILocation(line: 92, column: 6, scope: !127)
!135 = !DILocation(line: 96, column: 8, scope: !136)
!136 = distinct !DILexicalBlock(scope: !128, file: !1, line: 96, column: 8)
!137 = !DILocation(line: 96, column: 28, scope: !136)
!138 = !DILocation(line: 96, column: 25, scope: !136)
!139 = !DILocation(line: 96, column: 8, scope: !128)
!140 = !DILocation(line: 97, column: 25, scope: !136)
!141 = !DILocation(line: 97, column: 23, scope: !136)
!142 = !DILocation(line: 97, column: 6, scope: !136)
!143 = !DILocation(line: 98, column: 2, scope: !128)
!144 = !DILocation(line: 102, column: 12, scope: !88)
!145 = !DILocation(line: 102, column: 17, scope: !88)
!146 = !DILocation(line: 102, column: 10, scope: !88)
!147 = !DILocation(line: 103, column: 5, scope: !88)
!148 = !DILocation(line: 104, column: 10, scope: !22)
!149 = !DILocation(line: 104, column: 16, scope: !22)
!150 = !DILocation(line: 104, column: 13, scope: !22)
!151 = distinct !{!151, !86, !152}
!152 = !DILocation(line: 104, column: 32, scope: !22)
!153 = !DILocation(line: 107, column: 10, scope: !22)
!154 = !DILocation(line: 107, column: 3, scope: !22)
!155 = !DILocation(line: 108, column: 1, scope: !22)
!156 = distinct !DISubprogram(name: "prune_options", scope: !1, file: !1, line: 131, type: !157, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !13, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!160 = !DILocalVariable(name: "argcp", arg: 1, scope: !156, file: !1, line: 131, type: !13)
!161 = !DILocation(line: 131, column: 21, scope: !156)
!162 = !DILocalVariable(name: "argvp", arg: 2, scope: !156, file: !1, line: 131, type: !159)
!163 = !DILocation(line: 131, column: 36, scope: !156)
!164 = !DILocalVariable(name: "argc", scope: !156, file: !1, line: 133, type: !14)
!165 = !DILocation(line: 133, column: 7, scope: !156)
!166 = !DILocation(line: 133, column: 15, scope: !156)
!167 = !DILocation(line: 133, column: 14, scope: !156)
!168 = !DILocalVariable(name: "options", scope: !156, file: !1, line: 134, type: !13)
!169 = !DILocation(line: 134, column: 8, scope: !156)
!170 = !DILocation(line: 134, column: 18, scope: !156)
