; ModuleID = 'c-aux-info.c'
source_filename = "c-aux-info.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "compiled_from_record", scope: !2, file: !3, line: 556, type: !89, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "gen_aux_info_record", scope: !3, file: !3, line: 551, type: !4, scopeLine: 553, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !879, retainedNodes: !1026)
!3 = !DIFile(filename: "c-aux-info.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !89, !89, !89}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !7, line: 56, baseType: !8)
!7 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !10, line: 3371, size: 1792, elements: !11)
!10 = !DIFile(filename: "./tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !46, !52, !65, !72, !79, !84, !95, !101, !115, !127, !165, !173, !201, !209, !210, !215, !224, !230, !235, !239, !243, !272, !323, !329, !336, !343, !369, !394, !411, !423, !445, !689, !861}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !9, file: !10, line: 3372, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !10, line: 360, size: 64, elements: !14)
!14 = !{!15, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !13, file: !10, line: 361, baseType: !16, size: 16, flags: DIFlagBitField, extraData: i64 0)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !13, file: !10, line: 363, baseType: !16, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !13, file: !10, line: 364, baseType: !16, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !13, file: !10, line: 365, baseType: !16, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !13, file: !10, line: 366, baseType: !16, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !13, file: !10, line: 367, baseType: !16, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !13, file: !10, line: 368, baseType: !16, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !13, file: !10, line: 369, baseType: !16, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !13, file: !10, line: 370, baseType: !16, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !13, file: !10, line: 372, baseType: !16, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !13, file: !10, line: 373, baseType: !16, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !13, file: !10, line: 374, baseType: !16, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !13, file: !10, line: 375, baseType: !16, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !13, file: !10, line: 376, baseType: !16, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !13, file: !10, line: 377, baseType: !16, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !13, file: !10, line: 378, baseType: !16, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !13, file: !10, line: 379, baseType: !16, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !13, file: !10, line: 381, baseType: !16, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !13, file: !10, line: 382, baseType: !16, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !13, file: !10, line: 383, baseType: !16, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !13, file: !10, line: 384, baseType: !16, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !13, file: !10, line: 385, baseType: !16, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !13, file: !10, line: 386, baseType: !16, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !13, file: !10, line: 387, baseType: !16, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !13, file: !10, line: 388, baseType: !16, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !13, file: !10, line: 390, baseType: !16, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !13, file: !10, line: 391, baseType: !16, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !13, file: !10, line: 392, baseType: !16, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !13, file: !10, line: 394, baseType: !16, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !13, file: !10, line: 399, baseType: !16, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !9, file: !10, line: 3373, baseType: !47, size: 192)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !10, line: 402, size: 192, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !47, file: !10, line: 403, baseType: !13, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !47, file: !10, line: 404, baseType: !6, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !10, line: 405, baseType: !6, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !9, file: !10, line: 3374, baseType: !53, size: 320)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !10, line: 1384, size: 320, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !53, file: !10, line: 1385, baseType: !47, size: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !53, file: !10, line: 1386, baseType: !57, size: 128, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !58, line: 58, baseType: !59)
!58 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 54, size: 128, elements: !60)
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !59, file: !58, line: 56, baseType: !62, size: 64)
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !59, file: !58, line: 57, baseType: !64, size: 64, offset: 64)
!64 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !9, file: !10, line: 3375, baseType: !66, size: 256)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !10, line: 1397, size: 256, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !66, file: !10, line: 1398, baseType: !47, size: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !66, file: !10, line: 1399, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !10, line: 1392, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !9, file: !10, line: 3376, baseType: !73, size: 256)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !10, line: 1408, size: 256, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !73, file: !10, line: 1409, baseType: !47, size: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !73, file: !10, line: 1410, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !10, line: 1403, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !9, file: !10, line: 3377, baseType: !80, size: 256)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !10, line: 1437, size: 256, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !80, file: !10, line: 1438, baseType: !47, size: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !80, file: !10, line: 1439, baseType: !6, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !9, file: !10, line: 3378, baseType: !85, size: 256)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !10, line: 1418, size: 256, elements: !86)
!86 = !{!87, !88, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !85, file: !10, line: 1419, baseType: !47, size: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !10, line: 1420, baseType: !89, size: 32, offset: 192)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !85, file: !10, line: 1421, baseType: !91, size: 8, offset: 224)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 8, elements: !93)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !9, file: !10, line: 3379, baseType: !96, size: 320)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !10, line: 1428, size: 320, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !96, file: !10, line: 1429, baseType: !47, size: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !96, file: !10, line: 1430, baseType: !6, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !96, file: !10, line: 1431, baseType: !6, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !9, file: !10, line: 3380, baseType: !102, size: 320)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !10, line: 1460, size: 320, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !102, file: !10, line: 1461, baseType: !47, size: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !10, line: 1462, baseType: !106, size: 128, offset: 192)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !107, line: 31, size: 128, elements: !108)
!107 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !{!109, !113, !114}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !106, file: !107, line: 32, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !107, line: 33, baseType: !16, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !106, file: !107, line: 34, baseType: !16, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !9, file: !10, line: 3381, baseType: !116, size: 384)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !10, line: 2507, size: 384, elements: !117)
!117 = !{!118, !119, !124, !125, !126}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !116, file: !10, line: 2508, baseType: !47, size: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !116, file: !10, line: 2509, baseType: !120, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !121, line: 58, baseType: !122)
!121 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !123, line: 44, baseType: !16)
!123 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !116, file: !10, line: 2510, baseType: !16, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !10, line: 2511, baseType: !6, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !116, file: !10, line: 2512, baseType: !6, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !9, file: !10, line: 3382, baseType: !128, size: 896)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !10, line: 2652, size: 896, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !128, file: !10, line: 2653, baseType: !116, size: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !10, line: 2654, baseType: !6, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !128, file: !10, line: 2656, baseType: !16, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !128, file: !10, line: 2658, baseType: !16, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !128, file: !10, line: 2659, baseType: !16, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !128, file: !10, line: 2660, baseType: !16, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !128, file: !10, line: 2661, baseType: !16, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !128, file: !10, line: 2662, baseType: !16, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !128, file: !10, line: 2663, baseType: !16, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !128, file: !10, line: 2664, baseType: !16, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !128, file: !10, line: 2666, baseType: !16, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !128, file: !10, line: 2667, baseType: !16, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !128, file: !10, line: 2668, baseType: !16, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !128, file: !10, line: 2669, baseType: !16, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !128, file: !10, line: 2670, baseType: !16, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !128, file: !10, line: 2671, baseType: !16, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !128, file: !10, line: 2672, baseType: !16, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !128, file: !10, line: 2673, baseType: !16, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !128, file: !10, line: 2674, baseType: !16, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !128, file: !10, line: 2678, baseType: !16, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !128, file: !10, line: 2682, baseType: !16, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !128, file: !10, line: 2685, baseType: !16, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !128, file: !10, line: 2688, baseType: !16, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !128, file: !10, line: 2690, baseType: !16, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !128, file: !10, line: 2692, baseType: !16, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !128, file: !10, line: 2695, baseType: !16, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !128, file: !10, line: 2698, baseType: !16, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !128, file: !10, line: 2703, baseType: !16, size: 32, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !128, file: !10, line: 2705, baseType: !6, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !128, file: !10, line: 2706, baseType: !6, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !128, file: !10, line: 2707, baseType: !6, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !128, file: !10, line: 2708, baseType: !6, size: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !128, file: !10, line: 2711, baseType: !163, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !10, line: 2711, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !9, file: !10, line: 3383, baseType: !166, size: 960)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !10, line: 2756, size: 960, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !166, file: !10, line: 2757, baseType: !128, size: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !166, file: !10, line: 2758, baseType: !170, size: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !7, line: 50, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !7, line: 49, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !9, file: !10, line: 3384, baseType: !174, size: 1472)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !10, line: 3114, size: 1472, elements: !175)
!175 = !{!176, !197, !198, !199, !200}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !174, file: !10, line: 3115, baseType: !177, size: 1216)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !10, line: 2984, size: 1216, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !177, file: !10, line: 2985, baseType: !166, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !177, file: !10, line: 2986, baseType: !6, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !177, file: !10, line: 2987, baseType: !6, size: 64, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !177, file: !10, line: 2988, baseType: !6, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !177, file: !10, line: 2991, baseType: !16, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !177, file: !10, line: 2992, baseType: !16, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !177, file: !10, line: 2993, baseType: !16, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !177, file: !10, line: 2994, baseType: !16, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !177, file: !10, line: 2995, baseType: !16, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !177, file: !10, line: 2996, baseType: !16, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !177, file: !10, line: 2998, baseType: !16, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !177, file: !10, line: 3000, baseType: !16, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !177, file: !10, line: 3002, baseType: !16, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !177, file: !10, line: 3003, baseType: !16, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !177, file: !10, line: 3004, baseType: !16, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !177, file: !10, line: 3005, baseType: !16, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !177, file: !10, line: 3007, baseType: !16, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !177, file: !10, line: 3010, baseType: !16, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !174, file: !10, line: 3117, baseType: !6, size: 64, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !174, file: !10, line: 3119, baseType: !6, size: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !174, file: !10, line: 3121, baseType: !6, size: 64, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !174, file: !10, line: 3123, baseType: !6, size: 64, offset: 1408)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !9, file: !10, line: 3385, baseType: !202, size: 1088)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !10, line: 2874, size: 1088, elements: !203)
!203 = !{!204, !205, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !202, file: !10, line: 2875, baseType: !166, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !202, file: !10, line: 2876, baseType: !170, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !202, file: !10, line: 2877, baseType: !207, size: 64, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !10, line: 2856, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !9, file: !10, line: 3386, baseType: !177, size: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !9, file: !10, line: 3387, baseType: !211, size: 1280)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !10, line: 3093, size: 1280, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !211, file: !10, line: 3094, baseType: !177, size: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !211, file: !10, line: 3095, baseType: !207, size: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !9, file: !10, line: 3388, baseType: !216, size: 1216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !10, line: 2824, size: 1216, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !216, file: !10, line: 2825, baseType: !128, size: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !216, file: !10, line: 2827, baseType: !6, size: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !216, file: !10, line: 2828, baseType: !6, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !216, file: !10, line: 2829, baseType: !6, size: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !216, file: !10, line: 2830, baseType: !6, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !216, file: !10, line: 2831, baseType: !6, size: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !9, file: !10, line: 3389, baseType: !225, size: 1024)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !10, line: 2850, size: 1024, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !225, file: !10, line: 2851, baseType: !166, size: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !225, file: !10, line: 2852, baseType: !89, size: 32, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !225, file: !10, line: 2853, baseType: !89, size: 32, offset: 992)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !9, file: !10, line: 3390, baseType: !231, size: 1024)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !10, line: 2857, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !231, file: !10, line: 2858, baseType: !166, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !231, file: !10, line: 2859, baseType: !207, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !9, file: !10, line: 3391, baseType: !236, size: 960)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !10, line: 2862, size: 960, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !236, file: !10, line: 2863, baseType: !166, size: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !9, file: !10, line: 3392, baseType: !240, size: 1472)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !10, line: 3304, size: 1472, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !240, file: !10, line: 3305, baseType: !174, size: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !9, file: !10, line: 3393, baseType: !244, size: 1792)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !10, line: 3248, size: 1792, elements: !245)
!245 = !{!246, !247, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !244, file: !10, line: 3249, baseType: !174, size: 1472)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !244, file: !10, line: 3251, baseType: !248, size: 64, offset: 1472)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !250, line: 41, flags: DIFlagFwdDecl)
!250 = !DIFile(filename: "./statistics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !244, file: !10, line: 3254, baseType: !6, size: 64, offset: 1536)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !244, file: !10, line: 3257, baseType: !6, size: 64, offset: 1600)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !244, file: !10, line: 3258, baseType: !6, size: 64, offset: 1664)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !244, file: !10, line: 3264, baseType: !16, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !244, file: !10, line: 3265, baseType: !16, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !244, file: !10, line: 3267, baseType: !16, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !244, file: !10, line: 3268, baseType: !16, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !244, file: !10, line: 3269, baseType: !16, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !244, file: !10, line: 3271, baseType: !16, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !244, file: !10, line: 3272, baseType: !16, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !244, file: !10, line: 3273, baseType: !16, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !244, file: !10, line: 3274, baseType: !16, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !244, file: !10, line: 3275, baseType: !16, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !244, file: !10, line: 3276, baseType: !16, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !244, file: !10, line: 3277, baseType: !16, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !244, file: !10, line: 3279, baseType: !16, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !244, file: !10, line: 3280, baseType: !16, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !244, file: !10, line: 3281, baseType: !16, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !244, file: !10, line: 3282, baseType: !16, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !244, file: !10, line: 3283, baseType: !16, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !244, file: !10, line: 3284, baseType: !16, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !10, line: 3394, baseType: !273, size: 1344)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !10, line: 2279, size: 1344, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !300, !301, !302, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !273, file: !10, line: 2280, baseType: !47, size: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !273, file: !10, line: 2281, baseType: !6, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !273, file: !10, line: 2282, baseType: !6, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !273, file: !10, line: 2283, baseType: !6, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !273, file: !10, line: 2284, baseType: !6, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !273, file: !10, line: 2285, baseType: !16, size: 32, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !273, file: !10, line: 2287, baseType: !16, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !273, file: !10, line: 2288, baseType: !16, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !273, file: !10, line: 2289, baseType: !16, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !273, file: !10, line: 2290, baseType: !16, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !273, file: !10, line: 2291, baseType: !16, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !273, file: !10, line: 2292, baseType: !16, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !273, file: !10, line: 2294, baseType: !16, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !273, file: !10, line: 2296, baseType: !16, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !273, file: !10, line: 2297, baseType: !16, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !273, file: !10, line: 2298, baseType: !16, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !273, file: !10, line: 2299, baseType: !16, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !273, file: !10, line: 2300, baseType: !16, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !273, file: !10, line: 2301, baseType: !16, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !273, file: !10, line: 2302, baseType: !16, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !273, file: !10, line: 2303, baseType: !16, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !273, file: !10, line: 2305, baseType: !16, size: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !273, file: !10, line: 2306, baseType: !298, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !299, line: 31, baseType: !89)
!299 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !273, file: !10, line: 2307, baseType: !6, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !273, file: !10, line: 2308, baseType: !6, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !273, file: !10, line: 2314, baseType: !303, size: 64, offset: 704)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !10, line: 2309, size: 64, elements: !304)
!304 = !{!305, !306, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !303, file: !10, line: 2310, baseType: !89, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !303, file: !10, line: 2311, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !303, file: !10, line: 2312, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !10, line: 2277, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !10, line: 2315, baseType: !6, size: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !273, file: !10, line: 2316, baseType: !6, size: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !273, file: !10, line: 2317, baseType: !6, size: 64, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !273, file: !10, line: 2318, baseType: !6, size: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !273, file: !10, line: 2319, baseType: !6, size: 64, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !273, file: !10, line: 2320, baseType: !6, size: 64, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !273, file: !10, line: 2321, baseType: !6, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !273, file: !10, line: 2322, baseType: !6, size: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !273, file: !10, line: 2324, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !10, line: 2324, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !9, file: !10, line: 3395, baseType: !324, size: 320)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !10, line: 1469, size: 320, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !324, file: !10, line: 1470, baseType: !47, size: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !324, file: !10, line: 1471, baseType: !6, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !324, file: !10, line: 1472, baseType: !6, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !9, file: !10, line: 3396, baseType: !330, size: 320)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !10, line: 1482, size: 320, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !330, file: !10, line: 1483, baseType: !47, size: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !330, file: !10, line: 1484, baseType: !89, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !330, file: !10, line: 1485, baseType: !335, size: 64, offset: 256)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !93)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !9, file: !10, line: 3397, baseType: !337, size: 384)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !10, line: 1829, size: 384, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !337, file: !10, line: 1830, baseType: !47, size: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !337, file: !10, line: 1831, baseType: !120, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !337, file: !10, line: 1832, baseType: !6, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !337, file: !10, line: 1835, baseType: !335, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !9, file: !10, line: 3398, baseType: !344, size: 704)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !10, line: 1898, size: 704, elements: !345)
!345 = !{!346, !347, !348, !352, !353, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !344, file: !10, line: 1899, baseType: !47, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !344, file: !10, line: 1902, baseType: !6, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !344, file: !10, line: 1905, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !7, line: 58, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !7, line: 57, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !344, file: !10, line: 1908, baseType: !16, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !344, file: !10, line: 1911, baseType: !354, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !10, line: 1876, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !344, file: !10, line: 1914, baseType: !357, size: 256, offset: 448)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !10, line: 1883, size: 256, elements: !358)
!358 = !{!359, !361, !362, !367}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !357, file: !10, line: 1884, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !10, line: 1885, baseType: !360, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !357, file: !10, line: 1891, baseType: !363, size: 64, offset: 128)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !357, file: !10, line: 1891, size: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !363, file: !10, line: 1891, baseType: !349, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !363, file: !10, line: 1891, baseType: !6, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !357, file: !10, line: 1892, baseType: !368, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !9, file: !10, line: 3399, baseType: !370, size: 704)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !10, line: 2008, size: 704, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !389, !390, !391, !392, !393}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !370, file: !10, line: 2009, baseType: !47, size: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !370, file: !10, line: 2011, baseType: !16, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !370, file: !10, line: 2012, baseType: !16, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !370, file: !10, line: 2014, baseType: !120, size: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !370, file: !10, line: 2016, baseType: !6, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !370, file: !10, line: 2017, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !10, line: 183, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !10, line: 183, size: 128, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !380, file: !10, line: 183, baseType: !383, size: 128)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !10, line: 182, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !10, line: 182, size: 128, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !384, file: !10, line: 182, baseType: !16, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !384, file: !10, line: 182, baseType: !16, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !384, file: !10, line: 182, baseType: !335, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !370, file: !10, line: 2019, baseType: !6, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !370, file: !10, line: 2020, baseType: !6, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !370, file: !10, line: 2021, baseType: !6, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !370, file: !10, line: 2022, baseType: !6, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !370, file: !10, line: 2023, baseType: !6, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !9, file: !10, line: 3400, baseType: !395, size: 832)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !10, line: 2430, size: 832, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !395, file: !10, line: 2431, baseType: !47, size: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !395, file: !10, line: 2433, baseType: !6, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !395, file: !10, line: 2434, baseType: !6, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !395, file: !10, line: 2435, baseType: !6, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !395, file: !10, line: 2436, baseType: !6, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !395, file: !10, line: 2437, baseType: !378, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !395, file: !10, line: 2438, baseType: !6, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !395, file: !10, line: 2440, baseType: !6, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !395, file: !10, line: 2441, baseType: !6, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !395, file: !10, line: 2443, baseType: !407, size: 128, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !10, line: 182, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !10, line: 182, size: 128, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !408, file: !10, line: 182, baseType: !383, size: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !9, file: !10, line: 3401, baseType: !412, size: 320)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !10, line: 3327, size: 320, elements: !413)
!413 = !{!414, !415, !422}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !412, file: !10, line: 3329, baseType: !47, size: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !412, file: !10, line: 3330, baseType: !416, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !10, line: 3320, size: 192, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !10, line: 3322, baseType: !416, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !10, line: 3323, baseType: !416, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !417, file: !10, line: 3324, baseType: !6, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !10, line: 3331, baseType: !416, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !9, file: !10, line: 3402, baseType: !424, size: 256)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !10, line: 1540, size: 256, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !424, file: !10, line: 1541, baseType: !47, size: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !424, file: !10, line: 1542, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !10, line: 1538, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !10, line: 1538, size: 192, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !430, file: !10, line: 1538, baseType: !433, size: 192)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !10, line: 1537, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !10, line: 1537, size: 192, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !434, file: !10, line: 1537, baseType: !16, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !434, file: !10, line: 1537, baseType: !16, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !434, file: !10, line: 1537, baseType: !439, size: 128, offset: 64)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 128, elements: !93)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !10, line: 1535, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !10, line: 1532, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !441, file: !10, line: 1533, baseType: !6, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !441, file: !10, line: 1534, baseType: !6, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !9, file: !10, line: 3403, baseType: !446, size: 512)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !10, line: 1938, size: 512, elements: !447)
!447 = !{!448, !449, !450, !469, !683, !687, !688}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !446, file: !10, line: 1939, baseType: !47, size: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !446, file: !10, line: 1940, baseType: !120, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !446, file: !10, line: 1941, baseType: !451, size: 32, offset: 224)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !10, line: 280, baseType: !16, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!453 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!454 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!457 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!458 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!459 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!460 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!461 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!462 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!463 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!464 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!465 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!466 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!467 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!468 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !446, file: !10, line: 1946, baseType: !470, size: 32, offset: 256)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !10, line: 1942, size: 32, elements: !471)
!471 = !{!472, !480, !488}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !470, file: !10, line: 1943, baseType: !473, size: 32)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !10, line: 1817, baseType: !16, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479}
!475 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!479 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !470, file: !10, line: 1944, baseType: !481, size: 32)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !10, line: 1805, baseType: !16, size: 32, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!485 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!486 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!487 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !470, file: !10, line: 1945, baseType: !489, size: 32)
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code", file: !10, line: 39, baseType: !16, size: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!491 = !DIEnumerator(name: "ERROR_MARK", value: 0, isUnsigned: true)
!492 = !DIEnumerator(name: "IDENTIFIER_NODE", value: 1, isUnsigned: true)
!493 = !DIEnumerator(name: "TREE_LIST", value: 2, isUnsigned: true)
!494 = !DIEnumerator(name: "TREE_VEC", value: 3, isUnsigned: true)
!495 = !DIEnumerator(name: "BLOCK", value: 4, isUnsigned: true)
!496 = !DIEnumerator(name: "OFFSET_TYPE", value: 5, isUnsigned: true)
!497 = !DIEnumerator(name: "ENUMERAL_TYPE", value: 6, isUnsigned: true)
!498 = !DIEnumerator(name: "BOOLEAN_TYPE", value: 7, isUnsigned: true)
!499 = !DIEnumerator(name: "INTEGER_TYPE", value: 8, isUnsigned: true)
!500 = !DIEnumerator(name: "REAL_TYPE", value: 9, isUnsigned: true)
!501 = !DIEnumerator(name: "POINTER_TYPE", value: 10, isUnsigned: true)
!502 = !DIEnumerator(name: "FIXED_POINT_TYPE", value: 11, isUnsigned: true)
!503 = !DIEnumerator(name: "REFERENCE_TYPE", value: 12, isUnsigned: true)
!504 = !DIEnumerator(name: "COMPLEX_TYPE", value: 13, isUnsigned: true)
!505 = !DIEnumerator(name: "VECTOR_TYPE", value: 14, isUnsigned: true)
!506 = !DIEnumerator(name: "ARRAY_TYPE", value: 15, isUnsigned: true)
!507 = !DIEnumerator(name: "RECORD_TYPE", value: 16, isUnsigned: true)
!508 = !DIEnumerator(name: "UNION_TYPE", value: 17, isUnsigned: true)
!509 = !DIEnumerator(name: "QUAL_UNION_TYPE", value: 18, isUnsigned: true)
!510 = !DIEnumerator(name: "VOID_TYPE", value: 19, isUnsigned: true)
!511 = !DIEnumerator(name: "FUNCTION_TYPE", value: 20, isUnsigned: true)
!512 = !DIEnumerator(name: "METHOD_TYPE", value: 21, isUnsigned: true)
!513 = !DIEnumerator(name: "LANG_TYPE", value: 22, isUnsigned: true)
!514 = !DIEnumerator(name: "INTEGER_CST", value: 23, isUnsigned: true)
!515 = !DIEnumerator(name: "REAL_CST", value: 24, isUnsigned: true)
!516 = !DIEnumerator(name: "FIXED_CST", value: 25, isUnsigned: true)
!517 = !DIEnumerator(name: "COMPLEX_CST", value: 26, isUnsigned: true)
!518 = !DIEnumerator(name: "VECTOR_CST", value: 27, isUnsigned: true)
!519 = !DIEnumerator(name: "STRING_CST", value: 28, isUnsigned: true)
!520 = !DIEnumerator(name: "FUNCTION_DECL", value: 29, isUnsigned: true)
!521 = !DIEnumerator(name: "LABEL_DECL", value: 30, isUnsigned: true)
!522 = !DIEnumerator(name: "FIELD_DECL", value: 31, isUnsigned: true)
!523 = !DIEnumerator(name: "VAR_DECL", value: 32, isUnsigned: true)
!524 = !DIEnumerator(name: "CONST_DECL", value: 33, isUnsigned: true)
!525 = !DIEnumerator(name: "PARM_DECL", value: 34, isUnsigned: true)
!526 = !DIEnumerator(name: "TYPE_DECL", value: 35, isUnsigned: true)
!527 = !DIEnumerator(name: "RESULT_DECL", value: 36, isUnsigned: true)
!528 = !DIEnumerator(name: "DEBUG_EXPR_DECL", value: 37, isUnsigned: true)
!529 = !DIEnumerator(name: "NAMESPACE_DECL", value: 38, isUnsigned: true)
!530 = !DIEnumerator(name: "IMPORTED_DECL", value: 39, isUnsigned: true)
!531 = !DIEnumerator(name: "TRANSLATION_UNIT_DECL", value: 40, isUnsigned: true)
!532 = !DIEnumerator(name: "COMPONENT_REF", value: 41, isUnsigned: true)
!533 = !DIEnumerator(name: "BIT_FIELD_REF", value: 42, isUnsigned: true)
!534 = !DIEnumerator(name: "REALPART_EXPR", value: 43, isUnsigned: true)
!535 = !DIEnumerator(name: "IMAGPART_EXPR", value: 44, isUnsigned: true)
!536 = !DIEnumerator(name: "ARRAY_REF", value: 45, isUnsigned: true)
!537 = !DIEnumerator(name: "ARRAY_RANGE_REF", value: 46, isUnsigned: true)
!538 = !DIEnumerator(name: "INDIRECT_REF", value: 47, isUnsigned: true)
!539 = !DIEnumerator(name: "ALIGN_INDIRECT_REF", value: 48, isUnsigned: true)
!540 = !DIEnumerator(name: "MISALIGNED_INDIRECT_REF", value: 49, isUnsigned: true)
!541 = !DIEnumerator(name: "OBJ_TYPE_REF", value: 50, isUnsigned: true)
!542 = !DIEnumerator(name: "CONSTRUCTOR", value: 51, isUnsigned: true)
!543 = !DIEnumerator(name: "COMPOUND_EXPR", value: 52, isUnsigned: true)
!544 = !DIEnumerator(name: "MODIFY_EXPR", value: 53, isUnsigned: true)
!545 = !DIEnumerator(name: "INIT_EXPR", value: 54, isUnsigned: true)
!546 = !DIEnumerator(name: "TARGET_EXPR", value: 55, isUnsigned: true)
!547 = !DIEnumerator(name: "COND_EXPR", value: 56, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_COND_EXPR", value: 57, isUnsigned: true)
!549 = !DIEnumerator(name: "BIND_EXPR", value: 58, isUnsigned: true)
!550 = !DIEnumerator(name: "CALL_EXPR", value: 59, isUnsigned: true)
!551 = !DIEnumerator(name: "WITH_CLEANUP_EXPR", value: 60, isUnsigned: true)
!552 = !DIEnumerator(name: "CLEANUP_POINT_EXPR", value: 61, isUnsigned: true)
!553 = !DIEnumerator(name: "PLACEHOLDER_EXPR", value: 62, isUnsigned: true)
!554 = !DIEnumerator(name: "PLUS_EXPR", value: 63, isUnsigned: true)
!555 = !DIEnumerator(name: "MINUS_EXPR", value: 64, isUnsigned: true)
!556 = !DIEnumerator(name: "MULT_EXPR", value: 65, isUnsigned: true)
!557 = !DIEnumerator(name: "POINTER_PLUS_EXPR", value: 66, isUnsigned: true)
!558 = !DIEnumerator(name: "TRUNC_DIV_EXPR", value: 67, isUnsigned: true)
!559 = !DIEnumerator(name: "CEIL_DIV_EXPR", value: 68, isUnsigned: true)
!560 = !DIEnumerator(name: "FLOOR_DIV_EXPR", value: 69, isUnsigned: true)
!561 = !DIEnumerator(name: "ROUND_DIV_EXPR", value: 70, isUnsigned: true)
!562 = !DIEnumerator(name: "TRUNC_MOD_EXPR", value: 71, isUnsigned: true)
!563 = !DIEnumerator(name: "CEIL_MOD_EXPR", value: 72, isUnsigned: true)
!564 = !DIEnumerator(name: "FLOOR_MOD_EXPR", value: 73, isUnsigned: true)
!565 = !DIEnumerator(name: "ROUND_MOD_EXPR", value: 74, isUnsigned: true)
!566 = !DIEnumerator(name: "RDIV_EXPR", value: 75, isUnsigned: true)
!567 = !DIEnumerator(name: "EXACT_DIV_EXPR", value: 76, isUnsigned: true)
!568 = !DIEnumerator(name: "FIX_TRUNC_EXPR", value: 77, isUnsigned: true)
!569 = !DIEnumerator(name: "FLOAT_EXPR", value: 78, isUnsigned: true)
!570 = !DIEnumerator(name: "NEGATE_EXPR", value: 79, isUnsigned: true)
!571 = !DIEnumerator(name: "MIN_EXPR", value: 80, isUnsigned: true)
!572 = !DIEnumerator(name: "MAX_EXPR", value: 81, isUnsigned: true)
!573 = !DIEnumerator(name: "ABS_EXPR", value: 82, isUnsigned: true)
!574 = !DIEnumerator(name: "LSHIFT_EXPR", value: 83, isUnsigned: true)
!575 = !DIEnumerator(name: "RSHIFT_EXPR", value: 84, isUnsigned: true)
!576 = !DIEnumerator(name: "LROTATE_EXPR", value: 85, isUnsigned: true)
!577 = !DIEnumerator(name: "RROTATE_EXPR", value: 86, isUnsigned: true)
!578 = !DIEnumerator(name: "BIT_IOR_EXPR", value: 87, isUnsigned: true)
!579 = !DIEnumerator(name: "BIT_XOR_EXPR", value: 88, isUnsigned: true)
!580 = !DIEnumerator(name: "BIT_AND_EXPR", value: 89, isUnsigned: true)
!581 = !DIEnumerator(name: "BIT_NOT_EXPR", value: 90, isUnsigned: true)
!582 = !DIEnumerator(name: "TRUTH_ANDIF_EXPR", value: 91, isUnsigned: true)
!583 = !DIEnumerator(name: "TRUTH_ORIF_EXPR", value: 92, isUnsigned: true)
!584 = !DIEnumerator(name: "TRUTH_AND_EXPR", value: 93, isUnsigned: true)
!585 = !DIEnumerator(name: "TRUTH_OR_EXPR", value: 94, isUnsigned: true)
!586 = !DIEnumerator(name: "TRUTH_XOR_EXPR", value: 95, isUnsigned: true)
!587 = !DIEnumerator(name: "TRUTH_NOT_EXPR", value: 96, isUnsigned: true)
!588 = !DIEnumerator(name: "LT_EXPR", value: 97, isUnsigned: true)
!589 = !DIEnumerator(name: "LE_EXPR", value: 98, isUnsigned: true)
!590 = !DIEnumerator(name: "GT_EXPR", value: 99, isUnsigned: true)
!591 = !DIEnumerator(name: "GE_EXPR", value: 100, isUnsigned: true)
!592 = !DIEnumerator(name: "EQ_EXPR", value: 101, isUnsigned: true)
!593 = !DIEnumerator(name: "NE_EXPR", value: 102, isUnsigned: true)
!594 = !DIEnumerator(name: "UNORDERED_EXPR", value: 103, isUnsigned: true)
!595 = !DIEnumerator(name: "ORDERED_EXPR", value: 104, isUnsigned: true)
!596 = !DIEnumerator(name: "UNLT_EXPR", value: 105, isUnsigned: true)
!597 = !DIEnumerator(name: "UNLE_EXPR", value: 106, isUnsigned: true)
!598 = !DIEnumerator(name: "UNGT_EXPR", value: 107, isUnsigned: true)
!599 = !DIEnumerator(name: "UNGE_EXPR", value: 108, isUnsigned: true)
!600 = !DIEnumerator(name: "UNEQ_EXPR", value: 109, isUnsigned: true)
!601 = !DIEnumerator(name: "LTGT_EXPR", value: 110, isUnsigned: true)
!602 = !DIEnumerator(name: "RANGE_EXPR", value: 111, isUnsigned: true)
!603 = !DIEnumerator(name: "PAREN_EXPR", value: 112, isUnsigned: true)
!604 = !DIEnumerator(name: "CONVERT_EXPR", value: 113, isUnsigned: true)
!605 = !DIEnumerator(name: "ADDR_SPACE_CONVERT_EXPR", value: 114, isUnsigned: true)
!606 = !DIEnumerator(name: "FIXED_CONVERT_EXPR", value: 115, isUnsigned: true)
!607 = !DIEnumerator(name: "NOP_EXPR", value: 116, isUnsigned: true)
!608 = !DIEnumerator(name: "NON_LVALUE_EXPR", value: 117, isUnsigned: true)
!609 = !DIEnumerator(name: "VIEW_CONVERT_EXPR", value: 118, isUnsigned: true)
!610 = !DIEnumerator(name: "COMPOUND_LITERAL_EXPR", value: 119, isUnsigned: true)
!611 = !DIEnumerator(name: "SAVE_EXPR", value: 120, isUnsigned: true)
!612 = !DIEnumerator(name: "ADDR_EXPR", value: 121, isUnsigned: true)
!613 = !DIEnumerator(name: "FDESC_EXPR", value: 122, isUnsigned: true)
!614 = !DIEnumerator(name: "COMPLEX_EXPR", value: 123, isUnsigned: true)
!615 = !DIEnumerator(name: "CONJ_EXPR", value: 124, isUnsigned: true)
!616 = !DIEnumerator(name: "PREDECREMENT_EXPR", value: 125, isUnsigned: true)
!617 = !DIEnumerator(name: "PREINCREMENT_EXPR", value: 126, isUnsigned: true)
!618 = !DIEnumerator(name: "POSTDECREMENT_EXPR", value: 127, isUnsigned: true)
!619 = !DIEnumerator(name: "POSTINCREMENT_EXPR", value: 128, isUnsigned: true)
!620 = !DIEnumerator(name: "VA_ARG_EXPR", value: 129, isUnsigned: true)
!621 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!622 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!623 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!624 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!625 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!626 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!627 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!628 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!629 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!630 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!631 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!632 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!633 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!634 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!635 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!636 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!637 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!638 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!639 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!640 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!641 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!642 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!643 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!644 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!645 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!646 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!647 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!648 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!649 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!650 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!651 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!652 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!653 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!654 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!655 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!656 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!657 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!658 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!659 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!660 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!661 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!662 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!663 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!664 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!665 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!666 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!667 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!668 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!669 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!670 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!671 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!672 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!673 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!674 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!675 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!676 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!677 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!678 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!679 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!680 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!681 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!682 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !446, file: !10, line: 1950, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !7, line: 66, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !7, line: 65, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !446, file: !10, line: 1951, baseType: !684, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !446, file: !10, line: 1953, baseType: !335, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !9, file: !10, line: 3404, baseType: !690, size: 1664)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !10, line: 3337, size: 1664, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !10, line: 3338, baseType: !47, size: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !690, file: !10, line: 3341, baseType: !694, size: 1472, offset: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !695, line: 410, size: 1472, elements: !696)
!695 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !694, file: !695, line: 412, baseType: !89, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !694, file: !695, line: 413, baseType: !89, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !694, file: !695, line: 414, baseType: !89, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !694, file: !695, line: 415, baseType: !89, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !694, file: !695, line: 416, baseType: !89, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !694, file: !695, line: 417, baseType: !89, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !694, file: !695, line: 418, baseType: !112, size: 8, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !694, file: !695, line: 419, baseType: !112, size: 8, offset: 200)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !694, file: !695, line: 420, baseType: !706, size: 8, offset: 208)
!706 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !694, file: !695, line: 421, baseType: !706, size: 8, offset: 216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !694, file: !695, line: 422, baseType: !706, size: 8, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !694, file: !695, line: 423, baseType: !706, size: 8, offset: 232)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !694, file: !695, line: 424, baseType: !706, size: 8, offset: 240)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !694, file: !695, line: 425, baseType: !706, size: 8, offset: 248)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !694, file: !695, line: 426, baseType: !706, size: 8, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !694, file: !695, line: 427, baseType: !706, size: 8, offset: 264)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !694, file: !695, line: 428, baseType: !706, size: 8, offset: 272)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !694, file: !695, line: 429, baseType: !706, size: 8, offset: 280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !694, file: !695, line: 430, baseType: !706, size: 8, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !694, file: !695, line: 431, baseType: !706, size: 8, offset: 296)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !694, file: !695, line: 432, baseType: !706, size: 8, offset: 304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !694, file: !695, line: 433, baseType: !706, size: 8, offset: 312)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !694, file: !695, line: 434, baseType: !706, size: 8, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !694, file: !695, line: 435, baseType: !706, size: 8, offset: 328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !694, file: !695, line: 436, baseType: !706, size: 8, offset: 336)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !694, file: !695, line: 437, baseType: !706, size: 8, offset: 344)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !694, file: !695, line: 438, baseType: !706, size: 8, offset: 352)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !694, file: !695, line: 439, baseType: !706, size: 8, offset: 360)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !694, file: !695, line: 440, baseType: !706, size: 8, offset: 368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !694, file: !695, line: 441, baseType: !706, size: 8, offset: 376)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !694, file: !695, line: 442, baseType: !706, size: 8, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !694, file: !695, line: 443, baseType: !706, size: 8, offset: 392)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !694, file: !695, line: 444, baseType: !706, size: 8, offset: 400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !694, file: !695, line: 445, baseType: !706, size: 8, offset: 408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !694, file: !695, line: 446, baseType: !706, size: 8, offset: 416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !694, file: !695, line: 447, baseType: !706, size: 8, offset: 424)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !694, file: !695, line: 448, baseType: !706, size: 8, offset: 432)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !694, file: !695, line: 449, baseType: !706, size: 8, offset: 440)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !694, file: !695, line: 450, baseType: !706, size: 8, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !694, file: !695, line: 451, baseType: !706, size: 8, offset: 456)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !694, file: !695, line: 452, baseType: !706, size: 8, offset: 464)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !694, file: !695, line: 453, baseType: !706, size: 8, offset: 472)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !694, file: !695, line: 454, baseType: !706, size: 8, offset: 480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !694, file: !695, line: 455, baseType: !706, size: 8, offset: 488)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !694, file: !695, line: 456, baseType: !706, size: 8, offset: 496)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !694, file: !695, line: 457, baseType: !706, size: 8, offset: 504)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !694, file: !695, line: 458, baseType: !706, size: 8, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !694, file: !695, line: 459, baseType: !706, size: 8, offset: 520)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !694, file: !695, line: 460, baseType: !706, size: 8, offset: 528)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !694, file: !695, line: 461, baseType: !706, size: 8, offset: 536)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !694, file: !695, line: 462, baseType: !706, size: 8, offset: 544)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !694, file: !695, line: 463, baseType: !706, size: 8, offset: 552)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !694, file: !695, line: 464, baseType: !706, size: 8, offset: 560)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !694, file: !695, line: 465, baseType: !706, size: 8, offset: 568)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !694, file: !695, line: 466, baseType: !706, size: 8, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !694, file: !695, line: 467, baseType: !706, size: 8, offset: 584)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !694, file: !695, line: 468, baseType: !706, size: 8, offset: 592)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !694, file: !695, line: 469, baseType: !706, size: 8, offset: 600)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !694, file: !695, line: 470, baseType: !706, size: 8, offset: 608)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !694, file: !695, line: 471, baseType: !706, size: 8, offset: 616)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !694, file: !695, line: 472, baseType: !706, size: 8, offset: 624)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !694, file: !695, line: 473, baseType: !706, size: 8, offset: 632)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !694, file: !695, line: 474, baseType: !706, size: 8, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !694, file: !695, line: 475, baseType: !706, size: 8, offset: 648)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !694, file: !695, line: 476, baseType: !706, size: 8, offset: 656)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !694, file: !695, line: 477, baseType: !706, size: 8, offset: 664)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !694, file: !695, line: 478, baseType: !706, size: 8, offset: 672)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !694, file: !695, line: 479, baseType: !706, size: 8, offset: 680)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !694, file: !695, line: 480, baseType: !706, size: 8, offset: 688)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !694, file: !695, line: 481, baseType: !706, size: 8, offset: 696)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !694, file: !695, line: 482, baseType: !706, size: 8, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !694, file: !695, line: 483, baseType: !706, size: 8, offset: 712)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !694, file: !695, line: 484, baseType: !706, size: 8, offset: 720)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !694, file: !695, line: 485, baseType: !706, size: 8, offset: 728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !694, file: !695, line: 486, baseType: !706, size: 8, offset: 736)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !694, file: !695, line: 487, baseType: !706, size: 8, offset: 744)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !694, file: !695, line: 488, baseType: !706, size: 8, offset: 752)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !694, file: !695, line: 489, baseType: !706, size: 8, offset: 760)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !694, file: !695, line: 490, baseType: !706, size: 8, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !694, file: !695, line: 491, baseType: !706, size: 8, offset: 776)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !694, file: !695, line: 492, baseType: !706, size: 8, offset: 784)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !694, file: !695, line: 493, baseType: !706, size: 8, offset: 792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !694, file: !695, line: 494, baseType: !706, size: 8, offset: 800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !694, file: !695, line: 495, baseType: !706, size: 8, offset: 808)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !694, file: !695, line: 496, baseType: !706, size: 8, offset: 816)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !694, file: !695, line: 497, baseType: !706, size: 8, offset: 824)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !694, file: !695, line: 498, baseType: !706, size: 8, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !694, file: !695, line: 499, baseType: !706, size: 8, offset: 840)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !694, file: !695, line: 500, baseType: !706, size: 8, offset: 848)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !694, file: !695, line: 501, baseType: !706, size: 8, offset: 856)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !694, file: !695, line: 502, baseType: !706, size: 8, offset: 864)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !694, file: !695, line: 503, baseType: !706, size: 8, offset: 872)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !694, file: !695, line: 504, baseType: !706, size: 8, offset: 880)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !694, file: !695, line: 505, baseType: !706, size: 8, offset: 888)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !694, file: !695, line: 506, baseType: !706, size: 8, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !694, file: !695, line: 507, baseType: !706, size: 8, offset: 904)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !694, file: !695, line: 508, baseType: !706, size: 8, offset: 912)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !694, file: !695, line: 509, baseType: !706, size: 8, offset: 920)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !694, file: !695, line: 510, baseType: !706, size: 8, offset: 928)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !694, file: !695, line: 511, baseType: !706, size: 8, offset: 936)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !694, file: !695, line: 512, baseType: !706, size: 8, offset: 944)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !694, file: !695, line: 513, baseType: !706, size: 8, offset: 952)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !694, file: !695, line: 514, baseType: !706, size: 8, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !694, file: !695, line: 515, baseType: !706, size: 8, offset: 968)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !694, file: !695, line: 516, baseType: !706, size: 8, offset: 976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !694, file: !695, line: 517, baseType: !706, size: 8, offset: 984)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !694, file: !695, line: 518, baseType: !706, size: 8, offset: 992)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !694, file: !695, line: 519, baseType: !706, size: 8, offset: 1000)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !694, file: !695, line: 520, baseType: !706, size: 8, offset: 1008)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !694, file: !695, line: 521, baseType: !706, size: 8, offset: 1016)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !694, file: !695, line: 522, baseType: !706, size: 8, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !694, file: !695, line: 523, baseType: !706, size: 8, offset: 1032)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !694, file: !695, line: 524, baseType: !706, size: 8, offset: 1040)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !694, file: !695, line: 525, baseType: !706, size: 8, offset: 1048)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !694, file: !695, line: 526, baseType: !706, size: 8, offset: 1056)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !694, file: !695, line: 527, baseType: !706, size: 8, offset: 1064)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !694, file: !695, line: 528, baseType: !706, size: 8, offset: 1072)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !694, file: !695, line: 529, baseType: !706, size: 8, offset: 1080)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !694, file: !695, line: 530, baseType: !706, size: 8, offset: 1088)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !694, file: !695, line: 531, baseType: !706, size: 8, offset: 1096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !694, file: !695, line: 532, baseType: !706, size: 8, offset: 1104)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !694, file: !695, line: 533, baseType: !706, size: 8, offset: 1112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !694, file: !695, line: 534, baseType: !706, size: 8, offset: 1120)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !694, file: !695, line: 535, baseType: !706, size: 8, offset: 1128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !694, file: !695, line: 536, baseType: !706, size: 8, offset: 1136)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !694, file: !695, line: 537, baseType: !706, size: 8, offset: 1144)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !694, file: !695, line: 538, baseType: !706, size: 8, offset: 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !694, file: !695, line: 539, baseType: !706, size: 8, offset: 1160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !694, file: !695, line: 540, baseType: !706, size: 8, offset: 1168)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !694, file: !695, line: 541, baseType: !706, size: 8, offset: 1176)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !694, file: !695, line: 542, baseType: !706, size: 8, offset: 1184)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !694, file: !695, line: 543, baseType: !706, size: 8, offset: 1192)
