; ModuleID = 'varpool.c'
source_filename = "varpool.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!457 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!458 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!459 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!460 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!461 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!462 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!463 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!464 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!465 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!466 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!467 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!468 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!469 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!470 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!471 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!472 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!473 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!474 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!475 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!476 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!477 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!478 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!479 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!480 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!481 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!482 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!483 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!484 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!485 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!486 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!487 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!488 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!489 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!490 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!491 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!492 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!493 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!494 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!495 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!496 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!497 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 29, baseType: !7, size: 32, elements: !500)
!499 = !DIFile(filename: "./diagnostic.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!501 = !DIEnumerator(name: "DK_UNSPECIFIED", value: 0, isUnsigned: true)
!502 = !DIEnumerator(name: "DK_IGNORED", value: 1, isUnsigned: true)
!503 = !DIEnumerator(name: "DK_FATAL", value: 2, isUnsigned: true)
!504 = !DIEnumerator(name: "DK_ICE", value: 3, isUnsigned: true)
!505 = !DIEnumerator(name: "DK_ERROR", value: 4, isUnsigned: true)
!506 = !DIEnumerator(name: "DK_SORRY", value: 5, isUnsigned: true)
!507 = !DIEnumerator(name: "DK_WARNING", value: 6, isUnsigned: true)
!508 = !DIEnumerator(name: "DK_ANACHRONISM", value: 7, isUnsigned: true)
!509 = !DIEnumerator(name: "DK_NOTE", value: 8, isUnsigned: true)
!510 = !DIEnumerator(name: "DK_DEBUG", value: 9, isUnsigned: true)
!511 = !DIEnumerator(name: "DK_PEDWARN", value: 10, isUnsigned: true)
!512 = !DIEnumerator(name: "DK_PERMERROR", value: 11, isUnsigned: true)
!513 = !DIEnumerator(name: "DK_LAST_DIAGNOSTIC_KIND", value: 12, isUnsigned: true)
!514 = !{!515, !5, !516, !517, !521, !1026, !1711, !1111}
!515 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varpool_node", file: !315, line: 358, size: 320, elements: !519)
!519 = !{!520, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !518, file: !315, line: 359, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !305, line: 56, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !524)
!524 = !{!525, !558, !564, !577, !584, !591, !596, !606, !612, !626, !638, !676, !684, !712, !729, !730, !735, !744, !750, !755, !759, !763, !1349, !1398, !1404, !1410, !1417, !1430, !1444, !1461, !1473, !1495, !1510, !1682}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !523, file: !6, line: 3372, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !526, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !526, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !526, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !526, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !526, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !526, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !526, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !526, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !526, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !526, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !526, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !526, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !526, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !526, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !526, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !526, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !526, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !526, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !526, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !526, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !526, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !526, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !526, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !526, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !526, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !526, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !526, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !526, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !526, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !526, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !523, file: !6, line: 3373, baseType: !559, size: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !6, line: 403, baseType: !526, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !559, file: !6, line: 404, baseType: !521, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !559, file: !6, line: 405, baseType: !521, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !523, file: !6, line: 3374, baseType: !565, size: 320)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !6, line: 1385, baseType: !559, size: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !565, file: !6, line: 1386, baseType: !569, size: 128, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !570, line: 58, baseType: !571)
!570 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 54, size: 128, elements: !572)
!572 = !{!573, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !571, file: !570, line: 56, baseType: !574, size: 64)
!574 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !571, file: !570, line: 57, baseType: !576, size: 64, offset: 64)
!576 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !523, file: !6, line: 3375, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !6, line: 1398, baseType: !559, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !578, file: !6, line: 1399, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !523, file: !6, line: 3376, baseType: !585, size: 256)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !6, line: 1409, baseType: !559, size: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !585, file: !6, line: 1410, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !523, file: !6, line: 3377, baseType: !592, size: 256)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !6, line: 1438, baseType: !559, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !592, file: !6, line: 1439, baseType: !521, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !523, file: !6, line: 3378, baseType: !597, size: 256)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !6, line: 1419, baseType: !559, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !597, file: !6, line: 1420, baseType: !515, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !597, file: !6, line: 1421, baseType: !602, size: 8, offset: 224)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 8, elements: !604)
!603 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!604 = !{!605}
!605 = !DISubrange(count: 1)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !523, file: !6, line: 3379, baseType: !607, size: 320)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !607, file: !6, line: 1429, baseType: !559, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !607, file: !6, line: 1430, baseType: !521, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !607, file: !6, line: 1431, baseType: !521, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !523, file: !6, line: 3380, baseType: !613, size: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !6, line: 1461, baseType: !559, size: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !613, file: !6, line: 1462, baseType: !617, size: 128, offset: 192)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !618, line: 31, size: 128, elements: !619)
!618 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!619 = !{!620, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !617, file: !618, line: 32, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !617, file: !618, line: 33, baseType: !7, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !617, file: !618, line: 34, baseType: !7, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !523, file: !6, line: 3381, baseType: !627, size: 384)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !628)
!628 = !{!629, !630, !635, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !6, line: 2508, baseType: !559, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !627, file: !6, line: 2509, baseType: !631, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !632, line: 58, baseType: !633)
!632 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !634, line: 44, baseType: !7)
!634 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !627, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !6, line: 2511, baseType: !521, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !627, file: !6, line: 2512, baseType: !521, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !523, file: !6, line: 3382, baseType: !639, size: 896)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !6, line: 2653, baseType: !627, size: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !639, file: !6, line: 2654, baseType: !521, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !639, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !639, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !639, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !639, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !639, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !639, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !639, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !639, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !639, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !639, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !639, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !639, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !639, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !639, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !639, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !639, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !639, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !639, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !639, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !639, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !639, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !639, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !639, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !639, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !639, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !639, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !639, file: !6, line: 2705, baseType: !521, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !639, file: !6, line: 2706, baseType: !521, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !639, file: !6, line: 2707, baseType: !521, size: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !639, file: !6, line: 2708, baseType: !521, size: 64, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !639, file: !6, line: 2711, baseType: !674, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !523, file: !6, line: 3383, baseType: !677, size: 960)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !6, line: 2757, baseType: !639, size: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !677, file: !6, line: 2758, baseType: !681, size: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !305, line: 50, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !305, line: 49, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !523, file: !6, line: 3384, baseType: !685, size: 1472)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !686)
!686 = !{!687, !708, !709, !710, !711}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !685, file: !6, line: 3115, baseType: !688, size: 1216)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !688, file: !6, line: 2985, baseType: !677, size: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !688, file: !6, line: 2986, baseType: !521, size: 64, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !688, file: !6, line: 2987, baseType: !521, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !688, file: !6, line: 2988, baseType: !521, size: 64, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !688, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !688, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !688, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !688, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !688, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !688, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !688, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !688, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !688, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !688, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !688, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !688, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !688, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !688, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !685, file: !6, line: 3117, baseType: !521, size: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !685, file: !6, line: 3119, baseType: !521, size: 64, offset: 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !685, file: !6, line: 3121, baseType: !521, size: 64, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !685, file: !6, line: 3123, baseType: !521, size: 64, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !523, file: !6, line: 3385, baseType: !713, size: 1088)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !6, line: 2875, baseType: !677, size: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !713, file: !6, line: 2876, baseType: !681, size: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !713, file: !6, line: 2877, baseType: !718, size: 64, offset: 1024)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !720, line: 172, size: 128, elements: !721)
!720 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !{!722, !723, !724, !725, !726, !727, !728}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !719, file: !720, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !719, file: !720, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !719, file: !720, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !719, file: !720, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !719, file: !720, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !719, file: !720, line: 195, baseType: !7, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !719, file: !720, line: 199, baseType: !521, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !523, file: !6, line: 3386, baseType: !688, size: 1216)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !523, file: !6, line: 3387, baseType: !731, size: 1280)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !6, line: 3094, baseType: !688, size: 1216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !731, file: !6, line: 3095, baseType: !718, size: 64, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !523, file: !6, line: 3388, baseType: !736, size: 1216)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !6, line: 2825, baseType: !639, size: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !736, file: !6, line: 2827, baseType: !521, size: 64, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !736, file: !6, line: 2828, baseType: !521, size: 64, offset: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !736, file: !6, line: 2829, baseType: !521, size: 64, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !736, file: !6, line: 2830, baseType: !521, size: 64, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !736, file: !6, line: 2831, baseType: !521, size: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !523, file: !6, line: 3389, baseType: !745, size: 1024)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !745, file: !6, line: 2851, baseType: !677, size: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !745, file: !6, line: 2852, baseType: !515, size: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !745, file: !6, line: 2853, baseType: !515, size: 32, offset: 992)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !523, file: !6, line: 3390, baseType: !751, size: 1024)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !6, line: 2858, baseType: !677, size: 960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !751, file: !6, line: 2859, baseType: !718, size: 64, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !523, file: !6, line: 3391, baseType: !756, size: 960)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !6, line: 2863, baseType: !677, size: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !523, file: !6, line: 3392, baseType: !760, size: 1472)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !6, line: 3305, baseType: !685, size: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !523, file: !6, line: 3393, baseType: !764, size: 1792)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !765)
!765 = !{!766, !767, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !764, file: !6, line: 3249, baseType: !685, size: 1472)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !764, file: !6, line: 3251, baseType: !768, size: 64, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !770, line: 463, size: 1152, elements: !771)
!770 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!771 = !{!772, !775, !1096, !1097, !1269, !1272, !1273, !1274, !1275, !1276, !1277, !1301, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !769, file: !770, line: 464, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !770, line: 464, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !769, file: !770, line: 467, baseType: !776, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !778)
!778 = !{!779, !1071, !1072, !1085, !1086, !1087, !1088, !1089, !1090, !1092, !1094, !1095}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !777, file: !202, line: 377, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !305, line: 111, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !783)
!783 = !{!784, !1034, !1035, !1036, !1039, !1045, !1046, !1047, !1065, !1066, !1067, !1068, !1069, !1070}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !782, file: !202, line: 219, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !787, file: !202, line: 151, baseType: !790, size: 128)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !791, file: !202, line: 150, baseType: !7, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !791, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !791, file: !202, line: 150, baseType: !796, size: 64, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 64, elements: !604)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !305, line: 108, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !800)
!800 = !{!801, !802, !803, !1025, !1027, !1028, !1029, !1030, !1031, !1032}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !799, file: !202, line: 124, baseType: !781, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !799, file: !202, line: 125, baseType: !781, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !799, file: !202, line: 131, baseType: !804, size: 64, offset: 128)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !805)
!805 = !{!806, !1024}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !804, file: !202, line: 129, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !305, line: 66, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !810, line: 143, size: 192, elements: !811)
!810 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!811 = !{!812, !1022, !1023}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !809, file: !810, line: 145, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !305, line: 69, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !810, line: 136, size: 192, elements: !816)
!816 = !{!817, !1020, !1021}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !815, file: !810, line: 137, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !305, line: 58, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !810, line: 737, size: 768, elements: !821)
!821 = !{!822, !839, !873, !879, !884, !889, !896, !902, !908, !913, !927, !932, !938, !943, !955, !960, !978, !985, !992, !998, !1003, !1009, !1015}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !820, file: !810, line: 738, baseType: !823, size: 256)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !810, line: 271, size: 256, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !823, file: !810, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !823, file: !810, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !823, file: !810, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !823, file: !810, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !823, file: !810, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !823, file: !810, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !823, file: !810, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !823, file: !810, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !823, file: !810, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !823, file: !810, line: 312, baseType: !7, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !823, file: !810, line: 316, baseType: !631, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !823, file: !810, line: 319, baseType: !7, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !823, file: !810, line: 323, baseType: !781, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !823, file: !810, line: 327, baseType: !521, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !820, file: !810, line: 739, baseType: !840, size: 448)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !810, line: 350, size: 448, elements: !841)
!841 = !{!842, !871}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !840, file: !810, line: 353, baseType: !843, size: 384)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !810, line: 333, size: 384, elements: !844)
!844 = !{!845, !846, !854}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !843, file: !810, line: 336, baseType: !823, size: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !843, file: !810, line: 343, baseType: !847, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !849, line: 37, size: 128, elements: !850)
!849 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !849, line: 39, baseType: !847, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !848, file: !849, line: 40, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !843, file: !810, line: 344, baseType: !855, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !849, line: 45, size: 320, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !849, line: 47, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !856, file: !849, line: 48, baseType: !860, size: 256, offset: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !861)
!861 = !{!862, !864, !865, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !860, file: !6, line: 1884, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !6, line: 1885, baseType: !863, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !860, file: !6, line: 1891, baseType: !866, size: 64, offset: 128)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !6, line: 1891, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !866, file: !6, line: 1891, baseType: !818, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !866, file: !6, line: 1891, baseType: !521, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !860, file: !6, line: 1892, baseType: !853, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !840, file: !810, line: 359, baseType: !872, size: 64, offset: 384)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 64, elements: !604)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !820, file: !810, line: 740, baseType: !874, size: 512)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !810, line: 365, size: 512, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !874, file: !810, line: 368, baseType: !843, size: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !874, file: !810, line: 373, baseType: !521, size: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !874, file: !810, line: 374, baseType: !521, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !820, file: !810, line: 741, baseType: !880, size: 576)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !810, line: 380, size: 576, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !880, file: !810, line: 383, baseType: !874, size: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !880, file: !810, line: 389, baseType: !872, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !820, file: !810, line: 742, baseType: !885, size: 320)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !810, line: 395, size: 320, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !885, file: !810, line: 397, baseType: !823, size: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !885, file: !810, line: 400, baseType: !807, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !820, file: !810, line: 743, baseType: !890, size: 448)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !810, line: 406, size: 448, elements: !891)
!891 = !{!892, !893, !894, !895}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !890, file: !810, line: 408, baseType: !823, size: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !890, file: !810, line: 412, baseType: !521, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !890, file: !810, line: 420, baseType: !521, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !890, file: !810, line: 423, baseType: !807, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !820, file: !810, line: 744, baseType: !897, size: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !810, line: 429, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !810, line: 431, baseType: !823, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !897, file: !810, line: 434, baseType: !521, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !897, file: !810, line: 437, baseType: !807, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !820, file: !810, line: 745, baseType: !903, size: 384)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !810, line: 443, size: 384, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !810, line: 445, baseType: !823, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !903, file: !810, line: 449, baseType: !521, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !903, file: !810, line: 453, baseType: !807, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !820, file: !810, line: 746, baseType: !909, size: 320)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !810, line: 459, size: 320, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !909, file: !810, line: 461, baseType: !823, size: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !909, file: !810, line: 464, baseType: !521, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !820, file: !810, line: 747, baseType: !914, size: 768)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !810, line: 469, size: 768, elements: !915)
!915 = !{!916, !917, !918, !919, !920}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !914, file: !810, line: 471, baseType: !823, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !914, file: !810, line: 474, baseType: !7, size: 32, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !914, file: !810, line: 475, baseType: !7, size: 32, offset: 288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !914, file: !810, line: 478, baseType: !521, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !914, file: !810, line: 481, baseType: !921, size: 384, offset: 384)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 384, elements: !604)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !922, file: !6, line: 1920, baseType: !860, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !922, file: !6, line: 1921, baseType: !521, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !922, file: !6, line: 1922, baseType: !631, size: 32, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !820, file: !810, line: 748, baseType: !928, size: 320)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !810, line: 487, size: 320, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !928, file: !810, line: 490, baseType: !823, size: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !928, file: !810, line: 494, baseType: !515, size: 32, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !820, file: !810, line: 749, baseType: !933, size: 384)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !810, line: 500, size: 384, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !933, file: !810, line: 502, baseType: !823, size: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !933, file: !810, line: 506, baseType: !807, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !933, file: !810, line: 510, baseType: !807, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !820, file: !810, line: 750, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !810, line: 529, size: 320, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !939, file: !810, line: 531, baseType: !823, size: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !939, file: !810, line: 540, baseType: !807, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !820, file: !810, line: 751, baseType: !944, size: 704)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !810, line: 546, size: 704, elements: !945)
!945 = !{!946, !947, !950, !951, !952, !953, !954}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !944, file: !810, line: 549, baseType: !874, size: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !944, file: !810, line: 553, baseType: !948, size: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !944, file: !810, line: 557, baseType: !623, size: 8, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !944, file: !810, line: 558, baseType: !623, size: 8, offset: 584)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !944, file: !810, line: 559, baseType: !623, size: 8, offset: 592)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !944, file: !810, line: 560, baseType: !623, size: 8, offset: 600)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !944, file: !810, line: 566, baseType: !872, size: 64, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !820, file: !810, line: 752, baseType: !956, size: 384)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !810, line: 571, size: 384, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !956, file: !810, line: 573, baseType: !885, size: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !810, line: 577, baseType: !521, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !820, file: !810, line: 753, baseType: !961, size: 576)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !810, line: 600, size: 576, elements: !962)
!962 = !{!963, !964, !965, !968, !977}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !961, file: !810, line: 602, baseType: !885, size: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !961, file: !810, line: 605, baseType: !521, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !961, file: !810, line: 609, baseType: !966, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !967, line: 46, baseType: !574)
!967 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!968 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !961, file: !810, line: 612, baseType: !969, size: 64, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !810, line: 581, size: 320, elements: !971)
!971 = !{!972, !973, !974, !975, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !970, file: !810, line: 583, baseType: !5, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !970, file: !810, line: 586, baseType: !521, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !970, file: !810, line: 589, baseType: !521, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !970, file: !810, line: 592, baseType: !521, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !970, file: !810, line: 595, baseType: !521, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !961, file: !810, line: 616, baseType: !807, size: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !820, file: !810, line: 754, baseType: !979, size: 512)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !810, line: 622, size: 512, elements: !980)
!980 = !{!981, !982, !983, !984}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !810, line: 624, baseType: !885, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !810, line: 628, baseType: !521, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !979, file: !810, line: 632, baseType: !521, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !979, file: !810, line: 636, baseType: !521, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !820, file: !810, line: 755, baseType: !986, size: 704)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !810, line: 642, size: 704, elements: !987)
!987 = !{!988, !989, !990, !991}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !986, file: !810, line: 644, baseType: !979, size: 512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !986, file: !810, line: 648, baseType: !521, size: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !986, file: !810, line: 652, baseType: !521, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !986, file: !810, line: 653, baseType: !521, size: 64, offset: 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !820, file: !810, line: 756, baseType: !993, size: 448)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !810, line: 663, size: 448, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !993, file: !810, line: 665, baseType: !885, size: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !993, file: !810, line: 668, baseType: !521, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !993, file: !810, line: 673, baseType: !521, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !820, file: !810, line: 757, baseType: !999, size: 384)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !810, line: 694, size: 384, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !999, file: !810, line: 696, baseType: !885, size: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !999, file: !810, line: 699, baseType: !521, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !820, file: !810, line: 758, baseType: !1004, size: 384)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !810, line: 681, size: 384, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !810, line: 683, baseType: !823, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1004, file: !810, line: 686, baseType: !521, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1004, file: !810, line: 689, baseType: !521, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !820, file: !810, line: 759, baseType: !1010, size: 384)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !810, line: 707, size: 384, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1010, file: !810, line: 709, baseType: !823, size: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1010, file: !810, line: 712, baseType: !521, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1010, file: !810, line: 712, baseType: !521, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !820, file: !810, line: 760, baseType: !1016, size: 320)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !810, line: 718, size: 320, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1016, file: !810, line: 720, baseType: !823, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1016, file: !810, line: 723, baseType: !521, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !815, file: !810, line: 138, baseType: !814, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !815, file: !810, line: 139, baseType: !814, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !809, file: !810, line: 146, baseType: !813, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !809, file: !810, line: 152, baseType: !807, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !804, file: !202, line: 130, baseType: !681, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !799, file: !202, line: 134, baseType: !1026, size: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !799, file: !202, line: 137, baseType: !521, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !799, file: !202, line: 138, baseType: !631, size: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !799, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !202, line: 144, baseType: !515, size: 32, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !799, file: !202, line: 145, baseType: !515, size: 32, offset: 416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !799, file: !202, line: 146, baseType: !1033, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !782, file: !202, line: 220, baseType: !785, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !782, file: !202, line: 223, baseType: !1026, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !782, file: !202, line: 226, baseType: !1037, size: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !782, file: !202, line: 229, baseType: !1040, size: 128, offset: 256)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 128, elements: !1043)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1043 = !{!1044}
!1044 = !DISubrange(count: 2)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !782, file: !202, line: 232, baseType: !781, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !782, file: !202, line: 233, baseType: !781, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !782, file: !202, line: 238, baseType: !1048, size: 64, offset: 512)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1049)
!1049 = !{!1050, !1056}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1048, file: !202, line: 236, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1052, file: !202, line: 275, baseType: !807, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1052, file: !202, line: 278, baseType: !807, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1048, file: !202, line: 237, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1058, file: !202, line: 261, baseType: !681, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1058, file: !202, line: 262, baseType: !681, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1058, file: !202, line: 266, baseType: !681, size: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1058, file: !202, line: 267, baseType: !681, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1058, file: !202, line: 270, baseType: !515, size: 32, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !202, line: 241, baseType: !1033, size: 64, offset: 576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !782, file: !202, line: 244, baseType: !515, size: 32, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !782, file: !202, line: 247, baseType: !515, size: 32, offset: 672)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !782, file: !202, line: 250, baseType: !515, size: 32, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !782, file: !202, line: 253, baseType: !515, size: 32, offset: 736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !202, line: 256, baseType: !515, size: 32, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !777, file: !202, line: 378, baseType: !780, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !777, file: !202, line: 381, baseType: !1073, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1076)
!1076 = !{!1077}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1075, file: !202, line: 282, baseType: !1078, size: 128)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1079, file: !202, line: 281, baseType: !7, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1079, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1079, file: !202, line: 281, baseType: !1084, size: 64, offset: 64)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 64, elements: !604)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !777, file: !202, line: 384, baseType: !515, size: 32, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !777, file: !202, line: 387, baseType: !515, size: 32, offset: 224)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !777, file: !202, line: 390, baseType: !515, size: 32, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !777, file: !202, line: 394, baseType: !1073, size: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !777, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !777, file: !202, line: 399, baseType: !1091, size: 64, offset: 416)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !1043)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !777, file: !202, line: 402, baseType: !1093, size: 64, offset: 480)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1043)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !777, file: !202, line: 406, baseType: !515, size: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !777, file: !202, line: 409, baseType: !515, size: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !769, file: !770, line: 470, baseType: !808, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !769, file: !770, line: 473, baseType: !1098, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !720, line: 39, size: 1152, elements: !1100)
!1100 = !{!1101, !1150, !1163, !1175, !1176, !1246, !1247, !1251, !1252, !1253, !1254, !1255}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1099, file: !720, line: 41, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !263, line: 144, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !263, line: 100, size: 896, elements: !1105)
!1105 = !{!1106, !1114, !1119, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1136, !1138, !1139, !1144, !1149}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1104, file: !263, line: 102, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !263, line: 52, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !263, line: 47, baseType: !7)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1104, file: !263, line: 105, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !263, line: 59, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!515, !1112, !1112}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1104, file: !263, line: 108, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !263, line: 63, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{null, !1026}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1104, file: !263, line: 111, baseType: !1125, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !263, line: 114, baseType: !966, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1104, file: !263, line: 117, baseType: !966, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1104, file: !263, line: 120, baseType: !966, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1104, file: !263, line: 124, baseType: !7, size: 32, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1104, file: !263, line: 128, baseType: !7, size: 32, offset: 480)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1104, file: !263, line: 131, baseType: !1132, size: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !263, line: 75, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!1026, !966, !966}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1104, file: !263, line: 132, baseType: !1137, size: 64, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !263, line: 78, baseType: !1121)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1104, file: !263, line: 135, baseType: !1026, size: 64, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1104, file: !263, line: 136, baseType: !1140, size: 64, offset: 704)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !263, line: 82, baseType: !1141)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!1026, !1026, !966, !966}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1104, file: !263, line: 137, baseType: !1145, size: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !263, line: 83, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !1026, !1026}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1104, file: !263, line: 141, baseType: !7, size: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1099, file: !720, line: 48, baseType: !1151, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !810, line: 35, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !810, line: 35, size: 128, elements: !1154)
!1154 = !{!1155}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1153, file: !810, line: 35, baseType: !1156, size: 128)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !810, line: 33, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !810, line: 33, size: 128, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1157, file: !810, line: 33, baseType: !7, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1157, file: !810, line: 33, baseType: !7, size: 32, offset: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1157, file: !810, line: 33, baseType: !1162, size: 64, offset: 64)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 64, elements: !604)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1099, file: !720, line: 51, baseType: !1164, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1166, file: !6, line: 183, baseType: !1169, size: 128)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1170, file: !6, line: 182, baseType: !7, size: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1170, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1170, file: !6, line: 182, baseType: !872, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1099, file: !720, line: 54, baseType: !521, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1099, file: !720, line: 57, baseType: !1177, size: 128, offset: 256)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1178, line: 31, size: 128, elements: !1179)
!1178 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1177, file: !1178, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1177, file: !1178, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1177, file: !1178, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1177, file: !1178, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1177, file: !1178, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1177, file: !1178, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1177, file: !1178, line: 56, baseType: !1187, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !305, line: 47, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1190, line: 75, size: 256, elements: !1191)
!1190 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1191 = !{!1192, !1204, !1205, !1206}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1189, file: !1190, line: 76, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1190, line: 68, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1190, line: 63, size: 320, elements: !1196)
!1196 = !{!1197, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1195, file: !1190, line: 64, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1195, file: !1190, line: 65, baseType: !1198, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1195, file: !1190, line: 66, baseType: !7, size: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1195, file: !1190, line: 67, baseType: !1202, size: 128, offset: 192)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 128, elements: !1043)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1190, line: 29, baseType: !574)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1189, file: !1190, line: 77, baseType: !1193, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1189, file: !1190, line: 78, baseType: !7, size: 32, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1189, file: !1190, line: 79, baseType: !1207, size: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1190, line: 49, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1190, line: 45, size: 832, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1209, file: !1190, line: 46, baseType: !1198, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1209, file: !1190, line: 47, baseType: !1188, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1209, file: !1190, line: 48, baseType: !1214, size: 704, offset: 128)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1215, line: 164, size: 704, elements: !1216)
!1215 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1216 = !{!1217, !1218, !1229, !1230, !1231, !1232, !1233, !1234, !1238, !1242, !1243, !1244, !1245}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1214, file: !1215, line: 166, baseType: !576, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1214, file: !1215, line: 167, baseType: !1219, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1215, line: 157, size: 192, elements: !1221)
!1221 = !{!1222, !1224, !1225}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1220, file: !1215, line: 159, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1220, file: !1215, line: 160, baseType: !1219, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1220, file: !1215, line: 161, baseType: !1226, size: 32, offset: 128)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 32, elements: !1227)
!1227 = !{!1228}
!1228 = !DISubrange(count: 4)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1214, file: !1215, line: 168, baseType: !1223, size: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1214, file: !1215, line: 169, baseType: !1223, size: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1214, file: !1215, line: 170, baseType: !1223, size: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1214, file: !1215, line: 171, baseType: !576, size: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1214, file: !1215, line: 172, baseType: !515, size: 32, offset: 384)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1214, file: !1215, line: 176, baseType: !1235, size: 64, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1219, !1026, !576}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1214, file: !1215, line: 177, baseType: !1239, size: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !1026, !1219}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1214, file: !1215, line: 178, baseType: !1026, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1214, file: !1215, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1214, file: !1215, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1214, file: !1215, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1099, file: !720, line: 60, baseType: !1177, size: 128, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1099, file: !720, line: 64, baseType: !1248, size: 64, offset: 512)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1250, line: 33, flags: DIFlagFwdDecl)
!1250 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1099, file: !720, line: 67, baseType: !521, size: 64, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1099, file: !720, line: 73, baseType: !1102, size: 64, offset: 640)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1099, file: !720, line: 77, baseType: !1187, size: 64, offset: 704)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1099, file: !720, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1099, file: !720, line: 82, baseType: !1256, size: 320, offset: 832)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !849, line: 62, size: 320, elements: !1257)
!1257 = !{!1258, !1264, !1265, !1266, !1267, !1268}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1256, file: !849, line: 63, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !849, line: 56, size: 128, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1260, file: !849, line: 57, baseType: !1259, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1260, file: !849, line: 58, baseType: !602, size: 8, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1256, file: !849, line: 64, baseType: !7, size: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1256, file: !849, line: 66, baseType: !7, size: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1256, file: !849, line: 68, baseType: !623, size: 8, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1256, file: !849, line: 70, baseType: !847, size: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1256, file: !849, line: 71, baseType: !855, size: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !769, file: !770, line: 476, baseType: !1270, size: 64, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !770, line: 476, flags: DIFlagFwdDecl)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !769, file: !770, line: 479, baseType: !1102, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !769, file: !770, line: 484, baseType: !521, size: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !769, file: !770, line: 488, baseType: !521, size: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !769, file: !770, line: 493, baseType: !521, size: 64, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !769, file: !770, line: 496, baseType: !521, size: 64, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !769, file: !770, line: 501, baseType: !1278, size: 64, offset: 640)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1280)
!1280 = !{!1281, !1284, !1285, !1286, !1287, !1289, !1290, !1295, !1296, !1297, !1298, !1299, !1300}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1279, file: !213, line: 2356, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1279, file: !213, line: 2357, baseType: !948, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1279, file: !213, line: 2358, baseType: !515, size: 32, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1279, file: !213, line: 2359, baseType: !515, size: 32, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1279, file: !213, line: 2360, baseType: !1288, size: 128, offset: 192)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 128, elements: !1227)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1279, file: !213, line: 2364, baseType: !515, size: 32, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1279, file: !213, line: 2367, baseType: !1291, size: 128, offset: 384)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1292)
!1292 = !{!1293, !1294}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1291, file: !213, line: 2351, baseType: !681, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1291, file: !213, line: 2352, baseType: !576, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1279, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1279, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1279, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1279, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1279, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1279, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !769, file: !770, line: 504, baseType: !1302, size: 64, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !770, line: 504, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !769, file: !770, line: 507, baseType: !1102, size: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !769, file: !770, line: 510, baseType: !515, size: 32, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !769, file: !770, line: 513, baseType: !515, size: 32, offset: 864)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !769, file: !770, line: 516, baseType: !631, size: 32, offset: 896)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !769, file: !770, line: 519, baseType: !631, size: 32, offset: 928)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !769, file: !770, line: 522, baseType: !7, size: 32, offset: 960)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !769, file: !770, line: 523, baseType: !7, size: 32, offset: 992)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !769, file: !770, line: 528, baseType: !948, size: 64, offset: 1024)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !769, file: !770, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
