; ModuleID = 'targhooks.c'
source_filename = "targhooks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!3234 = !DIEnumerator(name: "OPT_msse3", value: 812, isUnsigned: true)
!3235 = !DIEnumerator(name: "OPT_msse4", value: 813, isUnsigned: true)
!3236 = !DIEnumerator(name: "OPT_msse4_1", value: 814, isUnsigned: true)
!3237 = !DIEnumerator(name: "OPT_msse4_2", value: 815, isUnsigned: true)
!3238 = !DIEnumerator(name: "OPT_msse4a", value: 816, isUnsigned: true)
!3239 = !DIEnumerator(name: "OPT_msseregparm", value: 817, isUnsigned: true)
!3240 = !DIEnumerator(name: "OPT_mssse3", value: 818, isUnsigned: true)
!3241 = !DIEnumerator(name: "OPT_mstack_arg_probe", value: 819, isUnsigned: true)
!3242 = !DIEnumerator(name: "OPT_mstackrealign", value: 820, isUnsigned: true)
!3243 = !DIEnumerator(name: "OPT_mstringop_strategy_", value: 821, isUnsigned: true)
!3244 = !DIEnumerator(name: "OPT_mtls_dialect_", value: 822, isUnsigned: true)
!3245 = !DIEnumerator(name: "OPT_mtls_direct_seg_refs", value: 823, isUnsigned: true)
!3246 = !DIEnumerator(name: "OPT_mtune_", value: 824, isUnsigned: true)
!3247 = !DIEnumerator(name: "OPT_muclibc", value: 825, isUnsigned: true)
!3248 = !DIEnumerator(name: "OPT_mveclibabi_", value: 826, isUnsigned: true)
!3249 = !DIEnumerator(name: "OPT_mxop", value: 827, isUnsigned: true)
!3250 = !DIEnumerator(name: "OPT_nocpp", value: 828, isUnsigned: true)
!3251 = !DIEnumerator(name: "OPT_nostdinc", value: 829, isUnsigned: true)
!3252 = !DIEnumerator(name: "OPT_nostdinc__", value: 830, isUnsigned: true)
!3253 = !DIEnumerator(name: "OPT_nostdlib", value: 831, isUnsigned: true)
!3254 = !DIEnumerator(name: "OPT_o", value: 832, isUnsigned: true)
!3255 = !DIEnumerator(name: "OPT_p", value: 833, isUnsigned: true)
!3256 = !DIEnumerator(name: "OPT_pedantic", value: 834, isUnsigned: true)
!3257 = !DIEnumerator(name: "OPT_pedantic_errors", value: 835, isUnsigned: true)
!3258 = !DIEnumerator(name: "OPT_pie", value: 836, isUnsigned: true)
!3259 = !DIEnumerator(name: "OPT_print_objc_runtime_info", value: 837, isUnsigned: true)
!3260 = !DIEnumerator(name: "OPT_print_pch_checksum", value: 838, isUnsigned: true)
!3261 = !DIEnumerator(name: "OPT_quiet", value: 839, isUnsigned: true)
!3262 = !DIEnumerator(name: "OPT_remap", value: 840, isUnsigned: true)
!3263 = !DIEnumerator(name: "OPT_shared", value: 841, isUnsigned: true)
!3264 = !DIEnumerator(name: "OPT_static_libgfortran", value: 842, isUnsigned: true)
!3265 = !DIEnumerator(name: "OPT_std_c__0x", value: 843, isUnsigned: true)
!3266 = !DIEnumerator(name: "OPT_std_c__98", value: 844, isUnsigned: true)
!3267 = !DIEnumerator(name: "OPT_std_c89", value: 845, isUnsigned: true)
!3268 = !DIEnumerator(name: "OPT_std_c90", value: 846, isUnsigned: true)
!3269 = !DIEnumerator(name: "OPT_std_c99", value: 847, isUnsigned: true)
!3270 = !DIEnumerator(name: "OPT_std_c9x", value: 848, isUnsigned: true)
!3271 = !DIEnumerator(name: "OPT_std_f2003", value: 849, isUnsigned: true)
!3272 = !DIEnumerator(name: "OPT_std_f2008", value: 850, isUnsigned: true)
!3273 = !DIEnumerator(name: "OPT_std_f95", value: 851, isUnsigned: true)
!3274 = !DIEnumerator(name: "OPT_std_gnu", value: 852, isUnsigned: true)
!3275 = !DIEnumerator(name: "OPT_std_gnu__0x", value: 853, isUnsigned: true)
!3276 = !DIEnumerator(name: "OPT_std_gnu__98", value: 854, isUnsigned: true)
!3277 = !DIEnumerator(name: "OPT_std_gnu89", value: 855, isUnsigned: true)
!3278 = !DIEnumerator(name: "OPT_std_gnu90", value: 856, isUnsigned: true)
!3279 = !DIEnumerator(name: "OPT_std_gnu99", value: 857, isUnsigned: true)
!3280 = !DIEnumerator(name: "OPT_std_gnu9x", value: 858, isUnsigned: true)
!3281 = !DIEnumerator(name: "OPT_std_iso9899_1990", value: 859, isUnsigned: true)
!3282 = !DIEnumerator(name: "OPT_std_iso9899_199409", value: 860, isUnsigned: true)
!3283 = !DIEnumerator(name: "OPT_std_iso9899_1999", value: 861, isUnsigned: true)
!3284 = !DIEnumerator(name: "OPT_std_iso9899_199x", value: 862, isUnsigned: true)
!3285 = !DIEnumerator(name: "OPT_std_legacy", value: 863, isUnsigned: true)
!3286 = !DIEnumerator(name: "OPT_traditional_cpp", value: 864, isUnsigned: true)
!3287 = !DIEnumerator(name: "OPT_trigraphs", value: 865, isUnsigned: true)
!3288 = !DIEnumerator(name: "OPT_undef", value: 866, isUnsigned: true)
!3289 = !DIEnumerator(name: "OPT_v", value: 867, isUnsigned: true)
!3290 = !DIEnumerator(name: "OPT_version", value: 868, isUnsigned: true)
!3291 = !DIEnumerator(name: "OPT_w", value: 869, isUnsigned: true)
!3292 = !DIEnumerator(name: "N_OPTS", value: 870, isUnsigned: true)
!3293 = !{!366, !509, !5, !172, !3294, !3295, !3296, !3737, !3424, !3472}
!3294 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!3295 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!3296 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !3297, line: 56, baseType: !3298)
!3297 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3299, size: 64)
!3299 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !3300)
!3300 = !{!3301, !3334, !3340, !3352, !3371, !3382, !3387, !3397, !3403, !3417, !3429, !3467, !3621, !3649, !3657, !3658, !3663, !3672, !3678, !3683, !3687, !3691, !3844, !3891, !3897, !3904, !3911, !3937, !3962, !3979, !3991, !4013, !4029, !4200}
!3301 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3299, file: !140, line: 3372, baseType: !3302, size: 64)
!3302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !3303)
!3303 = !{!3304, !3305, !3306, !3307, !3308, !3309, !3310, !3311, !3312, !3313, !3314, !3315, !3316, !3317, !3318, !3319, !3320, !3321, !3322, !3323, !3324, !3325, !3326, !3327, !3328, !3329, !3330, !3331, !3332, !3333}
!3304 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3302, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3305 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !3302, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3306 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !3302, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!3307 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !3302, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!3308 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !3302, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!3309 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !3302, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!3310 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !3302, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!3311 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !3302, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!3312 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !3302, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!3313 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !3302, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3314 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !3302, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3315 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !3302, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3316 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !3302, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3317 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !3302, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3318 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !3302, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3319 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !3302, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3320 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !3302, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3321 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !3302, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!3322 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3302, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!3323 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3302, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!3324 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3302, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!3325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3302, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!3326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3302, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!3327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3302, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!3328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3302, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!3329 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3302, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!3330 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !3302, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!3331 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !3302, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!3332 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !3302, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!3333 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !3302, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!3334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3299, file: !140, line: 3373, baseType: !3335, size: 192)
!3335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !3336)
!3336 = !{!3337, !3338, !3339}
!3337 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3335, file: !140, line: 403, baseType: !3302, size: 64)
!3338 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !3335, file: !140, line: 404, baseType: !3296, size: 64, offset: 64)
!3339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3335, file: !140, line: 405, baseType: !3296, size: 64, offset: 128)
!3340 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3299, file: !140, line: 3374, baseType: !3341, size: 320)
!3341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !3342)
!3342 = !{!3343, !3344}
!3343 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3341, file: !140, line: 1385, baseType: !3335, size: 192)
!3344 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !3341, file: !140, line: 1386, baseType: !3345, size: 128, offset: 192)
!3345 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !3346, line: 58, baseType: !3347)
!3346 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3346, line: 54, size: 128, elements: !3348)
!3348 = !{!3349, !3350}
!3349 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !3347, file: !3346, line: 56, baseType: !3295, size: 64)
!3350 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !3347, file: !3346, line: 57, baseType: !3351, size: 64, offset: 64)
!3351 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!3352 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !3299, file: !140, line: 3375, baseType: !3353, size: 256)
!3353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !3354)
!3354 = !{!3355, !3356}
!3355 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3353, file: !140, line: 1398, baseType: !3335, size: 192)
!3356 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !3353, file: !140, line: 1399, baseType: !3357, size: 64, offset: 192)
!3357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3358, size: 64)
!3358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !3359, line: 52, size: 256, elements: !3360)
!3359 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3360 = !{!3361, !3362, !3363, !3364, !3365, !3366, !3367}
!3361 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !3358, file: !3359, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!3362 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !3358, file: !3359, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!3363 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !3358, file: !3359, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!3364 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !3358, file: !3359, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!3365 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !3358, file: !3359, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!3366 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !3358, file: !3359, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!3367 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !3358, file: !3359, line: 62, baseType: !3368, size: 192, offset: 64)
!3368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3295, size: 192, elements: !3369)
!3369 = !{!3370}
!3370 = !DISubrange(count: 3)
!3371 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !3299, file: !140, line: 3376, baseType: !3372, size: 256)
!3372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !3373)
!3373 = !{!3374, !3375}
!3374 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3372, file: !140, line: 1409, baseType: !3335, size: 192)
!3375 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !3372, file: !140, line: 1410, baseType: !3376, size: 64, offset: 192)
!3376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3377, size: 64)
!3377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !3378, line: 27, size: 192, elements: !3379)
!3378 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3379 = !{!3380, !3381}
!3380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3377, file: !3378, line: 29, baseType: !3345, size: 128)
!3381 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3377, file: !3378, line: 30, baseType: !5, size: 32, offset: 128)
!3382 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !3299, file: !140, line: 3377, baseType: !3383, size: 256)
!3383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !3384)
!3384 = !{!3385, !3386}
!3385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3383, file: !140, line: 1438, baseType: !3335, size: 192)
!3386 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3383, file: !140, line: 1439, baseType: !3296, size: 64, offset: 192)
!3387 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3299, file: !140, line: 3378, baseType: !3388, size: 256)
!3388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !3389)
!3389 = !{!3390, !3391, !3392}
!3390 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3388, file: !140, line: 1419, baseType: !3335, size: 192)
!3391 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !3388, file: !140, line: 1420, baseType: !3294, size: 32, offset: 192)
!3392 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3388, file: !140, line: 1421, baseType: !3393, size: 8, offset: 224)
!3393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3394, size: 8, elements: !3395)
!3394 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!3395 = !{!3396}
!3396 = !DISubrange(count: 1)
!3397 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !3299, file: !140, line: 3379, baseType: !3398, size: 320)
!3398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !3399)
!3399 = !{!3400, !3401, !3402}
!3400 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3398, file: !140, line: 1429, baseType: !3335, size: 192)
!3401 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !3398, file: !140, line: 1430, baseType: !3296, size: 64, offset: 192)
!3402 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !3398, file: !140, line: 1431, baseType: !3296, size: 64, offset: 256)
!3403 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !3299, file: !140, line: 3380, baseType: !3404, size: 320)
!3404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !3405)
!3405 = !{!3406, !3407}
!3406 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3404, file: !140, line: 1461, baseType: !3335, size: 192)
!3407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !3404, file: !140, line: 1462, baseType: !3408, size: 128, offset: 192)
!3408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !3409, line: 31, size: 128, elements: !3410)
!3409 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3410 = !{!3411, !3415, !3416}
!3411 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3408, file: !3409, line: 32, baseType: !3412, size: 64)
!3412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3413, size: 64)
!3413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3414)
!3414 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!3415 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !3408, file: !3409, line: 33, baseType: !7, size: 32, offset: 64)
!3416 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !3408, file: !3409, line: 34, baseType: !7, size: 32, offset: 96)
!3417 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !3299, file: !140, line: 3381, baseType: !3418, size: 384)
!3418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !3419)
!3419 = !{!3420, !3421, !3426, !3427, !3428}
!3420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3418, file: !140, line: 2508, baseType: !3335, size: 192)
!3421 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3418, file: !140, line: 2509, baseType: !3422, size: 32, offset: 192)
!3422 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !3423, line: 58, baseType: !3424)
!3423 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3424 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !3425, line: 44, baseType: !7)
!3425 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3426 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3418, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!3427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3418, file: !140, line: 2511, baseType: !3296, size: 64, offset: 256)
!3428 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !3418, file: !140, line: 2512, baseType: !3296, size: 64, offset: 320)
!3429 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !3299, file: !140, line: 3382, baseType: !3430, size: 896)
!3430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !3431)
!3431 = !{!3432, !3433, !3434, !3435, !3436, !3437, !3438, !3439, !3440, !3441, !3442, !3443, !3444, !3445, !3446, !3447, !3448, !3449, !3450, !3451, !3452, !3453, !3454, !3455, !3456, !3457, !3458, !3459, !3460, !3461, !3462, !3463, !3464}
!3432 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3430, file: !140, line: 2653, baseType: !3418, size: 384)
!3433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3430, file: !140, line: 2654, baseType: !3296, size: 64, offset: 384)
!3434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3430, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!3435 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !3430, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!3436 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !3430, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!3437 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !3430, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!3438 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3430, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!3439 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !3430, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!3440 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !3430, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!3441 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !3430, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!3442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3430, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!3443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3430, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!3444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3430, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!3445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3430, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!3446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3430, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!3447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3430, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!3448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3430, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!3449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !3430, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!3450 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !3430, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!3451 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !3430, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!3452 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !3430, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!3453 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !3430, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!3454 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !3430, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!3455 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !3430, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!3456 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !3430, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!3457 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !3430, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!3458 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !3430, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!3459 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3430, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!3460 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3430, file: !140, line: 2705, baseType: !3296, size: 64, offset: 576)
!3461 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3430, file: !140, line: 2706, baseType: !3296, size: 64, offset: 640)
!3462 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3430, file: !140, line: 2707, baseType: !3296, size: 64, offset: 704)
!3463 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3430, file: !140, line: 2708, baseType: !3296, size: 64, offset: 768)
!3464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3430, file: !140, line: 2711, baseType: !3465, size: 64, offset: 832)
!3465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3466, size: 64)
!3466 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!3467 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !3299, file: !140, line: 3383, baseType: !3468, size: 960)
!3468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !3469)
!3469 = !{!3470, !3471}
!3470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3468, file: !140, line: 2757, baseType: !3430, size: 896)
!3471 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3468, file: !140, line: 2758, baseType: !3472, size: 64, offset: 896)
!3472 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !3297, line: 50, baseType: !3473)
!3473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3474, size: 64)
!3474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !367, line: 240, size: 384, elements: !3475)
!3475 = !{!3476, !3477, !3478, !3479, !3480, !3481, !3482, !3483, !3484, !3485, !3486}
!3476 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3474, file: !367, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3477 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3474, file: !367, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3478 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !3474, file: !367, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3479 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !3474, file: !367, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3480 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !3474, file: !367, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3481 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !3474, file: !367, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3482 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !3474, file: !367, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3483 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3474, file: !367, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !3474, file: !367, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3485 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !3474, file: !367, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3486 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3474, file: !367, line: 321, baseType: !3487, size: 320, offset: 64)
!3487 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !367, line: 315, size: 320, elements: !3488)
!3488 = !{!3489, !3554, !3556, !3619, !3620}
!3489 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3487, file: !367, line: 316, baseType: !3490, size: 64)
!3490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3491, size: 64, elements: !3395)
!3491 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !367, line: 183, baseType: !3492)
!3492 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !367, line: 166, size: 64, elements: !3493)
!3493 = !{!3494, !3495, !3496, !3499, !3500, !3508, !3509, !3521, !3524, !3527, !3528, !3531, !3544, !3551}
!3494 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !3492, file: !367, line: 168, baseType: !3294, size: 32)
!3495 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !3492, file: !367, line: 169, baseType: !7, size: 32)
!3496 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !3492, file: !367, line: 170, baseType: !3497, size: 64)
!3497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3498, size: 64)
!3498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3394)
!3499 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !3492, file: !367, line: 171, baseType: !3472, size: 64)
!3500 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !3492, file: !367, line: 172, baseType: !3501, size: 64)
!3501 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !3297, line: 53, baseType: !3502)
!3502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3503, size: 64)
!3503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !367, line: 359, size: 128, elements: !3504)
!3504 = !{!3505, !3506}
!3505 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !3503, file: !367, line: 360, baseType: !3294, size: 32)
!3506 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !3503, file: !367, line: 361, baseType: !3507, size: 64, offset: 64)
!3507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3472, size: 64, elements: !3395)
!3508 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !3492, file: !367, line: 173, baseType: !5, size: 32)
!3509 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !3492, file: !367, line: 174, baseType: !3510, size: 32)
!3510 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !367, line: 133, baseType: !3511)
!3511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 115, size: 32, elements: !3512)
!3512 = !{!3513, !3514, !3515, !3516, !3517, !3518, !3519, !3520}
!3513 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !3511, file: !367, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3514 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !3511, file: !367, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3515 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !3511, file: !367, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3516 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !3511, file: !367, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3517 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !3511, file: !367, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3518 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !3511, file: !367, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!3519 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !3511, file: !367, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3520 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !3511, file: !367, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3521 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !3492, file: !367, line: 175, baseType: !3522, size: 64)
!3522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3523, size: 64)
!3523 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !367, line: 175, flags: DIFlagFwdDecl)
!3524 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !3492, file: !367, line: 176, baseType: !3525, size: 64)
!3525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3526, size: 64)
!3526 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !3297, line: 46, flags: DIFlagFwdDecl)
!3527 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !3492, file: !367, line: 177, baseType: !3296, size: 64)
!3528 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !3492, file: !367, line: 178, baseType: !3529, size: 64)
!3529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3530, size: 64)
!3530 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !3297, line: 110, flags: DIFlagFwdDecl)
!3531 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !3492, file: !367, line: 179, baseType: !3532, size: 64)
!3532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3533, size: 64)
!3533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !367, line: 150, baseType: !3534)
!3534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !367, line: 142, size: 320, elements: !3535)
!3535 = !{!3536, !3537, !3538, !3539, !3542, !3543}
!3536 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !3534, file: !367, line: 144, baseType: !3296, size: 64)
!3537 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3534, file: !367, line: 145, baseType: !3472, size: 64, offset: 64)
!3538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3534, file: !367, line: 146, baseType: !3472, size: 64, offset: 128)
!3539 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !3534, file: !367, line: 147, baseType: !3540, size: 32, offset: 192)
!3540 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !3541, line: 31, baseType: !3294)
!3541 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3542 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3534, file: !367, line: 148, baseType: !7, size: 32, offset: 224)
!3543 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !3534, file: !367, line: 149, baseType: !3414, size: 8, offset: 256)
!3544 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !3492, file: !367, line: 180, baseType: !3545, size: 64)
!3545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3546, size: 64)
!3546 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !367, line: 162, baseType: !3547)
!3547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !367, line: 159, size: 128, elements: !3548)
!3548 = !{!3549, !3550}
!3549 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3547, file: !367, line: 160, baseType: !3296, size: 64)
!3550 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3547, file: !367, line: 161, baseType: !3351, size: 64, offset: 64)
!3551 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !3492, file: !367, line: 181, baseType: !3552, size: 64)
!3552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3553, size: 64)
!3553 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !367, line: 181, flags: DIFlagFwdDecl)
!3554 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !3487, file: !367, line: 317, baseType: !3555, size: 64)
!3555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3351, size: 64, elements: !3395)
!3556 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !3487, file: !367, line: 318, baseType: !3557, size: 320)
!3557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !367, line: 188, size: 320, elements: !3558)
!3558 = !{!3559, !3561, !3618}
!3559 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3557, file: !367, line: 190, baseType: !3560, size: 192)
!3560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3491, size: 192, elements: !3369)
!3561 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3557, file: !367, line: 193, baseType: !3562, size: 64, offset: 192)
!3562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3563, size: 64)
!3563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !367, line: 206, size: 320, elements: !3564)
!3564 = !{!3565, !3603, !3604, !3605, !3617}
!3565 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !3563, file: !367, line: 208, baseType: !3566, size: 64)
!3566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3567, size: 64)
!3567 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !3297, line: 62, baseType: !3568)
!3568 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !3569, line: 538, size: 256, elements: !3570)
!3569 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3570 = !{!3571, !3575, !3581, !3594}
!3571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3568, file: !3569, line: 539, baseType: !3572, size: 32)
!3572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !3569, line: 482, size: 32, elements: !3573)
!3573 = !{!3574}
!3574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3572, file: !3569, line: 484, baseType: !7, size: 32)
!3575 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !3568, file: !3569, line: 540, baseType: !3576, size: 192)
!3576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !3569, line: 488, size: 192, elements: !3577)
!3577 = !{!3578, !3579, !3580}
!3578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3576, file: !3569, line: 489, baseType: !3572, size: 32)
!3579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3576, file: !3569, line: 492, baseType: !3497, size: 64, offset: 64)
!3580 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3576, file: !3569, line: 496, baseType: !3296, size: 64, offset: 128)
!3581 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !3568, file: !3569, line: 541, baseType: !3582, size: 256)
!3582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !3569, line: 504, size: 256, elements: !3583)
!3583 = !{!3584, !3585, !3592, !3593}
!3584 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3582, file: !3569, line: 505, baseType: !3572, size: 32)
!3585 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3582, file: !3569, line: 509, baseType: !3586, size: 64, offset: 64)
!3586 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !3569, line: 501, baseType: !3587)
!3587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3588, size: 64)
!3588 = !DISubroutineType(types: !3589)
!3589 = !{null, !3590}
!3590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3591, size: 64)
!3591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!3592 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3582, file: !3569, line: 510, baseType: !3590, size: 64, offset: 128)
!3593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3582, file: !3569, line: 513, baseType: !3566, size: 64, offset: 192)
!3594 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !3568, file: !3569, line: 542, baseType: !3595, size: 128)
!3595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !3569, line: 530, size: 128, elements: !3596)
!3596 = !{!3597, !3598}
!3597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3595, file: !3569, line: 531, baseType: !3572, size: 32)
!3598 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !3595, file: !3569, line: 534, baseType: !3599, size: 64, offset: 64)
!3599 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !3569, line: 525, baseType: !3600)
!3600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3601, size: 64)
!3601 = !DISubroutineType(types: !3602)
!3602 = !{!3414, !3296, !3497, !3295, !3295}
!3603 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !3563, file: !367, line: 211, baseType: !7, size: 32, offset: 64)
!3604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3563, file: !367, line: 214, baseType: !3351, size: 64, offset: 128)
!3605 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !3563, file: !367, line: 224, baseType: !3606, size: 64, offset: 192)
!3606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3607, size: 64)
!3607 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !367, line: 202, baseType: !3608)
!3608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !367, line: 202, size: 128, elements: !3609)
!3609 = !{!3610}
!3610 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3608, file: !367, line: 202, baseType: !3611, size: 128)
!3611 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !367, line: 200, baseType: !3612)
!3612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !367, line: 200, size: 128, elements: !3613)
!3613 = !{!3614, !3615, !3616}
!3614 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3612, file: !367, line: 200, baseType: !7, size: 32)
!3615 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3612, file: !367, line: 200, baseType: !7, size: 32, offset: 32)
!3616 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3612, file: !367, line: 200, baseType: !3507, size: 64, offset: 64)
!3617 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !3563, file: !367, line: 234, baseType: !3606, size: 64, offset: 256)
!3618 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3557, file: !367, line: 197, baseType: !3351, size: 64, offset: 256)
!3619 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !3487, file: !367, line: 319, baseType: !3358, size: 256)
!3620 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !3487, file: !367, line: 320, baseType: !3377, size: 192)
!3621 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !3299, file: !140, line: 3384, baseType: !3622, size: 1472)
!3622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !3623)
!3623 = !{!3624, !3645, !3646, !3647, !3648}
!3624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3622, file: !140, line: 3115, baseType: !3625, size: 1216)
!3625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !3626)
!3626 = !{!3627, !3628, !3629, !3630, !3631, !3632, !3633, !3634, !3635, !3636, !3637, !3638, !3639, !3640, !3641, !3642, !3643, !3644}
!3627 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3625, file: !140, line: 2985, baseType: !3468, size: 960)
!3628 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !3625, file: !140, line: 2986, baseType: !3296, size: 64, offset: 960)
!3629 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !3625, file: !140, line: 2987, baseType: !3296, size: 64, offset: 1024)
!3630 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !3625, file: !140, line: 2988, baseType: !3296, size: 64, offset: 1088)
!3631 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !3625, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!3632 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !3625, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!3633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !3625, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!3634 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !3625, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!3635 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !3625, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!3636 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !3625, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!3637 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !3625, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!3638 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !3625, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!3639 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !3625, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!3640 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !3625, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!3641 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !3625, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!3642 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !3625, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!3643 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !3625, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!3644 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !3625, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!3645 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !3622, file: !140, line: 3117, baseType: !3296, size: 64, offset: 1216)
!3646 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !3622, file: !140, line: 3119, baseType: !3296, size: 64, offset: 1280)
!3647 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3622, file: !140, line: 3121, baseType: !3296, size: 64, offset: 1344)
!3648 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !3622, file: !140, line: 3123, baseType: !3296, size: 64, offset: 1408)
!3649 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !3299, file: !140, line: 3385, baseType: !3650, size: 1088)
!3650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !3651)
!3651 = !{!3652, !3653, !3654}
!3652 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3650, file: !140, line: 2875, baseType: !3468, size: 960)
!3653 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !3650, file: !140, line: 2876, baseType: !3472, size: 64, offset: 960)
!3654 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3650, file: !140, line: 2877, baseType: !3655, size: 64, offset: 1024)
!3655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3656, size: 64)
!3656 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!3657 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !3299, file: !140, line: 3386, baseType: !3625, size: 1216)
!3658 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !3299, file: !140, line: 3387, baseType: !3659, size: 1280)
!3659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !3660)
!3660 = !{!3661, !3662}
!3661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3659, file: !140, line: 3094, baseType: !3625, size: 1216)
!3662 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3659, file: !140, line: 3095, baseType: !3655, size: 64, offset: 1216)
!3663 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !3299, file: !140, line: 3388, baseType: !3664, size: 1216)
!3664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !3665)
!3665 = !{!3666, !3667, !3668, !3669, !3670, !3671}
!3666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3664, file: !140, line: 2825, baseType: !3430, size: 896)
!3667 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3664, file: !140, line: 2827, baseType: !3296, size: 64, offset: 896)
!3668 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !3664, file: !140, line: 2828, baseType: !3296, size: 64, offset: 960)
!3669 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !3664, file: !140, line: 2829, baseType: !3296, size: 64, offset: 1024)
!3670 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !3664, file: !140, line: 2830, baseType: !3296, size: 64, offset: 1088)
!3671 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !3664, file: !140, line: 2831, baseType: !3296, size: 64, offset: 1152)
!3672 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !3299, file: !140, line: 3389, baseType: !3673, size: 1024)
!3673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !3674)
!3674 = !{!3675, !3676, !3677}
!3675 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3673, file: !140, line: 2851, baseType: !3468, size: 960)
!3676 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !3673, file: !140, line: 2852, baseType: !3294, size: 32, offset: 960)
!3677 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !3673, file: !140, line: 2853, baseType: !3294, size: 32, offset: 992)
!3678 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !3299, file: !140, line: 3390, baseType: !3679, size: 1024)
!3679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !3680)
!3680 = !{!3681, !3682}
!3681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3679, file: !140, line: 2858, baseType: !3468, size: 960)
!3682 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3679, file: !140, line: 2859, baseType: !3655, size: 64, offset: 960)
!3683 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !3299, file: !140, line: 3391, baseType: !3684, size: 960)
!3684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !3685)
!3685 = !{!3686}
!3686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3684, file: !140, line: 2863, baseType: !3468, size: 960)
!3687 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !3299, file: !140, line: 3392, baseType: !3688, size: 1472)
!3688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !3689)
!3689 = !{!3690}
!3690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3688, file: !140, line: 3305, baseType: !3622, size: 1472)
!3691 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !3299, file: !140, line: 3393, baseType: !3692, size: 1792)
!3692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !3693)
!3693 = !{!3694, !3695, !3823, !3824, !3825, !3826, !3827, !3828, !3829, !3830, !3831, !3832, !3833, !3834, !3835, !3836, !3837, !3838, !3839, !3840, !3841, !3842, !3843}
!3694 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3692, file: !140, line: 3249, baseType: !3622, size: 1472)
!3695 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !3692, file: !140, line: 3251, baseType: !3696, size: 64, offset: 1472)
!3696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3697, size: 64)
!3697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !3698, line: 463, size: 1152, elements: !3699)
!3698 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3699 = !{!3700, !3703, !3706, !3709, !3712, !3715, !3766, !3767, !3768, !3769, !3770, !3796, !3799, !3800, !3801, !3802, !3803, !3804, !3805, !3806, !3807, !3808, !3809, !3810, !3811, !3812, !3813, !3814, !3815, !3816, !3817, !3818, !3819, !3820, !3821, !3822}
!3700 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !3697, file: !3698, line: 464, baseType: !3701, size: 64)
!3701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3702, size: 64)
!3702 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !3698, line: 464, flags: DIFlagFwdDecl)
!3703 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !3697, file: !3698, line: 467, baseType: !3704, size: 64, offset: 64)
!3704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3705, size: 64)
!3705 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !3698, line: 467, flags: DIFlagFwdDecl)
!3706 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !3697, file: !3698, line: 470, baseType: !3707, size: 64, offset: 128)
!3707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3708, size: 64)
!3708 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !3297, line: 65, flags: DIFlagFwdDecl)
!3709 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !3697, file: !3698, line: 473, baseType: !3710, size: 64, offset: 192)
!3710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3711, size: 64)
!3711 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !3698, line: 166, flags: DIFlagFwdDecl)
!3712 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !3697, file: !3698, line: 476, baseType: !3713, size: 64, offset: 256)
!3713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3714, size: 64)
!3714 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !3698, line: 476, flags: DIFlagFwdDecl)
!3715 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !3697, file: !3698, line: 479, baseType: !3716, size: 64, offset: 320)
!3716 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !3717, line: 144, baseType: !3718)
!3717 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!3718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3719, size: 64)
!3719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !3717, line: 100, size: 896, elements: !3720)
!3720 = !{!3721, !3727, !3732, !3738, !3740, !3743, !3744, !3745, !3746, !3747, !3752, !3754, !3755, !3760, !3765}
!3721 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !3719, file: !3717, line: 102, baseType: !3722, size: 64)
!3722 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !3717, line: 52, baseType: !3723)
!3723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3724, size: 64)
!3724 = !DISubroutineType(types: !3725)
!3725 = !{!3726, !3590}
!3726 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !3717, line: 47, baseType: !7)
!3727 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !3719, file: !3717, line: 105, baseType: !3728, size: 64, offset: 64)
!3728 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !3717, line: 59, baseType: !3729)
!3729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3730, size: 64)
!3730 = !DISubroutineType(types: !3731)
!3731 = !{!3294, !3590, !3590}
!3732 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !3719, file: !3717, line: 108, baseType: !3733, size: 64, offset: 128)
!3733 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !3717, line: 63, baseType: !3734)
!3734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3735, size: 64)
!3735 = !DISubroutineType(types: !3736)
!3736 = !{null, !3737}
!3737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!3738 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !3719, file: !3717, line: 111, baseType: !3739, size: 64, offset: 192)
!3739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3737, size: 64)
!3740 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3719, file: !3717, line: 114, baseType: !3741, size: 64, offset: 256)
!3741 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !3742, line: 46, baseType: !3295)
!3742 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!3743 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !3719, file: !3717, line: 117, baseType: !3741, size: 64, offset: 320)
!3744 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !3719, file: !3717, line: 120, baseType: !3741, size: 64, offset: 384)
!3745 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !3719, file: !3717, line: 124, baseType: !7, size: 32, offset: 448)
!3746 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !3719, file: !3717, line: 128, baseType: !7, size: 32, offset: 480)
!3747 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !3719, file: !3717, line: 131, baseType: !3748, size: 64, offset: 512)
!3748 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !3717, line: 75, baseType: !3749)
!3749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3750, size: 64)
!3750 = !DISubroutineType(types: !3751)
!3751 = !{!3737, !3741, !3741}
!3752 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !3719, file: !3717, line: 132, baseType: !3753, size: 64, offset: 576)
!3753 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !3717, line: 78, baseType: !3734)
!3754 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !3719, file: !3717, line: 135, baseType: !3737, size: 64, offset: 640)
!3755 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !3719, file: !3717, line: 136, baseType: !3756, size: 64, offset: 704)
!3756 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !3717, line: 82, baseType: !3757)
!3757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3758, size: 64)
!3758 = !DISubroutineType(types: !3759)
!3759 = !{!3737, !3737, !3741, !3741}
!3760 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !3719, file: !3717, line: 137, baseType: !3761, size: 64, offset: 768)
!3761 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !3717, line: 83, baseType: !3762)
!3762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3763, size: 64)
!3763 = !DISubroutineType(types: !3764)
!3764 = !{null, !3737, !3737}
!3765 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !3719, file: !3717, line: 141, baseType: !7, size: 32, offset: 832)
!3766 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3697, file: !3698, line: 484, baseType: !3296, size: 64, offset: 384)
!3767 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !3697, file: !3698, line: 488, baseType: !3296, size: 64, offset: 448)
!3768 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !3697, file: !3698, line: 493, baseType: !3296, size: 64, offset: 512)
!3769 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !3697, file: !3698, line: 496, baseType: !3296, size: 64, offset: 576)
!3770 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !3697, file: !3698, line: 501, baseType: !3771, size: 64, offset: 640)
!3771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3772, size: 64)
!3772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !3773)
!3773 = !{!3774, !3777, !3778, !3779, !3780, !3784, !3785, !3790, !3791, !3792, !3793, !3794, !3795}
!3774 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !3772, file: !135, line: 2356, baseType: !3775, size: 64)
!3775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3776, size: 64)
!3776 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!3777 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !3772, file: !135, line: 2357, baseType: !3497, size: 64, offset: 64)
!3778 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !3772, file: !135, line: 2358, baseType: !3294, size: 32, offset: 128)
!3779 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !3772, file: !135, line: 2359, baseType: !3294, size: 32, offset: 160)
!3780 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !3772, file: !135, line: 2360, baseType: !3781, size: 128, offset: 192)
!3781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3294, size: 128, elements: !3782)
!3782 = !{!3783}
!3783 = !DISubrange(count: 4)
!3784 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !3772, file: !135, line: 2364, baseType: !3294, size: 32, offset: 320)
!3785 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !3772, file: !135, line: 2367, baseType: !3786, size: 128, offset: 384)
!3786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !3787)
!3787 = !{!3788, !3789}
!3788 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !3786, file: !135, line: 2351, baseType: !3472, size: 64)
!3789 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3786, file: !135, line: 2352, baseType: !3351, size: 64, offset: 64)
!3790 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !3772, file: !135, line: 2371, baseType: !134, size: 32, offset: 512)
!3791 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !3772, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!3792 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !3772, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!3793 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !3772, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!3794 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !3772, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!3795 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !3772, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!3796 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !3697, file: !3698, line: 504, baseType: !3797, size: 64, offset: 704)
!3797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3798, size: 64)
!3798 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !3698, line: 504, flags: DIFlagFwdDecl)
!3799 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !3697, file: !3698, line: 507, baseType: !3716, size: 64, offset: 768)
!3800 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !3697, file: !3698, line: 510, baseType: !3294, size: 32, offset: 832)
!3801 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !3697, file: !3698, line: 513, baseType: !3294, size: 32, offset: 864)
!3802 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !3697, file: !3698, line: 516, baseType: !3422, size: 32, offset: 896)
!3803 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !3697, file: !3698, line: 519, baseType: !3422, size: 32, offset: 928)
!3804 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !3697, file: !3698, line: 522, baseType: !7, size: 32, offset: 960)
!3805 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !3697, file: !3698, line: 523, baseType: !7, size: 32, offset: 992)
!3806 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !3697, file: !3698, line: 528, baseType: !3497, size: 64, offset: 1024)
!3807 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !3697, file: !3698, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!3808 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !3697, file: !3698, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!3809 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !3697, file: !3698, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!3810 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !3697, file: !3698, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!3811 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !3697, file: !3698, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!3812 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !3697, file: !3698, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!3813 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !3697, file: !3698, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!3814 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !3697, file: !3698, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!3815 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !3697, file: !3698, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!3816 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !3697, file: !3698, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!3817 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !3697, file: !3698, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!3818 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !3697, file: !3698, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!3819 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !3697, file: !3698, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!3820 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !3697, file: !3698, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!3821 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !3697, file: !3698, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!3822 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !3697, file: !3698, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!3823 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !3692, file: !140, line: 3254, baseType: !3296, size: 64, offset: 1536)
!3824 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !3692, file: !140, line: 3257, baseType: !3296, size: 64, offset: 1600)
!3825 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !3692, file: !140, line: 3258, baseType: !3296, size: 64, offset: 1664)
!3826 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !3692, file: !140, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!3827 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !3692, file: !140, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!3828 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !3692, file: !140, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!3829 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !3692, file: !140, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!3830 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !3692, file: !140, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!3831 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !3692, file: !140, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!3832 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !3692, file: !140, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!3833 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !3692, file: !140, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!3834 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !3692, file: !140, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!3835 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !3692, file: !140, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!3836 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !3692, file: !140, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!3837 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !3692, file: !140, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!3838 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !3692, file: !140, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!3839 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !3692, file: !140, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!3840 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !3692, file: !140, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!3841 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !3692, file: !140, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!3842 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !3692, file: !140, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!3843 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !3692, file: !140, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!3844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3299, file: !140, line: 3394, baseType: !3845, size: 1344)
!3845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !140, line: 2279, size: 1344, elements: !3846)
!3846 = !{!3847, !3848, !3849, !3850, !3851, !3852, !3853, !3854, !3855, !3856, !3857, !3858, !3859, !3860, !3861, !3862, !3863, !3864, !3865, !3866, !3867, !3868, !3869, !3870, !3871, !3872, !3880, !3881, !3882, !3883, !3884, !3885, !3886, !3887, !3888}
!3847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3845, file: !140, line: 2280, baseType: !3335, size: 192)
!3848 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !3845, file: !140, line: 2281, baseType: !3296, size: 64, offset: 192)
!3849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3845, file: !140, line: 2282, baseType: !3296, size: 64, offset: 256)
!3850 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3845, file: !140, line: 2283, baseType: !3296, size: 64, offset: 320)
!3851 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3845, file: !140, line: 2284, baseType: !3296, size: 64, offset: 384)
!3852 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3845, file: !140, line: 2285, baseType: !7, size: 32, offset: 448)
!3853 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !3845, file: !140, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!3854 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !3845, file: !140, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!3855 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !3845, file: !140, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!3856 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !3845, file: !140, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!3857 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !3845, file: !140, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!3858 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !3845, file: !140, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!3859 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3845, file: !140, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!3860 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !3845, file: !140, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!3861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3845, file: !140, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!3862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3845, file: !140, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!3863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3845, file: !140, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!3864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3845, file: !140, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!3865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3845, file: !140, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!3866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3845, file: !140, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!3867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3845, file: !140, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!3868 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3845, file: !140, line: 2305, baseType: !7, size: 32, offset: 512)
!3869 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !3845, file: !140, line: 2306, baseType: !3540, size: 32, offset: 544)
!3870 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !3845, file: !140, line: 2307, baseType: !3296, size: 64, offset: 576)
!3871 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !3845, file: !140, line: 2308, baseType: !3296, size: 64, offset: 640)
!3872 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !3845, file: !140, line: 2314, baseType: !3873, size: 64, offset: 704)
!3873 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !140, line: 2309, size: 64, elements: !3874)
!3874 = !{!3875, !3876, !3877}
!3875 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !3873, file: !140, line: 2310, baseType: !3294, size: 32)
!3876 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !3873, file: !140, line: 2311, baseType: !3497, size: 64)
!3877 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !3873, file: !140, line: 2312, baseType: !3878, size: 64)
!3878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3879, size: 64)
!3879 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !140, line: 2277, flags: DIFlagFwdDecl)
!3880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3845, file: !140, line: 2315, baseType: !3296, size: 64, offset: 768)
!3881 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !3845, file: !140, line: 2316, baseType: !3296, size: 64, offset: 832)
!3882 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !3845, file: !140, line: 2317, baseType: !3296, size: 64, offset: 896)
!3883 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !3845, file: !140, line: 2318, baseType: !3296, size: 64, offset: 960)
!3884 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !3845, file: !140, line: 2319, baseType: !3296, size: 64, offset: 1024)
!3885 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !3845, file: !140, line: 2320, baseType: !3296, size: 64, offset: 1088)
!3886 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !3845, file: !140, line: 2321, baseType: !3296, size: 64, offset: 1152)
!3887 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !3845, file: !140, line: 2322, baseType: !3296, size: 64, offset: 1216)
!3888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3845, file: !140, line: 2324, baseType: !3889, size: 64, offset: 1280)
!3889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3890, size: 64)
!3890 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !140, line: 2324, flags: DIFlagFwdDecl)
!3891 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !3299, file: !140, line: 3395, baseType: !3892, size: 320)
!3892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !140, line: 1469, size: 320, elements: !3893)
!3893 = !{!3894, !3895, !3896}
!3894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3892, file: !140, line: 1470, baseType: !3335, size: 192)
!3895 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !3892, file: !140, line: 1471, baseType: !3296, size: 64, offset: 192)
!3896 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !3892, file: !140, line: 1472, baseType: !3296, size: 64, offset: 256)
!3897 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3299, file: !140, line: 3396, baseType: !3898, size: 320)
!3898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !140, line: 1482, size: 320, elements: !3899)
!3899 = !{!3900, !3901, !3902}
!3900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3898, file: !140, line: 1483, baseType: !3335, size: 192)
!3901 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !3898, file: !140, line: 1484, baseType: !3294, size: 32, offset: 192)
!3902 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !3898, file: !140, line: 1485, baseType: !3903, size: 64, offset: 256)
!3903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3296, size: 64, elements: !3395)
!3904 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !3299, file: !140, line: 3397, baseType: !3905, size: 384)
!3905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !140, line: 1829, size: 384, elements: !3906)
!3906 = !{!3907, !3908, !3909, !3910}
!3907 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3905, file: !140, line: 1830, baseType: !3335, size: 192)
!3908 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3905, file: !140, line: 1831, baseType: !3422, size: 32, offset: 192)
!3909 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3905, file: !140, line: 1832, baseType: !3296, size: 64, offset: 256)
!3910 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !3905, file: !140, line: 1835, baseType: !3903, size: 64, offset: 320)
!3911 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3299, file: !140, line: 3398, baseType: !3912, size: 704)
!3912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !140, line: 1898, size: 704, elements: !3913)
!3913 = !{!3914, !3915, !3916, !3920, !3921, !3924}
!3914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3912, file: !140, line: 1899, baseType: !3335, size: 192)
!3915 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !3912, file: !140, line: 1902, baseType: !3296, size: 64, offset: 192)
!3916 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !3912, file: !140, line: 1905, baseType: !3917, size: 64, offset: 256)
!3917 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !3297, line: 58, baseType: !3918)
!3918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3919, size: 64)
!3919 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !3297, line: 57, flags: DIFlagFwdDecl)
!3920 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !3912, file: !140, line: 1908, baseType: !7, size: 32, offset: 320)
!3921 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !3912, file: !140, line: 1911, baseType: !3922, size: 64, offset: 384)
!3922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3923, size: 64)
!3923 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !140, line: 1876, flags: DIFlagFwdDecl)
!3924 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !3912, file: !140, line: 1914, baseType: !3925, size: 256, offset: 448)
!3925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !3926)
!3926 = !{!3927, !3929, !3930, !3935}
!3927 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3925, file: !140, line: 1884, baseType: !3928, size: 64)
!3928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3925, size: 64)
!3929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3925, file: !140, line: 1885, baseType: !3928, size: 64, offset: 64)
!3930 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !3925, file: !140, line: 1891, baseType: !3931, size: 64, offset: 128)
!3931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3925, file: !140, line: 1891, size: 64, elements: !3932)
!3932 = !{!3933, !3934}
!3933 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3931, file: !140, line: 1891, baseType: !3917, size: 64)
!3934 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3931, file: !140, line: 1891, baseType: !3296, size: 64)
!3935 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !3925, file: !140, line: 1892, baseType: !3936, size: 64, offset: 192)
!3936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3296, size: 64)
!3937 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3299, file: !140, line: 3399, baseType: !3938, size: 704)
!3938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !140, line: 2008, size: 704, elements: !3939)
!3939 = !{!3940, !3941, !3942, !3943, !3944, !3945, !3957, !3958, !3959, !3960, !3961}
!3940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3938, file: !140, line: 2009, baseType: !3335, size: 192)
!3941 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3938, file: !140, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!3942 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !3938, file: !140, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!3943 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3938, file: !140, line: 2014, baseType: !3422, size: 32, offset: 224)
!3944 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !3938, file: !140, line: 2016, baseType: !3296, size: 64, offset: 256)
!3945 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !3938, file: !140, line: 2017, baseType: !3946, size: 64, offset: 320)
!3946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3947, size: 64)
!3947 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !3948)
!3948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !3949)
!3949 = !{!3950}
!3950 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3948, file: !140, line: 183, baseType: !3951, size: 128)
!3951 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !3952)
!3952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !3953)
!3953 = !{!3954, !3955, !3956}
!3954 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3952, file: !140, line: 182, baseType: !7, size: 32)
!3955 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3952, file: !140, line: 182, baseType: !7, size: 32, offset: 32)
!3956 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3952, file: !140, line: 182, baseType: !3903, size: 64, offset: 64)
!3957 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !3938, file: !140, line: 2019, baseType: !3296, size: 64, offset: 384)
!3958 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !3938, file: !140, line: 2020, baseType: !3296, size: 64, offset: 448)
!3959 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3938, file: !140, line: 2021, baseType: !3296, size: 64, offset: 512)
!3960 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !3938, file: !140, line: 2022, baseType: !3296, size: 64, offset: 576)
!3961 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !3938, file: !140, line: 2023, baseType: !3296, size: 64, offset: 640)
!3962 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !3299, file: !140, line: 3400, baseType: !3963, size: 832)
!3963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !140, line: 2430, size: 832, elements: !3964)
!3964 = !{!3965, !3966, !3967, !3968, !3969, !3970, !3971, !3972, !3973, !3974}
!3965 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3963, file: !140, line: 2431, baseType: !3335, size: 192)
!3966 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3963, file: !140, line: 2433, baseType: !3296, size: 64, offset: 192)
!3967 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !3963, file: !140, line: 2434, baseType: !3296, size: 64, offset: 256)
!3968 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !3963, file: !140, line: 2435, baseType: !3296, size: 64, offset: 320)
!3969 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !3963, file: !140, line: 2436, baseType: !3296, size: 64, offset: 384)
!3970 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !3963, file: !140, line: 2437, baseType: !3946, size: 64, offset: 448)
!3971 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !3963, file: !140, line: 2438, baseType: !3296, size: 64, offset: 512)
!3972 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !3963, file: !140, line: 2440, baseType: !3296, size: 64, offset: 576)
!3973 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !3963, file: !140, line: 2441, baseType: !3296, size: 64, offset: 640)
!3974 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !3963, file: !140, line: 2443, baseType: !3975, size: 128, offset: 704)
!3975 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !140, line: 182, baseType: !3976)
!3976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !140, line: 182, size: 128, elements: !3977)
!3977 = !{!3978}
!3978 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3976, file: !140, line: 182, baseType: !3951, size: 128)
!3979 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !3299, file: !140, line: 3401, baseType: !3980, size: 320)
!3980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !140, line: 3327, size: 320, elements: !3981)
!3981 = !{!3982, !3983, !3990}
!3982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3980, file: !140, line: 3329, baseType: !3335, size: 192)
!3983 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !3980, file: !140, line: 3330, baseType: !3984, size: 64, offset: 192)
!3984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3985, size: 64)
!3985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !140, line: 3320, size: 192, elements: !3986)
!3986 = !{!3987, !3988, !3989}
!3987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3985, file: !140, line: 3322, baseType: !3984, size: 64)
!3988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3985, file: !140, line: 3323, baseType: !3984, size: 64, offset: 64)
!3989 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3985, file: !140, line: 3324, baseType: !3296, size: 64, offset: 128)
!3990 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !3980, file: !140, line: 3331, baseType: !3984, size: 64, offset: 256)
!3991 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !3299, file: !140, line: 3402, baseType: !3992, size: 256)
!3992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !140, line: 1540, size: 256, elements: !3993)
!3993 = !{!3994, !3995}
!3994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3992, file: !140, line: 1541, baseType: !3335, size: 192)
!3995 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !3992, file: !140, line: 1542, baseType: !3996, size: 64, offset: 192)
!3996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3997, size: 64)
!3997 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !140, line: 1538, baseType: !3998)
!3998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !140, line: 1538, size: 192, elements: !3999)
!3999 = !{!4000}
!4000 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3998, file: !140, line: 1538, baseType: !4001, size: 192)
!4001 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !140, line: 1537, baseType: !4002)
!4002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !140, line: 1537, size: 192, elements: !4003)
!4003 = !{!4004, !4005, !4006}
!4004 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !4002, file: !140, line: 1537, baseType: !7, size: 32)
!4005 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !4002, file: !140, line: 1537, baseType: !7, size: 32, offset: 32)
!4006 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !4002, file: !140, line: 1537, baseType: !4007, size: 128, offset: 64)
!4007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4008, size: 128, elements: !3395)
!4008 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !140, line: 1535, baseType: !4009)
!4009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !140, line: 1532, size: 128, elements: !4010)
!4010 = !{!4011, !4012}
!4011 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !4009, file: !140, line: 1533, baseType: !3296, size: 64)
!4012 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !4009, file: !140, line: 1534, baseType: !3296, size: 64, offset: 64)
!4013 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !3299, file: !140, line: 3403, baseType: !4014, size: 512)
!4014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !140, line: 1938, size: 512, elements: !4015)
!4015 = !{!4016, !4017, !4018, !4019, !4025, !4027, !4028}
!4016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4014, file: !140, line: 1939, baseType: !3335, size: 192)
!4017 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !4014, file: !140, line: 1940, baseType: !3422, size: 32, offset: 192)
!4018 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !4014, file: !140, line: 1941, baseType: !139, size: 32, offset: 224)
!4019 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !4014, file: !140, line: 1946, baseType: !4020, size: 32, offset: 256)
!4020 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !140, line: 1942, size: 32, elements: !4021)
!4021 = !{!4022, !4023, !4024}
!4022 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !4020, file: !140, line: 1943, baseType: !158, size: 32)
!4023 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !4020, file: !140, line: 1944, baseType: !165, size: 32)
!4024 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !4020, file: !140, line: 1945, baseType: !172, size: 32)
!4025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !4014, file: !140, line: 1950, baseType: !4026, size: 64, offset: 320)
!4026 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !3297, line: 66, baseType: !3707)
!4027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !4014, file: !140, line: 1951, baseType: !4026, size: 64, offset: 384)
!4028 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !4014, file: !140, line: 1953, baseType: !3903, size: 64, offset: 448)
!4029 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !3299, file: !140, line: 3404, baseType: !4030, size: 1664)
!4030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !140, line: 3337, size: 1664, elements: !4031)
!4031 = !{!4032, !4033}
!4032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !4030, file: !140, line: 3338, baseType: !3335, size: 192)
!4033 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !4030, file: !140, line: 3341, baseType: !4034, size: 1472, offset: 192)
!4034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !2420, line: 410, size: 1472, elements: !4035)
