; ModuleID = 'print-tree.c'
source_filename = "print-tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bucket = type { %union.tree_node*, %struct.bucket* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type opaque

!387 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!388 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!389 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_node_structure_enum", file: !135, line: 630, baseType: !7, size: 32, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!392 = !DIEnumerator(name: "TS_BASE", value: 0, isUnsigned: true)
!393 = !DIEnumerator(name: "TS_COMMON", value: 1, isUnsigned: true)
!394 = !DIEnumerator(name: "TS_INT_CST", value: 2, isUnsigned: true)
!395 = !DIEnumerator(name: "TS_REAL_CST", value: 3, isUnsigned: true)
!396 = !DIEnumerator(name: "TS_FIXED_CST", value: 4, isUnsigned: true)
!397 = !DIEnumerator(name: "TS_VECTOR", value: 5, isUnsigned: true)
!398 = !DIEnumerator(name: "TS_STRING", value: 6, isUnsigned: true)
!399 = !DIEnumerator(name: "TS_COMPLEX", value: 7, isUnsigned: true)
!400 = !DIEnumerator(name: "TS_IDENTIFIER", value: 8, isUnsigned: true)
!401 = !DIEnumerator(name: "TS_DECL_MINIMAL", value: 9, isUnsigned: true)
!402 = !DIEnumerator(name: "TS_DECL_COMMON", value: 10, isUnsigned: true)
!403 = !DIEnumerator(name: "TS_DECL_WRTL", value: 11, isUnsigned: true)
!404 = !DIEnumerator(name: "TS_DECL_NON_COMMON", value: 12, isUnsigned: true)
!405 = !DIEnumerator(name: "TS_DECL_WITH_VIS", value: 13, isUnsigned: true)
!406 = !DIEnumerator(name: "TS_FIELD_DECL", value: 14, isUnsigned: true)
!407 = !DIEnumerator(name: "TS_VAR_DECL", value: 15, isUnsigned: true)
!408 = !DIEnumerator(name: "TS_PARM_DECL", value: 16, isUnsigned: true)
!409 = !DIEnumerator(name: "TS_LABEL_DECL", value: 17, isUnsigned: true)
!410 = !DIEnumerator(name: "TS_RESULT_DECL", value: 18, isUnsigned: true)
!411 = !DIEnumerator(name: "TS_CONST_DECL", value: 19, isUnsigned: true)
!412 = !DIEnumerator(name: "TS_TYPE_DECL", value: 20, isUnsigned: true)
!413 = !DIEnumerator(name: "TS_FUNCTION_DECL", value: 21, isUnsigned: true)
!414 = !DIEnumerator(name: "TS_TYPE", value: 22, isUnsigned: true)
!415 = !DIEnumerator(name: "TS_LIST", value: 23, isUnsigned: true)
!416 = !DIEnumerator(name: "TS_VEC", value: 24, isUnsigned: true)
!417 = !DIEnumerator(name: "TS_EXP", value: 25, isUnsigned: true)
!418 = !DIEnumerator(name: "TS_SSA_NAME", value: 26, isUnsigned: true)
!419 = !DIEnumerator(name: "TS_BLOCK", value: 27, isUnsigned: true)
!420 = !DIEnumerator(name: "TS_BINFO", value: 28, isUnsigned: true)
!421 = !DIEnumerator(name: "TS_STATEMENT_LIST", value: 29, isUnsigned: true)
!422 = !DIEnumerator(name: "TS_CONSTRUCTOR", value: 30, isUnsigned: true)
!423 = !DIEnumerator(name: "TS_OMP_CLAUSE", value: 31, isUnsigned: true)
!424 = !DIEnumerator(name: "TS_OPTIMIZATION", value: 32, isUnsigned: true)
!425 = !DIEnumerator(name: "TS_TARGET_OPTION", value: 33, isUnsigned: true)
!426 = !DIEnumerator(name: "LAST_TS_ENUM", value: 34, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "built_in_class", file: !135, line: 205, baseType: !7, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432}
!429 = !DIEnumerator(name: "NOT_BUILT_IN", value: 0, isUnsigned: true)
!430 = !DIEnumerator(name: "BUILT_IN_FRONTEND", value: 1, isUnsigned: true)
!431 = !DIEnumerator(name: "BUILT_IN_MD", value: 2, isUnsigned: true)
!432 = !DIEnumerator(name: "BUILT_IN_NORMAL", value: 3, isUnsigned: true)
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tls_model", file: !434, line: 97, baseType: !7, size: 32, elements: !435)
!434 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !437, !438, !439, !440, !441, !442}
!436 = !DIEnumerator(name: "TLS_MODEL_NONE", value: 0, isUnsigned: true)
!437 = !DIEnumerator(name: "TLS_MODEL_EMULATED", value: 1, isUnsigned: true)
!438 = !DIEnumerator(name: "TLS_MODEL_REAL", value: 2, isUnsigned: true)
!439 = !DIEnumerator(name: "TLS_MODEL_GLOBAL_DYNAMIC", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "TLS_MODEL_LOCAL_DYNAMIC", value: 3, isUnsigned: true)
!441 = !DIEnumerator(name: "TLS_MODEL_INITIAL_EXEC", value: 4, isUnsigned: true)
!442 = !DIEnumerator(name: "TLS_MODEL_LOCAL_EXEC", value: 5, isUnsigned: true)
!443 = !{!444, !545, !134, !893, !502, !445, !971, !504, !449, !578}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket", file: !3, line: 42, size: 128, elements: !447)
!447 = !{!448, !1646}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !446, file: !3, line: 44, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !434, line: 56, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !452)
!452 = !{!453, !486, !492, !505, !524, !535, !540, !551, !557, !571, !583, !621, !629, !657, !674, !675, !680, !689, !695, !700, !704, !708, !1295, !1344, !1350, !1356, !1363, !1376, !1390, !1407, !1419, !1441, !1456, !1628}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !451, file: !135, line: 3372, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !454, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !454, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !454, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !454, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !454, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !454, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !454, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !454, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !454, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !454, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !454, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !454, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !454, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !454, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !454, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !454, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !454, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !454, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !454, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !454, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !454, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !454, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !454, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !454, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !454, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !454, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !454, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !454, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !454, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !454, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !451, file: !135, line: 3373, baseType: !487, size: 192)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !487, file: !135, line: 403, baseType: !454, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !487, file: !135, line: 404, baseType: !449, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !135, line: 405, baseType: !449, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !451, file: !135, line: 3374, baseType: !493, size: 320)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !493, file: !135, line: 1385, baseType: !487, size: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !493, file: !135, line: 1386, baseType: !497, size: 128, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !498, line: 58, baseType: !499)
!498 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 54, size: 128, elements: !500)
!500 = !{!501, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !499, file: !498, line: 56, baseType: !502, size: 64)
!502 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !499, file: !498, line: 57, baseType: !504, size: 64, offset: 64)
!504 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !451, file: !135, line: 3375, baseType: !506, size: 256)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !135, line: 1398, baseType: !487, size: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !506, file: !135, line: 1399, baseType: !510, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !512, line: 52, size: 256, elements: !513)
!512 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !{!514, !515, !516, !517, !518, !519, !520}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !511, file: !512, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !511, file: !512, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !511, file: !512, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !511, file: !512, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !511, file: !512, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !511, file: !512, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !511, file: !512, line: 62, baseType: !521, size: 192, offset: 64)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 192, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 3)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !451, file: !135, line: 3376, baseType: !525, size: 256)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !525, file: !135, line: 1409, baseType: !487, size: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !525, file: !135, line: 1410, baseType: !529, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !531, line: 27, size: 192, elements: !532)
!531 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !531, line: 29, baseType: !497, size: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !530, file: !531, line: 30, baseType: !5, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !451, file: !135, line: 3377, baseType: !536, size: 256)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !536, file: !135, line: 1438, baseType: !487, size: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !536, file: !135, line: 1439, baseType: !449, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !451, file: !135, line: 3378, baseType: !541, size: 256)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !542)
!542 = !{!543, !544, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !135, line: 1419, baseType: !487, size: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !541, file: !135, line: 1420, baseType: !545, size: 32, offset: 192)
!545 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !541, file: !135, line: 1421, baseType: !547, size: 8, offset: 224)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 8, elements: !549)
!548 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!549 = !{!550}
!550 = !DISubrange(count: 1)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !451, file: !135, line: 3379, baseType: !552, size: 320)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !135, line: 1429, baseType: !487, size: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !552, file: !135, line: 1430, baseType: !449, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !552, file: !135, line: 1431, baseType: !449, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !451, file: !135, line: 3380, baseType: !558, size: 320)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !135, line: 1461, baseType: !487, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !558, file: !135, line: 1462, baseType: !562, size: 128, offset: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !563, line: 31, size: 128, elements: !564)
!563 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!564 = !{!565, !569, !570}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !562, file: !563, line: 32, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !562, file: !563, line: 33, baseType: !7, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !562, file: !563, line: 34, baseType: !7, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !451, file: !135, line: 3381, baseType: !572, size: 384)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !573)
!573 = !{!574, !575, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !572, file: !135, line: 2508, baseType: !487, size: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !572, file: !135, line: 2509, baseType: !576, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !577, line: 58, baseType: !578)
!577 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !579, line: 44, baseType: !7)
!579 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!580 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !572, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !135, line: 2511, baseType: !449, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !572, file: !135, line: 2512, baseType: !449, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !451, file: !135, line: 3382, baseType: !584, size: 896)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !135, line: 2653, baseType: !572, size: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !584, file: !135, line: 2654, baseType: !449, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !584, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !584, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !584, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !584, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !584, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !584, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !584, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !584, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !584, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !584, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !584, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !584, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !584, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !584, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !584, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !584, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !584, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !584, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !584, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !584, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !584, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !584, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !584, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !584, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !584, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !584, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !584, file: !135, line: 2705, baseType: !449, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !584, file: !135, line: 2706, baseType: !449, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !584, file: !135, line: 2707, baseType: !449, size: 64, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !584, file: !135, line: 2708, baseType: !449, size: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !584, file: !135, line: 2711, baseType: !619, size: 64, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !451, file: !135, line: 3383, baseType: !622, size: 960)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !135, line: 2757, baseType: !584, size: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !622, file: !135, line: 2758, baseType: !626, size: 64, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !434, line: 50, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !434, line: 49, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !451, file: !135, line: 3384, baseType: !630, size: 1472)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !631)
!631 = !{!632, !653, !654, !655, !656}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !135, line: 3115, baseType: !633, size: 1216)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !135, line: 2985, baseType: !622, size: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !633, file: !135, line: 2986, baseType: !449, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !633, file: !135, line: 2987, baseType: !449, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !633, file: !135, line: 2988, baseType: !449, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !633, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !633, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !633, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !633, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !633, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !633, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !633, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !633, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !633, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !633, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !633, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !633, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !633, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !633, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !630, file: !135, line: 3117, baseType: !449, size: 64, offset: 1216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !630, file: !135, line: 3119, baseType: !449, size: 64, offset: 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !630, file: !135, line: 3121, baseType: !449, size: 64, offset: 1344)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !630, file: !135, line: 3123, baseType: !449, size: 64, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !451, file: !135, line: 3385, baseType: !658, size: 1088)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !135, line: 2875, baseType: !622, size: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !658, file: !135, line: 2876, baseType: !626, size: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !658, file: !135, line: 2877, baseType: !663, size: 64, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !665, line: 172, size: 128, elements: !666)
!665 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!666 = !{!667, !668, !669, !670, !671, !672, !673}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !664, file: !665, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !664, file: !665, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !664, file: !665, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !664, file: !665, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !664, file: !665, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !664, file: !665, line: 195, baseType: !7, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !664, file: !665, line: 199, baseType: !449, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !451, file: !135, line: 3386, baseType: !633, size: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !451, file: !135, line: 3387, baseType: !676, size: 1280)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !135, line: 3094, baseType: !633, size: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !676, file: !135, line: 3095, baseType: !663, size: 64, offset: 1216)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !451, file: !135, line: 3388, baseType: !681, size: 1216)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !681, file: !135, line: 2825, baseType: !584, size: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !681, file: !135, line: 2827, baseType: !449, size: 64, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !681, file: !135, line: 2828, baseType: !449, size: 64, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !681, file: !135, line: 2829, baseType: !449, size: 64, offset: 1024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !681, file: !135, line: 2830, baseType: !449, size: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !681, file: !135, line: 2831, baseType: !449, size: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !451, file: !135, line: 3389, baseType: !690, size: 1024)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !135, line: 2851, baseType: !622, size: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !690, file: !135, line: 2852, baseType: !545, size: 32, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !690, file: !135, line: 2853, baseType: !545, size: 32, offset: 992)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !451, file: !135, line: 3390, baseType: !696, size: 1024)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !135, line: 2858, baseType: !622, size: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !696, file: !135, line: 2859, baseType: !663, size: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !451, file: !135, line: 3391, baseType: !701, size: 960)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !701, file: !135, line: 2863, baseType: !622, size: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !451, file: !135, line: 3392, baseType: !705, size: 1472)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !135, line: 3305, baseType: !630, size: 1472)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !451, file: !135, line: 3393, baseType: !709, size: 1792)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !710)
!710 = !{!711, !712, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !135, line: 3249, baseType: !630, size: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !709, file: !135, line: 3251, baseType: !713, size: 64, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !715, line: 463, size: 1152, elements: !716)
!715 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!716 = !{!717, !720, !1041, !1042, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1247, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !714, file: !715, line: 464, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !715, line: 464, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !714, file: !715, line: 467, baseType: !721, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !723)
!723 = !{!724, !1016, !1017, !1030, !1031, !1032, !1033, !1034, !1035, !1037, !1039, !1040}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !722, file: !330, line: 377, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !434, line: 111, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !728)
!728 = !{!729, !979, !980, !981, !984, !990, !991, !992, !1010, !1011, !1012, !1013, !1014, !1015}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !727, file: !330, line: 219, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !733)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !732, file: !330, line: 151, baseType: !735, size: 128)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !736, file: !330, line: 150, baseType: !7, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !736, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !736, file: !330, line: 150, baseType: !741, size: 64, offset: 64)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 64, elements: !549)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !434, line: 108, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !745)
!745 = !{!746, !747, !748, !970, !972, !973, !974, !975, !976, !977}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !744, file: !330, line: 124, baseType: !726, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !744, file: !330, line: 125, baseType: !726, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !744, file: !330, line: 131, baseType: !749, size: 64, offset: 128)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !750)
!750 = !{!751, !969}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !749, file: !330, line: 129, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !434, line: 66, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !755, line: 143, size: 192, elements: !756)
!755 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!756 = !{!757, !967, !968}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !754, file: !755, line: 145, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !434, line: 69, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !755, line: 136, size: 192, elements: !761)
!761 = !{!762, !965, !966}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !760, file: !755, line: 137, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !434, line: 58, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !755, line: 737, size: 768, elements: !766)
!766 = !{!767, !784, !818, !824, !829, !834, !841, !847, !853, !858, !872, !877, !883, !888, !900, !905, !923, !930, !937, !943, !948, !954, !960}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !765, file: !755, line: 738, baseType: !768, size: 256)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !755, line: 271, size: 256, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !768, file: !755, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !768, file: !755, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !768, file: !755, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !768, file: !755, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !768, file: !755, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !768, file: !755, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !768, file: !755, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !768, file: !755, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !768, file: !755, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !768, file: !755, line: 312, baseType: !7, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !768, file: !755, line: 316, baseType: !576, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !768, file: !755, line: 319, baseType: !7, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !768, file: !755, line: 323, baseType: !726, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !768, file: !755, line: 327, baseType: !449, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !765, file: !755, line: 739, baseType: !785, size: 448)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !755, line: 350, size: 448, elements: !786)
!786 = !{!787, !816}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !785, file: !755, line: 353, baseType: !788, size: 384)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !755, line: 333, size: 384, elements: !789)
!789 = !{!790, !791, !799}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !788, file: !755, line: 336, baseType: !768, size: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !788, file: !755, line: 343, baseType: !792, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !794, line: 37, size: 128, elements: !795)
!794 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !794, line: 39, baseType: !792, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !793, file: !794, line: 40, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !788, file: !755, line: 344, baseType: !800, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !794, line: 45, size: 320, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !794, line: 47, baseType: !800, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !801, file: !794, line: 48, baseType: !805, size: 256, offset: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !806)
!806 = !{!807, !809, !810, !815}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !805, file: !135, line: 1884, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !805, file: !135, line: 1885, baseType: !808, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !805, file: !135, line: 1891, baseType: !811, size: 64, offset: 128)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !135, line: 1891, size: 64, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !811, file: !135, line: 1891, baseType: !763, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !811, file: !135, line: 1891, baseType: !449, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !805, file: !135, line: 1892, baseType: !798, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !785, file: !755, line: 359, baseType: !817, size: 64, offset: 384)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 64, elements: !549)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !765, file: !755, line: 740, baseType: !819, size: 512)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !755, line: 365, size: 512, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !819, file: !755, line: 368, baseType: !788, size: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !819, file: !755, line: 373, baseType: !449, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !819, file: !755, line: 374, baseType: !449, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !765, file: !755, line: 741, baseType: !825, size: 576)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !755, line: 380, size: 576, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !825, file: !755, line: 383, baseType: !819, size: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !825, file: !755, line: 389, baseType: !817, size: 64, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !765, file: !755, line: 742, baseType: !830, size: 320)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !755, line: 395, size: 320, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !830, file: !755, line: 397, baseType: !768, size: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !830, file: !755, line: 400, baseType: !752, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !765, file: !755, line: 743, baseType: !835, size: 448)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !755, line: 406, size: 448, elements: !836)
!836 = !{!837, !838, !839, !840}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !835, file: !755, line: 408, baseType: !768, size: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !835, file: !755, line: 412, baseType: !449, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !835, file: !755, line: 420, baseType: !449, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !835, file: !755, line: 423, baseType: !752, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !765, file: !755, line: 744, baseType: !842, size: 384)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !755, line: 429, size: 384, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !842, file: !755, line: 431, baseType: !768, size: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !842, file: !755, line: 434, baseType: !449, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !842, file: !755, line: 437, baseType: !752, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !765, file: !755, line: 745, baseType: !848, size: 384)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !755, line: 443, size: 384, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !848, file: !755, line: 445, baseType: !768, size: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !848, file: !755, line: 449, baseType: !449, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !848, file: !755, line: 453, baseType: !752, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !765, file: !755, line: 746, baseType: !854, size: 320)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !755, line: 459, size: 320, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !854, file: !755, line: 461, baseType: !768, size: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !854, file: !755, line: 464, baseType: !449, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !765, file: !755, line: 747, baseType: !859, size: 768)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !755, line: 469, size: 768, elements: !860)
!860 = !{!861, !862, !863, !864, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !859, file: !755, line: 471, baseType: !768, size: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !859, file: !755, line: 474, baseType: !7, size: 32, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !859, file: !755, line: 475, baseType: !7, size: 32, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !859, file: !755, line: 478, baseType: !449, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !859, file: !755, line: 481, baseType: !866, size: 384, offset: 384)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 384, elements: !549)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !867, file: !135, line: 1920, baseType: !805, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !867, file: !135, line: 1921, baseType: !449, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !867, file: !135, line: 1922, baseType: !576, size: 32, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !765, file: !755, line: 748, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !755, line: 487, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !873, file: !755, line: 490, baseType: !768, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !873, file: !755, line: 494, baseType: !545, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !765, file: !755, line: 749, baseType: !878, size: 384)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !755, line: 500, size: 384, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !755, line: 502, baseType: !768, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !878, file: !755, line: 506, baseType: !752, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !878, file: !755, line: 510, baseType: !752, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !765, file: !755, line: 750, baseType: !884, size: 320)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !755, line: 529, size: 320, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !755, line: 531, baseType: !768, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !884, file: !755, line: 540, baseType: !752, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !765, file: !755, line: 751, baseType: !889, size: 704)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !755, line: 546, size: 704, elements: !890)
!890 = !{!891, !892, !895, !896, !897, !898, !899}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !889, file: !755, line: 549, baseType: !819, size: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !889, file: !755, line: 553, baseType: !893, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !889, file: !755, line: 557, baseType: !568, size: 8, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !889, file: !755, line: 558, baseType: !568, size: 8, offset: 584)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !889, file: !755, line: 559, baseType: !568, size: 8, offset: 592)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !889, file: !755, line: 560, baseType: !568, size: 8, offset: 600)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !889, file: !755, line: 566, baseType: !817, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !765, file: !755, line: 752, baseType: !901, size: 384)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !755, line: 571, size: 384, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !901, file: !755, line: 573, baseType: !830, size: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !755, line: 577, baseType: !449, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !765, file: !755, line: 753, baseType: !906, size: 576)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !755, line: 600, size: 576, elements: !907)
!907 = !{!908, !909, !910, !913, !922}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !906, file: !755, line: 602, baseType: !830, size: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !906, file: !755, line: 605, baseType: !449, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !906, file: !755, line: 609, baseType: !911, size: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !912, line: 46, baseType: !502)
!912 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!913 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !906, file: !755, line: 612, baseType: !914, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !755, line: 581, size: 320, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !915, file: !755, line: 583, baseType: !134, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !915, file: !755, line: 586, baseType: !449, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !915, file: !755, line: 589, baseType: !449, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !915, file: !755, line: 592, baseType: !449, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !915, file: !755, line: 595, baseType: !449, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !906, file: !755, line: 616, baseType: !752, size: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !765, file: !755, line: 754, baseType: !924, size: 512)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !755, line: 622, size: 512, elements: !925)
!925 = !{!926, !927, !928, !929}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !924, file: !755, line: 624, baseType: !830, size: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !924, file: !755, line: 628, baseType: !449, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !924, file: !755, line: 632, baseType: !449, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !924, file: !755, line: 636, baseType: !449, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !765, file: !755, line: 755, baseType: !931, size: 704)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !755, line: 642, size: 704, elements: !932)
!932 = !{!933, !934, !935, !936}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !931, file: !755, line: 644, baseType: !924, size: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !931, file: !755, line: 648, baseType: !449, size: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !931, file: !755, line: 652, baseType: !449, size: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !931, file: !755, line: 653, baseType: !449, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !765, file: !755, line: 756, baseType: !938, size: 448)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !755, line: 663, size: 448, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !938, file: !755, line: 665, baseType: !830, size: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !938, file: !755, line: 668, baseType: !449, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !938, file: !755, line: 673, baseType: !449, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !765, file: !755, line: 757, baseType: !944, size: 384)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !755, line: 694, size: 384, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !944, file: !755, line: 696, baseType: !830, size: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !944, file: !755, line: 699, baseType: !449, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !765, file: !755, line: 758, baseType: !949, size: 384)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !755, line: 681, size: 384, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !949, file: !755, line: 683, baseType: !768, size: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !949, file: !755, line: 686, baseType: !449, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !949, file: !755, line: 689, baseType: !449, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !765, file: !755, line: 759, baseType: !955, size: 384)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !755, line: 707, size: 384, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !755, line: 709, baseType: !768, size: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !955, file: !755, line: 712, baseType: !449, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !955, file: !755, line: 712, baseType: !449, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !765, file: !755, line: 760, baseType: !961, size: 320)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !755, line: 718, size: 320, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !961, file: !755, line: 720, baseType: !768, size: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !961, file: !755, line: 723, baseType: !449, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !755, line: 138, baseType: !759, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !755, line: 139, baseType: !759, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !754, file: !755, line: 146, baseType: !758, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !754, file: !755, line: 152, baseType: !752, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !749, file: !330, line: 130, baseType: !626, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !744, file: !330, line: 134, baseType: !971, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !744, file: !330, line: 137, baseType: !449, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !744, file: !330, line: 138, baseType: !576, size: 32, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !744, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !330, line: 144, baseType: !545, size: 32, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !744, file: !330, line: 145, baseType: !545, size: 32, offset: 416)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !744, file: !330, line: 146, baseType: !978, size: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !504)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !727, file: !330, line: 220, baseType: !730, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !727, file: !330, line: 223, baseType: !971, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !727, file: !330, line: 226, baseType: !982, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !727, file: !330, line: 229, baseType: !985, size: 128, offset: 256)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 128, elements: !988)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!988 = !{!989}
!989 = !DISubrange(count: 2)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !727, file: !330, line: 232, baseType: !726, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !727, file: !330, line: 233, baseType: !726, size: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !727, file: !330, line: 238, baseType: !993, size: 64, offset: 512)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !994)
!994 = !{!995, !1001}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !993, file: !330, line: 236, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !997, file: !330, line: 275, baseType: !752, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !997, file: !330, line: 278, baseType: !752, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !993, file: !330, line: 237, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1003, file: !330, line: 261, baseType: !626, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1003, file: !330, line: 262, baseType: !626, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1003, file: !330, line: 266, baseType: !626, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1003, file: !330, line: 267, baseType: !626, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1003, file: !330, line: 270, baseType: !545, size: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !727, file: !330, line: 241, baseType: !978, size: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !727, file: !330, line: 244, baseType: !545, size: 32, offset: 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !727, file: !330, line: 247, baseType: !545, size: 32, offset: 672)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !727, file: !330, line: 250, baseType: !545, size: 32, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !727, file: !330, line: 253, baseType: !545, size: 32, offset: 736)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !330, line: 256, baseType: !545, size: 32, offset: 768)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !722, file: !330, line: 378, baseType: !725, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !722, file: !330, line: 381, baseType: !1018, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1020, file: !330, line: 282, baseType: !1023, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1024, file: !330, line: 281, baseType: !7, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1024, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1024, file: !330, line: 281, baseType: !1029, size: 64, offset: 64)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 64, elements: !549)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !722, file: !330, line: 384, baseType: !545, size: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !722, file: !330, line: 387, baseType: !545, size: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !722, file: !330, line: 390, baseType: !545, size: 32, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !722, file: !330, line: 394, baseType: !1018, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !722, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !722, file: !330, line: 399, baseType: !1036, size: 64, offset: 416)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !988)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !722, file: !330, line: 402, baseType: !1038, size: 64, offset: 480)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !988)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !722, file: !330, line: 406, baseType: !545, size: 32, offset: 544)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !722, file: !330, line: 409, baseType: !545, size: 32, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !714, file: !715, line: 470, baseType: !753, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !714, file: !715, line: 473, baseType: !1043, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !665, line: 39, size: 1152, elements: !1045)
!1045 = !{!1046, !1096, !1109, !1121, !1122, !1192, !1193, !1197, !1198, !1199, !1200, !1201}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1044, file: !665, line: 41, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1048, line: 144, baseType: !1049)
!1048 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1048, line: 100, size: 896, elements: !1051)
!1051 = !{!1052, !1060, !1065, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1082, !1084, !1085, !1090, !1095}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1050, file: !1048, line: 102, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1048, line: 52, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1048, line: 47, baseType: !7)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1050, file: !1048, line: 105, baseType: !1061, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1048, line: 59, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!545, !1058, !1058}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1050, file: !1048, line: 108, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1048, line: 63, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !971}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1050, file: !1048, line: 111, baseType: !1071, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !1048, line: 114, baseType: !911, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1050, file: !1048, line: 117, baseType: !911, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1050, file: !1048, line: 120, baseType: !911, size: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1050, file: !1048, line: 124, baseType: !7, size: 32, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1050, file: !1048, line: 128, baseType: !7, size: 32, offset: 480)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1050, file: !1048, line: 131, baseType: !1078, size: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1048, line: 75, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!971, !911, !911}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1050, file: !1048, line: 132, baseType: !1083, size: 64, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1048, line: 78, baseType: !1067)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1050, file: !1048, line: 135, baseType: !971, size: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1050, file: !1048, line: 136, baseType: !1086, size: 64, offset: 704)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1048, line: 82, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!971, !971, !911, !911}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1050, file: !1048, line: 137, baseType: !1091, size: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1048, line: 83, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !971, !971}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1050, file: !1048, line: 141, baseType: !7, size: 32, offset: 832)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1044, file: !665, line: 48, baseType: !1097, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !755, line: 35, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !755, line: 35, size: 128, elements: !1100)
!1100 = !{!1101}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1099, file: !755, line: 35, baseType: !1102, size: 128)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !755, line: 33, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !755, line: 33, size: 128, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1103, file: !755, line: 33, baseType: !7, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1103, file: !755, line: 33, baseType: !7, size: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1103, file: !755, line: 33, baseType: !1108, size: 64, offset: 64)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 64, elements: !549)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1044, file: !665, line: 51, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1112, file: !135, line: 183, baseType: !1115, size: 128)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1116, file: !135, line: 182, baseType: !7, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1116, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1116, file: !135, line: 182, baseType: !817, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1044, file: !665, line: 54, baseType: !449, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1044, file: !665, line: 57, baseType: !1123, size: 128, offset: 256)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1124, line: 31, size: 128, elements: !1125)
!1124 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1123, file: !1124, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1123, file: !1124, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1123, file: !1124, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1123, file: !1124, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1123, file: !1124, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1123, file: !1124, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1123, file: !1124, line: 56, baseType: !1133, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !434, line: 47, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1136, line: 75, size: 256, elements: !1137)
!1136 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1137 = !{!1138, !1150, !1151, !1152}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1135, file: !1136, line: 76, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1136, line: 68, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1136, line: 63, size: 320, elements: !1142)
!1142 = !{!1143, !1145, !1146, !1147}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !1136, line: 64, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1141, file: !1136, line: 65, baseType: !1144, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1141, file: !1136, line: 66, baseType: !7, size: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1141, file: !1136, line: 67, baseType: !1148, size: 128, offset: 192)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 128, elements: !988)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1136, line: 29, baseType: !502)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1135, file: !1136, line: 77, baseType: !1139, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1135, file: !1136, line: 78, baseType: !7, size: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1135, file: !1136, line: 79, baseType: !1153, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1136, line: 49, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1136, line: 45, size: 832, elements: !1156)
!1156 = !{!1157, !1158, !1159}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1155, file: !1136, line: 46, baseType: !1144, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1155, file: !1136, line: 47, baseType: !1134, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1155, file: !1136, line: 48, baseType: !1160, size: 704, offset: 128)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1161, line: 164, size: 704, elements: !1162)
!1161 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1162 = !{!1163, !1164, !1175, !1176, !1177, !1178, !1179, !1180, !1184, !1188, !1189, !1190, !1191}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1160, file: !1161, line: 166, baseType: !504, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1160, file: !1161, line: 167, baseType: !1165, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1161, line: 157, size: 192, elements: !1167)
!1167 = !{!1168, !1170, !1171}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1166, file: !1161, line: 159, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1166, file: !1161, line: 160, baseType: !1165, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1166, file: !1161, line: 161, baseType: !1172, size: 32, offset: 128)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 32, elements: !1173)
!1173 = !{!1174}
!1174 = !DISubrange(count: 4)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1160, file: !1161, line: 168, baseType: !1169, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1160, file: !1161, line: 169, baseType: !1169, size: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1160, file: !1161, line: 170, baseType: !1169, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1160, file: !1161, line: 171, baseType: !504, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1160, file: !1161, line: 172, baseType: !545, size: 32, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1160, file: !1161, line: 176, baseType: !1181, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1165, !971, !504}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1160, file: !1161, line: 177, baseType: !1185, size: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !971, !1165}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1160, file: !1161, line: 178, baseType: !971, size: 64, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1160, file: !1161, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1160, file: !1161, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1160, file: !1161, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1044, file: !665, line: 60, baseType: !1123, size: 128, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1044, file: !665, line: 64, baseType: !1194, size: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1196, line: 33, flags: DIFlagFwdDecl)
!1196 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1044, file: !665, line: 67, baseType: !449, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1044, file: !665, line: 73, baseType: !1047, size: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1044, file: !665, line: 77, baseType: !1133, size: 64, offset: 704)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1044, file: !665, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1044, file: !665, line: 82, baseType: !1202, size: 320, offset: 832)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !794, line: 62, size: 320, elements: !1203)
!1203 = !{!1204, !1210, !1211, !1212, !1213, !1214}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1202, file: !794, line: 63, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !794, line: 56, size: 128, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1206, file: !794, line: 57, baseType: !1205, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1206, file: !794, line: 58, baseType: !547, size: 8, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1202, file: !794, line: 64, baseType: !7, size: 32, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1202, file: !794, line: 66, baseType: !7, size: 32, offset: 96)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1202, file: !794, line: 68, baseType: !568, size: 8, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1202, file: !794, line: 70, baseType: !792, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1202, file: !794, line: 71, baseType: !800, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !714, file: !715, line: 476, baseType: !1216, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !715, line: 476, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !714, file: !715, line: 479, baseType: !1047, size: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !714, file: !715, line: 484, baseType: !449, size: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !714, file: !715, line: 488, baseType: !449, size: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !714, file: !715, line: 493, baseType: !449, size: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !714, file: !715, line: 496, baseType: !449, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !714, file: !715, line: 501, baseType: !1224, size: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !341, line: 2355, size: 576, elements: !1226)
!1226 = !{!1227, !1230, !1231, !1232, !1233, !1235, !1236, !1241, !1242, !1243, !1244, !1245, !1246}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1225, file: !341, line: 2356, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !341, line: 2356, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1225, file: !341, line: 2357, baseType: !893, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1225, file: !341, line: 2358, baseType: !545, size: 32, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1225, file: !341, line: 2359, baseType: !545, size: 32, offset: 160)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1225, file: !341, line: 2360, baseType: !1234, size: 128, offset: 192)
