; ModuleID = 'ipa-cp.c'
source_filename = "ipa-cp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }

!1500 = !DIEnumerator(name: "PARAM_OMEGA_ELIMINATE_REDUNDANT_CONSTRAINTS", value: 70, isUnsigned: true)
!1501 = !DIEnumerator(name: "PARAM_VECT_MAX_VERSION_FOR_ALIGNMENT_CHECKS", value: 71, isUnsigned: true)
!1502 = !DIEnumerator(name: "PARAM_VECT_MAX_VERSION_FOR_ALIAS_CHECKS", value: 72, isUnsigned: true)
!1503 = !DIEnumerator(name: "PARAM_MAX_CSELIB_MEMORY_LOCATIONS", value: 73, isUnsigned: true)
!1504 = !DIEnumerator(name: "GGC_MIN_EXPAND", value: 74, isUnsigned: true)
!1505 = !DIEnumerator(name: "GGC_MIN_HEAPSIZE", value: 75, isUnsigned: true)
!1506 = !DIEnumerator(name: "PARAM_MAX_RELOAD_SEARCH_INSNS", value: 76, isUnsigned: true)
!1507 = !DIEnumerator(name: "PARAM_MAX_SCHED_REGION_BLOCKS", value: 77, isUnsigned: true)
!1508 = !DIEnumerator(name: "PARAM_MAX_SCHED_REGION_INSNS", value: 78, isUnsigned: true)
!1509 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_BLOCKS", value: 79, isUnsigned: true)
!1510 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_INSNS", value: 80, isUnsigned: true)
!1511 = !DIEnumerator(name: "PARAM_MIN_SPEC_PROB", value: 81, isUnsigned: true)
!1512 = !DIEnumerator(name: "PARAM_MAX_SCHED_EXTEND_REGIONS_ITERS", value: 82, isUnsigned: true)
!1513 = !DIEnumerator(name: "PARAM_MAX_SCHED_INSN_CONFLICT_DELAY", value: 83, isUnsigned: true)
!1514 = !DIEnumerator(name: "PARAM_SCHED_SPEC_PROB_CUTOFF", value: 84, isUnsigned: true)
!1515 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_LOOKAHEAD", value: 85, isUnsigned: true)
!1516 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_SCHED_TIMES", value: 86, isUnsigned: true)
!1517 = !DIEnumerator(name: "PARAM_SELSCHED_INSNS_TO_RENAME", value: 87, isUnsigned: true)
!1518 = !DIEnumerator(name: "PARAM_SCHED_MEM_TRUE_DEP_COST", value: 88, isUnsigned: true)
!1519 = !DIEnumerator(name: "PARAM_MAX_LAST_VALUE_RTL", value: 89, isUnsigned: true)
!1520 = !DIEnumerator(name: "PARAM_INTEGER_SHARE_LIMIT", value: 90, isUnsigned: true)
!1521 = !DIEnumerator(name: "PARAM_MIN_VIRTUAL_MAPPINGS", value: 91, isUnsigned: true)
!1522 = !DIEnumerator(name: "PARAM_VIRTUAL_MAPPINGS_TO_SYMS_RATIO", value: 92, isUnsigned: true)
!1523 = !DIEnumerator(name: "PARAM_SSP_BUFFER_SIZE", value: 93, isUnsigned: true)
!1524 = !DIEnumerator(name: "PARAM_MAX_JUMP_THREAD_DUPLICATION_STMTS", value: 94, isUnsigned: true)
!1525 = !DIEnumerator(name: "PARAM_MAX_FIELDS_FOR_FIELD_SENSITIVE", value: 95, isUnsigned: true)
!1526 = !DIEnumerator(name: "PARAM_MAX_SCHED_READY_INSNS", value: 96, isUnsigned: true)
!1527 = !DIEnumerator(name: "PARAM_PREFETCH_LATENCY", value: 97, isUnsigned: true)
!1528 = !DIEnumerator(name: "PARAM_SIMULTANEOUS_PREFETCHES", value: 98, isUnsigned: true)
!1529 = !DIEnumerator(name: "PARAM_L1_CACHE_SIZE", value: 99, isUnsigned: true)
!1530 = !DIEnumerator(name: "PARAM_L1_CACHE_LINE_SIZE", value: 100, isUnsigned: true)
!1531 = !DIEnumerator(name: "PARAM_L2_CACHE_SIZE", value: 101, isUnsigned: true)
!1532 = !DIEnumerator(name: "PARAM_USE_CANONICAL_TYPES", value: 102, isUnsigned: true)
!1533 = !DIEnumerator(name: "PARAM_MAX_PARTIAL_ANTIC_LENGTH", value: 103, isUnsigned: true)
!1534 = !DIEnumerator(name: "PARAM_SCCVN_MAX_SCC_SIZE", value: 104, isUnsigned: true)
!1535 = !DIEnumerator(name: "PARAM_IRA_MAX_LOOPS_NUM", value: 105, isUnsigned: true)
!1536 = !DIEnumerator(name: "PARAM_IRA_MAX_CONFLICT_TABLE_SIZE", value: 106, isUnsigned: true)
!1537 = !DIEnumerator(name: "PARAM_IRA_LOOP_RESERVED_REGS", value: 107, isUnsigned: true)
!1538 = !DIEnumerator(name: "PARAM_SWITCH_CONVERSION_BRANCH_RATIO", value: 108, isUnsigned: true)
!1539 = !DIEnumerator(name: "PARAM_LOOP_BLOCK_TILE_SIZE", value: 109, isUnsigned: true)
!1540 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_NB_SCOP_PARAMS", value: 110, isUnsigned: true)
!1541 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_BBS_PER_FUNCTION", value: 111, isUnsigned: true)
!1542 = !DIEnumerator(name: "PARAM_LOOP_INVARIANT_MAX_BBS_IN_LOOP", value: 112, isUnsigned: true)
!1543 = !DIEnumerator(name: "PARAM_SLP_MAX_INSNS_IN_BB", value: 113, isUnsigned: true)
!1544 = !DIEnumerator(name: "PARAM_MIN_INSN_TO_PREFETCH_RATIO", value: 114, isUnsigned: true)
!1545 = !DIEnumerator(name: "PARAM_PREFETCH_MIN_INSN_TO_MEM_RATIO", value: 115, isUnsigned: true)
!1546 = !DIEnumerator(name: "PARAM_MAX_VARTRACK_SIZE", value: 116, isUnsigned: true)
!1547 = !DIEnumerator(name: "PARAM_MIN_NONDEBUG_INSN_UID", value: 117, isUnsigned: true)
!1548 = !DIEnumerator(name: "PARAM_IPA_SRA_PTR_GROWTH_FACTOR", value: 118, isUnsigned: true)
!1549 = !DIEnumerator(name: "LAST_PARAM", value: 119, isUnsigned: true)
!1550 = !{!1551, !2057, !189, !1850, !2732, !1884, !2255, !1607, !7, !2734, !1632, !3008, !1665, !2775, !3050, !2219, !2958, !2971, !3064}
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1552, line: 56, baseType: !1553)
!1552 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64)
!1554 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !190, line: 3371, size: 1792, elements: !1555)
!1555 = !{!1556, !1589, !1595, !1608, !1615, !1622, !1627, !1638, !1644, !1658, !1670, !1708, !1716, !1744, !1761, !1762, !1767, !1776, !1782, !1787, !1791, !1795, !2381, !2430, !2436, !2442, !2449, !2462, !2476, !2493, !2505, !2527, !2542, !2714}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1554, file: !190, line: 3372, baseType: !1557, size: 64)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !190, line: 360, size: 64, elements: !1558)
!1558 = !{!1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1557, file: !190, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1557, file: !190, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1557, file: !190, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1557, file: !190, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1557, file: !190, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1557, file: !190, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1557, file: !190, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1557, file: !190, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1557, file: !190, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1557, file: !190, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1557, file: !190, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1557, file: !190, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1557, file: !190, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1557, file: !190, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1557, file: !190, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1557, file: !190, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1557, file: !190, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1557, file: !190, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1557, file: !190, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1557, file: !190, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1557, file: !190, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1557, file: !190, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1557, file: !190, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1557, file: !190, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1557, file: !190, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1557, file: !190, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1557, file: !190, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1557, file: !190, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1557, file: !190, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1557, file: !190, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1554, file: !190, line: 3373, baseType: !1590, size: 192)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !190, line: 402, size: 192, elements: !1591)
!1591 = !{!1592, !1593, !1594}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1590, file: !190, line: 403, baseType: !1557, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1590, file: !190, line: 404, baseType: !1551, size: 64, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1590, file: !190, line: 405, baseType: !1551, size: 64, offset: 128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1554, file: !190, line: 3374, baseType: !1596, size: 320)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !190, line: 1384, size: 320, elements: !1597)
!1597 = !{!1598, !1599}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1596, file: !190, line: 1385, baseType: !1590, size: 192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1596, file: !190, line: 1386, baseType: !1600, size: 128, offset: 192)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1601, line: 58, baseType: !1602)
!1601 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1601, line: 54, size: 128, elements: !1603)
!1603 = !{!1604, !1606}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1602, file: !1601, line: 56, baseType: !1605, size: 64)
!1605 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1602, file: !1601, line: 57, baseType: !1607, size: 64, offset: 64)
!1607 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1554, file: !190, line: 3375, baseType: !1609, size: 256)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !190, line: 1397, size: 256, elements: !1610)
!1610 = !{!1611, !1612}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1609, file: !190, line: 1398, baseType: !1590, size: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1609, file: !190, line: 1399, baseType: !1613, size: 64, offset: 192)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !190, line: 1392, flags: DIFlagFwdDecl)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1554, file: !190, line: 3376, baseType: !1616, size: 256)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !190, line: 1408, size: 256, elements: !1617)
!1617 = !{!1618, !1619}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1616, file: !190, line: 1409, baseType: !1590, size: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1616, file: !190, line: 1410, baseType: !1620, size: 64, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !190, line: 1403, flags: DIFlagFwdDecl)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1554, file: !190, line: 3377, baseType: !1623, size: 256)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !190, line: 1437, size: 256, elements: !1624)
!1624 = !{!1625, !1626}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1623, file: !190, line: 1438, baseType: !1590, size: 192)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1623, file: !190, line: 1439, baseType: !1551, size: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1554, file: !190, line: 3378, baseType: !1628, size: 256)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !190, line: 1418, size: 256, elements: !1629)
!1629 = !{!1630, !1631, !1633}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1628, file: !190, line: 1419, baseType: !1590, size: 192)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1628, file: !190, line: 1420, baseType: !1632, size: 32, offset: 192)
!1632 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1628, file: !190, line: 1421, baseType: !1634, size: 8, offset: 224)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1635, size: 8, elements: !1636)
!1635 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1636 = !{!1637}
!1637 = !DISubrange(count: 1)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1554, file: !190, line: 3379, baseType: !1639, size: 320)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !190, line: 1428, size: 320, elements: !1640)
!1640 = !{!1641, !1642, !1643}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1639, file: !190, line: 1429, baseType: !1590, size: 192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1639, file: !190, line: 1430, baseType: !1551, size: 64, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1639, file: !190, line: 1431, baseType: !1551, size: 64, offset: 256)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1554, file: !190, line: 3380, baseType: !1645, size: 320)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !190, line: 1460, size: 320, elements: !1646)
!1646 = !{!1647, !1648}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1645, file: !190, line: 1461, baseType: !1590, size: 192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1645, file: !190, line: 1462, baseType: !1649, size: 128, offset: 192)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1650, line: 31, size: 128, elements: !1651)
!1650 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1651 = !{!1652, !1656, !1657}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1649, file: !1650, line: 32, baseType: !1653, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1649, file: !1650, line: 33, baseType: !7, size: 32, offset: 64)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1649, file: !1650, line: 34, baseType: !7, size: 32, offset: 96)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1554, file: !190, line: 3381, baseType: !1659, size: 384)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !190, line: 2507, size: 384, elements: !1660)
!1660 = !{!1661, !1662, !1667, !1668, !1669}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1659, file: !190, line: 2508, baseType: !1590, size: 192)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1659, file: !190, line: 2509, baseType: !1663, size: 32, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1664, line: 58, baseType: !1665)
!1664 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1666, line: 44, baseType: !7)
!1666 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1659, file: !190, line: 2510, baseType: !7, size: 32, offset: 224)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1659, file: !190, line: 2511, baseType: !1551, size: 64, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1659, file: !190, line: 2512, baseType: !1551, size: 64, offset: 320)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1554, file: !190, line: 3382, baseType: !1671, size: 896)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !190, line: 2652, size: 896, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1671, file: !190, line: 2653, baseType: !1659, size: 384)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1671, file: !190, line: 2654, baseType: !1551, size: 64, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1671, file: !190, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1671, file: !190, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1671, file: !190, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1671, file: !190, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1671, file: !190, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1671, file: !190, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1671, file: !190, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1671, file: !190, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1671, file: !190, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1671, file: !190, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1671, file: !190, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1671, file: !190, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1671, file: !190, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1671, file: !190, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1671, file: !190, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1671, file: !190, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1671, file: !190, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1671, file: !190, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1671, file: !190, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1671, file: !190, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1671, file: !190, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1671, file: !190, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1671, file: !190, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1671, file: !190, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1671, file: !190, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1671, file: !190, line: 2703, baseType: !7, size: 32, offset: 512)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1671, file: !190, line: 2705, baseType: !1551, size: 64, offset: 576)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1671, file: !190, line: 2706, baseType: !1551, size: 64, offset: 640)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1671, file: !190, line: 2707, baseType: !1551, size: 64, offset: 704)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1671, file: !190, line: 2708, baseType: !1551, size: 64, offset: 768)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1671, file: !190, line: 2711, baseType: !1706, size: 64, offset: 832)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !190, line: 2711, flags: DIFlagFwdDecl)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1554, file: !190, line: 3383, baseType: !1709, size: 960)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !190, line: 2756, size: 960, elements: !1710)
!1710 = !{!1711, !1712}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1709, file: !190, line: 2757, baseType: !1671, size: 896)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1709, file: !190, line: 2758, baseType: !1713, size: 64, offset: 896)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1552, line: 50, baseType: !1714)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64)
!1715 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1552, line: 49, flags: DIFlagFwdDecl)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1554, file: !190, line: 3384, baseType: !1717, size: 1472)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !190, line: 3114, size: 1472, elements: !1718)
!1718 = !{!1719, !1740, !1741, !1742, !1743}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1717, file: !190, line: 3115, baseType: !1720, size: 1216)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !190, line: 2984, size: 1216, elements: !1721)
!1721 = !{!1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1720, file: !190, line: 2985, baseType: !1709, size: 960)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1720, file: !190, line: 2986, baseType: !1551, size: 64, offset: 960)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1720, file: !190, line: 2987, baseType: !1551, size: 64, offset: 1024)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1720, file: !190, line: 2988, baseType: !1551, size: 64, offset: 1088)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1720, file: !190, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1720, file: !190, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1720, file: !190, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1720, file: !190, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1720, file: !190, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1720, file: !190, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1720, file: !190, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1720, file: !190, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1720, file: !190, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1720, file: !190, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1720, file: !190, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1720, file: !190, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1720, file: !190, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1720, file: !190, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1717, file: !190, line: 3117, baseType: !1551, size: 64, offset: 1216)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1717, file: !190, line: 3119, baseType: !1551, size: 64, offset: 1280)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1717, file: !190, line: 3121, baseType: !1551, size: 64, offset: 1344)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1717, file: !190, line: 3123, baseType: !1551, size: 64, offset: 1408)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1554, file: !190, line: 3385, baseType: !1745, size: 1088)
!1745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !190, line: 2874, size: 1088, elements: !1746)
!1746 = !{!1747, !1748, !1749}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1745, file: !190, line: 2875, baseType: !1709, size: 960)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1745, file: !190, line: 2876, baseType: !1713, size: 64, offset: 960)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1745, file: !190, line: 2877, baseType: !1750, size: 64, offset: 1024)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1752, line: 172, size: 128, elements: !1753)
!1752 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1753 = !{!1754, !1755, !1756, !1757, !1758, !1759, !1760}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1751, file: !1752, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1751, file: !1752, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1751, file: !1752, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1751, file: !1752, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1751, file: !1752, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1751, file: !1752, line: 195, baseType: !7, size: 32, offset: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1751, file: !1752, line: 199, baseType: !1551, size: 64, offset: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1554, file: !190, line: 3386, baseType: !1720, size: 1216)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1554, file: !190, line: 3387, baseType: !1763, size: 1280)
!1763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !190, line: 3093, size: 1280, elements: !1764)
!1764 = !{!1765, !1766}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1763, file: !190, line: 3094, baseType: !1720, size: 1216)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1763, file: !190, line: 3095, baseType: !1750, size: 64, offset: 1216)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1554, file: !190, line: 3388, baseType: !1768, size: 1216)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !190, line: 2824, size: 1216, elements: !1769)
!1769 = !{!1770, !1771, !1772, !1773, !1774, !1775}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1768, file: !190, line: 2825, baseType: !1671, size: 896)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1768, file: !190, line: 2827, baseType: !1551, size: 64, offset: 896)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1768, file: !190, line: 2828, baseType: !1551, size: 64, offset: 960)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1768, file: !190, line: 2829, baseType: !1551, size: 64, offset: 1024)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1768, file: !190, line: 2830, baseType: !1551, size: 64, offset: 1088)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1768, file: !190, line: 2831, baseType: !1551, size: 64, offset: 1152)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1554, file: !190, line: 3389, baseType: !1777, size: 1024)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !190, line: 2850, size: 1024, elements: !1778)
!1778 = !{!1779, !1780, !1781}
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1777, file: !190, line: 2851, baseType: !1709, size: 960)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1777, file: !190, line: 2852, baseType: !1632, size: 32, offset: 960)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1777, file: !190, line: 2853, baseType: !1632, size: 32, offset: 992)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1554, file: !190, line: 3390, baseType: !1783, size: 1024)
!1783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !190, line: 2857, size: 1024, elements: !1784)
!1784 = !{!1785, !1786}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1783, file: !190, line: 2858, baseType: !1709, size: 960)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1783, file: !190, line: 2859, baseType: !1750, size: 64, offset: 960)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1554, file: !190, line: 3391, baseType: !1788, size: 960)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !190, line: 2862, size: 960, elements: !1789)
!1789 = !{!1790}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1788, file: !190, line: 2863, baseType: !1709, size: 960)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1554, file: !190, line: 3392, baseType: !1792, size: 1472)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !190, line: 3304, size: 1472, elements: !1793)
!1793 = !{!1794}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1792, file: !190, line: 3305, baseType: !1717, size: 1472)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1554, file: !190, line: 3393, baseType: !1796, size: 1792)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !190, line: 3248, size: 1792, elements: !1797)
!1797 = !{!1798, !1799, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1796, file: !190, line: 3249, baseType: !1717, size: 1472)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1796, file: !190, line: 3251, baseType: !1800, size: 64, offset: 1472)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64)
!1801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1802, line: 463, size: 1152, elements: !1803)
!1802 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1803 = !{!1804, !1807, !2127, !2128, !2301, !2304, !2305, !2306, !2307, !2308, !2309, !2333, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1801, file: !1802, line: 464, baseType: !1805, size: 64)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64)
!1806 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1802, line: 464, flags: DIFlagFwdDecl)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1801, file: !1802, line: 467, baseType: !1808, size: 64, offset: 64)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !385, line: 374, size: 640, elements: !1810)
!1810 = !{!1811, !2102, !2103, !2116, !2117, !2118, !2119, !2120, !2121, !2123, !2125, !2126}
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1809, file: !385, line: 377, baseType: !1812, size: 64)
!1812 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1552, line: 111, baseType: !1813)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64)
!1814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !385, line: 217, size: 832, elements: !1815)
!1815 = !{!1816, !2065, !2066, !2067, !2070, !2076, !2077, !2078, !2096, !2097, !2098, !2099, !2100, !2101}
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1814, file: !385, line: 219, baseType: !1817, size: 64)
!1817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1818, size: 64)
!1818 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !385, line: 151, baseType: !1819)
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !385, line: 151, size: 128, elements: !1820)
!1820 = !{!1821}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1819, file: !385, line: 151, baseType: !1822, size: 128)
!1822 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !385, line: 150, baseType: !1823)
!1823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !385, line: 150, size: 128, elements: !1824)
!1824 = !{!1825, !1826, !1827}
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1823, file: !385, line: 150, baseType: !7, size: 32)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1823, file: !385, line: 150, baseType: !7, size: 32, offset: 32)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1823, file: !385, line: 150, baseType: !1828, size: 64, offset: 64)
!1828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1829, size: 64, elements: !1636)
!1829 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1552, line: 108, baseType: !1830)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64)
!1831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !385, line: 122, size: 512, elements: !1832)
!1832 = !{!1833, !1834, !1835, !2056, !2058, !2059, !2060, !2061, !2062, !2063}
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1831, file: !385, line: 124, baseType: !1813, size: 64)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1831, file: !385, line: 125, baseType: !1813, size: 64, offset: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1831, file: !385, line: 131, baseType: !1836, size: 64, offset: 128)
!1836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !385, line: 128, size: 64, elements: !1837)
!1837 = !{!1838, !2055}
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1836, file: !385, line: 129, baseType: !1839, size: 64)
!1839 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1552, line: 66, baseType: !1840)
!1840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1841, size: 64)
!1841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1209, line: 143, size: 192, elements: !1842)
!1842 = !{!1843, !2053, !2054}
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1841, file: !1209, line: 145, baseType: !1844, size: 64)
!1844 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1552, line: 69, baseType: !1845)
!1845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1846, size: 64)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1209, line: 136, size: 192, elements: !1847)
!1847 = !{!1848, !2051, !2052}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1846, file: !1209, line: 137, baseType: !1849, size: 64)
!1849 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1552, line: 58, baseType: !1850)
!1850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1851, size: 64)
!1851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1209, line: 737, size: 768, elements: !1852)
!1852 = !{!1853, !1870, !1904, !1910, !1915, !1920, !1927, !1933, !1939, !1944, !1958, !1963, !1969, !1974, !1986, !1991, !2009, !2016, !2023, !2029, !2034, !2040, !2046}
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1851, file: !1209, line: 738, baseType: !1854, size: 256)
!1854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1209, line: 271, size: 256, elements: !1855)
!1855 = !{!1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869}
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1854, file: !1209, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1854, file: !1209, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1854, file: !1209, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1854, file: !1209, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1854, file: !1209, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1854, file: !1209, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1854, file: !1209, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1854, file: !1209, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1854, file: !1209, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1854, file: !1209, line: 312, baseType: !7, size: 32, offset: 32)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1854, file: !1209, line: 316, baseType: !1663, size: 32, offset: 64)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1854, file: !1209, line: 319, baseType: !7, size: 32, offset: 96)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1854, file: !1209, line: 323, baseType: !1813, size: 64, offset: 128)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1854, file: !1209, line: 327, baseType: !1551, size: 64, offset: 192)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1851, file: !1209, line: 739, baseType: !1871, size: 448)
!1871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1209, line: 350, size: 448, elements: !1872)
!1872 = !{!1873, !1902}
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1871, file: !1209, line: 353, baseType: !1874, size: 384)
!1874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1209, line: 333, size: 384, elements: !1875)
!1875 = !{!1876, !1877, !1885}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1874, file: !1209, line: 336, baseType: !1854, size: 256)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1874, file: !1209, line: 343, baseType: !1878, size: 64, offset: 256)
!1878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1879, size: 64)
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1880, line: 37, size: 128, elements: !1881)
!1880 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1881 = !{!1882, !1883}
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1879, file: !1880, line: 39, baseType: !1878, size: 64)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1879, file: !1880, line: 40, baseType: !1884, size: 64, offset: 64)
!1884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1874, file: !1209, line: 344, baseType: !1886, size: 64, offset: 320)
!1886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1887, size: 64)
!1887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1880, line: 45, size: 320, elements: !1888)
!1888 = !{!1889, !1890}
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1887, file: !1880, line: 47, baseType: !1886, size: 64)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1887, file: !1880, line: 48, baseType: !1891, size: 256, offset: 64)
!1891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !190, line: 1883, size: 256, elements: !1892)
!1892 = !{!1893, !1895, !1896, !1901}
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1891, file: !190, line: 1884, baseType: !1894, size: 64)
!1894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1891, size: 64)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1891, file: !190, line: 1885, baseType: !1894, size: 64, offset: 64)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1891, file: !190, line: 1891, baseType: !1897, size: 64, offset: 128)
!1897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1891, file: !190, line: 1891, size: 64, elements: !1898)
!1898 = !{!1899, !1900}
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1897, file: !190, line: 1891, baseType: !1849, size: 64)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1897, file: !190, line: 1891, baseType: !1551, size: 64)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1891, file: !190, line: 1892, baseType: !1884, size: 64, offset: 192)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1871, file: !1209, line: 359, baseType: !1903, size: 64, offset: 384)
!1903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1551, size: 64, elements: !1636)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1851, file: !1209, line: 740, baseType: !1905, size: 512)
!1905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1209, line: 365, size: 512, elements: !1906)
!1906 = !{!1907, !1908, !1909}
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1905, file: !1209, line: 368, baseType: !1874, size: 384)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1905, file: !1209, line: 373, baseType: !1551, size: 64, offset: 384)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1905, file: !1209, line: 374, baseType: !1551, size: 64, offset: 448)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1851, file: !1209, line: 741, baseType: !1911, size: 576)
!1911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1209, line: 380, size: 576, elements: !1912)
!1912 = !{!1913, !1914}
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1911, file: !1209, line: 383, baseType: !1905, size: 512)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1911, file: !1209, line: 389, baseType: !1903, size: 64, offset: 512)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1851, file: !1209, line: 742, baseType: !1916, size: 320)
!1916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1209, line: 395, size: 320, elements: !1917)
!1917 = !{!1918, !1919}
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1916, file: !1209, line: 397, baseType: !1854, size: 256)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1916, file: !1209, line: 400, baseType: !1839, size: 64, offset: 256)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1851, file: !1209, line: 743, baseType: !1921, size: 448)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1209, line: 406, size: 448, elements: !1922)
!1922 = !{!1923, !1924, !1925, !1926}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1921, file: !1209, line: 408, baseType: !1854, size: 256)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1921, file: !1209, line: 412, baseType: !1551, size: 64, offset: 256)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1921, file: !1209, line: 420, baseType: !1551, size: 64, offset: 320)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1921, file: !1209, line: 423, baseType: !1839, size: 64, offset: 384)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1851, file: !1209, line: 744, baseType: !1928, size: 384)
!1928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1209, line: 429, size: 384, elements: !1929)
!1929 = !{!1930, !1931, !1932}
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1928, file: !1209, line: 431, baseType: !1854, size: 256)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1928, file: !1209, line: 434, baseType: !1551, size: 64, offset: 256)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1928, file: !1209, line: 437, baseType: !1839, size: 64, offset: 320)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1851, file: !1209, line: 745, baseType: !1934, size: 384)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1209, line: 443, size: 384, elements: !1935)
!1935 = !{!1936, !1937, !1938}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1934, file: !1209, line: 445, baseType: !1854, size: 256)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1934, file: !1209, line: 449, baseType: !1551, size: 64, offset: 256)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1934, file: !1209, line: 453, baseType: !1839, size: 64, offset: 320)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1851, file: !1209, line: 746, baseType: !1940, size: 320)
!1940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1209, line: 459, size: 320, elements: !1941)
!1941 = !{!1942, !1943}
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1940, file: !1209, line: 461, baseType: !1854, size: 256)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1940, file: !1209, line: 464, baseType: !1551, size: 64, offset: 256)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1851, file: !1209, line: 747, baseType: !1945, size: 768)
!1945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1209, line: 469, size: 768, elements: !1946)
!1946 = !{!1947, !1948, !1949, !1950, !1951}
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1945, file: !1209, line: 471, baseType: !1854, size: 256)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1945, file: !1209, line: 474, baseType: !7, size: 32, offset: 256)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1945, file: !1209, line: 475, baseType: !7, size: 32, offset: 288)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1945, file: !1209, line: 478, baseType: !1551, size: 64, offset: 320)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1945, file: !1209, line: 481, baseType: !1952, size: 384, offset: 384)
!1952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1953, size: 384, elements: !1636)
!1953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !190, line: 1917, size: 384, elements: !1954)
!1954 = !{!1955, !1956, !1957}
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1953, file: !190, line: 1920, baseType: !1891, size: 256)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1953, file: !190, line: 1921, baseType: !1551, size: 64, offset: 256)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1953, file: !190, line: 1922, baseType: !1663, size: 32, offset: 320)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1851, file: !1209, line: 748, baseType: !1959, size: 320)
!1959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1209, line: 487, size: 320, elements: !1960)
!1960 = !{!1961, !1962}
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1959, file: !1209, line: 490, baseType: !1854, size: 256)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1959, file: !1209, line: 494, baseType: !1632, size: 32, offset: 256)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1851, file: !1209, line: 749, baseType: !1964, size: 384)
!1964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1209, line: 500, size: 384, elements: !1965)
!1965 = !{!1966, !1967, !1968}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1964, file: !1209, line: 502, baseType: !1854, size: 256)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1964, file: !1209, line: 506, baseType: !1839, size: 64, offset: 256)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1964, file: !1209, line: 510, baseType: !1839, size: 64, offset: 320)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1851, file: !1209, line: 750, baseType: !1970, size: 320)
!1970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1209, line: 529, size: 320, elements: !1971)
!1971 = !{!1972, !1973}
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1970, file: !1209, line: 531, baseType: !1854, size: 256)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1970, file: !1209, line: 540, baseType: !1839, size: 64, offset: 256)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1851, file: !1209, line: 751, baseType: !1975, size: 704)
!1975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1209, line: 546, size: 704, elements: !1976)
!1976 = !{!1977, !1978, !1981, !1982, !1983, !1984, !1985}
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1975, file: !1209, line: 549, baseType: !1905, size: 512)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1975, file: !1209, line: 553, baseType: !1979, size: 64, offset: 512)
!1979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1980, size: 64)
!1980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1635)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1975, file: !1209, line: 557, baseType: !1655, size: 8, offset: 576)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1975, file: !1209, line: 558, baseType: !1655, size: 8, offset: 584)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1975, file: !1209, line: 559, baseType: !1655, size: 8, offset: 592)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1975, file: !1209, line: 560, baseType: !1655, size: 8, offset: 600)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1975, file: !1209, line: 566, baseType: !1903, size: 64, offset: 640)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1851, file: !1209, line: 752, baseType: !1987, size: 384)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1209, line: 571, size: 384, elements: !1988)
!1988 = !{!1989, !1990}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1987, file: !1209, line: 573, baseType: !1916, size: 320)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1987, file: !1209, line: 577, baseType: !1551, size: 64, offset: 320)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1851, file: !1209, line: 753, baseType: !1992, size: 576)
!1992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1209, line: 600, size: 576, elements: !1993)
!1993 = !{!1994, !1995, !1996, !1999, !2008}
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1992, file: !1209, line: 602, baseType: !1916, size: 320)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1992, file: !1209, line: 605, baseType: !1551, size: 64, offset: 320)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1992, file: !1209, line: 609, baseType: !1997, size: 64, offset: 384)
!1997 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1998, line: 46, baseType: !1605)
!1998 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1992, file: !1209, line: 612, baseType: !2000, size: 64, offset: 448)
!2000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2001, size: 64)
!2001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1209, line: 581, size: 320, elements: !2002)
!2002 = !{!2003, !2004, !2005, !2006, !2007}
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2001, file: !1209, line: 583, baseType: !189, size: 32)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2001, file: !1209, line: 586, baseType: !1551, size: 64, offset: 64)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2001, file: !1209, line: 589, baseType: !1551, size: 64, offset: 128)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2001, file: !1209, line: 592, baseType: !1551, size: 64, offset: 192)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2001, file: !1209, line: 595, baseType: !1551, size: 64, offset: 256)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1992, file: !1209, line: 616, baseType: !1839, size: 64, offset: 512)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1851, file: !1209, line: 754, baseType: !2010, size: 512)
!2010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1209, line: 622, size: 512, elements: !2011)
!2011 = !{!2012, !2013, !2014, !2015}
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2010, file: !1209, line: 624, baseType: !1916, size: 320)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2010, file: !1209, line: 628, baseType: !1551, size: 64, offset: 320)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2010, file: !1209, line: 632, baseType: !1551, size: 64, offset: 384)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2010, file: !1209, line: 636, baseType: !1551, size: 64, offset: 448)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1851, file: !1209, line: 755, baseType: !2017, size: 704)
!2017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1209, line: 642, size: 704, elements: !2018)
!2018 = !{!2019, !2020, !2021, !2022}
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2017, file: !1209, line: 644, baseType: !2010, size: 512)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2017, file: !1209, line: 648, baseType: !1551, size: 64, offset: 512)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2017, file: !1209, line: 652, baseType: !1551, size: 64, offset: 576)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2017, file: !1209, line: 653, baseType: !1551, size: 64, offset: 640)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1851, file: !1209, line: 756, baseType: !2024, size: 448)
!2024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1209, line: 663, size: 448, elements: !2025)
!2025 = !{!2026, !2027, !2028}
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2024, file: !1209, line: 665, baseType: !1916, size: 320)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2024, file: !1209, line: 668, baseType: !1551, size: 64, offset: 320)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2024, file: !1209, line: 673, baseType: !1551, size: 64, offset: 384)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1851, file: !1209, line: 757, baseType: !2030, size: 384)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1209, line: 694, size: 384, elements: !2031)
!2031 = !{!2032, !2033}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2030, file: !1209, line: 696, baseType: !1916, size: 320)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2030, file: !1209, line: 699, baseType: !1551, size: 64, offset: 320)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1851, file: !1209, line: 758, baseType: !2035, size: 384)
!2035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1209, line: 681, size: 384, elements: !2036)
!2036 = !{!2037, !2038, !2039}
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2035, file: !1209, line: 683, baseType: !1854, size: 256)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2035, file: !1209, line: 686, baseType: !1551, size: 64, offset: 256)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2035, file: !1209, line: 689, baseType: !1551, size: 64, offset: 320)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1851, file: !1209, line: 759, baseType: !2041, size: 384)
!2041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1209, line: 707, size: 384, elements: !2042)
!2042 = !{!2043, !2044, !2045}
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2041, file: !1209, line: 709, baseType: !1854, size: 256)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2041, file: !1209, line: 712, baseType: !1551, size: 64, offset: 256)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2041, file: !1209, line: 712, baseType: !1551, size: 64, offset: 320)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1851, file: !1209, line: 760, baseType: !2047, size: 320)
!2047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1209, line: 718, size: 320, elements: !2048)
!2048 = !{!2049, !2050}
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2047, file: !1209, line: 720, baseType: !1854, size: 256)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2047, file: !1209, line: 723, baseType: !1551, size: 64, offset: 256)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1846, file: !1209, line: 138, baseType: !1845, size: 64, offset: 64)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1846, file: !1209, line: 139, baseType: !1845, size: 64, offset: 128)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1841, file: !1209, line: 146, baseType: !1844, size: 64, offset: 64)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1841, file: !1209, line: 152, baseType: !1839, size: 64, offset: 128)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1836, file: !385, line: 130, baseType: !1713, size: 64)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1831, file: !385, line: 134, baseType: !2057, size: 64, offset: 192)
!2057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1831, file: !385, line: 137, baseType: !1551, size: 64, offset: 256)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1831, file: !385, line: 138, baseType: !1663, size: 32, offset: 320)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1831, file: !385, line: 142, baseType: !7, size: 32, offset: 352)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1831, file: !385, line: 144, baseType: !1632, size: 32, offset: 384)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1831, file: !385, line: 145, baseType: !1632, size: 32, offset: 416)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1831, file: !385, line: 146, baseType: !2064, size: 64, offset: 448)
!2064 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !385, line: 119, baseType: !1607)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1814, file: !385, line: 220, baseType: !1817, size: 64, offset: 64)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1814, file: !385, line: 223, baseType: !2057, size: 64, offset: 128)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1814, file: !385, line: 226, baseType: !2068, size: 64, offset: 192)
!2068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2069, size: 64)
!2069 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !385, line: 185, flags: DIFlagFwdDecl)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1814, file: !385, line: 229, baseType: !2071, size: 128, offset: 256)
!2071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2072, size: 128, elements: !2074)
!2072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2073, size: 64)
!2073 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !385, line: 229, flags: DIFlagFwdDecl)
!2074 = !{!2075}
!2075 = !DISubrange(count: 2)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1814, file: !385, line: 232, baseType: !1813, size: 64, offset: 384)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1814, file: !385, line: 233, baseType: !1813, size: 64, offset: 448)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1814, file: !385, line: 238, baseType: !2079, size: 64, offset: 512)
!2079 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !385, line: 235, size: 64, elements: !2080)
!2080 = !{!2081, !2087}
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2079, file: !385, line: 236, baseType: !2082, size: 64)
!2082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2083, size: 64)
!2083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !385, line: 273, size: 128, elements: !2084)
!2084 = !{!2085, !2086}
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2083, file: !385, line: 275, baseType: !1839, size: 64)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2083, file: !385, line: 278, baseType: !1839, size: 64, offset: 64)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2079, file: !385, line: 237, baseType: !2088, size: 64)
!2088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2089, size: 64)
!2089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !385, line: 259, size: 320, elements: !2090)
!2090 = !{!2091, !2092, !2093, !2094, !2095}
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2089, file: !385, line: 261, baseType: !1713, size: 64)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2089, file: !385, line: 262, baseType: !1713, size: 64, offset: 64)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2089, file: !385, line: 266, baseType: !1713, size: 64, offset: 128)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2089, file: !385, line: 267, baseType: !1713, size: 64, offset: 192)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2089, file: !385, line: 270, baseType: !1632, size: 32, offset: 256)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1814, file: !385, line: 241, baseType: !2064, size: 64, offset: 576)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1814, file: !385, line: 244, baseType: !1632, size: 32, offset: 640)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1814, file: !385, line: 247, baseType: !1632, size: 32, offset: 672)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1814, file: !385, line: 250, baseType: !1632, size: 32, offset: 704)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1814, file: !385, line: 253, baseType: !1632, size: 32, offset: 736)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1814, file: !385, line: 256, baseType: !1632, size: 32, offset: 768)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1809, file: !385, line: 378, baseType: !1812, size: 64, offset: 64)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1809, file: !385, line: 381, baseType: !2104, size: 64, offset: 128)
!2104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2105, size: 64)
!2105 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !385, line: 282, baseType: !2106)
!2106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !385, line: 282, size: 128, elements: !2107)
!2107 = !{!2108}
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2106, file: !385, line: 282, baseType: !2109, size: 128)
!2109 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !385, line: 281, baseType: !2110)
!2110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !385, line: 281, size: 128, elements: !2111)
!2111 = !{!2112, !2113, !2114}
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2110, file: !385, line: 281, baseType: !7, size: 32)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2110, file: !385, line: 281, baseType: !7, size: 32, offset: 32)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2110, file: !385, line: 281, baseType: !2115, size: 64, offset: 64)
!2115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1812, size: 64, elements: !1636)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1809, file: !385, line: 384, baseType: !1632, size: 32, offset: 192)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1809, file: !385, line: 387, baseType: !1632, size: 32, offset: 224)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1809, file: !385, line: 390, baseType: !1632, size: 32, offset: 256)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1809, file: !385, line: 394, baseType: !2104, size: 64, offset: 320)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1809, file: !385, line: 396, baseType: !384, size: 32, offset: 384)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1809, file: !385, line: 399, baseType: !2122, size: 64, offset: 416)
!2122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !2074)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1809, file: !385, line: 402, baseType: !2124, size: 64, offset: 480)
!2124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2074)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1809, file: !385, line: 406, baseType: !1632, size: 32, offset: 544)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1809, file: !385, line: 409, baseType: !1632, size: 32, offset: 576)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1801, file: !1802, line: 470, baseType: !1840, size: 64, offset: 128)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1801, file: !1802, line: 473, baseType: !2129, size: 64, offset: 192)
!2129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2130, size: 64)
!2130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1752, line: 39, size: 1152, elements: !2131)
!2131 = !{!2132, !2182, !2195, !2207, !2208, !2278, !2279, !2283, !2284, !2285, !2286, !2287}
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !2130, file: !1752, line: 41, baseType: !2133, size: 64)
!2133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2134, line: 144, baseType: !2135)
!2134 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2136, size: 64)
!2136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2134, line: 100, size: 896, elements: !2137)
!2137 = !{!2138, !2146, !2151, !2156, !2158, !2159, !2160, !2161, !2162, !2163, !2168, !2170, !2171, !2176, !2181}
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2136, file: !2134, line: 102, baseType: !2139, size: 64)
!2139 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2134, line: 52, baseType: !2140)
!2140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2141, size: 64)
!2141 = !DISubroutineType(types: !2142)
!2142 = !{!2143, !2144}
!2143 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2134, line: 47, baseType: !7)
!2144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2145, size: 64)
!2145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2136, file: !2134, line: 105, baseType: !2147, size: 64, offset: 64)
!2147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2134, line: 59, baseType: !2148)
!2148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2149, size: 64)
!2149 = !DISubroutineType(types: !2150)
!2150 = !{!1632, !2144, !2144}
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2136, file: !2134, line: 108, baseType: !2152, size: 64, offset: 128)
!2152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2134, line: 63, baseType: !2153)
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DISubroutineType(types: !2155)
!2155 = !{null, !2057}
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2136, file: !2134, line: 111, baseType: !2157, size: 64, offset: 192)
!2157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2057, size: 64)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2136, file: !2134, line: 114, baseType: !1997, size: 64, offset: 256)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2136, file: !2134, line: 117, baseType: !1997, size: 64, offset: 320)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2136, file: !2134, line: 120, baseType: !1997, size: 64, offset: 384)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2136, file: !2134, line: 124, baseType: !7, size: 32, offset: 448)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2136, file: !2134, line: 128, baseType: !7, size: 32, offset: 480)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2136, file: !2134, line: 131, baseType: !2164, size: 64, offset: 512)
!2164 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2134, line: 75, baseType: !2165)
!2165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2166, size: 64)
!2166 = !DISubroutineType(types: !2167)
!2167 = !{!2057, !1997, !1997}
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2136, file: !2134, line: 132, baseType: !2169, size: 64, offset: 576)
!2169 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2134, line: 78, baseType: !2153)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2136, file: !2134, line: 135, baseType: !2057, size: 64, offset: 640)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2136, file: !2134, line: 136, baseType: !2172, size: 64, offset: 704)
!2172 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2134, line: 82, baseType: !2173)
!2173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2174, size: 64)
!2174 = !DISubroutineType(types: !2175)
!2175 = !{!2057, !2057, !1997, !1997}
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2136, file: !2134, line: 137, baseType: !2177, size: 64, offset: 768)
!2177 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2134, line: 83, baseType: !2178)
!2178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2179, size: 64)
!2179 = !DISubroutineType(types: !2180)
!2180 = !{null, !2057, !2057}
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2136, file: !2134, line: 141, baseType: !7, size: 32, offset: 832)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !2130, file: !1752, line: 48, baseType: !2183, size: 64, offset: 64)
!2183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2184, size: 64)
!2184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !1209, line: 35, baseType: !2185)
!2185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !1209, line: 35, size: 128, elements: !2186)
!2186 = !{!2187}
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2185, file: !1209, line: 35, baseType: !2188, size: 128)
!2188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !1209, line: 33, baseType: !2189)
!2189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !1209, line: 33, size: 128, elements: !2190)
!2190 = !{!2191, !2192, !2193}
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2189, file: !1209, line: 33, baseType: !7, size: 32)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2189, file: !1209, line: 33, baseType: !7, size: 32, offset: 32)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2189, file: !1209, line: 33, baseType: !2194, size: 64, offset: 64)
!2194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1849, size: 64, elements: !1636)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !2130, file: !1752, line: 51, baseType: !2196, size: 64, offset: 128)
!2196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2197, size: 64)
!2197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !190, line: 183, baseType: !2198)
!2198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !190, line: 183, size: 128, elements: !2199)
!2199 = !{!2200}
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2198, file: !190, line: 183, baseType: !2201, size: 128)
!2201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !190, line: 182, baseType: !2202)
!2202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !190, line: 182, size: 128, elements: !2203)
!2203 = !{!2204, !2205, !2206}
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2202, file: !190, line: 182, baseType: !7, size: 32)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2202, file: !190, line: 182, baseType: !7, size: 32, offset: 32)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2202, file: !190, line: 182, baseType: !1903, size: 64, offset: 64)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !2130, file: !1752, line: 54, baseType: !1551, size: 64, offset: 192)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2130, file: !1752, line: 57, baseType: !2209, size: 128, offset: 256)
!2209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !2210, line: 31, size: 128, elements: !2211)
!2210 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2211 = !{!2212, !2213, !2214, !2215, !2216, !2217, !2218}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !2209, file: !2210, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !2209, file: !2210, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2209, file: !2210, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !2209, file: !2210, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !2209, file: !2210, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !2209, file: !2210, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2209, file: !2210, line: 56, baseType: !2219, size: 64, offset: 64)
!2219 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1552, line: 47, baseType: !2220)
!2220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2221, size: 64)
!2221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2222, line: 75, size: 256, elements: !2223)
!2222 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2223 = !{!2224, !2236, !2237, !2238}
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2221, file: !2222, line: 76, baseType: !2225, size: 64)
!2225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2226, size: 64)
!2226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2222, line: 68, baseType: !2227)
!2227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2222, line: 63, size: 320, elements: !2228)
!2228 = !{!2229, !2231, !2232, !2233}
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2227, file: !2222, line: 64, baseType: !2230, size: 64)
!2230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2227, size: 64)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2227, file: !2222, line: 65, baseType: !2230, size: 64, offset: 64)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2227, file: !2222, line: 66, baseType: !7, size: 32, offset: 128)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2227, file: !2222, line: 67, baseType: !2234, size: 128, offset: 192)
!2234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2235, size: 128, elements: !2074)
!2235 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2222, line: 29, baseType: !1605)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2221, file: !2222, line: 77, baseType: !2225, size: 64, offset: 64)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2221, file: !2222, line: 78, baseType: !7, size: 32, offset: 128)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2221, file: !2222, line: 79, baseType: !2239, size: 64, offset: 192)
!2239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2240, size: 64)
!2240 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2222, line: 49, baseType: !2241)
!2241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2222, line: 45, size: 832, elements: !2242)
!2242 = !{!2243, !2244, !2245}
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2241, file: !2222, line: 46, baseType: !2230, size: 64)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2241, file: !2222, line: 47, baseType: !2220, size: 64, offset: 64)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2241, file: !2222, line: 48, baseType: !2246, size: 704, offset: 128)
!2246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2247, line: 164, size: 704, elements: !2248)
!2247 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2248 = !{!2249, !2250, !2261, !2262, !2263, !2264, !2265, !2266, !2270, !2274, !2275, !2276, !2277}
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2246, file: !2247, line: 166, baseType: !1607, size: 64)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2246, file: !2247, line: 167, baseType: !2251, size: 64, offset: 64)
!2251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2252, size: 64)
!2252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2247, line: 157, size: 192, elements: !2253)
!2253 = !{!2254, !2256, !2257}
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2252, file: !2247, line: 159, baseType: !2255, size: 64)
!2255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2252, file: !2247, line: 160, baseType: !2251, size: 64, offset: 64)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2252, file: !2247, line: 161, baseType: !2258, size: 32, offset: 128)
!2258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1635, size: 32, elements: !2259)
!2259 = !{!2260}
!2260 = !DISubrange(count: 4)
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2246, file: !2247, line: 168, baseType: !2255, size: 64, offset: 128)
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2246, file: !2247, line: 169, baseType: !2255, size: 64, offset: 192)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2246, file: !2247, line: 170, baseType: !2255, size: 64, offset: 256)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2246, file: !2247, line: 171, baseType: !1607, size: 64, offset: 320)
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2246, file: !2247, line: 172, baseType: !1632, size: 32, offset: 384)
!2266 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2246, file: !2247, line: 176, baseType: !2267, size: 64, offset: 448)
!2267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2268, size: 64)
!2268 = !DISubroutineType(types: !2269)
!2269 = !{!2251, !2057, !1607}
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2246, file: !2247, line: 177, baseType: !2271, size: 64, offset: 512)
!2271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2272, size: 64)
!2272 = !DISubroutineType(types: !2273)
!2273 = !{null, !2057, !2251}
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2246, file: !2247, line: 178, baseType: !2057, size: 64, offset: 576)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2246, file: !2247, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2246, file: !2247, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2246, file: !2247, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !2130, file: !1752, line: 60, baseType: !2209, size: 128, offset: 384)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !2130, file: !1752, line: 64, baseType: !2280, size: 64, offset: 512)
!2280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2281, size: 64)
!2281 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !2282, line: 33, flags: DIFlagFwdDecl)
!2282 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !2130, file: !1752, line: 67, baseType: !1551, size: 64, offset: 576)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !2130, file: !1752, line: 73, baseType: !2133, size: 64, offset: 640)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !2130, file: !1752, line: 77, baseType: !2219, size: 64, offset: 704)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !2130, file: !1752, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !2130, file: !1752, line: 82, baseType: !2288, size: 320, offset: 832)
!2288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1880, line: 62, size: 320, elements: !2289)
!2289 = !{!2290, !2296, !2297, !2298, !2299, !2300}
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !2288, file: !1880, line: 63, baseType: !2291, size: 64)
!2291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2292, size: 64)
!2292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1880, line: 56, size: 128, elements: !2293)
!2293 = !{!2294, !2295}
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2292, file: !1880, line: 57, baseType: !2291, size: 64)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !2292, file: !1880, line: 58, baseType: !1634, size: 8, offset: 64)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !2288, file: !1880, line: 64, baseType: !7, size: 32, offset: 64)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !2288, file: !1880, line: 66, baseType: !7, size: 32, offset: 96)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !2288, file: !1880, line: 68, baseType: !1655, size: 8, offset: 128)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !2288, file: !1880, line: 70, baseType: !1878, size: 64, offset: 192)
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !2288, file: !1880, line: 71, baseType: !1886, size: 64, offset: 256)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1801, file: !1802, line: 476, baseType: !2302, size: 64, offset: 256)
!2302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2303, size: 64)
!2303 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1802, line: 476, flags: DIFlagFwdDecl)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1801, file: !1802, line: 479, baseType: !2133, size: 64, offset: 320)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1801, file: !1802, line: 484, baseType: !1551, size: 64, offset: 384)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1801, file: !1802, line: 488, baseType: !1551, size: 64, offset: 448)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1801, file: !1802, line: 493, baseType: !1551, size: 64, offset: 512)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1801, file: !1802, line: 496, baseType: !1551, size: 64, offset: 576)
!2309 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1801, file: !1802, line: 501, baseType: !2310, size: 64, offset: 640)
!2310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2311, size: 64)
!2311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !396, line: 2355, size: 576, elements: !2312)
!2312 = !{!2313, !2316, !2317, !2318, !2319, !2321, !2322, !2327, !2328, !2329, !2330, !2331, !2332}
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2311, file: !396, line: 2356, baseType: !2314, size: 64)
!2314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2315, size: 64)
!2315 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !396, line: 2356, flags: DIFlagFwdDecl)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2311, file: !396, line: 2357, baseType: !1979, size: 64, offset: 64)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2311, file: !396, line: 2358, baseType: !1632, size: 32, offset: 128)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2311, file: !396, line: 2359, baseType: !1632, size: 32, offset: 160)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2311, file: !396, line: 2360, baseType: !2320, size: 128, offset: 192)
!2320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1632, size: 128, elements: !2259)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2311, file: !396, line: 2364, baseType: !1632, size: 32, offset: 320)
