; ModuleID = 'tree-ssanames.c'
source_filename = "tree-ssanames.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!433 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!434 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!435 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!436 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!437 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!438 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!439 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!440 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!441 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!442 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!443 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!444 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!445 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!446 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!447 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!448 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!449 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!450 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!451 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !453, line: 51, baseType: !7, size: 32, elements: !454)
!453 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!455 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!459 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!460 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!470 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!471 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!472 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!473 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!474 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!475 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!477 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!478 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!479 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!480 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!481 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!482 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!483 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!484 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!485 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!486 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!487 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!488 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!489 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!490 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!491 = !{!492, !997, !573, !39, !1397, !1136, !7}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !493, line: 56, baseType: !494)
!493 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !496)
!496 = !{!497, !530, !536, !549, !556, !563, !568, !579, !585, !599, !611, !649, !657, !685, !702, !703, !708, !717, !723, !728, !732, !736, !1321, !1370, !1376, !1382, !1389, !1402, !1416, !1433, !1445, !1467, !1482, !1654}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !495, file: !6, line: 3372, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !498, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !498, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !498, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !498, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !498, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !498, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !498, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !498, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !498, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !498, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !498, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !498, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !498, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !498, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !498, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !498, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !498, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !498, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !498, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !498, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !498, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !498, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !498, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !498, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !498, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !498, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !498, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !498, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !498, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !498, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !495, file: !6, line: 3373, baseType: !531, size: 192)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !531, file: !6, line: 403, baseType: !498, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !531, file: !6, line: 404, baseType: !492, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !6, line: 405, baseType: !492, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !495, file: !6, line: 3374, baseType: !537, size: 320)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !537, file: !6, line: 1385, baseType: !531, size: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !537, file: !6, line: 1386, baseType: !541, size: 128, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !542, line: 58, baseType: !543)
!542 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 54, size: 128, elements: !544)
!544 = !{!545, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !543, file: !542, line: 56, baseType: !546, size: 64)
!546 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !543, file: !542, line: 57, baseType: !548, size: 64, offset: 64)
!548 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !495, file: !6, line: 3375, baseType: !550, size: 256)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !550, file: !6, line: 1398, baseType: !531, size: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !550, file: !6, line: 1399, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !495, file: !6, line: 3376, baseType: !557, size: 256)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !557, file: !6, line: 1409, baseType: !531, size: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !557, file: !6, line: 1410, baseType: !561, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !495, file: !6, line: 3377, baseType: !564, size: 256)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !564, file: !6, line: 1438, baseType: !531, size: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !564, file: !6, line: 1439, baseType: !492, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !495, file: !6, line: 3378, baseType: !569, size: 256)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !570)
!570 = !{!571, !572, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !569, file: !6, line: 1419, baseType: !531, size: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !569, file: !6, line: 1420, baseType: !573, size: 32, offset: 192)
!573 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !569, file: !6, line: 1421, baseType: !575, size: 8, offset: 224)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 8, elements: !577)
!576 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!577 = !{!578}
!578 = !DISubrange(count: 1)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !495, file: !6, line: 3379, baseType: !580, size: 320)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !6, line: 1429, baseType: !531, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !580, file: !6, line: 1430, baseType: !492, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !580, file: !6, line: 1431, baseType: !492, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !495, file: !6, line: 3380, baseType: !586, size: 320)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !6, line: 1461, baseType: !531, size: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !586, file: !6, line: 1462, baseType: !590, size: 128, offset: 192)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !591, line: 31, size: 128, elements: !592)
!591 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!592 = !{!593, !597, !598}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !590, file: !591, line: 32, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !590, file: !591, line: 33, baseType: !7, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !590, file: !591, line: 34, baseType: !7, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !495, file: !6, line: 3381, baseType: !600, size: 384)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !601)
!601 = !{!602, !603, !608, !609, !610}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !600, file: !6, line: 2508, baseType: !531, size: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !600, file: !6, line: 2509, baseType: !604, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !605, line: 58, baseType: !606)
!605 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !607, line: 44, baseType: !7)
!607 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!608 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !600, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !6, line: 2511, baseType: !492, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !600, file: !6, line: 2512, baseType: !492, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !495, file: !6, line: 3382, baseType: !612, size: 896)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !612, file: !6, line: 2653, baseType: !600, size: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !612, file: !6, line: 2654, baseType: !492, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !612, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !612, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !612, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !612, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !612, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !612, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !612, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !612, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !612, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !612, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !612, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !612, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !612, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !612, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !612, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !612, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !612, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !612, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !612, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !612, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !612, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !612, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !612, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !612, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !612, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !612, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !612, file: !6, line: 2705, baseType: !492, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !612, file: !6, line: 2706, baseType: !492, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !612, file: !6, line: 2707, baseType: !492, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !612, file: !6, line: 2708, baseType: !492, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !612, file: !6, line: 2711, baseType: !647, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !495, file: !6, line: 3383, baseType: !650, size: 960)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !650, file: !6, line: 2757, baseType: !612, size: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !650, file: !6, line: 2758, baseType: !654, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !493, line: 50, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !493, line: 49, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !495, file: !6, line: 3384, baseType: !658, size: 1472)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !659)
!659 = !{!660, !681, !682, !683, !684}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !6, line: 3115, baseType: !661, size: 1216)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !6, line: 2985, baseType: !650, size: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !661, file: !6, line: 2986, baseType: !492, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !661, file: !6, line: 2987, baseType: !492, size: 64, offset: 1024)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !661, file: !6, line: 2988, baseType: !492, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !661, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !661, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !661, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !661, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !661, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !661, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !661, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !661, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !661, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !661, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !661, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !661, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !661, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !661, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !658, file: !6, line: 3117, baseType: !492, size: 64, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !658, file: !6, line: 3119, baseType: !492, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !658, file: !6, line: 3121, baseType: !492, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !658, file: !6, line: 3123, baseType: !492, size: 64, offset: 1408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !495, file: !6, line: 3385, baseType: !686, size: 1088)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !6, line: 2875, baseType: !650, size: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !686, file: !6, line: 2876, baseType: !654, size: 64, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !686, file: !6, line: 2877, baseType: !691, size: 64, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !693, line: 172, size: 128, elements: !694)
!693 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !692, file: !693, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !692, file: !693, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !692, file: !693, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !692, file: !693, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !692, file: !693, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !692, file: !693, line: 195, baseType: !7, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !692, file: !693, line: 199, baseType: !492, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !495, file: !6, line: 3386, baseType: !661, size: 1216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !495, file: !6, line: 3387, baseType: !704, size: 1280)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !6, line: 3094, baseType: !661, size: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !704, file: !6, line: 3095, baseType: !691, size: 64, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !495, file: !6, line: 3388, baseType: !709, size: 1216)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !6, line: 2825, baseType: !612, size: 896)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !709, file: !6, line: 2827, baseType: !492, size: 64, offset: 896)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !709, file: !6, line: 2828, baseType: !492, size: 64, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !709, file: !6, line: 2829, baseType: !492, size: 64, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !709, file: !6, line: 2830, baseType: !492, size: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !709, file: !6, line: 2831, baseType: !492, size: 64, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !495, file: !6, line: 3389, baseType: !718, size: 1024)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !718, file: !6, line: 2851, baseType: !650, size: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !718, file: !6, line: 2852, baseType: !573, size: 32, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !718, file: !6, line: 2853, baseType: !573, size: 32, offset: 992)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !495, file: !6, line: 3390, baseType: !724, size: 1024)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !724, file: !6, line: 2858, baseType: !650, size: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !724, file: !6, line: 2859, baseType: !691, size: 64, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !495, file: !6, line: 3391, baseType: !729, size: 960)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !729, file: !6, line: 2863, baseType: !650, size: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !495, file: !6, line: 3392, baseType: !733, size: 1472)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !6, line: 3305, baseType: !658, size: 1472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !495, file: !6, line: 3393, baseType: !737, size: 1792)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !738)
!738 = !{!739, !740, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !6, line: 3249, baseType: !658, size: 1472)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !737, file: !6, line: 3251, baseType: !741, size: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !743, line: 463, size: 1152, elements: !744)
!743 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!744 = !{!745, !748, !1067, !1068, !1241, !1244, !1245, !1246, !1247, !1248, !1249, !1273, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !742, file: !743, line: 464, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !743, line: 464, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !742, file: !743, line: 467, baseType: !749, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !234, line: 374, size: 640, elements: !751)
!751 = !{!752, !1042, !1043, !1056, !1057, !1058, !1059, !1060, !1061, !1063, !1065, !1066}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !750, file: !234, line: 377, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !493, line: 111, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !234, line: 217, size: 832, elements: !756)
!756 = !{!757, !1005, !1006, !1007, !1010, !1016, !1017, !1018, !1036, !1037, !1038, !1039, !1040, !1041}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !755, file: !234, line: 219, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !234, line: 151, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !234, line: 151, size: 128, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !760, file: !234, line: 151, baseType: !763, size: 128)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !234, line: 150, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !234, line: 150, size: 128, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !764, file: !234, line: 150, baseType: !7, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !764, file: !234, line: 150, baseType: !7, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !764, file: !234, line: 150, baseType: !769, size: 64, offset: 64)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 64, elements: !577)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !493, line: 108, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !234, line: 122, size: 512, elements: !773)
!773 = !{!774, !775, !776, !996, !998, !999, !1000, !1001, !1002, !1003}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !772, file: !234, line: 124, baseType: !754, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !772, file: !234, line: 125, baseType: !754, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !772, file: !234, line: 131, baseType: !777, size: 64, offset: 128)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !234, line: 128, size: 64, elements: !778)
!778 = !{!779, !995}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !777, file: !234, line: 129, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !493, line: 66, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !453, line: 143, size: 192, elements: !783)
!783 = !{!784, !993, !994}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !782, file: !453, line: 145, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !493, line: 69, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !453, line: 136, size: 192, elements: !788)
!788 = !{!789, !991, !992}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !787, file: !453, line: 137, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !493, line: 58, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !453, line: 737, size: 768, elements: !793)
!793 = !{!794, !811, !844, !850, !855, !860, !867, !873, !879, !884, !898, !903, !909, !914, !926, !931, !949, !956, !963, !969, !974, !980, !986}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !792, file: !453, line: 738, baseType: !795, size: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !453, line: 271, size: 256, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !795, file: !453, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !795, file: !453, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !795, file: !453, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !795, file: !453, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !795, file: !453, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !795, file: !453, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !795, file: !453, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !795, file: !453, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !795, file: !453, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !795, file: !453, line: 312, baseType: !7, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !795, file: !453, line: 316, baseType: !604, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !795, file: !453, line: 319, baseType: !7, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !795, file: !453, line: 323, baseType: !754, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !795, file: !453, line: 327, baseType: !492, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !792, file: !453, line: 739, baseType: !812, size: 448)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !453, line: 350, size: 448, elements: !813)
!813 = !{!814, !842}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !812, file: !453, line: 353, baseType: !815, size: 384)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !453, line: 333, size: 384, elements: !816)
!816 = !{!817, !818, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !815, file: !453, line: 336, baseType: !795, size: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !815, file: !453, line: 343, baseType: !819, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !263, line: 37, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !263, line: 39, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !820, file: !263, line: 40, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !815, file: !453, line: 344, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !263, line: 45, size: 320, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !827, file: !263, line: 47, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !827, file: !263, line: 48, baseType: !831, size: 256, offset: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !832)
!832 = !{!833, !835, !836, !841}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !831, file: !6, line: 1884, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !6, line: 1885, baseType: !834, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !831, file: !6, line: 1891, baseType: !837, size: 64, offset: 128)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !831, file: !6, line: 1891, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !837, file: !6, line: 1891, baseType: !790, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !837, file: !6, line: 1891, baseType: !492, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !831, file: !6, line: 1892, baseType: !824, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !812, file: !453, line: 359, baseType: !843, size: 64, offset: 384)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 64, elements: !577)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !792, file: !453, line: 740, baseType: !845, size: 512)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !453, line: 365, size: 512, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !845, file: !453, line: 368, baseType: !815, size: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !845, file: !453, line: 373, baseType: !492, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !845, file: !453, line: 374, baseType: !492, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !792, file: !453, line: 741, baseType: !851, size: 576)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !453, line: 380, size: 576, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !851, file: !453, line: 383, baseType: !845, size: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !851, file: !453, line: 389, baseType: !843, size: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !792, file: !453, line: 742, baseType: !856, size: 320)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !453, line: 395, size: 320, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !856, file: !453, line: 397, baseType: !795, size: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !856, file: !453, line: 400, baseType: !780, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !792, file: !453, line: 743, baseType: !861, size: 448)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !453, line: 406, size: 448, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !861, file: !453, line: 408, baseType: !795, size: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !861, file: !453, line: 412, baseType: !492, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !861, file: !453, line: 420, baseType: !492, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !861, file: !453, line: 423, baseType: !780, size: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !792, file: !453, line: 744, baseType: !868, size: 384)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !453, line: 429, size: 384, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !868, file: !453, line: 431, baseType: !795, size: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !868, file: !453, line: 434, baseType: !492, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !868, file: !453, line: 437, baseType: !780, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !792, file: !453, line: 745, baseType: !874, size: 384)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !453, line: 443, size: 384, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !453, line: 445, baseType: !795, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !874, file: !453, line: 449, baseType: !492, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !874, file: !453, line: 453, baseType: !780, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !792, file: !453, line: 746, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !453, line: 459, size: 320, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !880, file: !453, line: 461, baseType: !795, size: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !880, file: !453, line: 464, baseType: !492, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !792, file: !453, line: 747, baseType: !885, size: 768)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !453, line: 469, size: 768, elements: !886)
!886 = !{!887, !888, !889, !890, !891}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !885, file: !453, line: 471, baseType: !795, size: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !885, file: !453, line: 474, baseType: !7, size: 32, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !885, file: !453, line: 475, baseType: !7, size: 32, offset: 288)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !885, file: !453, line: 478, baseType: !492, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !885, file: !453, line: 481, baseType: !892, size: 384, offset: 384)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 384, elements: !577)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !893, file: !6, line: 1920, baseType: !831, size: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !893, file: !6, line: 1921, baseType: !492, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !893, file: !6, line: 1922, baseType: !604, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !792, file: !453, line: 748, baseType: !899, size: 320)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !453, line: 487, size: 320, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !899, file: !453, line: 490, baseType: !795, size: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !899, file: !453, line: 494, baseType: !573, size: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !792, file: !453, line: 749, baseType: !904, size: 384)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !453, line: 500, size: 384, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !904, file: !453, line: 502, baseType: !795, size: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !904, file: !453, line: 506, baseType: !780, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !904, file: !453, line: 510, baseType: !780, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !792, file: !453, line: 750, baseType: !910, size: 320)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !453, line: 529, size: 320, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !453, line: 531, baseType: !795, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !910, file: !453, line: 540, baseType: !780, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !792, file: !453, line: 751, baseType: !915, size: 704)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !453, line: 546, size: 704, elements: !916)
!916 = !{!917, !918, !921, !922, !923, !924, !925}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !915, file: !453, line: 549, baseType: !845, size: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !915, file: !453, line: 553, baseType: !919, size: 64, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !915, file: !453, line: 557, baseType: !596, size: 8, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !915, file: !453, line: 558, baseType: !596, size: 8, offset: 584)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !915, file: !453, line: 559, baseType: !596, size: 8, offset: 592)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !915, file: !453, line: 560, baseType: !596, size: 8, offset: 600)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !915, file: !453, line: 566, baseType: !843, size: 64, offset: 640)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !792, file: !453, line: 752, baseType: !927, size: 384)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !453, line: 571, size: 384, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !927, file: !453, line: 573, baseType: !856, size: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !453, line: 577, baseType: !492, size: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !792, file: !453, line: 753, baseType: !932, size: 576)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !453, line: 600, size: 576, elements: !933)
!933 = !{!934, !935, !936, !939, !948}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !932, file: !453, line: 602, baseType: !856, size: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !932, file: !453, line: 605, baseType: !492, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !932, file: !453, line: 609, baseType: !937, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !938, line: 46, baseType: !546)
!938 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!939 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !932, file: !453, line: 612, baseType: !940, size: 64, offset: 448)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !453, line: 581, size: 320, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !941, file: !453, line: 583, baseType: !39, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !941, file: !453, line: 586, baseType: !492, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !941, file: !453, line: 589, baseType: !492, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !941, file: !453, line: 592, baseType: !492, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !941, file: !453, line: 595, baseType: !492, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !932, file: !453, line: 616, baseType: !780, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !792, file: !453, line: 754, baseType: !950, size: 512)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !453, line: 622, size: 512, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !950, file: !453, line: 624, baseType: !856, size: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !950, file: !453, line: 628, baseType: !492, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !950, file: !453, line: 632, baseType: !492, size: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !950, file: !453, line: 636, baseType: !492, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !792, file: !453, line: 755, baseType: !957, size: 704)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !453, line: 642, size: 704, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !957, file: !453, line: 644, baseType: !950, size: 512)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !957, file: !453, line: 648, baseType: !492, size: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !957, file: !453, line: 652, baseType: !492, size: 64, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !957, file: !453, line: 653, baseType: !492, size: 64, offset: 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !792, file: !453, line: 756, baseType: !964, size: 448)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !453, line: 663, size: 448, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !964, file: !453, line: 665, baseType: !856, size: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !964, file: !453, line: 668, baseType: !492, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !964, file: !453, line: 673, baseType: !492, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !792, file: !453, line: 757, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !453, line: 694, size: 384, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !970, file: !453, line: 696, baseType: !856, size: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !970, file: !453, line: 699, baseType: !492, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !792, file: !453, line: 758, baseType: !975, size: 384)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !453, line: 681, size: 384, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !975, file: !453, line: 683, baseType: !795, size: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !975, file: !453, line: 686, baseType: !492, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !975, file: !453, line: 689, baseType: !492, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !792, file: !453, line: 759, baseType: !981, size: 384)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !453, line: 707, size: 384, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !981, file: !453, line: 709, baseType: !795, size: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !981, file: !453, line: 712, baseType: !492, size: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !981, file: !453, line: 712, baseType: !492, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !792, file: !453, line: 760, baseType: !987, size: 320)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !453, line: 718, size: 320, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !987, file: !453, line: 720, baseType: !795, size: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !987, file: !453, line: 723, baseType: !492, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !787, file: !453, line: 138, baseType: !786, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !453, line: 139, baseType: !786, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !782, file: !453, line: 146, baseType: !785, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !782, file: !453, line: 152, baseType: !780, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !777, file: !234, line: 130, baseType: !654, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !772, file: !234, line: 134, baseType: !997, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !772, file: !234, line: 137, baseType: !492, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !772, file: !234, line: 138, baseType: !604, size: 32, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !772, file: !234, line: 142, baseType: !7, size: 32, offset: 352)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !772, file: !234, line: 144, baseType: !573, size: 32, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !772, file: !234, line: 145, baseType: !573, size: 32, offset: 416)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !772, file: !234, line: 146, baseType: !1004, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !234, line: 119, baseType: !548)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !755, file: !234, line: 220, baseType: !758, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !755, file: !234, line: 223, baseType: !997, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !755, file: !234, line: 226, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !234, line: 185, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !755, file: !234, line: 229, baseType: !1011, size: 128, offset: 256)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, elements: !1014)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !234, line: 229, flags: DIFlagFwdDecl)
!1014 = !{!1015}
!1015 = !DISubrange(count: 2)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !755, file: !234, line: 232, baseType: !754, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !755, file: !234, line: 233, baseType: !754, size: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !755, file: !234, line: 238, baseType: !1019, size: 64, offset: 512)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !234, line: 235, size: 64, elements: !1020)
!1020 = !{!1021, !1027}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1019, file: !234, line: 236, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !234, line: 273, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1023, file: !234, line: 275, baseType: !780, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1023, file: !234, line: 278, baseType: !780, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1019, file: !234, line: 237, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !234, line: 259, size: 320, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1029, file: !234, line: 261, baseType: !654, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1029, file: !234, line: 262, baseType: !654, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1029, file: !234, line: 266, baseType: !654, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1029, file: !234, line: 267, baseType: !654, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1029, file: !234, line: 270, baseType: !573, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !755, file: !234, line: 241, baseType: !1004, size: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !755, file: !234, line: 244, baseType: !573, size: 32, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !755, file: !234, line: 247, baseType: !573, size: 32, offset: 672)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !755, file: !234, line: 250, baseType: !573, size: 32, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !755, file: !234, line: 253, baseType: !573, size: 32, offset: 736)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !234, line: 256, baseType: !573, size: 32, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !750, file: !234, line: 378, baseType: !753, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !750, file: !234, line: 381, baseType: !1044, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !234, line: 282, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !234, line: 282, size: 128, elements: !1047)
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1046, file: !234, line: 282, baseType: !1049, size: 128)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !234, line: 281, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !234, line: 281, size: 128, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1050, file: !234, line: 281, baseType: !7, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1050, file: !234, line: 281, baseType: !7, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1050, file: !234, line: 281, baseType: !1055, size: 64, offset: 64)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 64, elements: !577)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !750, file: !234, line: 384, baseType: !573, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !750, file: !234, line: 387, baseType: !573, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !750, file: !234, line: 390, baseType: !573, size: 32, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !750, file: !234, line: 394, baseType: !1044, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !750, file: !234, line: 396, baseType: !233, size: 32, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !750, file: !234, line: 399, baseType: !1062, size: 64, offset: 416)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !1014)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !750, file: !234, line: 402, baseType: !1064, size: 64, offset: 480)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1014)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !750, file: !234, line: 406, baseType: !573, size: 32, offset: 544)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !750, file: !234, line: 409, baseType: !573, size: 32, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !742, file: !743, line: 470, baseType: !781, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !742, file: !743, line: 473, baseType: !1069, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !693, line: 39, size: 1152, elements: !1071)
!1071 = !{!1072, !1122, !1135, !1147, !1148, !1218, !1219, !1223, !1224, !1225, !1226, !1227}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1070, file: !693, line: 41, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1074, line: 144, baseType: !1075)
!1074 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1074, line: 100, size: 896, elements: !1077)
!1077 = !{!1078, !1086, !1091, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1108, !1110, !1111, !1116, !1121}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1076, file: !1074, line: 102, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1074, line: 52, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1074, line: 47, baseType: !7)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1076, file: !1074, line: 105, baseType: !1087, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1074, line: 59, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!573, !1084, !1084}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1076, file: !1074, line: 108, baseType: !1092, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1074, line: 63, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !997}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1076, file: !1074, line: 111, baseType: !1097, size: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !1074, line: 114, baseType: !937, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1076, file: !1074, line: 117, baseType: !937, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1076, file: !1074, line: 120, baseType: !937, size: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1076, file: !1074, line: 124, baseType: !7, size: 32, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1076, file: !1074, line: 128, baseType: !7, size: 32, offset: 480)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1076, file: !1074, line: 131, baseType: !1104, size: 64, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1074, line: 75, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!997, !937, !937}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1076, file: !1074, line: 132, baseType: !1109, size: 64, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1074, line: 78, baseType: !1093)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1076, file: !1074, line: 135, baseType: !997, size: 64, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1076, file: !1074, line: 136, baseType: !1112, size: 64, offset: 704)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1074, line: 82, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!997, !997, !937, !937}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1076, file: !1074, line: 137, baseType: !1117, size: 64, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1074, line: 83, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !997, !997}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1076, file: !1074, line: 141, baseType: !7, size: 32, offset: 832)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1070, file: !693, line: 48, baseType: !1123, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !453, line: 35, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !453, line: 35, size: 128, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1125, file: !453, line: 35, baseType: !1128, size: 128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !453, line: 33, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !453, line: 33, size: 128, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1129, file: !453, line: 33, baseType: !7, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1129, file: !453, line: 33, baseType: !7, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1129, file: !453, line: 33, baseType: !1134, size: 64, offset: 64)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 64, elements: !577)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1070, file: !693, line: 51, baseType: !1136, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1138, file: !6, line: 183, baseType: !1141, size: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1142, file: !6, line: 182, baseType: !7, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1142, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1142, file: !6, line: 182, baseType: !843, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1070, file: !693, line: 54, baseType: !492, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1070, file: !693, line: 57, baseType: !1149, size: 128, offset: 256)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1150, line: 31, size: 128, elements: !1151)
!1150 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1149, file: !1150, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1149, file: !1150, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1149, file: !1150, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1149, file: !1150, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1149, file: !1150, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1149, file: !1150, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1149, file: !1150, line: 56, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !493, line: 47, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1162, line: 75, size: 256, elements: !1163)
!1162 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1163 = !{!1164, !1176, !1177, !1178}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1161, file: !1162, line: 76, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1162, line: 68, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1162, line: 63, size: 320, elements: !1168)
!1168 = !{!1169, !1171, !1172, !1173}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1167, file: !1162, line: 64, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1167, file: !1162, line: 65, baseType: !1170, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1167, file: !1162, line: 66, baseType: !7, size: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1167, file: !1162, line: 67, baseType: !1174, size: 128, offset: 192)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 128, elements: !1014)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1162, line: 29, baseType: !546)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1161, file: !1162, line: 77, baseType: !1165, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1161, file: !1162, line: 78, baseType: !7, size: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1161, file: !1162, line: 79, baseType: !1179, size: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1162, line: 49, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1162, line: 45, size: 832, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1181, file: !1162, line: 46, baseType: !1170, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1181, file: !1162, line: 47, baseType: !1160, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1181, file: !1162, line: 48, baseType: !1186, size: 704, offset: 128)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1187, line: 164, size: 704, elements: !1188)
!1187 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1188 = !{!1189, !1190, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1214, !1215, !1216, !1217}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1186, file: !1187, line: 166, baseType: !548, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1186, file: !1187, line: 167, baseType: !1191, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1187, line: 157, size: 192, elements: !1193)
!1193 = !{!1194, !1196, !1197}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1192, file: !1187, line: 159, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1192, file: !1187, line: 160, baseType: !1191, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1192, file: !1187, line: 161, baseType: !1198, size: 32, offset: 128)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 32, elements: !1199)
!1199 = !{!1200}
!1200 = !DISubrange(count: 4)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1186, file: !1187, line: 168, baseType: !1195, size: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1186, file: !1187, line: 169, baseType: !1195, size: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1186, file: !1187, line: 170, baseType: !1195, size: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1186, file: !1187, line: 171, baseType: !548, size: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1186, file: !1187, line: 172, baseType: !573, size: 32, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1186, file: !1187, line: 176, baseType: !1207, size: 64, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!1191, !997, !548}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1186, file: !1187, line: 177, baseType: !1211, size: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !997, !1191}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1186, file: !1187, line: 178, baseType: !997, size: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1186, file: !1187, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1186, file: !1187, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1186, file: !1187, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1070, file: !693, line: 60, baseType: !1149, size: 128, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1070, file: !693, line: 64, baseType: !1220, size: 64, offset: 512)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1222, line: 33, flags: DIFlagFwdDecl)
!1222 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1070, file: !693, line: 67, baseType: !492, size: 64, offset: 576)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1070, file: !693, line: 73, baseType: !1073, size: 64, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1070, file: !693, line: 77, baseType: !1159, size: 64, offset: 704)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1070, file: !693, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1070, file: !693, line: 82, baseType: !1228, size: 320, offset: 832)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !263, line: 62, size: 320, elements: !1229)
!1229 = !{!1230, !1236, !1237, !1238, !1239, !1240}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1228, file: !263, line: 63, baseType: !1231, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !263, line: 56, size: 128, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1232, file: !263, line: 57, baseType: !1231, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1232, file: !263, line: 58, baseType: !575, size: 8, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1228, file: !263, line: 64, baseType: !7, size: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1228, file: !263, line: 66, baseType: !7, size: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1228, file: !263, line: 68, baseType: !596, size: 8, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1228, file: !263, line: 70, baseType: !819, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1228, file: !263, line: 71, baseType: !826, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !742, file: !743, line: 476, baseType: !1242, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !743, line: 476, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !742, file: !743, line: 479, baseType: !1073, size: 64, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !742, file: !743, line: 484, baseType: !492, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !742, file: !743, line: 488, baseType: !492, size: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !742, file: !743, line: 493, baseType: !492, size: 64, offset: 512)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !742, file: !743, line: 496, baseType: !492, size: 64, offset: 576)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !742, file: !743, line: 501, baseType: !1250, size: 64, offset: 640)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !245, line: 2355, size: 576, elements: !1252)
!1252 = !{!1253, !1256, !1257, !1258, !1259, !1261, !1262, !1267, !1268, !1269, !1270, !1271, !1272}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1251, file: !245, line: 2356, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !245, line: 2356, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1251, file: !245, line: 2357, baseType: !919, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1251, file: !245, line: 2358, baseType: !573, size: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1251, file: !245, line: 2359, baseType: !573, size: 32, offset: 160)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1251, file: !245, line: 2360, baseType: !1260, size: 128, offset: 192)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, elements: !1199)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1251, file: !245, line: 2364, baseType: !573, size: 32, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1251, file: !245, line: 2367, baseType: !1263, size: 128, offset: 384)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !245, line: 2349, size: 128, elements: !1264)
!1264 = !{!1265, !1266}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1263, file: !245, line: 2351, baseType: !654, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1263, file: !245, line: 2352, baseType: !548, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1251, file: !245, line: 2371, baseType: !244, size: 32, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1251, file: !245, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1251, file: !245, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1251, file: !245, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1251, file: !245, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1251, file: !245, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !742, file: !743, line: 504, baseType: !1274, size: 64, offset: 704)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !743, line: 504, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !742, file: !743, line: 507, baseType: !1073, size: 64, offset: 768)
