; ModuleID = 'plugin.c'
source_filename = "plugin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.callback_info = type { i8*, void (i8*, i8*)*, i8*, %struct.callback_info* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.plugin_name_args = type { i8*, i8*, i32, %struct.plugin_argument*, i8*, i8* }
%struct.plugin_argument = type { i8*, i8* }
%struct.register_pass_info = type { %struct.opt_pass*, i8*, i32, i32 }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.plugin_info = type { i8*, i8* }
%struct.ggc_root_tab = type { i8*, i64, i64, void (i8*)*, void (i8*)* }
%struct.ggc_cache_tab = type { %struct.htab**, i64, i64, void (i8*)*, void (i8*)*, i32 (i8*)* }
%struct.print_options = type { %struct._IO_FILE*, i8* }
%struct.plugin_gcc_version = type { i8*, i8*, i8*, i8*, i8* }


!159 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!160 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!161 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!162 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!163 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!164 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!165 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!166 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!167 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!168 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!169 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!170 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!171 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!172 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!173 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!174 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!175 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!176 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!177 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!178 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!179 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!180 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!181 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!182 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!183 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!184 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!185 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!186 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!187 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!188 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!189 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!190 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!191 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!192 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!193 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pass_positioning_ops", file: !12, line: 319, baseType: !7, size: 32, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIEnumerator(name: "PASS_POS_INSERT_AFTER", value: 0, isUnsigned: true)
!197 = !DIEnumerator(name: "PASS_POS_INSERT_BEFORE", value: 1, isUnsigned: true)
!198 = !DIEnumerator(name: "PASS_POS_REPLACE", value: 2, isUnsigned: true)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plugin_event", file: !200, line: 33, baseType: !7, size: 32, elements: !201)
!200 = !DIFile(filename: "./gcc-plugin.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!202 = !DIEnumerator(name: "PLUGIN_PASS_MANAGER_SETUP", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "PLUGIN_FINISH_TYPE", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "PLUGIN_FINISH_UNIT", value: 2, isUnsigned: true)
!205 = !DIEnumerator(name: "PLUGIN_PRE_GENERICIZE", value: 3, isUnsigned: true)
!206 = !DIEnumerator(name: "PLUGIN_FINISH", value: 4, isUnsigned: true)
!207 = !DIEnumerator(name: "PLUGIN_INFO", value: 5, isUnsigned: true)
!208 = !DIEnumerator(name: "PLUGIN_GGC_START", value: 6, isUnsigned: true)
!209 = !DIEnumerator(name: "PLUGIN_GGC_MARKING", value: 7, isUnsigned: true)
!210 = !DIEnumerator(name: "PLUGIN_GGC_END", value: 8, isUnsigned: true)
!211 = !DIEnumerator(name: "PLUGIN_REGISTER_GGC_ROOTS", value: 9, isUnsigned: true)
!212 = !DIEnumerator(name: "PLUGIN_REGISTER_GGC_CACHES", value: 10, isUnsigned: true)
!213 = !DIEnumerator(name: "PLUGIN_ATTRIBUTES", value: 11, isUnsigned: true)
!214 = !DIEnumerator(name: "PLUGIN_START_UNIT", value: 12, isUnsigned: true)
!215 = !DIEnumerator(name: "PLUGIN_PRAGMAS", value: 13, isUnsigned: true)
!216 = !DIEnumerator(name: "PLUGIN_ALL_PASSES_START", value: 14, isUnsigned: true)
!217 = !DIEnumerator(name: "PLUGIN_ALL_PASSES_END", value: 15, isUnsigned: true)
!218 = !DIEnumerator(name: "PLUGIN_ALL_IPA_PASSES_START", value: 16, isUnsigned: true)
!219 = !DIEnumerator(name: "PLUGIN_ALL_IPA_PASSES_END", value: 17, isUnsigned: true)
!220 = !DIEnumerator(name: "PLUGIN_OVERRIDE_GATE", value: 18, isUnsigned: true)
!221 = !DIEnumerator(name: "PLUGIN_PASS_EXECUTION", value: 19, isUnsigned: true)
!222 = !DIEnumerator(name: "PLUGIN_EARLY_GIMPLE_PASSES_START", value: 20, isUnsigned: true)
!223 = !DIEnumerator(name: "PLUGIN_EARLY_GIMPLE_PASSES_END", value: 21, isUnsigned: true)
!224 = !DIEnumerator(name: "PLUGIN_NEW_PASS", value: 22, isUnsigned: true)
!225 = !DIEnumerator(name: "PLUGIN_EVENT_FIRST_DYNAMIC", value: 23, isUnsigned: true)
!226 = !{!227, !231, !246, !239, !247, !248, !260, !291, !296, !313, !249, !368, !234, !370, !372}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_name_args", file: !200, line: 69, size: 384, elements: !229)
!229 = !{!230, !233, !236, !238, !244, !245}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "base_name", scope: !228, file: !200, line: 71, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !228, file: !200, line: 73, baseType: !234, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !228, file: !200, line: 75, baseType: !237, size: 32, offset: 128)
!237 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !228, file: !200, line: 77, baseType: !239, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_argument", file: !200, line: 43, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !240, file: !200, line: 45, baseType: !231, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !240, file: !200, line: 46, baseType: !231, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !228, file: !200, line: 78, baseType: !234, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !228, file: !200, line: 79, baseType: !234, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_info", file: !3, line: 77, size: 256, elements: !251)
!251 = !{!252, !253, !258, !259}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_name", scope: !250, file: !3, line: 79, baseType: !234, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !250, file: !3, line: 80, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_callback_func", file: !200, line: 115, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !246, !246}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !250, file: !3, line: 81, baseType: !246, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !3, line: 82, baseType: !249, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "register_pass_info", file: !12, line: 326, size: 192, elements: !262)
!262 = !{!263, !288, !289, !290}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !261, file: !12, line: 328, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !12, line: 114, size: 640, elements: !266)
!266 = !{!267, !268, !269, !274, !278, !279, !280, !281, !283, !284, !285, !286, !287}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !12, line: 117, baseType: !11, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !12, line: 121, baseType: !234, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !265, file: !12, line: 125, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273}
!273 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !265, file: !12, line: 130, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!7}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !265, file: !12, line: 133, baseType: !264, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !12, line: 136, baseType: !264, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !265, file: !12, line: 139, baseType: !237, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !265, file: !12, line: 143, baseType: !282, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !19, line: 80, baseType: !18)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !265, file: !12, line: 146, baseType: !7, size: 32, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !265, file: !12, line: 147, baseType: !7, size: 32, offset: 480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !265, file: !12, line: 148, baseType: !7, size: 32, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !265, file: !12, line: 151, baseType: !7, size: 32, offset: 544)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !265, file: !12, line: 152, baseType: !7, size: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reference_pass_name", scope: !261, file: !12, line: 329, baseType: !234, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pass_instance_number", scope: !261, file: !12, line: 331, baseType: !237, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pos_op", scope: !261, file: !12, line: 334, baseType: !194, size: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_info", file: !200, line: 51, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !292, file: !200, line: 53, baseType: !234, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !292, file: !200, line: 54, baseType: !234, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_root_tab", file: !299, line: 69, size: 320, elements: !300)
!299 = !DIFile(filename: "./ggc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !{!301, !302, !306, !307, !312}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !298, file: !299, line: 70, baseType: !246, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !298, file: !299, line: 71, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !304, line: 46, baseType: !305)
!304 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!305 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !298, file: !299, line: 72, baseType: !303, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !298, file: !299, line: 73, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "gt_pointer_walker", file: !299, line: 65, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !246}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !298, file: !299, line: 74, baseType: !308, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_cache_tab", file: !299, line: 85, size: 384, elements: !316)
!316 = !{!317, !360, !361, !362, !363, !364}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !315, file: !299, line: 86, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !6, line: 100, size: 896, elements: !321)
!321 = !{!322, !330, !335, !337, !339, !340, !341, !342, !343, !344, !349, !351, !352, !357, !359}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !320, file: !6, line: 102, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !6, line: 52, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !6, line: 47, baseType: !7)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !320, file: !6, line: 105, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !6, line: 59, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!237, !328, !328}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !320, file: !6, line: 108, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !6, line: 63, baseType: !309)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !320, file: !6, line: 111, baseType: !338, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !320, file: !6, line: 114, baseType: !303, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !320, file: !6, line: 117, baseType: !303, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !320, file: !6, line: 120, baseType: !303, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !320, file: !6, line: 124, baseType: !7, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !320, file: !6, line: 128, baseType: !7, size: 32, offset: 480)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !320, file: !6, line: 131, baseType: !345, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !6, line: 75, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!246, !303, !303}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !320, file: !6, line: 132, baseType: !350, size: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !6, line: 78, baseType: !309)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !320, file: !6, line: 135, baseType: !246, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !320, file: !6, line: 136, baseType: !353, size: 64, offset: 704)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !6, line: 82, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!246, !246, !303, !303}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !320, file: !6, line: 137, baseType: !358, size: 64, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !6, line: 83, baseType: !255)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !320, file: !6, line: 141, baseType: !7, size: 32, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !315, file: !299, line: 87, baseType: !303, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !315, file: !299, line: 88, baseType: !303, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !315, file: !299, line: 89, baseType: !308, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !315, file: !299, line: 90, baseType: !308, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "marked_p", scope: !315, file: !299, line: 91, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!237, !328}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_options", file: !3, line: 659, size: 128, elements: !374)
!374 = !{!375, !432}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !373, file: !3, line: 661, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !378, line: 7, baseType: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !380, line: 49, size: 1728, elements: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !397, !399, !400, !401, !405, !407, !409, !413, !416, !418, !421, !424, !425, !426, !427, !428}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !379, file: !380, line: 51, baseType: !237, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !379, file: !380, line: 54, baseType: !231, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !379, file: !380, line: 55, baseType: !231, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !379, file: !380, line: 56, baseType: !231, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !379, file: !380, line: 57, baseType: !231, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !379, file: !380, line: 58, baseType: !231, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !379, file: !380, line: 59, baseType: !231, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !379, file: !380, line: 60, baseType: !231, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !379, file: !380, line: 61, baseType: !231, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !379, file: !380, line: 64, baseType: !231, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !379, file: !380, line: 65, baseType: !231, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !379, file: !380, line: 66, baseType: !231, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !379, file: !380, line: 68, baseType: !395, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !380, line: 36, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !379, file: !380, line: 70, baseType: !398, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !379, file: !380, line: 72, baseType: !237, size: 32, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !379, file: !380, line: 73, baseType: !237, size: 32, offset: 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !379, file: !380, line: 74, baseType: !402, size: 64, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !403, line: 152, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !379, file: !380, line: 77, baseType: !406, size: 16, offset: 1024)
!406 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !379, file: !380, line: 78, baseType: !408, size: 8, offset: 1040)
!408 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !379, file: !380, line: 79, baseType: !410, size: 8, offset: 1048)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 8, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 1)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !379, file: !380, line: 81, baseType: !414, size: 64, offset: 1088)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !380, line: 43, baseType: null)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !379, file: !380, line: 89, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !403, line: 153, baseType: !404)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !379, file: !380, line: 91, baseType: !419, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !380, line: 37, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !379, file: !380, line: 92, baseType: !422, size: 64, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !380, line: 38, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !379, file: !380, line: 93, baseType: !398, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !379, file: !380, line: 94, baseType: !246, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !379, file: !380, line: 95, baseType: !303, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !379, file: !380, line: 96, baseType: !237, size: 32, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !379, file: !380, line: 98, baseType: !429, size: 160, offset: 1568)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 160, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 20)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !373, file: !3, line: 662, baseType: !234, size: 64, offset: 64)
!433 = !{!434, !436, !439, !0, !444, !446, !448, !450}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "plugin_event_name", scope: !2, file: !3, line: 61, type: !247, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "event_tab", scope: !2, file: !3, line: 65, type: !438, isLocal: true, isDefinition: true)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !6, line: 144, baseType: !319)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "plugin_callbacks_init", scope: !2, file: !3, line: 86, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1472, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 23)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "plugin_name_args_tab", scope: !2, file: !3, line: 74, type: !438, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "event_last", scope: !2, file: !3, line: 69, type: !237, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "event_horizon", scope: !2, file: !3, line: 70, type: !237, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "plugin_callbacks", scope: !2, file: !3, line: 87, type: !248, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 1472, elements: !442)
!453 = !{i32 7, !"Dwarf Version", i32 4}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{i32 1, !"wchar_size", i32 4}
!456 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!457 = distinct !DISubprogram(name: "add_new_plugin", scope: !3, file: !3, line: 132, type: !458, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !234}
!460 = !{}
!461 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !457, file: !3, line: 132, type: !234)
!462 = !DILocation(line: 132, column: 29, scope: !457)
!463 = !DILocalVariable(name: "plugin", scope: !457, file: !3, line: 134, type: !227)
!464 = !DILocation(line: 134, column: 28, scope: !457)
!465 = !DILocalVariable(name: "slot", scope: !457, file: !3, line: 135, type: !338)
!466 = !DILocation(line: 135, column: 10, scope: !457)
!467 = !DILocalVariable(name: "base_name", scope: !457, file: !3, line: 136, type: !231)
!468 = !DILocation(line: 136, column: 9, scope: !457)
!469 = !DILocation(line: 136, column: 43, scope: !457)
!470 = !DILocation(line: 136, column: 21, scope: !457)
!471 = !DILocation(line: 140, column: 8, scope: !472)
!472 = distinct !DILexicalBlock(scope: !457, file: !3, line: 140, column: 7)
!473 = !DILocation(line: 140, column: 7, scope: !457)
!474 = !DILocation(line: 141, column: 28, scope: !472)
!475 = !DILocation(line: 141, column: 26, scope: !472)
!476 = !DILocation(line: 141, column: 5, scope: !472)
!477 = !DILocation(line: 144, column: 26, scope: !457)
!478 = !DILocation(line: 144, column: 48, scope: !457)
!479 = !DILocation(line: 144, column: 10, scope: !457)
!480 = !DILocation(line: 144, column: 8, scope: !457)
!481 = !DILocation(line: 149, column: 8, scope: !482)
!482 = distinct !DILexicalBlock(scope: !457, file: !3, line: 149, column: 7)
!483 = !DILocation(line: 149, column: 7, scope: !482)
!484 = !DILocation(line: 149, column: 7, scope: !457)
!485 = !DILocation(line: 151, column: 45, scope: !486)
!486 = distinct !DILexicalBlock(scope: !482, file: !3, line: 150, column: 5)
!487 = !DILocation(line: 151, column: 44, scope: !486)
!488 = !DILocation(line: 151, column: 16, scope: !486)
!489 = !DILocation(line: 151, column: 14, scope: !486)
!490 = !DILocation(line: 152, column: 19, scope: !491)
!491 = distinct !DILexicalBlock(scope: !486, file: !3, line: 152, column: 11)
!492 = !DILocation(line: 152, column: 27, scope: !491)
!493 = !DILocation(line: 152, column: 38, scope: !491)
!494 = !DILocation(line: 152, column: 11, scope: !491)
!495 = !DILocation(line: 152, column: 11, scope: !486)
!496 = !DILocation(line: 154, column: 16, scope: !491)
!497 = !DILocation(line: 154, column: 24, scope: !491)
!498 = !DILocation(line: 154, column: 35, scope: !491)
!499 = !DILocation(line: 154, column: 43, scope: !491)
!500 = !DILocation(line: 154, column: 54, scope: !491)
!501 = !DILocation(line: 153, column: 9, scope: !491)
!502 = !DILocation(line: 155, column: 7, scope: !486)
!503 = !DILocation(line: 158, column: 12, scope: !457)
!504 = !DILocation(line: 158, column: 10, scope: !457)
!505 = !DILocation(line: 159, column: 23, scope: !457)
!506 = !DILocation(line: 159, column: 3, scope: !457)
!507 = !DILocation(line: 159, column: 11, scope: !457)
!508 = !DILocation(line: 159, column: 21, scope: !457)
!509 = !DILocation(line: 160, column: 23, scope: !457)
!510 = !DILocation(line: 160, column: 3, scope: !457)
!511 = !DILocation(line: 160, column: 11, scope: !457)
!512 = !DILocation(line: 160, column: 21, scope: !457)
!513 = !DILocation(line: 162, column: 11, scope: !457)
!514 = !DILocation(line: 162, column: 4, scope: !457)
!515 = !DILocation(line: 162, column: 9, scope: !457)
!516 = !DILocation(line: 163, column: 1, scope: !457)
!517 = distinct !DISubprogram(name: "get_plugin_base_name", scope: !3, file: !3, line: 115, type: !518, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!518 = !DISubroutineType(types: !519)
!519 = !{!231, !234}
!520 = !DILocalVariable(name: "full_name", arg: 1, scope: !517, file: !3, line: 115, type: !234)
!521 = !DILocation(line: 115, column: 35, scope: !517)
!522 = !DILocalVariable(name: "base_name", scope: !517, file: !3, line: 118, type: !231)
!523 = !DILocation(line: 118, column: 9, scope: !517)
!524 = !DILocation(line: 118, column: 41, scope: !517)
!525 = !DILocation(line: 118, column: 30, scope: !517)
!526 = !DILocation(line: 118, column: 21, scope: !517)
!527 = !DILocation(line: 121, column: 21, scope: !517)
!528 = !DILocation(line: 121, column: 40, scope: !517)
!529 = !DILocation(line: 121, column: 32, scope: !517)
!530 = !DILocation(line: 121, column: 3, scope: !517)
!531 = !DILocation(line: 123, column: 10, scope: !517)
!532 = !DILocation(line: 123, column: 3, scope: !517)
!533 = distinct !DISubprogram(name: "htab_str_eq", scope: !3, file: !3, line: 104, type: !333, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!534 = !DILocalVariable(name: "s1", arg: 1, scope: !533, file: !3, line: 104, type: !328)
!535 = !DILocation(line: 104, column: 26, scope: !533)
!536 = !DILocalVariable(name: "s2", arg: 2, scope: !533, file: !3, line: 104, type: !328)
!537 = !DILocation(line: 104, column: 42, scope: !533)
!538 = !DILocalVariable(name: "plugin", scope: !533, file: !3, line: 106, type: !368)
!539 = !DILocation(line: 106, column: 34, scope: !533)
!540 = !DILocation(line: 106, column: 77, scope: !533)
!541 = !DILocation(line: 106, column: 43, scope: !533)
!542 = !DILocation(line: 107, column: 19, scope: !533)
!543 = !DILocation(line: 107, column: 27, scope: !533)
!544 = !DILocation(line: 107, column: 53, scope: !533)
!545 = !DILocation(line: 107, column: 11, scope: !533)
!546 = !DILocation(line: 107, column: 10, scope: !533)
!547 = !DILocation(line: 107, column: 3, scope: !533)
!548 = distinct !DISubprogram(name: "parse_plugin_arg_opt", scope: !3, file: !3, line: 171, type: !458, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!549 = !DILocalVariable(name: "arg", arg: 1, scope: !548, file: !3, line: 171, type: !234)
!550 = !DILocation(line: 171, column: 35, scope: !548)
!551 = !DILocalVariable(name: "len", scope: !548, file: !3, line: 173, type: !303)
!552 = !DILocation(line: 173, column: 10, scope: !548)
!553 = !DILocalVariable(name: "name_len", scope: !548, file: !3, line: 173, type: !303)
!554 = !DILocation(line: 173, column: 19, scope: !548)
!555 = !DILocalVariable(name: "key_len", scope: !548, file: !3, line: 173, type: !303)
!556 = !DILocation(line: 173, column: 33, scope: !548)
!557 = !DILocalVariable(name: "value_len", scope: !548, file: !3, line: 173, type: !303)
!558 = !DILocation(line: 173, column: 46, scope: !548)
!559 = !DILocalVariable(name: "ptr", scope: !548, file: !3, line: 174, type: !234)
!560 = !DILocation(line: 174, column: 15, scope: !548)
!561 = !DILocalVariable(name: "name_start", scope: !548, file: !3, line: 174, type: !234)
!562 = !DILocation(line: 174, column: 21, scope: !548)
!563 = !DILocation(line: 174, column: 34, scope: !548)
!564 = !DILocalVariable(name: "key_start", scope: !548, file: !3, line: 174, type: !234)
!565 = !DILocation(line: 174, column: 40, scope: !548)
!566 = !DILocalVariable(name: "value_start", scope: !548, file: !3, line: 174, type: !234)
!567 = !DILocation(line: 174, column: 59, scope: !548)
!568 = !DILocalVariable(name: "name", scope: !548, file: !3, line: 175, type: !231)
!569 = !DILocation(line: 175, column: 9, scope: !548)
!570 = !DILocalVariable(name: "key", scope: !548, file: !3, line: 175, type: !231)
!571 = !DILocation(line: 175, column: 16, scope: !548)
!572 = !DILocalVariable(name: "value", scope: !548, file: !3, line: 175, type: !231)
!573 = !DILocation(line: 175, column: 22, scope: !548)
!574 = !DILocalVariable(name: "slot", scope: !548, file: !3, line: 176, type: !338)
!575 = !DILocation(line: 176, column: 10, scope: !548)
!576 = !DILocalVariable(name: "name_parsed", scope: !548, file: !3, line: 177, type: !273)
!577 = !DILocation(line: 177, column: 8, scope: !548)
!578 = !DILocalVariable(name: "key_parsed", scope: !548, file: !3, line: 177, type: !273)
!579 = !DILocation(line: 177, column: 29, scope: !548)
!580 = !DILocation(line: 181, column: 14, scope: !581)
!581 = distinct !DILexicalBlock(scope: !548, file: !3, line: 181, column: 3)
!582 = !DILocation(line: 181, column: 12, scope: !581)
!583 = !DILocation(line: 181, column: 8, scope: !581)
!584 = !DILocation(line: 181, column: 20, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !3, line: 181, column: 3)
!586 = !DILocation(line: 181, column: 19, scope: !585)
!587 = !DILocation(line: 181, column: 3, scope: !581)
!588 = !DILocation(line: 187, column: 12, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !3, line: 187, column: 11)
!590 = distinct !DILexicalBlock(scope: !585, file: !3, line: 182, column: 5)
!591 = !DILocation(line: 187, column: 11, scope: !589)
!592 = !DILocation(line: 187, column: 16, scope: !589)
!593 = !DILocation(line: 187, column: 23, scope: !589)
!594 = !DILocation(line: 187, column: 27, scope: !589)
!595 = !DILocation(line: 187, column: 11, scope: !590)
!596 = !DILocation(line: 189, column: 22, scope: !597)
!597 = distinct !DILexicalBlock(scope: !589, file: !3, line: 188, column: 9)
!598 = !DILocation(line: 189, column: 20, scope: !597)
!599 = !DILocation(line: 190, column: 15, scope: !597)
!600 = !DILocation(line: 191, column: 23, scope: !597)
!601 = !DILocation(line: 191, column: 27, scope: !597)
!602 = !DILocation(line: 191, column: 21, scope: !597)
!603 = !DILocation(line: 192, column: 23, scope: !597)
!604 = !DILocation(line: 193, column: 11, scope: !597)
!605 = !DILocation(line: 195, column: 17, scope: !606)
!606 = distinct !DILexicalBlock(scope: !589, file: !3, line: 195, column: 16)
!607 = !DILocation(line: 195, column: 16, scope: !606)
!608 = !DILocation(line: 195, column: 21, scope: !606)
!609 = !DILocation(line: 195, column: 16, scope: !589)
!610 = !DILocation(line: 197, column: 15, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !3, line: 197, column: 15)
!612 = distinct !DILexicalBlock(scope: !606, file: !3, line: 196, column: 9)
!613 = !DILocation(line: 197, column: 15, scope: !612)
!614 = !DILocation(line: 200, column: 8, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !3, line: 198, column: 13)
!616 = !DILocation(line: 199, column: 15, scope: !615)
!617 = !DILocation(line: 201, column: 15, scope: !615)
!618 = !DILocation(line: 203, column: 21, scope: !612)
!619 = !DILocation(line: 203, column: 19, scope: !612)
!620 = !DILocation(line: 204, column: 15, scope: !612)
!621 = !DILocation(line: 205, column: 25, scope: !612)
!622 = !DILocation(line: 205, column: 29, scope: !612)
!623 = !DILocation(line: 205, column: 23, scope: !612)
!624 = !DILocation(line: 206, column: 22, scope: !612)
!625 = !DILocation(line: 207, column: 11, scope: !612)
!626 = !DILocation(line: 210, column: 9, scope: !606)
!627 = !DILocation(line: 211, column: 5, scope: !590)
!628 = !DILocation(line: 181, column: 25, scope: !585)
!629 = !DILocation(line: 181, column: 3, scope: !585)
!630 = distinct !{!630, !587, !631}
!631 = !DILocation(line: 211, column: 5, scope: !581)
!632 = !DILocation(line: 213, column: 8, scope: !633)
!633 = distinct !DILexicalBlock(scope: !548, file: !3, line: 213, column: 7)
!634 = !DILocation(line: 213, column: 7, scope: !548)
!635 = !DILocation(line: 216, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !3, line: 214, column: 5)
!637 = !DILocation(line: 215, column: 7, scope: !636)
!638 = !DILocation(line: 217, column: 7, scope: !636)
!639 = !DILocation(line: 222, column: 8, scope: !640)
!640 = distinct !DILexicalBlock(scope: !548, file: !3, line: 222, column: 7)
!641 = !DILocation(line: 222, column: 7, scope: !548)
!642 = !DILocation(line: 223, column: 15, scope: !640)
!643 = !DILocation(line: 223, column: 13, scope: !640)
!644 = !DILocation(line: 223, column: 5, scope: !640)
!645 = !DILocation(line: 225, column: 17, scope: !640)
!646 = !DILocation(line: 225, column: 15, scope: !640)
!647 = !DILocation(line: 227, column: 10, scope: !548)
!648 = !DILocation(line: 227, column: 8, scope: !548)
!649 = !DILocation(line: 228, column: 12, scope: !548)
!650 = !DILocation(line: 228, column: 18, scope: !548)
!651 = !DILocation(line: 228, column: 30, scope: !548)
!652 = !DILocation(line: 228, column: 3, scope: !548)
!653 = !DILocation(line: 229, column: 3, scope: !548)
!654 = !DILocation(line: 229, column: 8, scope: !548)
!655 = !DILocation(line: 229, column: 18, scope: !548)
!656 = !DILocation(line: 233, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !548, file: !3, line: 233, column: 7)
!658 = !DILocation(line: 234, column: 7, scope: !657)
!659 = !DILocation(line: 234, column: 35, scope: !657)
!660 = !DILocation(line: 234, column: 57, scope: !657)
!661 = !DILocation(line: 234, column: 19, scope: !657)
!662 = !DILocation(line: 234, column: 17, scope: !657)
!663 = !DILocation(line: 235, column: 11, scope: !657)
!664 = !DILocation(line: 233, column: 7, scope: !548)
!665 = !DILocalVariable(name: "plugin", scope: !666, file: !3, line: 237, type: !227)
!666 = distinct !DILexicalBlock(scope: !657, file: !3, line: 236, column: 5)
!667 = !DILocation(line: 237, column: 32, scope: !666)
!668 = !DILocation(line: 237, column: 70, scope: !666)
!669 = !DILocation(line: 237, column: 69, scope: !666)
!670 = !DILocation(line: 237, column: 41, scope: !666)
!671 = !DILocation(line: 239, column: 13, scope: !666)
!672 = !DILocation(line: 239, column: 11, scope: !666)
!673 = !DILocation(line: 240, column: 16, scope: !666)
!674 = !DILocation(line: 240, column: 21, scope: !666)
!675 = !DILocation(line: 240, column: 32, scope: !666)
!676 = !DILocation(line: 240, column: 7, scope: !666)
!677 = !DILocation(line: 241, column: 7, scope: !666)
!678 = !DILocation(line: 241, column: 11, scope: !666)
!679 = !DILocation(line: 241, column: 20, scope: !666)
!680 = !DILocation(line: 242, column: 11, scope: !681)
!681 = distinct !DILexicalBlock(scope: !666, file: !3, line: 242, column: 11)
!682 = !DILocation(line: 242, column: 11, scope: !666)
!683 = !DILocation(line: 244, column: 19, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !3, line: 243, column: 9)
!685 = !DILocation(line: 244, column: 17, scope: !684)
!686 = !DILocation(line: 245, column: 20, scope: !684)
!687 = !DILocation(line: 245, column: 27, scope: !684)
!688 = !DILocation(line: 245, column: 40, scope: !684)
!689 = !DILocation(line: 245, column: 11, scope: !684)
!690 = !DILocation(line: 246, column: 11, scope: !684)
!691 = !DILocation(line: 246, column: 17, scope: !684)
!692 = !DILocation(line: 246, column: 28, scope: !684)
!693 = !DILocation(line: 247, column: 9, scope: !684)
!694 = !DILocation(line: 249, column: 15, scope: !681)
!695 = !DILocation(line: 256, column: 11, scope: !696)
!696 = distinct !DILexicalBlock(scope: !666, file: !3, line: 256, column: 11)
!697 = !DILocation(line: 256, column: 19, scope: !696)
!698 = !DILocation(line: 256, column: 24, scope: !696)
!699 = !DILocation(line: 256, column: 11, scope: !666)
!700 = !DILocalVariable(name: "args", scope: !701, file: !3, line: 258, type: !239)
!701 = distinct !DILexicalBlock(scope: !696, file: !3, line: 257, column: 9)
!702 = !DILocation(line: 258, column: 35, scope: !701)
!703 = !DILocation(line: 258, column: 42, scope: !701)
!704 = !DILocation(line: 260, column: 19, scope: !701)
!705 = !DILocation(line: 260, column: 11, scope: !701)
!706 = !DILocation(line: 260, column: 25, scope: !701)
!707 = !DILocation(line: 260, column: 33, scope: !701)
!708 = !DILocation(line: 261, column: 53, scope: !701)
!709 = !DILocation(line: 261, column: 61, scope: !701)
!710 = !DILocation(line: 261, column: 51, scope: !701)
!711 = !DILocation(line: 262, column: 11, scope: !701)
!712 = !DILocation(line: 263, column: 26, scope: !701)
!713 = !DILocation(line: 263, column: 11, scope: !701)
!714 = !DILocation(line: 263, column: 19, scope: !701)
!715 = !DILocation(line: 263, column: 24, scope: !701)
!716 = !DILocation(line: 264, column: 13, scope: !701)
!717 = !DILocation(line: 264, column: 21, scope: !701)
!718 = !DILocation(line: 264, column: 11, scope: !701)
!719 = !DILocation(line: 265, column: 9, scope: !701)
!720 = !DILocation(line: 268, column: 11, scope: !721)
!721 = distinct !DILexicalBlock(scope: !696, file: !3, line: 267, column: 9)
!722 = !DILocation(line: 269, column: 26, scope: !721)
!723 = !DILocation(line: 269, column: 11, scope: !721)
!724 = !DILocation(line: 269, column: 19, scope: !721)
!725 = !DILocation(line: 269, column: 24, scope: !721)
!726 = !DILocation(line: 270, column: 11, scope: !721)
!727 = !DILocation(line: 270, column: 19, scope: !721)
!728 = !DILocation(line: 270, column: 24, scope: !721)
!729 = !DILocation(line: 273, column: 44, scope: !666)
!730 = !DILocation(line: 273, column: 7, scope: !666)
!731 = !DILocation(line: 273, column: 15, scope: !666)
!732 = !DILocation(line: 273, column: 20, scope: !666)
!733 = !DILocation(line: 273, column: 28, scope: !666)
!734 = !DILocation(line: 273, column: 33, scope: !666)
!735 = !DILocation(line: 273, column: 38, scope: !666)
!736 = !DILocation(line: 273, column: 42, scope: !666)
!737 = !DILocation(line: 274, column: 46, scope: !666)
!738 = !DILocation(line: 274, column: 7, scope: !666)
!739 = !DILocation(line: 274, column: 15, scope: !666)
!740 = !DILocation(line: 274, column: 20, scope: !666)
!741 = !DILocation(line: 274, column: 28, scope: !666)
!742 = !DILocation(line: 274, column: 33, scope: !666)
!743 = !DILocation(line: 274, column: 38, scope: !666)
!744 = !DILocation(line: 274, column: 44, scope: !666)
!745 = !DILocation(line: 275, column: 5, scope: !666)
!746 = !DILocation(line: 278, column: 35, scope: !657)
!747 = !DILocation(line: 278, column: 41, scope: !657)
!748 = !DILocation(line: 277, column: 5, scope: !657)
!749 = !DILocation(line: 281, column: 3, scope: !548)
!750 = !DILocation(line: 282, column: 1, scope: !548)
!751 = distinct !DISubprogram(name: "get_named_event_id", scope: !3, file: !3, line: 310, type: !752, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!752 = !DISubroutineType(types: !753)
!753 = !{!237, !234, !5}
!754 = !DILocalVariable(name: "name", arg: 1, scope: !751, file: !3, line: 310, type: !234)
!755 = !DILocation(line: 310, column: 33, scope: !751)
!756 = !DILocalVariable(name: "insert", arg: 2, scope: !751, file: !3, line: 310, type: !5)
!757 = !DILocation(line: 310, column: 58, scope: !751)
!758 = !DILocalVariable(name: "slot", scope: !751, file: !3, line: 312, type: !338)
!759 = !DILocation(line: 312, column: 10, scope: !751)
!760 = !DILocation(line: 314, column: 8, scope: !761)
!761 = distinct !DILexicalBlock(scope: !751, file: !3, line: 314, column: 7)
!762 = !DILocation(line: 314, column: 7, scope: !751)
!763 = !DILocalVariable(name: "i", scope: !764, file: !3, line: 316, type: !237)
!764 = distinct !DILexicalBlock(scope: !761, file: !3, line: 315, column: 5)
!765 = !DILocation(line: 316, column: 11, scope: !764)
!766 = !DILocation(line: 318, column: 19, scope: !764)
!767 = !DILocation(line: 318, column: 17, scope: !764)
!768 = !DILocation(line: 319, column: 14, scope: !769)
!769 = distinct !DILexicalBlock(scope: !764, file: !3, line: 319, column: 7)
!770 = !DILocation(line: 319, column: 12, scope: !769)
!771 = !DILocation(line: 319, column: 19, scope: !772)
!772 = distinct !DILexicalBlock(scope: !769, file: !3, line: 319, column: 7)
!773 = !DILocation(line: 319, column: 23, scope: !772)
!774 = !DILocation(line: 319, column: 21, scope: !772)
!775 = !DILocation(line: 319, column: 7, scope: !769)
!776 = !DILocation(line: 321, column: 27, scope: !777)
!777 = distinct !DILexicalBlock(scope: !772, file: !3, line: 320, column: 2)
!778 = !DILocation(line: 321, column: 38, scope: !777)
!779 = !DILocation(line: 321, column: 56, scope: !777)
!780 = !DILocation(line: 321, column: 11, scope: !777)
!781 = !DILocation(line: 321, column: 9, scope: !777)
!782 = !DILocation(line: 322, column: 4, scope: !777)
!783 = !DILocation(line: 323, column: 13, scope: !777)
!784 = !DILocation(line: 323, column: 31, scope: !777)
!785 = !DILocation(line: 323, column: 12, scope: !777)
!786 = !DILocation(line: 323, column: 5, scope: !777)
!787 = !DILocation(line: 323, column: 10, scope: !777)
!788 = !DILocation(line: 324, column: 2, scope: !777)
!789 = !DILocation(line: 319, column: 36, scope: !772)
!790 = !DILocation(line: 319, column: 7, scope: !772)
!791 = distinct !{!791, !775, !792}
!792 = !DILocation(line: 324, column: 2, scope: !769)
!793 = !DILocation(line: 325, column: 5, scope: !764)
!794 = !DILocation(line: 326, column: 26, scope: !751)
!795 = !DILocation(line: 326, column: 37, scope: !751)
!796 = !DILocation(line: 326, column: 43, scope: !751)
!797 = !DILocation(line: 326, column: 10, scope: !751)
!798 = !DILocation(line: 326, column: 8, scope: !751)
!799 = !DILocation(line: 327, column: 7, scope: !800)
!800 = distinct !DILexicalBlock(scope: !751, file: !3, line: 327, column: 7)
!801 = !DILocation(line: 327, column: 12, scope: !800)
!802 = !DILocation(line: 327, column: 7, scope: !751)
!803 = !DILocation(line: 328, column: 5, scope: !800)
!804 = !DILocation(line: 329, column: 8, scope: !805)
!805 = distinct !DILexicalBlock(scope: !751, file: !3, line: 329, column: 7)
!806 = !DILocation(line: 329, column: 7, scope: !805)
!807 = !DILocation(line: 329, column: 13, scope: !805)
!808 = !DILocation(line: 329, column: 7, scope: !751)
!809 = !DILocation(line: 330, column: 29, scope: !805)
!810 = !DILocation(line: 330, column: 28, scope: !805)
!811 = !DILocation(line: 330, column: 12, scope: !805)
!812 = !DILocation(line: 330, column: 37, scope: !805)
!813 = !DILocation(line: 330, column: 34, scope: !805)
!814 = !DILocation(line: 330, column: 5, scope: !805)
!815 = !DILocation(line: 332, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !751, file: !3, line: 332, column: 7)
!817 = !DILocation(line: 332, column: 21, scope: !816)
!818 = !DILocation(line: 332, column: 18, scope: !816)
!819 = !DILocation(line: 332, column: 7, scope: !751)
!820 = !DILocation(line: 334, column: 23, scope: !821)
!821 = distinct !DILexicalBlock(scope: !816, file: !3, line: 333, column: 5)
!822 = !DILocation(line: 334, column: 34, scope: !821)
!823 = !DILocation(line: 334, column: 21, scope: !821)
!824 = !DILocation(line: 335, column: 11, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !3, line: 335, column: 11)
!826 = !DILocation(line: 335, column: 29, scope: !825)
!827 = !DILocation(line: 335, column: 11, scope: !821)
!828 = !DILocation(line: 337, column: 24, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !3, line: 336, column: 2)
!830 = !DILocation(line: 337, column: 22, scope: !829)
!831 = !DILocation(line: 338, column: 12, scope: !829)
!832 = !DILocation(line: 338, column: 4, scope: !829)
!833 = !DILocation(line: 340, column: 23, scope: !829)
!834 = !DILocation(line: 340, column: 21, scope: !829)
!835 = !DILocation(line: 341, column: 12, scope: !829)
!836 = !DILocation(line: 341, column: 4, scope: !829)
!837 = !DILocation(line: 343, column: 2, scope: !829)
!838 = !DILocation(line: 347, column: 8, scope: !839)
!839 = distinct !DILexicalBlock(scope: !825, file: !3, line: 345, column: 2)
!840 = !DILocation(line: 347, column: 6, scope: !839)
!841 = !DILocation(line: 348, column: 23, scope: !839)
!842 = !DILocation(line: 348, column: 21, scope: !839)
!843 = !DILocation(line: 352, column: 20, scope: !821)
!844 = !DILocation(line: 352, column: 7, scope: !821)
!845 = !DILocation(line: 353, column: 17, scope: !821)
!846 = !DILocation(line: 354, column: 5, scope: !821)
!847 = !DILocation(line: 356, column: 14, scope: !816)
!848 = !DILocation(line: 356, column: 32, scope: !816)
!849 = !DILocation(line: 356, column: 13, scope: !816)
!850 = !DILocation(line: 356, column: 6, scope: !816)
!851 = !DILocation(line: 356, column: 11, scope: !816)
!852 = !DILocation(line: 357, column: 35, scope: !751)
!853 = !DILocation(line: 357, column: 3, scope: !751)
!854 = !DILocation(line: 357, column: 21, scope: !751)
!855 = !DILocation(line: 357, column: 33, scope: !751)
!856 = !DILocation(line: 358, column: 20, scope: !751)
!857 = !DILocation(line: 358, column: 3, scope: !751)
!858 = !DILocation(line: 359, column: 1, scope: !751)
!859 = distinct !DISubprogram(name: "htab_event_eq", scope: !3, file: !3, line: 300, type: !333, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!860 = !DILocalVariable(name: "e1", arg: 1, scope: !859, file: !3, line: 300, type: !328)
!861 = !DILocation(line: 300, column: 28, scope: !859)
!862 = !DILocalVariable(name: "s2", arg: 2, scope: !859, file: !3, line: 300, type: !328)
!863 = !DILocation(line: 300, column: 44, scope: !859)
!864 = !DILocalVariable(name: "s1", scope: !859, file: !3, line: 302, type: !234)
!865 = !DILocation(line: 302, column: 15, scope: !859)
!866 = !DILocation(line: 302, column: 43, scope: !859)
!867 = !DILocation(line: 302, column: 20, scope: !859)
!868 = !DILocation(line: 302, column: 19, scope: !859)
!869 = !DILocation(line: 303, column: 19, scope: !859)
!870 = !DILocation(line: 303, column: 38, scope: !859)
!871 = !DILocation(line: 303, column: 11, scope: !859)
!872 = !DILocation(line: 303, column: 10, scope: !859)
!873 = !DILocation(line: 303, column: 3, scope: !859)
!874 = distinct !DISubprogram(name: "register_callback", scope: !3, file: !3, line: 370, type: !875, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !234, !237, !254, !246}
!877 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !874, file: !3, line: 370, type: !234)
!878 = !DILocation(line: 370, column: 32, scope: !874)
!879 = !DILocalVariable(name: "event", arg: 2, scope: !874, file: !3, line: 371, type: !237)
!880 = !DILocation(line: 371, column: 10, scope: !874)
!881 = !DILocalVariable(name: "callback", arg: 3, scope: !874, file: !3, line: 372, type: !254)
!882 = !DILocation(line: 372, column: 41, scope: !874)
!883 = !DILocalVariable(name: "user_data", arg: 4, scope: !874, file: !3, line: 373, type: !246)
!884 = !DILocation(line: 373, column: 26, scope: !874)
!885 = !DILocation(line: 375, column: 11, scope: !874)
!886 = !DILocation(line: 375, column: 3, scope: !874)
!887 = !DILocation(line: 378, column: 2, scope: !888)
!888 = distinct !DILexicalBlock(scope: !874, file: !3, line: 376, column: 5)
!889 = !DILocation(line: 379, column: 54, scope: !888)
!890 = !DILocation(line: 379, column: 24, scope: !888)
!891 = !DILocation(line: 379, column: 9, scope: !888)
!892 = !DILocation(line: 380, column: 9, scope: !888)
!893 = !DILocation(line: 382, column: 2, scope: !888)
!894 = !DILocation(line: 383, column: 24, scope: !888)
!895 = !DILocation(line: 383, column: 60, scope: !888)
!896 = !DILocation(line: 383, column: 37, scope: !888)
!897 = !DILocation(line: 383, column: 2, scope: !888)
!898 = !DILocation(line: 384, column: 2, scope: !888)
!899 = !DILocation(line: 386, column: 2, scope: !888)
!900 = !DILocation(line: 387, column: 61, scope: !888)
!901 = !DILocation(line: 387, column: 32, scope: !888)
!902 = !DILocation(line: 387, column: 9, scope: !888)
!903 = !DILocation(line: 388, column: 2, scope: !888)
!904 = !DILocation(line: 390, column: 2, scope: !888)
!905 = !DILocation(line: 391, column: 63, scope: !888)
!906 = !DILocation(line: 391, column: 33, scope: !888)
!907 = !DILocation(line: 391, column: 9, scope: !888)
!908 = !DILocation(line: 392, column: 2, scope: !888)
!909 = !DILocation(line: 395, column: 6, scope: !910)
!910 = distinct !DILexicalBlock(scope: !888, file: !3, line: 395, column: 6)
!911 = !DILocation(line: 395, column: 12, scope: !910)
!912 = !DILocation(line: 395, column: 41, scope: !910)
!913 = !DILocation(line: 395, column: 44, scope: !910)
!914 = !DILocation(line: 395, column: 53, scope: !910)
!915 = !DILocation(line: 395, column: 50, scope: !910)
!916 = !DILocation(line: 395, column: 6, scope: !888)
!917 = !DILocation(line: 398, column: 6, scope: !918)
!918 = distinct !DILexicalBlock(scope: !910, file: !3, line: 396, column: 4)
!919 = !DILocation(line: 397, column: 6, scope: !918)
!920 = !DILocation(line: 399, column: 6, scope: !918)
!921 = !DILocalVariable(name: "new_callback", scope: !922, file: !3, line: 422, type: !249)
!922 = distinct !DILexicalBlock(scope: !888, file: !3, line: 421, column: 9)
!923 = !DILocation(line: 422, column: 33, scope: !922)
!924 = !DILocation(line: 423, column: 16, scope: !925)
!925 = distinct !DILexicalBlock(scope: !922, file: !3, line: 423, column: 15)
!926 = !DILocation(line: 423, column: 15, scope: !922)
!927 = !DILocation(line: 426, column: 24, scope: !928)
!928 = distinct !DILexicalBlock(scope: !925, file: !3, line: 424, column: 13)
!929 = !DILocation(line: 426, column: 37, scope: !928)
!930 = !DILocation(line: 426, column: 55, scope: !928)
!931 = !DILocation(line: 425, column: 15, scope: !928)
!932 = !DILocation(line: 427, column: 15, scope: !928)
!933 = !DILocation(line: 429, column: 26, scope: !922)
!934 = !DILocation(line: 429, column: 24, scope: !922)
!935 = !DILocation(line: 430, column: 39, scope: !922)
!936 = !DILocation(line: 430, column: 11, scope: !922)
!937 = !DILocation(line: 430, column: 25, scope: !922)
!938 = !DILocation(line: 430, column: 37, scope: !922)
!939 = !DILocation(line: 431, column: 32, scope: !922)
!940 = !DILocation(line: 431, column: 11, scope: !922)
!941 = !DILocation(line: 431, column: 25, scope: !922)
!942 = !DILocation(line: 431, column: 30, scope: !922)
!943 = !DILocation(line: 432, column: 37, scope: !922)
!944 = !DILocation(line: 432, column: 11, scope: !922)
!945 = !DILocation(line: 432, column: 25, scope: !922)
!946 = !DILocation(line: 432, column: 35, scope: !922)
!947 = !DILocation(line: 433, column: 32, scope: !922)
!948 = !DILocation(line: 433, column: 49, scope: !922)
!949 = !DILocation(line: 433, column: 11, scope: !922)
!950 = !DILocation(line: 433, column: 25, scope: !922)
!951 = !DILocation(line: 433, column: 30, scope: !922)
!952 = !DILocation(line: 434, column: 37, scope: !922)
!953 = !DILocation(line: 434, column: 11, scope: !922)
!954 = !DILocation(line: 434, column: 28, scope: !922)
!955 = !DILocation(line: 434, column: 35, scope: !922)
!956 = !DILocation(line: 436, column: 9, scope: !888)
!957 = !DILocation(line: 438, column: 1, scope: !874)
!958 = distinct !DISubprogram(name: "register_plugin_info", scope: !3, file: !3, line: 288, type: !959, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !234, !291}
!961 = !DILocalVariable(name: "name", arg: 1, scope: !958, file: !3, line: 288, type: !234)
!962 = !DILocation(line: 288, column: 35, scope: !958)
!963 = !DILocalVariable(name: "info", arg: 2, scope: !958, file: !3, line: 288, type: !291)
!964 = !DILocation(line: 288, column: 61, scope: !958)
!965 = !DILocalVariable(name: "slot", scope: !958, file: !3, line: 290, type: !338)
!966 = !DILocation(line: 290, column: 10, scope: !958)
!967 = !DILocation(line: 290, column: 33, scope: !958)
!968 = !DILocation(line: 290, column: 55, scope: !958)
!969 = !DILocation(line: 290, column: 17, scope: !958)
!970 = !DILocalVariable(name: "plugin", scope: !958, file: !3, line: 291, type: !227)
!971 = !DILocation(line: 291, column: 28, scope: !958)
!972 = !DILocation(line: 291, column: 66, scope: !958)
!973 = !DILocation(line: 291, column: 65, scope: !958)
!974 = !DILocation(line: 291, column: 37, scope: !958)
!975 = !DILocation(line: 292, column: 21, scope: !958)
!976 = !DILocation(line: 292, column: 27, scope: !958)
!977 = !DILocation(line: 292, column: 3, scope: !958)
!978 = !DILocation(line: 292, column: 11, scope: !958)
!979 = !DILocation(line: 292, column: 19, scope: !958)
!980 = !DILocation(line: 293, column: 18, scope: !958)
!981 = !DILocation(line: 293, column: 24, scope: !958)
!982 = !DILocation(line: 293, column: 3, scope: !958)
!983 = !DILocation(line: 293, column: 11, scope: !958)
!984 = !DILocation(line: 293, column: 16, scope: !958)
!985 = !DILocation(line: 294, column: 1, scope: !958)
!986 = distinct !DISubprogram(name: "unregister_callback", scope: !3, file: !3, line: 445, type: !987, scopeLine: 446, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!987 = !DISubroutineType(types: !988)
!988 = !{!237, !234, !237}
!989 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !986, file: !3, line: 445, type: !234)
!990 = !DILocation(line: 445, column: 34, scope: !986)
!991 = !DILocalVariable(name: "event", arg: 2, scope: !986, file: !3, line: 445, type: !237)
!992 = !DILocation(line: 445, column: 51, scope: !986)
!993 = !DILocalVariable(name: "callback", scope: !986, file: !3, line: 447, type: !249)
!994 = !DILocation(line: 447, column: 25, scope: !986)
!995 = !DILocalVariable(name: "cbp", scope: !986, file: !3, line: 447, type: !248)
!996 = !DILocation(line: 447, column: 37, scope: !986)
!997 = !DILocation(line: 449, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !986, file: !3, line: 449, column: 7)
!999 = !DILocation(line: 449, column: 16, scope: !998)
!1000 = !DILocation(line: 449, column: 13, scope: !998)
!1001 = !DILocation(line: 449, column: 7, scope: !986)
!1002 = !DILocation(line: 450, column: 5, scope: !998)
!1003 = !DILocation(line: 452, column: 15, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !986, file: !3, line: 452, column: 3)
!1005 = !DILocation(line: 452, column: 32, scope: !1004)
!1006 = !DILocation(line: 452, column: 12, scope: !1004)
!1007 = !DILocation(line: 452, column: 8, scope: !1004)
!1008 = !DILocation(line: 452, column: 53, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 452, column: 3)
!1010 = !DILocation(line: 452, column: 52, scope: !1009)
!1011 = !DILocation(line: 452, column: 50, scope: !1009)
!1012 = !DILocation(line: 452, column: 3, scope: !1004)
!1013 = !DILocation(line: 453, column: 17, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 453, column: 9)
!1015 = !DILocation(line: 453, column: 27, scope: !1014)
!1016 = !DILocation(line: 453, column: 40, scope: !1014)
!1017 = !DILocation(line: 453, column: 9, scope: !1014)
!1018 = !DILocation(line: 453, column: 53, scope: !1014)
!1019 = !DILocation(line: 453, column: 9, scope: !1009)
!1020 = !DILocation(line: 455, column: 9, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 454, column: 7)
!1022 = !DILocation(line: 455, column: 19, scope: !1021)
!1023 = !DILocation(line: 455, column: 3, scope: !1021)
!1024 = !DILocation(line: 455, column: 7, scope: !1021)
!1025 = !DILocation(line: 456, column: 2, scope: !1021)
!1026 = !DILocation(line: 453, column: 56, scope: !1014)
!1027 = !DILocation(line: 452, column: 66, scope: !1009)
!1028 = !DILocation(line: 452, column: 76, scope: !1009)
!1029 = !DILocation(line: 452, column: 63, scope: !1009)
!1030 = !DILocation(line: 452, column: 3, scope: !1009)
!1031 = distinct !{!1031, !1012, !1032}
!1032 = !DILocation(line: 457, column: 7, scope: !1004)
!1033 = !DILocation(line: 458, column: 3, scope: !986)
!1034 = !DILocation(line: 459, column: 1, scope: !986)
!1035 = distinct !DISubprogram(name: "invoke_plugin_callbacks", scope: !3, file: !3, line: 470, type: !1036, scopeLine: 471, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!237, !237, !246}
!1038 = !DILocalVariable(name: "event", arg: 1, scope: !1035, file: !3, line: 470, type: !237)
!1039 = !DILocation(line: 470, column: 30, scope: !1035)
!1040 = !DILocalVariable(name: "gcc_data", arg: 2, scope: !1035, file: !3, line: 470, type: !246)
!1041 = !DILocation(line: 470, column: 43, scope: !1035)
!1042 = !DILocalVariable(name: "retval", scope: !1035, file: !3, line: 472, type: !237)
!1043 = !DILocation(line: 472, column: 7, scope: !1035)
!1044 = !DILocation(line: 474, column: 3, scope: !1035)
!1045 = !DILocation(line: 474, column: 3, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 474, column: 3)
!1047 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 474, column: 3)
!1048 = !DILocation(line: 474, column: 3, scope: !1047)
!1049 = !DILocation(line: 476, column: 11, scope: !1035)
!1050 = !DILocation(line: 476, column: 3, scope: !1035)
!1051 = !DILocation(line: 477, column: 5, scope: !1035)
!1052 = !DILocation(line: 480, column: 2, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 477, column: 5)
!1054 = !DILocation(line: 481, column: 2, scope: !1053)
!1055 = !DILocalVariable(name: "callback", scope: !1056, file: !3, line: 505, type: !249)
!1056 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 502, column: 9)
!1057 = !DILocation(line: 505, column: 33, scope: !1056)
!1058 = !DILocation(line: 505, column: 44, scope: !1056)
!1059 = !DILocation(line: 505, column: 61, scope: !1056)
!1060 = !DILocation(line: 507, column: 9, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 507, column: 8)
!1062 = !DILocation(line: 507, column: 8, scope: !1056)
!1063 = !DILocation(line: 508, column: 13, scope: !1061)
!1064 = !DILocation(line: 508, column: 6, scope: !1061)
!1065 = !DILocation(line: 509, column: 11, scope: !1056)
!1066 = !DILocation(line: 509, column: 19, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 509, column: 11)
!1068 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 509, column: 11)
!1069 = !DILocation(line: 509, column: 11, scope: !1068)
!1070 = !DILocation(line: 510, column: 15, scope: !1067)
!1071 = !DILocation(line: 510, column: 25, scope: !1067)
!1072 = !DILocation(line: 510, column: 32, scope: !1067)
!1073 = !DILocation(line: 510, column: 42, scope: !1067)
!1074 = !DILocation(line: 510, column: 52, scope: !1067)
!1075 = !DILocation(line: 510, column: 13, scope: !1067)
!1076 = !DILocation(line: 509, column: 40, scope: !1067)
!1077 = !DILocation(line: 509, column: 50, scope: !1067)
!1078 = !DILocation(line: 509, column: 38, scope: !1067)
!1079 = !DILocation(line: 509, column: 11, scope: !1067)
!1080 = distinct !{!1080, !1069, !1081}
!1081 = !DILocation(line: 510, column: 61, scope: !1068)
!1082 = !DILocation(line: 512, column: 9, scope: !1053)
!1083 = !DILocation(line: 517, column: 9, scope: !1053)
!1084 = !DILocation(line: 518, column: 5, scope: !1053)
!1085 = !DILocation(line: 520, column: 3, scope: !1035)
!1086 = !DILocation(line: 520, column: 3, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 520, column: 3)
!1088 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 520, column: 3)
!1089 = !DILocation(line: 520, column: 3, scope: !1088)
!1090 = !DILocation(line: 521, column: 10, scope: !1035)
!1091 = !DILocation(line: 521, column: 3, scope: !1035)
!1092 = distinct !DISubprogram(name: "initialize_plugins", scope: !3, file: !3, line: 611, type: !1093, scopeLine: 612, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null}
!1095 = !DILocation(line: 614, column: 8, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 614, column: 7)
!1097 = !DILocation(line: 614, column: 7, scope: !1092)
!1098 = !DILocation(line: 615, column: 5, scope: !1096)
!1099 = !DILocation(line: 617, column: 3, scope: !1092)
!1100 = !DILocation(line: 617, column: 3, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 617, column: 3)
!1102 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 617, column: 3)
!1103 = !DILocation(line: 617, column: 3, scope: !1102)
!1104 = !DILocation(line: 624, column: 3, scope: !1092)
!1105 = !DILocation(line: 624, column: 3, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 624, column: 3)
!1107 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 624, column: 3)
!1108 = !DILocation(line: 624, column: 3, scope: !1107)
!1109 = !DILocation(line: 625, column: 1, scope: !1092)
!1110 = distinct !DISubprogram(name: "finalize_plugins", scope: !3, file: !3, line: 640, type: !1093, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1111 = !DILocation(line: 642, column: 8, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 642, column: 7)
!1113 = !DILocation(line: 642, column: 7, scope: !1110)
!1114 = !DILocation(line: 643, column: 5, scope: !1112)
!1115 = !DILocation(line: 650, column: 27, scope: !1110)
!1116 = !DILocation(line: 650, column: 3, scope: !1110)
!1117 = !DILocation(line: 653, column: 16, scope: !1110)
!1118 = !DILocation(line: 653, column: 3, scope: !1110)
!1119 = !DILocation(line: 654, column: 24, scope: !1110)
!1120 = !DILocation(line: 655, column: 1, scope: !1110)
!1121 = distinct !DISubprogram(name: "finalize_one_plugin", scope: !3, file: !3, line: 630, type: !1122, scopeLine: 631, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!237, !338, !246}
!1124 = !DILocalVariable(name: "slot", arg: 1, scope: !1121, file: !3, line: 630, type: !338)
!1125 = !DILocation(line: 630, column: 29, scope: !1121)
!1126 = !DILocalVariable(name: "info", arg: 2, scope: !1121, file: !3, line: 630, type: !246)
!1127 = !DILocation(line: 630, column: 42, scope: !1121)
!1128 = !DILocalVariable(name: "plugin", scope: !1121, file: !3, line: 632, type: !227)
!1129 = !DILocation(line: 632, column: 28, scope: !1121)
!1130 = !DILocation(line: 632, column: 66, scope: !1121)
!1131 = !DILocation(line: 632, column: 65, scope: !1121)
!1132 = !DILocation(line: 632, column: 37, scope: !1121)
!1133 = !DILocation(line: 633, column: 3, scope: !1121)
!1134 = !DILocation(line: 634, column: 3, scope: !1121)
!1135 = distinct !DISubprogram(name: "print_plugins_versions", scope: !3, file: !3, line: 681, type: !1136, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !376, !234}
!1138 = !DILocalVariable(name: "file", arg: 1, scope: !1135, file: !3, line: 681, type: !376)
!1139 = !DILocation(line: 681, column: 31, scope: !1135)
!1140 = !DILocalVariable(name: "indent", arg: 2, scope: !1135, file: !3, line: 681, type: !234)
!1141 = !DILocation(line: 681, column: 49, scope: !1135)
!1142 = !DILocalVariable(name: "opt", scope: !1135, file: !3, line: 683, type: !373)
!1143 = !DILocation(line: 683, column: 24, scope: !1135)
!1144 = !DILocation(line: 684, column: 14, scope: !1135)
!1145 = !DILocation(line: 684, column: 7, scope: !1135)
!1146 = !DILocation(line: 684, column: 12, scope: !1135)
!1147 = !DILocation(line: 685, column: 16, scope: !1135)
!1148 = !DILocation(line: 685, column: 7, scope: !1135)
!1149 = !DILocation(line: 685, column: 14, scope: !1135)
!1150 = !DILocation(line: 686, column: 8, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 686, column: 7)
!1152 = !DILocation(line: 686, column: 29, scope: !1151)
!1153 = !DILocation(line: 686, column: 47, scope: !1151)
!1154 = !DILocation(line: 686, column: 32, scope: !1151)
!1155 = !DILocation(line: 686, column: 69, scope: !1151)
!1156 = !DILocation(line: 686, column: 7, scope: !1135)
!1157 = !DILocation(line: 687, column: 5, scope: !1151)
!1158 = !DILocation(line: 689, column: 12, scope: !1135)
!1159 = !DILocation(line: 689, column: 53, scope: !1135)
!1160 = !DILocation(line: 689, column: 3, scope: !1135)
!1161 = !DILocation(line: 690, column: 27, scope: !1135)
!1162 = !DILocation(line: 690, column: 75, scope: !1135)
!1163 = !DILocation(line: 690, column: 3, scope: !1135)
!1164 = !DILocation(line: 691, column: 1, scope: !1135)
!1165 = distinct !DISubprogram(name: "print_version_one_plugin", scope: !3, file: !3, line: 668, type: !1122, scopeLine: 669, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1166 = !DILocalVariable(name: "slot", arg: 1, scope: !1165, file: !3, line: 668, type: !338)
!1167 = !DILocation(line: 668, column: 34, scope: !1165)
!1168 = !DILocalVariable(name: "data", arg: 2, scope: !1165, file: !3, line: 668, type: !246)
!1169 = !DILocation(line: 668, column: 46, scope: !1165)
!1170 = !DILocalVariable(name: "opt", scope: !1165, file: !3, line: 670, type: !372)
!1171 = !DILocation(line: 670, column: 25, scope: !1165)
!1172 = !DILocation(line: 670, column: 56, scope: !1165)
!1173 = !DILocation(line: 670, column: 31, scope: !1165)
!1174 = !DILocalVariable(name: "plugin", scope: !1165, file: !3, line: 671, type: !227)
!1175 = !DILocation(line: 671, column: 28, scope: !1165)
!1176 = !DILocation(line: 671, column: 66, scope: !1165)
!1177 = !DILocation(line: 671, column: 65, scope: !1165)
!1178 = !DILocation(line: 671, column: 37, scope: !1165)
!1179 = !DILocalVariable(name: "version", scope: !1165, file: !3, line: 672, type: !234)
!1180 = !DILocation(line: 672, column: 15, scope: !1165)
!1181 = !DILocation(line: 672, column: 25, scope: !1165)
!1182 = !DILocation(line: 672, column: 33, scope: !1165)
!1183 = !DILocation(line: 672, column: 43, scope: !1165)
!1184 = !DILocation(line: 672, column: 51, scope: !1165)
!1185 = !DILocation(line: 674, column: 12, scope: !1165)
!1186 = !DILocation(line: 674, column: 17, scope: !1165)
!1187 = !DILocation(line: 674, column: 38, scope: !1165)
!1188 = !DILocation(line: 674, column: 43, scope: !1165)
!1189 = !DILocation(line: 674, column: 51, scope: !1165)
!1190 = !DILocation(line: 674, column: 59, scope: !1165)
!1191 = !DILocation(line: 674, column: 70, scope: !1165)
!1192 = !DILocation(line: 674, column: 3, scope: !1165)
!1193 = !DILocation(line: 675, column: 3, scope: !1165)
!1194 = distinct !DISubprogram(name: "print_plugins_help", scope: !3, file: !3, line: 726, type: !1136, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1195 = !DILocalVariable(name: "file", arg: 1, scope: !1194, file: !3, line: 726, type: !376)
!1196 = !DILocation(line: 726, column: 27, scope: !1194)
!1197 = !DILocalVariable(name: "indent", arg: 2, scope: !1194, file: !3, line: 726, type: !234)
!1198 = !DILocation(line: 726, column: 45, scope: !1194)
!1199 = !DILocalVariable(name: "opt", scope: !1194, file: !3, line: 728, type: !373)
!1200 = !DILocation(line: 728, column: 24, scope: !1194)
!1201 = !DILocation(line: 729, column: 14, scope: !1194)
!1202 = !DILocation(line: 729, column: 7, scope: !1194)
!1203 = !DILocation(line: 729, column: 12, scope: !1194)
!1204 = !DILocation(line: 730, column: 16, scope: !1194)
!1205 = !DILocation(line: 730, column: 7, scope: !1194)
!1206 = !DILocation(line: 730, column: 14, scope: !1194)
!1207 = !DILocation(line: 731, column: 8, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 731, column: 7)
!1209 = !DILocation(line: 731, column: 29, scope: !1208)
!1210 = !DILocation(line: 731, column: 47, scope: !1208)
!1211 = !DILocation(line: 731, column: 32, scope: !1208)
!1212 = !DILocation(line: 731, column: 69, scope: !1208)
!1213 = !DILocation(line: 731, column: 7, scope: !1194)
!1214 = !DILocation(line: 732, column: 5, scope: !1208)
!1215 = !DILocation(line: 734, column: 12, scope: !1194)
!1216 = !DILocation(line: 734, column: 54, scope: !1194)
!1217 = !DILocation(line: 734, column: 3, scope: !1194)
!1218 = !DILocation(line: 735, column: 27, scope: !1194)
!1219 = !DILocation(line: 735, column: 72, scope: !1194)
!1220 = !DILocation(line: 735, column: 3, scope: !1194)
!1221 = !DILocation(line: 736, column: 1, scope: !1194)
!1222 = distinct !DISubprogram(name: "print_help_one_plugin", scope: !3, file: !3, line: 697, type: !1122, scopeLine: 698, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1223 = !DILocalVariable(name: "slot", arg: 1, scope: !1222, file: !3, line: 697, type: !338)
!1224 = !DILocation(line: 697, column: 31, scope: !1222)
!1225 = !DILocalVariable(name: "data", arg: 2, scope: !1222, file: !3, line: 697, type: !246)
!1226 = !DILocation(line: 697, column: 43, scope: !1222)
!1227 = !DILocalVariable(name: "opt", scope: !1222, file: !3, line: 699, type: !372)
!1228 = !DILocation(line: 699, column: 25, scope: !1222)
!1229 = !DILocation(line: 699, column: 56, scope: !1222)
!1230 = !DILocation(line: 699, column: 31, scope: !1222)
!1231 = !DILocalVariable(name: "plugin", scope: !1222, file: !3, line: 700, type: !227)
!1232 = !DILocation(line: 700, column: 28, scope: !1222)
!1233 = !DILocation(line: 700, column: 66, scope: !1222)
!1234 = !DILocation(line: 700, column: 65, scope: !1222)
!1235 = !DILocation(line: 700, column: 37, scope: !1222)
!1236 = !DILocalVariable(name: "help", scope: !1222, file: !3, line: 701, type: !234)
!1237 = !DILocation(line: 701, column: 15, scope: !1222)
!1238 = !DILocation(line: 701, column: 22, scope: !1222)
!1239 = !DILocation(line: 701, column: 30, scope: !1222)
!1240 = !DILocation(line: 701, column: 37, scope: !1222)
!1241 = !DILocation(line: 701, column: 45, scope: !1222)
!1242 = !DILocalVariable(name: "dup", scope: !1222, file: !3, line: 703, type: !231)
!1243 = !DILocation(line: 703, column: 9, scope: !1222)
!1244 = !DILocation(line: 703, column: 24, scope: !1222)
!1245 = !DILocation(line: 703, column: 15, scope: !1222)
!1246 = !DILocalVariable(name: "p", scope: !1222, file: !3, line: 704, type: !231)
!1247 = !DILocation(line: 704, column: 9, scope: !1222)
!1248 = !DILocalVariable(name: "nl", scope: !1222, file: !3, line: 704, type: !231)
!1249 = !DILocation(line: 704, column: 13, scope: !1222)
!1250 = !DILocation(line: 705, column: 12, scope: !1222)
!1251 = !DILocation(line: 705, column: 17, scope: !1222)
!1252 = !DILocation(line: 705, column: 35, scope: !1222)
!1253 = !DILocation(line: 705, column: 40, scope: !1222)
!1254 = !DILocation(line: 705, column: 48, scope: !1222)
!1255 = !DILocation(line: 705, column: 56, scope: !1222)
!1256 = !DILocation(line: 705, column: 3, scope: !1222)
!1257 = !DILocation(line: 707, column: 17, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1222, file: !3, line: 707, column: 3)
!1259 = !DILocation(line: 707, column: 15, scope: !1258)
!1260 = !DILocation(line: 707, column: 10, scope: !1258)
!1261 = !DILocation(line: 707, column: 8, scope: !1258)
!1262 = !DILocation(line: 707, column: 22, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 707, column: 3)
!1264 = !DILocation(line: 707, column: 3, scope: !1258)
!1265 = !DILocation(line: 709, column: 20, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 708, column: 5)
!1267 = !DILocation(line: 709, column: 12, scope: !1266)
!1268 = !DILocation(line: 709, column: 10, scope: !1266)
!1269 = !DILocation(line: 710, column: 11, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 710, column: 11)
!1271 = !DILocation(line: 710, column: 11, scope: !1266)
!1272 = !DILocation(line: 712, column: 5, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 711, column: 2)
!1274 = !DILocation(line: 712, column: 8, scope: !1273)
!1275 = !DILocation(line: 713, column: 6, scope: !1273)
!1276 = !DILocation(line: 714, column: 2, scope: !1273)
!1277 = !DILocation(line: 715, column: 16, scope: !1266)
!1278 = !DILocation(line: 715, column: 21, scope: !1266)
!1279 = !DILocation(line: 715, column: 41, scope: !1266)
!1280 = !DILocation(line: 715, column: 46, scope: !1266)
!1281 = !DILocation(line: 715, column: 54, scope: !1266)
!1282 = !DILocation(line: 715, column: 7, scope: !1266)
!1283 = !DILocation(line: 716, column: 5, scope: !1266)
!1284 = !DILocation(line: 707, column: 30, scope: !1263)
!1285 = !DILocation(line: 707, column: 28, scope: !1263)
!1286 = !DILocation(line: 707, column: 3, scope: !1263)
!1287 = distinct !{!1287, !1264, !1288}
!1288 = !DILocation(line: 716, column: 5, scope: !1258)
!1289 = !DILocation(line: 718, column: 9, scope: !1222)
!1290 = !DILocation(line: 718, column: 3, scope: !1222)
!1291 = !DILocation(line: 719, column: 3, scope: !1222)
!1292 = distinct !DISubprogram(name: "plugins_active_p", scope: !3, file: !3, line: 742, type: !271, scopeLine: 743, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1293 = !DILocalVariable(name: "event", scope: !1292, file: !3, line: 744, type: !237)
!1294 = !DILocation(line: 744, column: 7, scope: !1292)
!1295 = !DILocation(line: 746, column: 14, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1292, file: !3, line: 746, column: 3)
!1297 = !DILocation(line: 746, column: 8, scope: !1296)
!1298 = !DILocation(line: 746, column: 43, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1296, file: !3, line: 746, column: 3)
!1300 = !DILocation(line: 746, column: 51, scope: !1299)
!1301 = !DILocation(line: 746, column: 49, scope: !1299)
!1302 = !DILocation(line: 746, column: 3, scope: !1296)
!1303 = !DILocation(line: 747, column: 9, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1299, file: !3, line: 747, column: 9)
!1305 = !DILocation(line: 747, column: 26, scope: !1304)
!1306 = !DILocation(line: 747, column: 9, scope: !1299)
!1307 = !DILocation(line: 748, column: 7, scope: !1304)
!1308 = !DILocation(line: 747, column: 31, scope: !1304)
!1309 = !DILocation(line: 746, column: 68, scope: !1299)
!1310 = !DILocation(line: 746, column: 3, scope: !1299)
!1311 = distinct !{!1311, !1302, !1312}
!1312 = !DILocation(line: 748, column: 14, scope: !1296)
!1313 = !DILocation(line: 750, column: 3, scope: !1292)
!1314 = !DILocation(line: 751, column: 1, scope: !1292)
!1315 = distinct !DISubprogram(name: "dump_active_plugins", scope: !3, file: !3, line: 758, type: !1316, scopeLine: 759, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !376}
!1318 = !DILocalVariable(name: "file", arg: 1, scope: !1315, file: !3, line: 758, type: !376)
!1319 = !DILocation(line: 758, column: 28, scope: !1315)
!1320 = !DILocalVariable(name: "event", scope: !1315, file: !3, line: 760, type: !237)
!1321 = !DILocation(line: 760, column: 7, scope: !1315)
!1322 = !DILocation(line: 762, column: 8, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 762, column: 7)
!1324 = !DILocation(line: 762, column: 7, scope: !1315)
!1325 = !DILocation(line: 763, column: 5, scope: !1323)
!1326 = !DILocation(line: 765, column: 12, scope: !1315)
!1327 = !DILocation(line: 765, column: 3, scope: !1315)
!1328 = !DILocation(line: 766, column: 14, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1315, file: !3, line: 766, column: 3)
!1330 = !DILocation(line: 766, column: 8, scope: !1329)
!1331 = !DILocation(line: 766, column: 43, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1329, file: !3, line: 766, column: 3)
!1333 = !DILocation(line: 766, column: 51, scope: !1332)
!1334 = !DILocation(line: 766, column: 49, scope: !1332)
!1335 = !DILocation(line: 766, column: 3, scope: !1329)
!1336 = !DILocation(line: 767, column: 9, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1332, file: !3, line: 767, column: 9)
!1338 = !DILocation(line: 767, column: 26, scope: !1337)
!1339 = !DILocation(line: 767, column: 9, scope: !1332)
!1340 = !DILocalVariable(name: "ci", scope: !1341, file: !3, line: 769, type: !249)
!1341 = distinct !DILexicalBlock(scope: !1337, file: !3, line: 768, column: 7)
!1342 = !DILocation(line: 769, column: 24, scope: !1341)
!1343 = !DILocation(line: 771, column: 11, scope: !1341)
!1344 = !DILocation(line: 771, column: 44, scope: !1341)
!1345 = !DILocation(line: 771, column: 62, scope: !1341)
!1346 = !DILocation(line: 771, column: 2, scope: !1341)
!1347 = !DILocation(line: 773, column: 12, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 773, column: 2)
!1349 = !DILocation(line: 773, column: 29, scope: !1348)
!1350 = !DILocation(line: 773, column: 10, scope: !1348)
!1351 = !DILocation(line: 773, column: 7, scope: !1348)
!1352 = !DILocation(line: 773, column: 37, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1348, file: !3, line: 773, column: 2)
!1354 = !DILocation(line: 773, column: 2, scope: !1348)
!1355 = !DILocation(line: 774, column: 13, scope: !1353)
!1356 = !DILocation(line: 774, column: 26, scope: !1353)
!1357 = !DILocation(line: 774, column: 30, scope: !1353)
!1358 = !DILocation(line: 774, column: 4, scope: !1353)
!1359 = !DILocation(line: 773, column: 46, scope: !1353)
!1360 = !DILocation(line: 773, column: 50, scope: !1353)
!1361 = !DILocation(line: 773, column: 44, scope: !1353)
!1362 = !DILocation(line: 773, column: 2, scope: !1353)
!1363 = distinct !{!1363, !1354, !1364}
!1364 = !DILocation(line: 774, column: 41, scope: !1348)
!1365 = !DILocation(line: 776, column: 13, scope: !1341)
!1366 = !DILocation(line: 776, column: 2, scope: !1341)
!1367 = !DILocation(line: 777, column: 7, scope: !1341)
!1368 = !DILocation(line: 767, column: 31, scope: !1337)
!1369 = !DILocation(line: 766, column: 68, scope: !1332)
!1370 = !DILocation(line: 766, column: 3, scope: !1332)
!1371 = distinct !{!1371, !1335, !1372}
!1372 = !DILocation(line: 777, column: 7, scope: !1329)
!1373 = !DILocation(line: 778, column: 1, scope: !1315)
!1374 = distinct !DISubprogram(name: "debug_active_plugins", scope: !3, file: !3, line: 784, type: !1093, scopeLine: 785, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1375 = !DILocation(line: 786, column: 24, scope: !1374)
!1376 = !DILocation(line: 786, column: 3, scope: !1374)
!1377 = !DILocation(line: 787, column: 1, scope: !1374)
!1378 = distinct !DISubprogram(name: "plugin_default_version_check", scope: !3, file: !3, line: 792, type: !1379, scopeLine: 794, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!273, !1381, !1381}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_gcc_version", file: !200, line: 59, size: 320, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "basever", scope: !1382, file: !200, line: 61, baseType: !234, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "datestamp", scope: !1382, file: !200, line: 62, baseType: !234, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "devphase", scope: !1382, file: !200, line: 63, baseType: !234, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !1382, file: !200, line: 64, baseType: !234, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "configuration_arguments", scope: !1382, file: !200, line: 65, baseType: !234, size: 64, offset: 256)
!1389 = !DILocalVariable(name: "gcc_version", arg: 1, scope: !1378, file: !3, line: 792, type: !1381)
!1390 = !DILocation(line: 792, column: 58, scope: !1378)
!1391 = !DILocalVariable(name: "plugin_version", arg: 2, scope: !1378, file: !3, line: 793, type: !1381)
!1392 = !DILocation(line: 793, column: 37, scope: !1378)
!1393 = !DILocation(line: 795, column: 8, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 795, column: 7)
!1395 = !DILocation(line: 795, column: 20, scope: !1394)
!1396 = !DILocation(line: 795, column: 24, scope: !1394)
!1397 = !DILocation(line: 795, column: 7, scope: !1378)
!1398 = !DILocation(line: 796, column: 5, scope: !1394)
!1399 = !DILocation(line: 798, column: 15, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 798, column: 7)
!1401 = !DILocation(line: 798, column: 28, scope: !1400)
!1402 = !DILocation(line: 798, column: 37, scope: !1400)
!1403 = !DILocation(line: 798, column: 53, scope: !1400)
!1404 = !DILocation(line: 798, column: 7, scope: !1400)
!1405 = !DILocation(line: 798, column: 7, scope: !1378)
!1406 = !DILocation(line: 799, column: 5, scope: !1400)
!1407 = !DILocation(line: 800, column: 15, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 800, column: 7)
!1409 = !DILocation(line: 800, column: 28, scope: !1408)
!1410 = !DILocation(line: 800, column: 39, scope: !1408)
!1411 = !DILocation(line: 800, column: 55, scope: !1408)
!1412 = !DILocation(line: 800, column: 7, scope: !1408)
!1413 = !DILocation(line: 800, column: 7, scope: !1378)
!1414 = !DILocation(line: 801, column: 5, scope: !1408)
!1415 = !DILocation(line: 802, column: 15, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 802, column: 7)
!1417 = !DILocation(line: 802, column: 28, scope: !1416)
!1418 = !DILocation(line: 802, column: 38, scope: !1416)
!1419 = !DILocation(line: 802, column: 54, scope: !1416)
!1420 = !DILocation(line: 802, column: 7, scope: !1416)
!1421 = !DILocation(line: 802, column: 7, scope: !1378)
!1422 = !DILocation(line: 803, column: 5, scope: !1416)
!1423 = !DILocation(line: 804, column: 15, scope: !1424)
!1424 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 804, column: 7)
!1425 = !DILocation(line: 804, column: 28, scope: !1424)
!1426 = !DILocation(line: 804, column: 38, scope: !1424)
!1427 = !DILocation(line: 804, column: 54, scope: !1424)
!1428 = !DILocation(line: 804, column: 7, scope: !1424)
!1429 = !DILocation(line: 804, column: 7, scope: !1378)
!1430 = !DILocation(line: 805, column: 5, scope: !1424)
!1431 = !DILocation(line: 806, column: 15, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1378, file: !3, line: 806, column: 7)
!1433 = !DILocation(line: 806, column: 28, scope: !1432)
!1434 = !DILocation(line: 807, column: 8, scope: !1432)
!1435 = !DILocation(line: 807, column: 24, scope: !1432)
!1436 = !DILocation(line: 806, column: 7, scope: !1432)
!1437 = !DILocation(line: 806, column: 7, scope: !1378)
!1438 = !DILocation(line: 808, column: 5, scope: !1432)
!1439 = !DILocation(line: 809, column: 3, scope: !1378)
!1440 = !DILocation(line: 810, column: 1, scope: !1378)
!1441 = distinct !DISubprogram(name: "get_event_last", scope: !3, file: !3, line: 817, type: !1442, scopeLine: 818, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !460)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!237}
!1444 = !DILocation(line: 819, column: 10, scope: !1441)
!1445 = !DILocation(line: 819, column: 3, scope: !1441)
