; ModuleID = 'ipa-type-escape.c'
source_filename = "ipa-type-escape.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.splay_tree_s = type { %struct.splay_tree_node_s*, i32 (i64, i64)*, void (i64)*, void (i64)*, i8* (i32, i8*)*, void (i8*, i8*)*, i8* }
%struct.splay_tree_node_s = type { i64, i64, %struct.splay_tree_node_s*, %struct.splay_tree_node_s* }
%struct.pointer_set_t = type opaque
%struct.simple_ipa_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }

!679 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!680 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!681 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!682 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!683 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!684 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!685 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!686 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!687 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!688 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!689 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!690 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!691 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!692 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!693 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!694 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!695 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!696 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!697 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!698 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!699 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!700 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!701 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!702 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!703 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!704 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!705 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!706 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!707 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!708 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!709 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!710 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !202, line: 295, baseType: !7, size: 32, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!713 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!714 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!715 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!716 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!717 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!718 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!719 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!720 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!721 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!722 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!723 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!724 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "availability", file: !555, line: 27, baseType: !7, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DIEnumerator(name: "AVAIL_UNSET", value: 0, isUnsigned: true)
!728 = !DIEnumerator(name: "AVAIL_NOT_AVAILABLE", value: 1, isUnsigned: true)
!729 = !DIEnumerator(name: "AVAIL_OVERWRITABLE", value: 2, isUnsigned: true)
!730 = !DIEnumerator(name: "AVAIL_AVAILABLE", value: 3, isUnsigned: true)
!731 = !DIEnumerator(name: "AVAIL_LOCAL", value: 4, isUnsigned: true)
!732 = !{!5, !733, !737, !794, !789, !803, !1916, !1921, !1225, !1922, !1097, !1928, !1130, !777, !1930, !532}
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !734, line: 62, baseType: !735)
!734 = !DIFile(filename: "./include/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !734, line: 41, baseType: !736)
!736 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !738, line: 47, baseType: !739)
!738 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !741, line: 75, size: 256, elements: !742)
!741 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !{!743, !757, !758, !759}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !740, file: !741, line: 76, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !741, line: 68, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !741, line: 63, size: 320, elements: !747)
!747 = !{!748, !750, !751, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !741, line: 64, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !746, file: !741, line: 65, baseType: !749, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !746, file: !741, line: 66, baseType: !7, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !746, file: !741, line: 67, baseType: !753, size: 128, offset: 192)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 128, elements: !755)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !741, line: 29, baseType: !736)
!755 = !{!756}
!756 = !DISubrange(count: 2)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !740, file: !741, line: 77, baseType: !744, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !740, file: !741, line: 78, baseType: !7, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !740, file: !741, line: 79, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !741, line: 49, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !741, line: 45, size: 832, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !762, file: !741, line: 46, baseType: !749, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !762, file: !741, line: 47, baseType: !739, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !762, file: !741, line: 48, baseType: !767, size: 704, offset: 128)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !768, line: 164, size: 704, elements: !769)
!768 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !{!770, !772, !784, !785, !786, !787, !788, !790, !795, !799, !800, !801, !802}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !767, file: !768, line: 166, baseType: !771, size: 64)
!771 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !767, file: !768, line: 167, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !768, line: 157, size: 192, elements: !775)
!775 = !{!776, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !774, file: !768, line: 159, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !768, line: 160, baseType: !773, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !774, file: !768, line: 161, baseType: !781, size: 32, offset: 128)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 32, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 4)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !767, file: !768, line: 168, baseType: !777, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !767, file: !768, line: 169, baseType: !777, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !767, file: !768, line: 170, baseType: !777, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !767, file: !768, line: 171, baseType: !771, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !767, file: !768, line: 172, baseType: !789, size: 32, offset: 384)
!789 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !767, file: !768, line: 176, baseType: !791, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!773, !794, !771}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !767, file: !768, line: 177, baseType: !796, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !794, !773}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !767, file: !768, line: 178, baseType: !794, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !767, file: !768, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !767, file: !768, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !767, file: !768, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !738, line: 56, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !806)
!806 = !{!807, !840, !846, !857, !864, !871, !876, !885, !891, !905, !917, !955, !963, !991, !1008, !1009, !1014, !1023, !1029, !1034, !1038, !1042, !1565, !1614, !1620, !1626, !1633, !1646, !1660, !1677, !1689, !1711, !1726, !1898}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !805, file: !6, line: 3372, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !808, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !808, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !808, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !808, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !808, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !808, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !808, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !808, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !808, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !808, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !808, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !808, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !808, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !808, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !808, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !808, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !808, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !808, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !808, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !808, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !808, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !808, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !808, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !808, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !808, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !808, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !808, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !808, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !808, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !808, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !6, line: 3373, baseType: !841, size: 192)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !842)
!842 = !{!843, !844, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !841, file: !6, line: 403, baseType: !808, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !841, file: !6, line: 404, baseType: !803, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !841, file: !6, line: 405, baseType: !803, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !805, file: !6, line: 3374, baseType: !847, size: 320)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !6, line: 1385, baseType: !841, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !847, file: !6, line: 1386, baseType: !851, size: 128, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !852, line: 58, baseType: !853)
!852 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 54, size: 128, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !853, file: !852, line: 56, baseType: !736, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !853, file: !852, line: 57, baseType: !771, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !805, file: !6, line: 3375, baseType: !858, size: 256)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !6, line: 1398, baseType: !841, size: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !858, file: !6, line: 1399, baseType: !862, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !805, file: !6, line: 3376, baseType: !865, size: 256)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !6, line: 1409, baseType: !841, size: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !865, file: !6, line: 1410, baseType: !869, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !805, file: !6, line: 3377, baseType: !872, size: 256)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !6, line: 1438, baseType: !841, size: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !872, file: !6, line: 1439, baseType: !803, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !805, file: !6, line: 3378, baseType: !877, size: 256)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !6, line: 1419, baseType: !841, size: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !877, file: !6, line: 1420, baseType: !789, size: 32, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !877, file: !6, line: 1421, baseType: !882, size: 8, offset: 224)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 8, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 1)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !805, file: !6, line: 3379, baseType: !886, size: 320)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !6, line: 1429, baseType: !841, size: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !886, file: !6, line: 1430, baseType: !803, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !886, file: !6, line: 1431, baseType: !803, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !805, file: !6, line: 3380, baseType: !892, size: 320)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !6, line: 1461, baseType: !841, size: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !892, file: !6, line: 1462, baseType: !896, size: 128, offset: 192)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !897, line: 31, size: 128, elements: !898)
!897 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!898 = !{!899, !903, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !896, file: !897, line: 32, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !896, file: !897, line: 33, baseType: !7, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !896, file: !897, line: 34, baseType: !7, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !805, file: !6, line: 3381, baseType: !906, size: 384)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !907)
!907 = !{!908, !909, !914, !915, !916}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !906, file: !6, line: 2508, baseType: !841, size: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !906, file: !6, line: 2509, baseType: !910, size: 32, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !911, line: 58, baseType: !912)
!911 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !913, line: 44, baseType: !7)
!913 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!914 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !906, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !6, line: 2511, baseType: !803, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !906, file: !6, line: 2512, baseType: !803, size: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !805, file: !6, line: 3382, baseType: !918, size: 896)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !6, line: 2653, baseType: !906, size: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !918, file: !6, line: 2654, baseType: !803, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !918, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !918, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !918, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !918, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !918, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !918, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !918, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !918, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !918, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !918, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !918, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !918, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !918, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !918, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !918, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !918, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !918, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !918, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !918, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !918, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !918, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !918, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !918, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !918, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !918, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !918, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !918, file: !6, line: 2705, baseType: !803, size: 64, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !918, file: !6, line: 2706, baseType: !803, size: 64, offset: 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !918, file: !6, line: 2707, baseType: !803, size: 64, offset: 704)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !918, file: !6, line: 2708, baseType: !803, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !918, file: !6, line: 2711, baseType: !953, size: 64, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !805, file: !6, line: 3383, baseType: !956, size: 960)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !956, file: !6, line: 2757, baseType: !918, size: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !956, file: !6, line: 2758, baseType: !960, size: 64, offset: 896)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !738, line: 50, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !738, line: 49, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !805, file: !6, line: 3384, baseType: !964, size: 1472)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !965)
!965 = !{!966, !987, !988, !989, !990}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !6, line: 3115, baseType: !967, size: 1216)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !6, line: 2985, baseType: !956, size: 960)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !967, file: !6, line: 2986, baseType: !803, size: 64, offset: 960)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !967, file: !6, line: 2987, baseType: !803, size: 64, offset: 1024)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !967, file: !6, line: 2988, baseType: !803, size: 64, offset: 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !967, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !967, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !967, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !967, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !967, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !967, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !967, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !967, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !967, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !967, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !967, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !967, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !967, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !967, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !964, file: !6, line: 3117, baseType: !803, size: 64, offset: 1216)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !964, file: !6, line: 3119, baseType: !803, size: 64, offset: 1280)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !964, file: !6, line: 3121, baseType: !803, size: 64, offset: 1344)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !964, file: !6, line: 3123, baseType: !803, size: 64, offset: 1408)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !805, file: !6, line: 3385, baseType: !992, size: 1088)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !6, line: 2875, baseType: !956, size: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !992, file: !6, line: 2876, baseType: !960, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !992, file: !6, line: 2877, baseType: !997, size: 64, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !999, line: 172, size: 128, elements: !1000)
!999 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !998, file: !999, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !998, file: !999, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !998, file: !999, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !998, file: !999, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !998, file: !999, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !998, file: !999, line: 195, baseType: !7, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !998, file: !999, line: 199, baseType: !803, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !805, file: !6, line: 3386, baseType: !967, size: 1216)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !805, file: !6, line: 3387, baseType: !1010, size: 1280)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !6, line: 3094, baseType: !967, size: 1216)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1010, file: !6, line: 3095, baseType: !997, size: 64, offset: 1216)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !805, file: !6, line: 3388, baseType: !1015, size: 1216)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !6, line: 2825, baseType: !918, size: 896)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1015, file: !6, line: 2827, baseType: !803, size: 64, offset: 896)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1015, file: !6, line: 2828, baseType: !803, size: 64, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1015, file: !6, line: 2829, baseType: !803, size: 64, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1015, file: !6, line: 2830, baseType: !803, size: 64, offset: 1088)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1015, file: !6, line: 2831, baseType: !803, size: 64, offset: 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !805, file: !6, line: 3389, baseType: !1024, size: 1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !6, line: 2851, baseType: !956, size: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1024, file: !6, line: 2852, baseType: !789, size: 32, offset: 960)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1024, file: !6, line: 2853, baseType: !789, size: 32, offset: 992)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !805, file: !6, line: 3390, baseType: !1030, size: 1024)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !6, line: 2858, baseType: !956, size: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1030, file: !6, line: 2859, baseType: !997, size: 64, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !805, file: !6, line: 3391, baseType: !1035, size: 960)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !6, line: 2863, baseType: !956, size: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !805, file: !6, line: 3392, baseType: !1039, size: 1472)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !1040)
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !6, line: 3305, baseType: !964, size: 1472)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !805, file: !6, line: 3393, baseType: !1043, size: 1792)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !1044)
!1044 = !{!1045, !1046, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !6, line: 3249, baseType: !964, size: 1472)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1043, file: !6, line: 3251, baseType: !1047, size: 64, offset: 1472)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1049, line: 463, size: 1152, elements: !1050)
!1049 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1050 = !{!1051, !1054, !1370, !1371, !1485, !1488, !1489, !1490, !1491, !1492, !1493, !1517, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1048, file: !1049, line: 464, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1049, line: 464, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1048, file: !1049, line: 467, baseType: !1055, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !1057)
!1057 = !{!1058, !1345, !1346, !1359, !1360, !1361, !1362, !1363, !1364, !1366, !1368, !1369}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1056, file: !202, line: 377, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !738, line: 111, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !1062)
!1062 = !{!1063, !1310, !1311, !1312, !1315, !1319, !1320, !1321, !1339, !1340, !1341, !1342, !1343, !1344}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1061, file: !202, line: 219, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !1067)
!1067 = !{!1068}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1066, file: !202, line: 151, baseType: !1069, size: 128)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !1071)
!1071 = !{!1072, !1073, !1074}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1070, file: !202, line: 150, baseType: !7, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1070, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1070, file: !202, line: 150, baseType: !1075, size: 64, offset: 64)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 64, elements: !883)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !738, line: 108, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1078, file: !202, line: 124, baseType: !1060, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1078, file: !202, line: 125, baseType: !1060, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1078, file: !202, line: 131, baseType: !1083, size: 64, offset: 128)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !1084)
!1084 = !{!1085, !1301}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1083, file: !202, line: 129, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !738, line: 66, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !446, line: 143, size: 192, elements: !1089)
!1089 = !{!1090, !1299, !1300}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1088, file: !446, line: 145, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !738, line: 69, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !446, line: 136, size: 192, elements: !1094)
!1094 = !{!1095, !1297, !1298}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1093, file: !446, line: 137, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !738, line: 58, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !446, line: 737, size: 768, elements: !1099)
!1099 = !{!1100, !1117, !1150, !1156, !1161, !1166, !1173, !1179, !1185, !1190, !1204, !1209, !1215, !1220, !1232, !1237, !1255, !1262, !1269, !1275, !1280, !1286, !1292}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !446, line: 738, baseType: !1101, size: 256)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !446, line: 271, size: 256, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1101, file: !446, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1101, file: !446, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1101, file: !446, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1101, file: !446, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1101, file: !446, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1101, file: !446, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1101, file: !446, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1101, file: !446, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1101, file: !446, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1101, file: !446, line: 312, baseType: !7, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1101, file: !446, line: 316, baseType: !910, size: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1101, file: !446, line: 319, baseType: !7, size: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1101, file: !446, line: 323, baseType: !1060, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1101, file: !446, line: 327, baseType: !803, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1098, file: !446, line: 739, baseType: !1118, size: 448)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !446, line: 350, size: 448, elements: !1119)
!1119 = !{!1120, !1148}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1118, file: !446, line: 353, baseType: !1121, size: 384)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !446, line: 333, size: 384, elements: !1122)
!1122 = !{!1123, !1124, !1131}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1121, file: !446, line: 336, baseType: !1101, size: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1121, file: !446, line: 343, baseType: !1125, size: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !485, line: 37, size: 128, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1126, file: !485, line: 39, baseType: !1125, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1126, file: !485, line: 40, baseType: !1130, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1121, file: !446, line: 344, baseType: !1132, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !485, line: 45, size: 320, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1133, file: !485, line: 47, baseType: !1132, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1133, file: !485, line: 48, baseType: !1137, size: 256, offset: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !1138)
!1138 = !{!1139, !1141, !1142, !1147}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1137, file: !6, line: 1884, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !6, line: 1885, baseType: !1140, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1137, file: !6, line: 1891, baseType: !1143, size: 64, offset: 128)
!1143 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1137, file: !6, line: 1891, size: 64, elements: !1144)
!1144 = !{!1145, !1146}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1143, file: !6, line: 1891, baseType: !1096, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1143, file: !6, line: 1891, baseType: !803, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1137, file: !6, line: 1892, baseType: !1130, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1118, file: !446, line: 359, baseType: !1149, size: 64, offset: 384)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 64, elements: !883)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1098, file: !446, line: 740, baseType: !1151, size: 512)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !446, line: 365, size: 512, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1151, file: !446, line: 368, baseType: !1121, size: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1151, file: !446, line: 373, baseType: !803, size: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1151, file: !446, line: 374, baseType: !803, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1098, file: !446, line: 741, baseType: !1157, size: 576)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !446, line: 380, size: 576, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1157, file: !446, line: 383, baseType: !1151, size: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1157, file: !446, line: 389, baseType: !1149, size: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1098, file: !446, line: 742, baseType: !1162, size: 320)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !446, line: 395, size: 320, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1162, file: !446, line: 397, baseType: !1101, size: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1162, file: !446, line: 400, baseType: !1086, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1098, file: !446, line: 743, baseType: !1167, size: 448)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !446, line: 406, size: 448, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1167, file: !446, line: 408, baseType: !1101, size: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1167, file: !446, line: 412, baseType: !803, size: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1167, file: !446, line: 420, baseType: !803, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1167, file: !446, line: 423, baseType: !1086, size: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1098, file: !446, line: 744, baseType: !1174, size: 384)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !446, line: 429, size: 384, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1174, file: !446, line: 431, baseType: !1101, size: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1174, file: !446, line: 434, baseType: !803, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1174, file: !446, line: 437, baseType: !1086, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1098, file: !446, line: 745, baseType: !1180, size: 384)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !446, line: 443, size: 384, elements: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1180, file: !446, line: 445, baseType: !1101, size: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1180, file: !446, line: 449, baseType: !803, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1180, file: !446, line: 453, baseType: !1086, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1098, file: !446, line: 746, baseType: !1186, size: 320)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !446, line: 459, size: 320, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1186, file: !446, line: 461, baseType: !1101, size: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1186, file: !446, line: 464, baseType: !803, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1098, file: !446, line: 747, baseType: !1191, size: 768)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !446, line: 469, size: 768, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1191, file: !446, line: 471, baseType: !1101, size: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1191, file: !446, line: 474, baseType: !7, size: 32, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1191, file: !446, line: 475, baseType: !7, size: 32, offset: 288)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1191, file: !446, line: 478, baseType: !803, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1191, file: !446, line: 481, baseType: !1198, size: 384, offset: 384)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 384, elements: !883)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1199, file: !6, line: 1920, baseType: !1137, size: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1199, file: !6, line: 1921, baseType: !803, size: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1199, file: !6, line: 1922, baseType: !910, size: 32, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1098, file: !446, line: 748, baseType: !1205, size: 320)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !446, line: 487, size: 320, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1205, file: !446, line: 490, baseType: !1101, size: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1205, file: !446, line: 494, baseType: !789, size: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1098, file: !446, line: 749, baseType: !1210, size: 384)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !446, line: 500, size: 384, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1210, file: !446, line: 502, baseType: !1101, size: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1210, file: !446, line: 506, baseType: !1086, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1210, file: !446, line: 510, baseType: !1086, size: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1098, file: !446, line: 750, baseType: !1216, size: 320)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !446, line: 529, size: 320, elements: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1216, file: !446, line: 531, baseType: !1101, size: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1216, file: !446, line: 540, baseType: !1086, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1098, file: !446, line: 751, baseType: !1221, size: 704)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !446, line: 546, size: 704, elements: !1222)
!1222 = !{!1223, !1224, !1227, !1228, !1229, !1230, !1231}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1221, file: !446, line: 549, baseType: !1151, size: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1221, file: !446, line: 553, baseType: !1225, size: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1221, file: !446, line: 557, baseType: !902, size: 8, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1221, file: !446, line: 558, baseType: !902, size: 8, offset: 584)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1221, file: !446, line: 559, baseType: !902, size: 8, offset: 592)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1221, file: !446, line: 560, baseType: !902, size: 8, offset: 600)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1221, file: !446, line: 566, baseType: !1149, size: 64, offset: 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1098, file: !446, line: 752, baseType: !1233, size: 384)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !446, line: 571, size: 384, elements: !1234)
!1234 = !{!1235, !1236}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1233, file: !446, line: 573, baseType: !1162, size: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1233, file: !446, line: 577, baseType: !803, size: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1098, file: !446, line: 753, baseType: !1238, size: 576)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !446, line: 600, size: 576, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1245, !1254}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1238, file: !446, line: 602, baseType: !1162, size: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1238, file: !446, line: 605, baseType: !803, size: 64, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1238, file: !446, line: 609, baseType: !1243, size: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1244, line: 46, baseType: !736)
!1244 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1238, file: !446, line: 612, baseType: !1246, size: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !446, line: 581, size: 320, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1247, file: !446, line: 583, baseType: !5, size: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1247, file: !446, line: 586, baseType: !803, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1247, file: !446, line: 589, baseType: !803, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1247, file: !446, line: 592, baseType: !803, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1247, file: !446, line: 595, baseType: !803, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1238, file: !446, line: 616, baseType: !1086, size: 64, offset: 512)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1098, file: !446, line: 754, baseType: !1256, size: 512)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !446, line: 622, size: 512, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1256, file: !446, line: 624, baseType: !1162, size: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1256, file: !446, line: 628, baseType: !803, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1256, file: !446, line: 632, baseType: !803, size: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1256, file: !446, line: 636, baseType: !803, size: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1098, file: !446, line: 755, baseType: !1263, size: 704)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !446, line: 642, size: 704, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1263, file: !446, line: 644, baseType: !1256, size: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1263, file: !446, line: 648, baseType: !803, size: 64, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1263, file: !446, line: 652, baseType: !803, size: 64, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1263, file: !446, line: 653, baseType: !803, size: 64, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1098, file: !446, line: 756, baseType: !1270, size: 448)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !446, line: 663, size: 448, elements: !1271)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1270, file: !446, line: 665, baseType: !1162, size: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1270, file: !446, line: 668, baseType: !803, size: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1270, file: !446, line: 673, baseType: !803, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1098, file: !446, line: 757, baseType: !1276, size: 384)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !446, line: 694, size: 384, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1276, file: !446, line: 696, baseType: !1162, size: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1276, file: !446, line: 699, baseType: !803, size: 64, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1098, file: !446, line: 758, baseType: !1281, size: 384)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !446, line: 681, size: 384, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1281, file: !446, line: 683, baseType: !1101, size: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1281, file: !446, line: 686, baseType: !803, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1281, file: !446, line: 689, baseType: !803, size: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1098, file: !446, line: 759, baseType: !1287, size: 384)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !446, line: 707, size: 384, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1287, file: !446, line: 709, baseType: !1101, size: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1287, file: !446, line: 712, baseType: !803, size: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1287, file: !446, line: 712, baseType: !803, size: 64, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1098, file: !446, line: 760, baseType: !1293, size: 320)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !446, line: 718, size: 320, elements: !1294)
!1294 = !{!1295, !1296}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1293, file: !446, line: 720, baseType: !1101, size: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1293, file: !446, line: 723, baseType: !803, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1093, file: !446, line: 138, baseType: !1092, size: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1093, file: !446, line: 139, baseType: !1092, size: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1088, file: !446, line: 146, baseType: !1091, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1088, file: !446, line: 152, baseType: !1086, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1083, file: !202, line: 130, baseType: !960, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1078, file: !202, line: 134, baseType: !794, size: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1078, file: !202, line: 137, baseType: !803, size: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1078, file: !202, line: 138, baseType: !910, size: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1078, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1078, file: !202, line: 144, baseType: !789, size: 32, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1078, file: !202, line: 145, baseType: !789, size: 32, offset: 416)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1078, file: !202, line: 146, baseType: !1309, size: 64, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !771)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1061, file: !202, line: 220, baseType: !1064, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1061, file: !202, line: 223, baseType: !794, size: 64, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1061, file: !202, line: 226, baseType: !1313, size: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1061, file: !202, line: 229, baseType: !1316, size: 128, offset: 256)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1317, size: 128, elements: !755)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1061, file: !202, line: 232, baseType: !1060, size: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1061, file: !202, line: 233, baseType: !1060, size: 64, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1061, file: !202, line: 238, baseType: !1322, size: 64, offset: 512)
!1322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1323)
!1323 = !{!1324, !1330}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1322, file: !202, line: 236, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1327)
!1327 = !{!1328, !1329}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1326, file: !202, line: 275, baseType: !1086, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1326, file: !202, line: 278, baseType: !1086, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1322, file: !202, line: 237, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1332, file: !202, line: 261, baseType: !960, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1332, file: !202, line: 262, baseType: !960, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1332, file: !202, line: 266, baseType: !960, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1332, file: !202, line: 267, baseType: !960, size: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1332, file: !202, line: 270, baseType: !789, size: 32, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1061, file: !202, line: 241, baseType: !1309, size: 64, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1061, file: !202, line: 244, baseType: !789, size: 32, offset: 640)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1061, file: !202, line: 247, baseType: !789, size: 32, offset: 672)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1061, file: !202, line: 250, baseType: !789, size: 32, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1061, file: !202, line: 253, baseType: !789, size: 32, offset: 736)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1061, file: !202, line: 256, baseType: !789, size: 32, offset: 768)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1056, file: !202, line: 378, baseType: !1059, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1056, file: !202, line: 381, baseType: !1347, size: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1350)
!1350 = !{!1351}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1349, file: !202, line: 282, baseType: !1352, size: 128)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1354)
!1354 = !{!1355, !1356, !1357}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1353, file: !202, line: 281, baseType: !7, size: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1353, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1353, file: !202, line: 281, baseType: !1358, size: 64, offset: 64)
!1358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1059, size: 64, elements: !883)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1056, file: !202, line: 384, baseType: !789, size: 32, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1056, file: !202, line: 387, baseType: !789, size: 32, offset: 224)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1056, file: !202, line: 390, baseType: !789, size: 32, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1056, file: !202, line: 394, baseType: !1347, size: 64, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1056, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1056, file: !202, line: 399, baseType: !1365, size: 64, offset: 416)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !755)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1056, file: !202, line: 402, baseType: !1367, size: 64, offset: 480)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !755)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1056, file: !202, line: 406, baseType: !789, size: 32, offset: 544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1056, file: !202, line: 409, baseType: !789, size: 32, offset: 576)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1048, file: !1049, line: 470, baseType: !1087, size: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1048, file: !1049, line: 473, baseType: !1372, size: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !999, line: 39, size: 1152, elements: !1374)
!1374 = !{!1375, !1425, !1438, !1450, !1451, !1462, !1463, !1467, !1468, !1469, !1470, !1471}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1373, file: !999, line: 41, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1377, line: 144, baseType: !1378)
!1377 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1377, line: 100, size: 896, elements: !1380)
!1380 = !{!1381, !1389, !1394, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1411, !1413, !1414, !1419, !1424}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1379, file: !1377, line: 102, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1377, line: 52, baseType: !1383)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1377, line: 47, baseType: !7)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1379, file: !1377, line: 105, baseType: !1390, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1377, line: 59, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!789, !1387, !1387}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1379, file: !1377, line: 108, baseType: !1395, size: 64, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1377, line: 63, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !794}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1379, file: !1377, line: 111, baseType: !1400, size: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1379, file: !1377, line: 114, baseType: !1243, size: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1379, file: !1377, line: 117, baseType: !1243, size: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1379, file: !1377, line: 120, baseType: !1243, size: 64, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1379, file: !1377, line: 124, baseType: !7, size: 32, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1379, file: !1377, line: 128, baseType: !7, size: 32, offset: 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1379, file: !1377, line: 131, baseType: !1407, size: 64, offset: 512)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1377, line: 75, baseType: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!794, !1243, !1243}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1379, file: !1377, line: 132, baseType: !1412, size: 64, offset: 576)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1377, line: 78, baseType: !1396)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1379, file: !1377, line: 135, baseType: !794, size: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1379, file: !1377, line: 136, baseType: !1415, size: 64, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1377, line: 82, baseType: !1416)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!794, !794, !1243, !1243}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1379, file: !1377, line: 137, baseType: !1420, size: 64, offset: 768)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1377, line: 83, baseType: !1421)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !794, !794}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1379, file: !1377, line: 141, baseType: !7, size: 32, offset: 832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1373, file: !999, line: 48, baseType: !1426, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !446, line: 35, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !446, line: 35, size: 128, elements: !1429)
!1429 = !{!1430}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1428, file: !446, line: 35, baseType: !1431, size: 128)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !446, line: 33, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !446, line: 33, size: 128, elements: !1433)
!1433 = !{!1434, !1435, !1436}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1432, file: !446, line: 33, baseType: !7, size: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1432, file: !446, line: 33, baseType: !7, size: 32, offset: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1432, file: !446, line: 33, baseType: !1437, size: 64, offset: 64)
!1437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 64, elements: !883)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1373, file: !999, line: 51, baseType: !1439, size: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1442)
!1442 = !{!1443}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1441, file: !6, line: 183, baseType: !1444, size: 128)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1446)
!1446 = !{!1447, !1448, !1449}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1445, file: !6, line: 182, baseType: !7, size: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1445, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1445, file: !6, line: 182, baseType: !1149, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1373, file: !999, line: 54, baseType: !803, size: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1373, file: !999, line: 57, baseType: !1452, size: 128, offset: 256)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1453, line: 31, size: 128, elements: !1454)
!1453 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1452, file: !1453, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1452, file: !1453, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1452, file: !1453, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1452, file: !1453, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1452, file: !1453, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1452, file: !1453, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1452, file: !1453, line: 56, baseType: !737, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1373, file: !999, line: 60, baseType: !1452, size: 128, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1373, file: !999, line: 64, baseType: !1464, size: 64, offset: 512)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1466, line: 33, flags: DIFlagFwdDecl)
!1466 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1373, file: !999, line: 67, baseType: !803, size: 64, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1373, file: !999, line: 73, baseType: !1376, size: 64, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1373, file: !999, line: 77, baseType: !737, size: 64, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1373, file: !999, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1373, file: !999, line: 82, baseType: !1472, size: 320, offset: 832)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !485, line: 62, size: 320, elements: !1473)
!1473 = !{!1474, !1480, !1481, !1482, !1483, !1484}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1472, file: !485, line: 63, baseType: !1475, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !485, line: 56, size: 128, elements: !1477)
!1477 = !{!1478, !1479}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1476, file: !485, line: 57, baseType: !1475, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1476, file: !485, line: 58, baseType: !882, size: 8, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1472, file: !485, line: 64, baseType: !7, size: 32, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1472, file: !485, line: 66, baseType: !7, size: 32, offset: 96)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1472, file: !485, line: 68, baseType: !902, size: 8, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1472, file: !485, line: 70, baseType: !1125, size: 64, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1472, file: !485, line: 71, baseType: !1132, size: 64, offset: 256)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1048, file: !1049, line: 476, baseType: !1486, size: 64, offset: 256)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1049, line: 476, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1048, file: !1049, line: 479, baseType: !1376, size: 64, offset: 320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1048, file: !1049, line: 484, baseType: !803, size: 64, offset: 384)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1048, file: !1049, line: 488, baseType: !803, size: 64, offset: 448)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1048, file: !1049, line: 493, baseType: !803, size: 64, offset: 512)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1048, file: !1049, line: 496, baseType: !803, size: 64, offset: 576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1048, file: !1049, line: 501, baseType: !1494, size: 64, offset: 640)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1496)
!1496 = !{!1497, !1500, !1501, !1502, !1503, !1505, !1506, !1511, !1512, !1513, !1514, !1515, !1516}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1495, file: !213, line: 2356, baseType: !1498, size: 64)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1495, file: !213, line: 2357, baseType: !1225, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1495, file: !213, line: 2358, baseType: !789, size: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1495, file: !213, line: 2359, baseType: !789, size: 32, offset: 160)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1495, file: !213, line: 2360, baseType: !1504, size: 128, offset: 192)
!1504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !782)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1495, file: !213, line: 2364, baseType: !789, size: 32, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1495, file: !213, line: 2367, baseType: !1507, size: 128, offset: 384)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1508)
!1508 = !{!1509, !1510}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1507, file: !213, line: 2351, baseType: !960, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1507, file: !213, line: 2352, baseType: !771, size: 64, offset: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1495, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1495, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1495, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1495, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1495, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1495, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1048, file: !1049, line: 504, baseType: !1518, size: 64, offset: 704)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
