; ModuleID = 'rtl.c'
source_filename = "rtl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtvec_def = type { i32, [1 x %struct.rtx_def*] }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.mem_attrs = type { %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, i32, i32, i8 }
%union.tree_node = type opaque

@rtx_length = dso_local constant [139 x i8] c"\01\01\01\02\02\01\01\08\08\09\09\08\08\07\02\01\02\07\02\02\01\05\03\02\01\01\02\00\00\02\01\03\04\01\01\01\00\03\01\02\01\02\01\02\01\03\00\03\02\02\02\01\02\02\02\02\02\02\02\02\02\02\02\02\01\02\02\02\02\02\02\02\02\02\01\01\01\01\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\02\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\01\03\03\01\02\03\02\02\01\02\02\02\01\01\01\02\02\02\01\01\03", align 16, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"UnKnown\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"value\00", align 1

!214 = !DIEnumerator(name: "IOR", value: 62, isUnsigned: true)
!215 = !DIEnumerator(name: "XOR", value: 63, isUnsigned: true)
!216 = !DIEnumerator(name: "NOT", value: 64, isUnsigned: true)
!217 = !DIEnumerator(name: "ASHIFT", value: 65, isUnsigned: true)
!218 = !DIEnumerator(name: "ROTATE", value: 66, isUnsigned: true)
!219 = !DIEnumerator(name: "ASHIFTRT", value: 67, isUnsigned: true)
!220 = !DIEnumerator(name: "LSHIFTRT", value: 68, isUnsigned: true)
!221 = !DIEnumerator(name: "ROTATERT", value: 69, isUnsigned: true)
!222 = !DIEnumerator(name: "SMIN", value: 70, isUnsigned: true)
!223 = !DIEnumerator(name: "SMAX", value: 71, isUnsigned: true)
!224 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!225 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!226 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!227 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!228 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!229 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!230 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!231 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!232 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!233 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!234 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!235 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!236 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!237 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!238 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!239 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!240 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!241 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!242 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!243 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!244 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!245 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!246 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!247 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!248 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!249 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!250 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!251 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!252 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!253 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!254 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!255 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!256 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!257 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!258 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!259 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!260 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!261 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!262 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!263 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!264 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!265 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!266 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!267 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!268 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!269 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!270 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!271 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!272 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!273 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!274 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!275 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!276 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!277 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!278 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!279 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!280 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!281 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!282 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!283 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!284 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!285 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!286 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!287 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!288 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!289 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!290 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!291 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!292 = !{!293, !150, !302, !299, !443, !22}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !294, line: 53, baseType: !295)
!294 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !6, line: 359, size: 128, elements: !297)
!297 = !{!298, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !296, file: !6, line: 360, baseType: !299, size: 32)
!299 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !296, file: !6, line: 361, baseType: !301, size: 64, offset: 64)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 64, elements: !383)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !294, line: 50, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !6, line: 240, size: 384, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !304, file: !6, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !304, file: !6, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !304, file: !6, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !304, file: !6, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !304, file: !6, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !304, file: !6, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !304, file: !6, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !304, file: !6, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !304, file: !6, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !304, file: !6, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !304, file: !6, line: 321, baseType: !317, size: 320, offset: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !6, line: 315, size: 320, elements: !318)
!318 = !{!319, !385, !387, !418, !431}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !317, file: !6, line: 316, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 64, elements: !383)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !6, line: 183, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !6, line: 166, size: 64, elements: !323)
!323 = !{!324, !325, !326, !330, !331, !332, !333, !345, !348, !351, !355, !358, !372, !380}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !322, file: !6, line: 168, baseType: !299, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !322, file: !6, line: 169, baseType: !7, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !322, file: !6, line: 170, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !322, file: !6, line: 171, baseType: !302, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !322, file: !6, line: 172, baseType: !293, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !322, file: !6, line: 173, baseType: !22, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !322, file: !6, line: 174, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !6, line: 133, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 115, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !335, file: !6, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !335, file: !6, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !335, file: !6, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !335, file: !6, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !335, file: !6, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !335, file: !6, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !335, file: !6, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !335, file: !6, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !322, file: !6, line: 175, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !6, line: 175, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !322, file: !6, line: 176, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !294, line: 46, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !322, file: !6, line: 177, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !294, line: 56, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !294, line: 55, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !322, file: !6, line: 178, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !294, line: 110, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !322, file: !6, line: 179, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !6, line: 150, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !6, line: 142, size: 320, elements: !362)
!362 = !{!363, !364, !365, !366, !369, !370}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !361, file: !6, line: 144, baseType: !352, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !361, file: !6, line: 145, baseType: !302, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !6, line: 146, baseType: !302, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !361, file: !6, line: 147, baseType: !367, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !368, line: 31, baseType: !299)
!368 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !361, file: !6, line: 148, baseType: !7, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !361, file: !6, line: 149, baseType: !371, size: 8, offset: 256)
!371 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !322, file: !6, line: 180, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !6, line: 162, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !6, line: 159, size: 128, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !375, file: !6, line: 160, baseType: !352, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !375, file: !6, line: 161, baseType: !379, size: 64, offset: 64)
!379 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !322, file: !6, line: 181, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !6, line: 181, flags: DIFlagFwdDecl)
!383 = !{!384}
!384 = !DISubrange(count: 1)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !317, file: !6, line: 317, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 64, elements: !383)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !317, file: !6, line: 318, baseType: !388, size: 320)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !6, line: 188, size: 320, elements: !389)
!389 = !{!390, !394, !417}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !388, file: !6, line: 190, baseType: !391, size: 192)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 192, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 3)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !388, file: !6, line: 193, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !6, line: 206, size: 320, elements: !397)
!397 = !{!398, !402, !403, !404, !416}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !396, file: !6, line: 208, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !294, line: 62, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !294, line: 61, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !396, file: !6, line: 211, baseType: !7, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !396, file: !6, line: 214, baseType: !379, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !396, file: !6, line: 224, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !6, line: 202, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !6, line: 202, size: 128, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !407, file: !6, line: 202, baseType: !410, size: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !6, line: 200, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !6, line: 200, size: 128, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !411, file: !6, line: 200, baseType: !7, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !411, file: !6, line: 200, baseType: !7, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !411, file: !6, line: 200, baseType: !301, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !396, file: !6, line: 234, baseType: !405, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !388, file: !6, line: 197, baseType: !379, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !317, file: !6, line: 319, baseType: !419, size: 256)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !420, line: 52, size: 256, elements: !421)
!420 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!421 = !{!422, !423, !424, !425, !426, !427, !428}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !419, file: !420, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !419, file: !420, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !419, file: !420, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !419, file: !420, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !419, file: !420, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !419, file: !420, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !419, file: !420, line: 62, baseType: !429, size: 192, offset: 64)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 192, elements: !392)
!430 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !317, file: !6, line: 320, baseType: !432, size: 192)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !433, line: 27, size: 192, elements: !434)
!433 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!434 = !{!435, !442}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !432, file: !433, line: 29, baseType: !436, size: 128)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !437, line: 58, baseType: !438)
!437 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 54, size: 128, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !438, file: !437, line: 56, baseType: !430, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !438, file: !437, line: 57, baseType: !379, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !432, file: !433, line: 30, baseType: !22, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!444 = !{!0, !445, !451, !453, !457, !461, !466, !471, !473}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "rtx_name", scope: !2, file: !3, line: 57, type: !447, isLocal: false, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 8896, elements: !449)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!449 = !{!450}
!450 = !DISubrange(count: 139)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "rtx_format", scope: !2, file: !3, line: 67, type: !447, isLocal: false, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "rtx_class", scope: !2, file: !3, line: 103, type: !455, isLocal: false, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 4448, elements: !449)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "rtx_code_size", scope: !2, file: !3, line: 111, type: !459, isLocal: false, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 1112, elements: !449)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "note_insn_name", scope: !2, file: !3, line: 123, type: !463, isLocal: false, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 832, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 13)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "reg_note_name", scope: !2, file: !3, line: 130, type: !468, isLocal: false, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 1984, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 31)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "generating_concat_p", scope: !2, file: !3, line: 346, type: !299, isLocal: false, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "currently_expanding_to_rtl", scope: !2, file: !3, line: 349, type: !299, isLocal: false, isDefinition: true)
!475 = !{i32 7, !"Dwarf Version", i32 4}
!476 = !{i32 2, !"Debug Info Version", i32 3}
!477 = !{i32 1, !"wchar_size", i32 4}
!478 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!479 = distinct !DISubprogram(name: "rtvec_alloc", scope: !3, file: !3, line: 149, type: !480, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!293, !299}
!482 = !{}
!483 = !DILocalVariable(name: "n", arg: 1, scope: !479, file: !3, line: 149, type: !299)
!484 = !DILocation(line: 149, column: 18, scope: !479)
!485 = !DILocalVariable(name: "rt", scope: !479, file: !3, line: 151, type: !293)
!486 = !DILocation(line: 151, column: 9, scope: !479)
!487 = !DILocation(line: 153, column: 8, scope: !479)
!488 = !DILocation(line: 153, column: 6, scope: !479)
!489 = !DILocation(line: 155, column: 12, scope: !479)
!490 = !DILocation(line: 155, column: 16, scope: !479)
!491 = !DILocation(line: 155, column: 3, scope: !479)
!492 = !DILocation(line: 155, column: 28, scope: !479)
!493 = !DILocation(line: 155, column: 30, scope: !479)
!494 = !DILocation(line: 157, column: 3, scope: !479)
!495 = !DILocation(line: 164, column: 10, scope: !479)
