; ModuleID = 'lto-streamer.c'
source_filename = "lto-streamer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.lto_stats_d = type { i64, i64, i64, i64, i64, [10 x i64], i64, [188 x i64], i64, i64, i64, i64 }

!504 = !DIEnumerator(name: "itk_unsigned_long_long", value: 10, isUnsigned: true)
!505 = !DIEnumerator(name: "itk_none", value: 11, isUnsigned: true)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "size_type_kind", file: !37, line: 4288, baseType: !7, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512}
!508 = !DIEnumerator(name: "SIZETYPE", value: 0, isUnsigned: true)
!509 = !DIEnumerator(name: "SSIZETYPE", value: 1, isUnsigned: true)
!510 = !DIEnumerator(name: "BITSIZETYPE", value: 2, isUnsigned: true)
!511 = !DIEnumerator(name: "SBITSIZETYPE", value: 3, isUnsigned: true)
!512 = !DIEnumerator(name: "TYPE_KIND_LAST", value: 4, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !37, line: 58, baseType: !7, size: 32, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!515 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!516 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!518 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!519 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!520 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!521 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!522 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!523 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!524 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!525 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_node_structure_enum", file: !37, line: 630, baseType: !7, size: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!528 = !DIEnumerator(name: "TS_BASE", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "TS_COMMON", value: 1, isUnsigned: true)
!530 = !DIEnumerator(name: "TS_INT_CST", value: 2, isUnsigned: true)
!531 = !DIEnumerator(name: "TS_REAL_CST", value: 3, isUnsigned: true)
!532 = !DIEnumerator(name: "TS_FIXED_CST", value: 4, isUnsigned: true)
!533 = !DIEnumerator(name: "TS_VECTOR", value: 5, isUnsigned: true)
!534 = !DIEnumerator(name: "TS_STRING", value: 6, isUnsigned: true)
!535 = !DIEnumerator(name: "TS_COMPLEX", value: 7, isUnsigned: true)
!536 = !DIEnumerator(name: "TS_IDENTIFIER", value: 8, isUnsigned: true)
!537 = !DIEnumerator(name: "TS_DECL_MINIMAL", value: 9, isUnsigned: true)
!538 = !DIEnumerator(name: "TS_DECL_COMMON", value: 10, isUnsigned: true)
!539 = !DIEnumerator(name: "TS_DECL_WRTL", value: 11, isUnsigned: true)
!540 = !DIEnumerator(name: "TS_DECL_NON_COMMON", value: 12, isUnsigned: true)
!541 = !DIEnumerator(name: "TS_DECL_WITH_VIS", value: 13, isUnsigned: true)
!542 = !DIEnumerator(name: "TS_FIELD_DECL", value: 14, isUnsigned: true)
!543 = !DIEnumerator(name: "TS_VAR_DECL", value: 15, isUnsigned: true)
!544 = !DIEnumerator(name: "TS_PARM_DECL", value: 16, isUnsigned: true)
!545 = !DIEnumerator(name: "TS_LABEL_DECL", value: 17, isUnsigned: true)
!546 = !DIEnumerator(name: "TS_RESULT_DECL", value: 18, isUnsigned: true)
!547 = !DIEnumerator(name: "TS_CONST_DECL", value: 19, isUnsigned: true)
!548 = !DIEnumerator(name: "TS_TYPE_DECL", value: 20, isUnsigned: true)
!549 = !DIEnumerator(name: "TS_FUNCTION_DECL", value: 21, isUnsigned: true)
!550 = !DIEnumerator(name: "TS_TYPE", value: 22, isUnsigned: true)
!551 = !DIEnumerator(name: "TS_LIST", value: 23, isUnsigned: true)
!552 = !DIEnumerator(name: "TS_VEC", value: 24, isUnsigned: true)
!553 = !DIEnumerator(name: "TS_EXP", value: 25, isUnsigned: true)
!554 = !DIEnumerator(name: "TS_SSA_NAME", value: 26, isUnsigned: true)
!555 = !DIEnumerator(name: "TS_BLOCK", value: 27, isUnsigned: true)
!556 = !DIEnumerator(name: "TS_BINFO", value: 28, isUnsigned: true)
!557 = !DIEnumerator(name: "TS_STATEMENT_LIST", value: 29, isUnsigned: true)
!558 = !DIEnumerator(name: "TS_CONSTRUCTOR", value: 30, isUnsigned: true)
!559 = !DIEnumerator(name: "TS_OMP_CLAUSE", value: 31, isUnsigned: true)
!560 = !DIEnumerator(name: "TS_OPTIMIZATION", value: 32, isUnsigned: true)
!561 = !DIEnumerator(name: "TS_TARGET_OPTION", value: 33, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_TS_ENUM", value: 34, isUnsigned: true)
!563 = !{!564, !622, !617, !631, !632, !652, !655, !7, !662, !1772, !36, !313, !640, !1294, !1779, !769, !1083, !1792}
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !565, line: 47, baseType: !566)
!565 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !568, line: 75, size: 256, elements: !569)
!568 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !{!570, !585, !586, !587}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !567, file: !568, line: 76, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !568, line: 68, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !568, line: 63, size: 320, elements: !574)
!574 = !{!575, !577, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !568, line: 64, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !573, file: !568, line: 65, baseType: !576, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !573, file: !568, line: 66, baseType: !7, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !573, file: !568, line: 67, baseType: !580, size: 128, offset: 192)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128, elements: !583)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !568, line: 29, baseType: !582)
!582 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!583 = !{!584}
!584 = !DISubrange(count: 2)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !567, file: !568, line: 77, baseType: !571, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !567, file: !568, line: 78, baseType: !7, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !567, file: !568, line: 79, baseType: !588, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !568, line: 49, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !568, line: 45, size: 832, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !590, file: !568, line: 46, baseType: !576, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !590, file: !568, line: 47, baseType: !566, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !590, file: !568, line: 48, baseType: !595, size: 704, offset: 128)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !596, line: 164, size: 704, elements: !597)
!596 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !600, !612, !613, !614, !615, !616, !618, !623, !627, !628, !629, !630}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !595, file: !596, line: 166, baseType: !599, size: 64)
!599 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !595, file: !596, line: 167, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !596, line: 157, size: 192, elements: !603)
!603 = !{!604, !607, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !602, file: !596, line: 159, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !602, file: !596, line: 160, baseType: !601, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !602, file: !596, line: 161, baseType: !609, size: 32, offset: 128)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 32, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 4)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !595, file: !596, line: 168, baseType: !605, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !595, file: !596, line: 169, baseType: !605, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !595, file: !596, line: 170, baseType: !605, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !595, file: !596, line: 171, baseType: !599, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !595, file: !596, line: 172, baseType: !617, size: 32, offset: 384)
!617 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !595, file: !596, line: 176, baseType: !619, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!601, !622, !599}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !595, file: !596, line: 177, baseType: !624, size: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !622, !601}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !595, file: !596, line: 178, baseType: !622, size: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !595, file: !596, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !595, file: !596, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !595, file: !596, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!631 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitpack_d", file: !6, line: 156, size: 192, elements: !634)
!634 = !{!635, !638, !639}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !633, file: !6, line: 159, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !637, line: 46, baseType: !582)
!637 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!638 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused_bit", scope: !633, file: !6, line: 165, baseType: !636, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !633, file: !6, line: 168, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_bitpack_word_t_heap", file: !6, line: 154, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_bitpack_word_t_heap", file: !6, line: 154, size: 128, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !642, file: !6, line: 154, baseType: !645, size: 128)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_bitpack_word_t_base", file: !6, line: 153, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_bitpack_word_t_base", file: !6, line: 153, size: 128, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !646, file: !6, line: 153, baseType: !7, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !646, file: !6, line: 153, baseType: !7, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !646, file: !6, line: 153, baseType: !651, size: 64, offset: 64)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 64, elements: !653)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitpack_word_t", file: !6, line: 152, baseType: !582)
!653 = !{!654}
!654 = !DISubrange(count: 1)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_map", file: !37, line: 5290, size: 128, elements: !657)
!657 = !{!658, !1771}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !656, file: !37, line: 5291, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_map_base", file: !37, line: 5267, size: 64, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !659, file: !37, line: 5268, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !565, line: 56, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !37, line: 3371, size: 1792, elements: !665)
!665 = !{!666, !699, !705, !716, !723, !730, !735, !742, !748, !762, !774, !812, !820, !848, !865, !866, !871, !880, !886, !891, !895, !899, !1420, !1469, !1475, !1481, !1488, !1501, !1515, !1532, !1544, !1566, !1581, !1753}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !664, file: !37, line: 3372, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !37, line: 360, size: 64, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !667, file: !37, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !667, file: !37, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !667, file: !37, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !667, file: !37, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !667, file: !37, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !667, file: !37, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !667, file: !37, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !667, file: !37, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !667, file: !37, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !667, file: !37, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !667, file: !37, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !667, file: !37, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !667, file: !37, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !667, file: !37, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !667, file: !37, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !667, file: !37, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !667, file: !37, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !667, file: !37, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !667, file: !37, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !667, file: !37, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !667, file: !37, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !667, file: !37, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !667, file: !37, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !667, file: !37, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !667, file: !37, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !667, file: !37, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !667, file: !37, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !667, file: !37, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !667, file: !37, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !667, file: !37, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !37, line: 3373, baseType: !700, size: 192)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !37, line: 402, size: 192, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !700, file: !37, line: 403, baseType: !667, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !700, file: !37, line: 404, baseType: !662, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !37, line: 405, baseType: !662, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !664, file: !37, line: 3374, baseType: !706, size: 320)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !37, line: 1384, size: 320, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !37, line: 1385, baseType: !700, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !706, file: !37, line: 1386, baseType: !710, size: 128, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !711, line: 58, baseType: !712)
!711 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 54, size: 128, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !712, file: !711, line: 56, baseType: !582, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !712, file: !711, line: 57, baseType: !599, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !664, file: !37, line: 3375, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !37, line: 1397, size: 256, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !37, line: 1398, baseType: !700, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !717, file: !37, line: 1399, baseType: !721, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !37, line: 1392, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !664, file: !37, line: 3376, baseType: !724, size: 256)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !37, line: 1408, size: 256, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !724, file: !37, line: 1409, baseType: !700, size: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !724, file: !37, line: 1410, baseType: !728, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !37, line: 1403, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !664, file: !37, line: 3377, baseType: !731, size: 256)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !37, line: 1437, size: 256, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !37, line: 1438, baseType: !700, size: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !731, file: !37, line: 1439, baseType: !662, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !664, file: !37, line: 3378, baseType: !736, size: 256)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !37, line: 1418, size: 256, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !37, line: 1419, baseType: !700, size: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !736, file: !37, line: 1420, baseType: !617, size: 32, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !736, file: !37, line: 1421, baseType: !741, size: 8, offset: 224)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 8, elements: !653)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !664, file: !37, line: 3379, baseType: !743, size: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !37, line: 1428, size: 320, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !37, line: 1429, baseType: !700, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !743, file: !37, line: 1430, baseType: !662, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !743, file: !37, line: 1431, baseType: !662, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !664, file: !37, line: 3380, baseType: !749, size: 320)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !37, line: 1460, size: 320, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !37, line: 1461, baseType: !700, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !749, file: !37, line: 1462, baseType: !753, size: 128, offset: 192)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !754, line: 31, size: 128, elements: !755)
!754 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!755 = !{!756, !760, !761}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !753, file: !754, line: 32, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !753, file: !754, line: 33, baseType: !7, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !753, file: !754, line: 34, baseType: !7, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !664, file: !37, line: 3381, baseType: !763, size: 384)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !37, line: 2507, size: 384, elements: !764)
!764 = !{!765, !766, !771, !772, !773}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !37, line: 2508, baseType: !700, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !763, file: !37, line: 2509, baseType: !767, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !768, line: 58, baseType: !769)
!768 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !770, line: 44, baseType: !7)
!770 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !763, file: !37, line: 2510, baseType: !7, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !37, line: 2511, baseType: !662, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !763, file: !37, line: 2512, baseType: !662, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !664, file: !37, line: 3382, baseType: !775, size: 896)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !37, line: 2652, size: 896, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !37, line: 2653, baseType: !763, size: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !775, file: !37, line: 2654, baseType: !662, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !775, file: !37, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !775, file: !37, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !775, file: !37, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !775, file: !37, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !775, file: !37, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !775, file: !37, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !775, file: !37, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !775, file: !37, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !775, file: !37, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !775, file: !37, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !775, file: !37, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !775, file: !37, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !775, file: !37, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !775, file: !37, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !775, file: !37, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !775, file: !37, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !775, file: !37, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !775, file: !37, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !775, file: !37, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !775, file: !37, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !775, file: !37, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !775, file: !37, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !775, file: !37, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !775, file: !37, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !775, file: !37, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !775, file: !37, line: 2703, baseType: !7, size: 32, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !775, file: !37, line: 2705, baseType: !662, size: 64, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !775, file: !37, line: 2706, baseType: !662, size: 64, offset: 640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !775, file: !37, line: 2707, baseType: !662, size: 64, offset: 704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !775, file: !37, line: 2708, baseType: !662, size: 64, offset: 768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !775, file: !37, line: 2711, baseType: !810, size: 64, offset: 832)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !37, line: 2711, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !664, file: !37, line: 3383, baseType: !813, size: 960)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !37, line: 2756, size: 960, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !813, file: !37, line: 2757, baseType: !775, size: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !813, file: !37, line: 2758, baseType: !817, size: 64, offset: 896)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !565, line: 50, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !565, line: 49, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !664, file: !37, line: 3384, baseType: !821, size: 1472)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !37, line: 3114, size: 1472, elements: !822)
!822 = !{!823, !844, !845, !846, !847}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !37, line: 3115, baseType: !824, size: 1216)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !37, line: 2984, size: 1216, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !37, line: 2985, baseType: !813, size: 960)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !824, file: !37, line: 2986, baseType: !662, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !824, file: !37, line: 2987, baseType: !662, size: 64, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !824, file: !37, line: 2988, baseType: !662, size: 64, offset: 1088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !824, file: !37, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !824, file: !37, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !824, file: !37, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !824, file: !37, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !824, file: !37, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !824, file: !37, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !824, file: !37, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !824, file: !37, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !824, file: !37, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !824, file: !37, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !824, file: !37, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !824, file: !37, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !824, file: !37, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !824, file: !37, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !821, file: !37, line: 3117, baseType: !662, size: 64, offset: 1216)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !821, file: !37, line: 3119, baseType: !662, size: 64, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !821, file: !37, line: 3121, baseType: !662, size: 64, offset: 1344)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !821, file: !37, line: 3123, baseType: !662, size: 64, offset: 1408)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !664, file: !37, line: 3385, baseType: !849, size: 1088)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !37, line: 2874, size: 1088, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !37, line: 2875, baseType: !813, size: 960)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !849, file: !37, line: 2876, baseType: !817, size: 64, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !849, file: !37, line: 2877, baseType: !854, size: 64, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !856, line: 172, size: 128, elements: !857)
!856 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!857 = !{!858, !859, !860, !861, !862, !863, !864}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !855, file: !856, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !855, file: !856, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !855, file: !856, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !855, file: !856, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !855, file: !856, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !855, file: !856, line: 195, baseType: !7, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !855, file: !856, line: 199, baseType: !662, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !664, file: !37, line: 3386, baseType: !824, size: 1216)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !664, file: !37, line: 3387, baseType: !867, size: 1280)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !37, line: 3093, size: 1280, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !37, line: 3094, baseType: !824, size: 1216)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !867, file: !37, line: 3095, baseType: !854, size: 64, offset: 1216)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !664, file: !37, line: 3388, baseType: !872, size: 1216)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !37, line: 2824, size: 1216, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !37, line: 2825, baseType: !775, size: 896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !872, file: !37, line: 2827, baseType: !662, size: 64, offset: 896)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !872, file: !37, line: 2828, baseType: !662, size: 64, offset: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !872, file: !37, line: 2829, baseType: !662, size: 64, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !872, file: !37, line: 2830, baseType: !662, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !872, file: !37, line: 2831, baseType: !662, size: 64, offset: 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !664, file: !37, line: 3389, baseType: !881, size: 1024)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !37, line: 2850, size: 1024, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !881, file: !37, line: 2851, baseType: !813, size: 960)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !881, file: !37, line: 2852, baseType: !617, size: 32, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !881, file: !37, line: 2853, baseType: !617, size: 32, offset: 992)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !664, file: !37, line: 3390, baseType: !887, size: 1024)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !37, line: 2857, size: 1024, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !37, line: 2858, baseType: !813, size: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !887, file: !37, line: 2859, baseType: !854, size: 64, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !664, file: !37, line: 3391, baseType: !892, size: 960)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !37, line: 2862, size: 960, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !37, line: 2863, baseType: !813, size: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !664, file: !37, line: 3392, baseType: !896, size: 1472)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !37, line: 3304, size: 1472, elements: !897)
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !37, line: 3305, baseType: !821, size: 1472)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !664, file: !37, line: 3393, baseType: !900, size: 1792)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !37, line: 3248, size: 1792, elements: !901)
!901 = !{!902, !903, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !37, line: 3249, baseType: !821, size: 1472)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !900, file: !37, line: 3251, baseType: !904, size: 64, offset: 1472)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !906, line: 463, size: 1152, elements: !907)
!906 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!907 = !{!908, !911, !1226, !1227, !1340, !1343, !1344, !1345, !1346, !1347, !1348, !1372, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !905, file: !906, line: 464, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !906, line: 464, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !905, file: !906, line: 467, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !245, line: 374, size: 640, elements: !914)
!914 = !{!915, !1201, !1202, !1215, !1216, !1217, !1218, !1219, !1220, !1222, !1224, !1225}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !913, file: !245, line: 377, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !565, line: 111, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !245, line: 217, size: 832, elements: !919)
!919 = !{!920, !1166, !1167, !1168, !1171, !1175, !1176, !1177, !1195, !1196, !1197, !1198, !1199, !1200}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !918, file: !245, line: 219, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !245, line: 151, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !245, line: 151, size: 128, elements: !924)
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !923, file: !245, line: 151, baseType: !926, size: 128)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !245, line: 150, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !245, line: 150, size: 128, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !927, file: !245, line: 150, baseType: !7, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !927, file: !245, line: 150, baseType: !7, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !927, file: !245, line: 150, baseType: !932, size: 64, offset: 64)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 64, elements: !653)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !565, line: 108, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !245, line: 122, size: 512, elements: !936)
!936 = !{!937, !938, !939, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !935, file: !245, line: 124, baseType: !917, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !935, file: !245, line: 125, baseType: !917, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !935, file: !245, line: 131, baseType: !940, size: 64, offset: 128)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !245, line: 128, size: 64, elements: !941)
!941 = !{!942, !1157}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !940, file: !245, line: 129, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !565, line: 66, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !314, line: 143, size: 192, elements: !946)
!946 = !{!947, !1155, !1156}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !945, file: !314, line: 145, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !565, line: 69, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !314, line: 136, size: 192, elements: !951)
!951 = !{!952, !1153, !1154}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !950, file: !314, line: 137, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !565, line: 58, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !314, line: 737, size: 768, elements: !956)
!956 = !{!957, !974, !1008, !1014, !1019, !1024, !1031, !1037, !1043, !1048, !1062, !1067, !1073, !1078, !1090, !1095, !1111, !1118, !1125, !1131, !1136, !1142, !1148}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !314, line: 738, baseType: !958, size: 256)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !314, line: 271, size: 256, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !958, file: !314, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !958, file: !314, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !958, file: !314, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !958, file: !314, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !958, file: !314, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !958, file: !314, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !958, file: !314, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !958, file: !314, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !958, file: !314, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !958, file: !314, line: 312, baseType: !7, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !958, file: !314, line: 316, baseType: !767, size: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !958, file: !314, line: 319, baseType: !7, size: 32, offset: 96)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !958, file: !314, line: 323, baseType: !917, size: 64, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !958, file: !314, line: 327, baseType: !662, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !955, file: !314, line: 739, baseType: !975, size: 448)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !314, line: 350, size: 448, elements: !976)
!976 = !{!977, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !975, file: !314, line: 353, baseType: !978, size: 384)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !314, line: 333, size: 384, elements: !979)
!979 = !{!980, !981, !989}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !978, file: !314, line: 336, baseType: !958, size: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !978, file: !314, line: 343, baseType: !982, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !984, line: 37, size: 128, elements: !985)
!984 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !984, line: 39, baseType: !982, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !983, file: !984, line: 40, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !978, file: !314, line: 344, baseType: !990, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !984, line: 45, size: 320, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !984, line: 47, baseType: !990, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !991, file: !984, line: 48, baseType: !995, size: 256, offset: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !37, line: 1883, size: 256, elements: !996)
!996 = !{!997, !999, !1000, !1005}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !995, file: !37, line: 1884, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !37, line: 1885, baseType: !998, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !995, file: !37, line: 1891, baseType: !1001, size: 64, offset: 128)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !37, line: 1891, size: 64, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1001, file: !37, line: 1891, baseType: !953, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1001, file: !37, line: 1891, baseType: !662, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !995, file: !37, line: 1892, baseType: !988, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !975, file: !314, line: 359, baseType: !1007, size: 64, offset: 384)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 64, elements: !653)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !955, file: !314, line: 740, baseType: !1009, size: 512)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !314, line: 365, size: 512, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1009, file: !314, line: 368, baseType: !978, size: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1009, file: !314, line: 373, baseType: !662, size: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1009, file: !314, line: 374, baseType: !662, size: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !955, file: !314, line: 741, baseType: !1015, size: 576)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !314, line: 380, size: 576, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1015, file: !314, line: 383, baseType: !1009, size: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1015, file: !314, line: 389, baseType: !1007, size: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !955, file: !314, line: 742, baseType: !1020, size: 320)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !314, line: 395, size: 320, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1020, file: !314, line: 397, baseType: !958, size: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1020, file: !314, line: 400, baseType: !943, size: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !955, file: !314, line: 743, baseType: !1025, size: 448)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !314, line: 406, size: 448, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1025, file: !314, line: 408, baseType: !958, size: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1025, file: !314, line: 412, baseType: !662, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1025, file: !314, line: 420, baseType: !662, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1025, file: !314, line: 423, baseType: !943, size: 64, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !955, file: !314, line: 744, baseType: !1032, size: 384)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !314, line: 429, size: 384, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1032, file: !314, line: 431, baseType: !958, size: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1032, file: !314, line: 434, baseType: !662, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1032, file: !314, line: 437, baseType: !943, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !955, file: !314, line: 745, baseType: !1038, size: 384)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !314, line: 443, size: 384, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1038, file: !314, line: 445, baseType: !958, size: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1038, file: !314, line: 449, baseType: !662, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1038, file: !314, line: 453, baseType: !943, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !955, file: !314, line: 746, baseType: !1044, size: 320)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !314, line: 459, size: 320, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1044, file: !314, line: 461, baseType: !958, size: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1044, file: !314, line: 464, baseType: !662, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !955, file: !314, line: 747, baseType: !1049, size: 768)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !314, line: 469, size: 768, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1049, file: !314, line: 471, baseType: !958, size: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1049, file: !314, line: 474, baseType: !7, size: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1049, file: !314, line: 475, baseType: !7, size: 32, offset: 288)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1049, file: !314, line: 478, baseType: !662, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1049, file: !314, line: 481, baseType: !1056, size: 384, offset: 384)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 384, elements: !653)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !37, line: 1917, size: 384, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1057, file: !37, line: 1920, baseType: !995, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1057, file: !37, line: 1921, baseType: !662, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1057, file: !37, line: 1922, baseType: !767, size: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !955, file: !314, line: 748, baseType: !1063, size: 320)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !314, line: 487, size: 320, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1063, file: !314, line: 490, baseType: !958, size: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1063, file: !314, line: 494, baseType: !617, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !955, file: !314, line: 749, baseType: !1068, size: 384)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !314, line: 500, size: 384, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1068, file: !314, line: 502, baseType: !958, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1068, file: !314, line: 506, baseType: !943, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1068, file: !314, line: 510, baseType: !943, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !955, file: !314, line: 750, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !314, line: 529, size: 320, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1074, file: !314, line: 531, baseType: !958, size: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1074, file: !314, line: 540, baseType: !943, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !955, file: !314, line: 751, baseType: !1079, size: 704)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !314, line: 546, size: 704, elements: !1080)
!1080 = !{!1081, !1082, !1085, !1086, !1087, !1088, !1089}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1079, file: !314, line: 549, baseType: !1009, size: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1079, file: !314, line: 553, baseType: !1083, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1079, file: !314, line: 557, baseType: !759, size: 8, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1079, file: !314, line: 558, baseType: !759, size: 8, offset: 584)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1079, file: !314, line: 559, baseType: !759, size: 8, offset: 592)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1079, file: !314, line: 560, baseType: !759, size: 8, offset: 600)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1079, file: !314, line: 566, baseType: !1007, size: 64, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !955, file: !314, line: 752, baseType: !1091, size: 384)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !314, line: 571, size: 384, elements: !1092)
!1092 = !{!1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1091, file: !314, line: 573, baseType: !1020, size: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !314, line: 577, baseType: !662, size: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !955, file: !314, line: 753, baseType: !1096, size: 576)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !314, line: 600, size: 576, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1110}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1096, file: !314, line: 602, baseType: !1020, size: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1096, file: !314, line: 605, baseType: !662, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1096, file: !314, line: 609, baseType: !636, size: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1096, file: !314, line: 612, baseType: !1102, size: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !314, line: 581, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1103, file: !314, line: 583, baseType: !36, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1103, file: !314, line: 586, baseType: !662, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1103, file: !314, line: 589, baseType: !662, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1103, file: !314, line: 592, baseType: !662, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1103, file: !314, line: 595, baseType: !662, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1096, file: !314, line: 616, baseType: !943, size: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !955, file: !314, line: 754, baseType: !1112, size: 512)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !314, line: 622, size: 512, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1112, file: !314, line: 624, baseType: !1020, size: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1112, file: !314, line: 628, baseType: !662, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1112, file: !314, line: 632, baseType: !662, size: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1112, file: !314, line: 636, baseType: !662, size: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !955, file: !314, line: 755, baseType: !1119, size: 704)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !314, line: 642, size: 704, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1119, file: !314, line: 644, baseType: !1112, size: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1119, file: !314, line: 648, baseType: !662, size: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1119, file: !314, line: 652, baseType: !662, size: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1119, file: !314, line: 653, baseType: !662, size: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !955, file: !314, line: 756, baseType: !1126, size: 448)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !314, line: 663, size: 448, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1126, file: !314, line: 665, baseType: !1020, size: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1126, file: !314, line: 668, baseType: !662, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1126, file: !314, line: 673, baseType: !662, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !955, file: !314, line: 757, baseType: !1132, size: 384)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !314, line: 694, size: 384, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1132, file: !314, line: 696, baseType: !1020, size: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1132, file: !314, line: 699, baseType: !662, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !955, file: !314, line: 758, baseType: !1137, size: 384)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !314, line: 681, size: 384, elements: !1138)
!1138 = !{!1139, !1140, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1137, file: !314, line: 683, baseType: !958, size: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1137, file: !314, line: 686, baseType: !662, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1137, file: !314, line: 689, baseType: !662, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !955, file: !314, line: 759, baseType: !1143, size: 384)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !314, line: 707, size: 384, elements: !1144)
!1144 = !{!1145, !1146, !1147}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1143, file: !314, line: 709, baseType: !958, size: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1143, file: !314, line: 712, baseType: !662, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1143, file: !314, line: 712, baseType: !662, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !955, file: !314, line: 760, baseType: !1149, size: 320)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !314, line: 718, size: 320, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1149, file: !314, line: 720, baseType: !958, size: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1149, file: !314, line: 723, baseType: !662, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !950, file: !314, line: 138, baseType: !949, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !314, line: 139, baseType: !949, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !945, file: !314, line: 146, baseType: !948, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !945, file: !314, line: 152, baseType: !943, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !940, file: !245, line: 130, baseType: !817, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !935, file: !245, line: 134, baseType: !622, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !935, file: !245, line: 137, baseType: !662, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !935, file: !245, line: 138, baseType: !767, size: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !935, file: !245, line: 142, baseType: !7, size: 32, offset: 352)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !935, file: !245, line: 144, baseType: !617, size: 32, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !935, file: !245, line: 145, baseType: !617, size: 32, offset: 416)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !935, file: !245, line: 146, baseType: !1165, size: 64, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !245, line: 119, baseType: !599)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !918, file: !245, line: 220, baseType: !921, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !918, file: !245, line: 223, baseType: !622, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !918, file: !245, line: 226, baseType: !1169, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !245, line: 185, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !918, file: !245, line: 229, baseType: !1172, size: 128, offset: 256)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 128, elements: !583)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !245, line: 229, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !918, file: !245, line: 232, baseType: !917, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !918, file: !245, line: 233, baseType: !917, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !918, file: !245, line: 238, baseType: !1178, size: 64, offset: 512)
!1178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !245, line: 235, size: 64, elements: !1179)
!1179 = !{!1180, !1186}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1178, file: !245, line: 236, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !245, line: 273, size: 128, elements: !1183)
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1182, file: !245, line: 275, baseType: !943, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1182, file: !245, line: 278, baseType: !943, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1178, file: !245, line: 237, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !245, line: 259, size: 320, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1188, file: !245, line: 261, baseType: !817, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1188, file: !245, line: 262, baseType: !817, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1188, file: !245, line: 266, baseType: !817, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1188, file: !245, line: 267, baseType: !817, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1188, file: !245, line: 270, baseType: !617, size: 32, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !918, file: !245, line: 241, baseType: !1165, size: 64, offset: 576)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !918, file: !245, line: 244, baseType: !617, size: 32, offset: 640)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !918, file: !245, line: 247, baseType: !617, size: 32, offset: 672)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !918, file: !245, line: 250, baseType: !617, size: 32, offset: 704)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !918, file: !245, line: 253, baseType: !617, size: 32, offset: 736)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !245, line: 256, baseType: !617, size: 32, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !913, file: !245, line: 378, baseType: !916, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !913, file: !245, line: 381, baseType: !1203, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !245, line: 282, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !245, line: 282, size: 128, elements: !1206)
!1206 = !{!1207}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1205, file: !245, line: 282, baseType: !1208, size: 128)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !245, line: 281, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !245, line: 281, size: 128, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1209, file: !245, line: 281, baseType: !7, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1209, file: !245, line: 281, baseType: !7, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1209, file: !245, line: 281, baseType: !1214, size: 64, offset: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 64, elements: !653)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !913, file: !245, line: 384, baseType: !617, size: 32, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !913, file: !245, line: 387, baseType: !617, size: 32, offset: 224)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !913, file: !245, line: 390, baseType: !617, size: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !913, file: !245, line: 394, baseType: !1203, size: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !913, file: !245, line: 396, baseType: !244, size: 32, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !913, file: !245, line: 399, baseType: !1221, size: 64, offset: 416)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !583)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !913, file: !245, line: 402, baseType: !1223, size: 64, offset: 480)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !583)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !913, file: !245, line: 406, baseType: !617, size: 32, offset: 544)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !913, file: !245, line: 409, baseType: !617, size: 32, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !905, file: !906, line: 470, baseType: !944, size: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !905, file: !906, line: 473, baseType: !1228, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !856, line: 39, size: 1152, elements: !1230)
!1230 = !{!1231, !1280, !1293, !1305, !1306, !1317, !1318, !1322, !1323, !1324, !1325, !1326}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1229, file: !856, line: 41, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !293, line: 144, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !293, line: 100, size: 896, elements: !1235)
!1235 = !{!1236, !1244, !1249, !1254, !1256, !1257, !1258, !1259, !1260, !1261, !1266, !1268, !1269, !1274, !1279}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1234, file: !293, line: 102, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !293, line: 52, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !293, line: 47, baseType: !7)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1234, file: !293, line: 105, baseType: !1245, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !293, line: 59, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!617, !1242, !1242}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1234, file: !293, line: 108, baseType: !1250, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !293, line: 63, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !622}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1234, file: !293, line: 111, baseType: !1255, size: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !293, line: 114, baseType: !636, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1234, file: !293, line: 117, baseType: !636, size: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1234, file: !293, line: 120, baseType: !636, size: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1234, file: !293, line: 124, baseType: !7, size: 32, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1234, file: !293, line: 128, baseType: !7, size: 32, offset: 480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1234, file: !293, line: 131, baseType: !1262, size: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !293, line: 75, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!622, !636, !636}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1234, file: !293, line: 132, baseType: !1267, size: 64, offset: 576)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !293, line: 78, baseType: !1251)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1234, file: !293, line: 135, baseType: !622, size: 64, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1234, file: !293, line: 136, baseType: !1270, size: 64, offset: 704)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !293, line: 82, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!622, !622, !636, !636}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1234, file: !293, line: 137, baseType: !1275, size: 64, offset: 768)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !293, line: 83, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !622, !622}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1234, file: !293, line: 141, baseType: !7, size: 32, offset: 832)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1229, file: !856, line: 48, baseType: !1281, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !314, line: 35, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !314, line: 35, size: 128, elements: !1284)
!1284 = !{!1285}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1283, file: !314, line: 35, baseType: !1286, size: 128)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !314, line: 33, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !314, line: 33, size: 128, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1287, file: !314, line: 33, baseType: !7, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1287, file: !314, line: 33, baseType: !7, size: 32, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1287, file: !314, line: 33, baseType: !1292, size: 64, offset: 64)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 64, elements: !653)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1229, file: !856, line: 51, baseType: !1294, size: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !37, line: 183, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !37, line: 183, size: 128, elements: !1297)
!1297 = !{!1298}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1296, file: !37, line: 183, baseType: !1299, size: 128)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !37, line: 182, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !37, line: 182, size: 128, elements: !1301)
!1301 = !{!1302, !1303, !1304}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1300, file: !37, line: 182, baseType: !7, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1300, file: !37, line: 182, baseType: !7, size: 32, offset: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1300, file: !37, line: 182, baseType: !1007, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1229, file: !856, line: 54, baseType: !662, size: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1229, file: !856, line: 57, baseType: !1307, size: 128, offset: 256)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1308, line: 31, size: 128, elements: !1309)
!1308 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1309 = !{!1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1307, file: !1308, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1307, file: !1308, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1307, file: !1308, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1307, file: !1308, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1307, file: !1308, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1307, file: !1308, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1307, file: !1308, line: 56, baseType: !564, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1229, file: !856, line: 60, baseType: !1307, size: 128, offset: 384)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1229, file: !856, line: 64, baseType: !1319, size: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1321, line: 33, flags: DIFlagFwdDecl)
!1321 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1229, file: !856, line: 67, baseType: !662, size: 64, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1229, file: !856, line: 73, baseType: !1232, size: 64, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1229, file: !856, line: 77, baseType: !564, size: 64, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1229, file: !856, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1229, file: !856, line: 82, baseType: !1327, size: 320, offset: 832)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !984, line: 62, size: 320, elements: !1328)
!1328 = !{!1329, !1335, !1336, !1337, !1338, !1339}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1327, file: !984, line: 63, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !984, line: 56, size: 128, elements: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1331, file: !984, line: 57, baseType: !1330, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1331, file: !984, line: 58, baseType: !741, size: 8, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1327, file: !984, line: 64, baseType: !7, size: 32, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1327, file: !984, line: 66, baseType: !7, size: 32, offset: 96)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1327, file: !984, line: 68, baseType: !759, size: 8, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1327, file: !984, line: 70, baseType: !982, size: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1327, file: !984, line: 71, baseType: !990, size: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !905, file: !906, line: 476, baseType: !1341, size: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !906, line: 476, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !905, file: !906, line: 479, baseType: !1232, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !905, file: !906, line: 484, baseType: !662, size: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !905, file: !906, line: 488, baseType: !662, size: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !905, file: !906, line: 493, baseType: !662, size: 64, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !905, file: !906, line: 496, baseType: !662, size: 64, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !905, file: !906, line: 501, baseType: !1349, size: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !256, line: 2355, size: 576, elements: !1351)
!1351 = !{!1352, !1355, !1356, !1357, !1358, !1360, !1361, !1366, !1367, !1368, !1369, !1370, !1371}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1350, file: !256, line: 2356, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !256, line: 2356, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1350, file: !256, line: 2357, baseType: !1083, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1350, file: !256, line: 2358, baseType: !617, size: 32, offset: 128)
