; ModuleID = 'et-forest.c'
source_filename = "et-forest.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.alloc_pool_def = type { i8*, i64, %struct.alloc_pool_list_def*, i8*, i64, i64, i64, i64, %struct.alloc_pool_list_def*, i64, i64 }
%struct.alloc_pool_list_def = type { %struct.alloc_pool_list_def* }
%struct.et_node = type { i8*, i32, i32, %struct.et_node*, %struct.et_node*, %struct.et_node*, %struct.et_node*, %struct.et_occ*, %struct.et_occ* }
%struct.et_occ = type { %struct.et_node*, %struct.et_occ*, %struct.et_occ*, %struct.et_occ*, i32, i32, %struct.et_occ* }

@et_nodes = internal global %struct.alloc_pool_def* null, align 8, !dbg !0
@.str = private unnamed_addr constant [13 x i8] c"et_node pool\00", align 1
@et_occurrences = internal global %struct.alloc_pool_def* null, align 8, !dbg !32
@.str.1 = private unnamed_addr constant [12 x i8] c"et_occ pool\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.et_node* @et_new_tree(i8* %data) #0 !dbg !66 {
entry:
  %data.addr = alloca i8*, align 8
  %nw = alloca %struct.et_node*, align 8
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !69, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.declare(metadata %struct.et_node** %nw, metadata !71, metadata !DIExpression()), !dbg !72

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "et_nodes", scope: !2, file: !3, line: 58, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !31, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "et-forest.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !11, !20}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !8, line: 59, size: 512, elements: !9)
!8 = !DIFile(filename: "./et-forest.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !12, !14, !15, !16, !17, !18, !19, !30}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !8, line: 61, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dfs_num_in", scope: !7, file: !8, line: 63, baseType: !13, size: 32, offset: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "dfs_num_out", scope: !7, file: !8, line: 63, baseType: !13, size: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "father", scope: !7, file: !8, line: 65, baseType: !6, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !7, file: !8, line: 66, baseType: !6, size: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !7, file: !8, line: 67, baseType: !6, size: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !7, file: !8, line: 68, baseType: !6, size: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rightmost_occ", scope: !7, file: !8, line: 70, baseType: !20, size: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "et_occ", file: !3, line: 41, size: 384, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "of", scope: !21, file: !3, line: 43, baseType: !6, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !21, file: !3, line: 45, baseType: !20, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !3, line: 46, baseType: !20, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !3, line: 47, baseType: !20, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !21, file: !3, line: 49, baseType: !13, size: 32, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !21, file: !3, line: 51, baseType: !13, size: 32, offset: 288)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "min_occ", scope: !21, file: !3, line: 54, baseType: !20, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "parent_occ", scope: !7, file: !8, line: 71, baseType: !20, size: 64, offset: 448)
!31 = !{!0, !32}
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "et_occurrences", scope: !2, file: !3, line: 59, type: !34, isLocal: true, isDefinition: true)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool", file: !35, line: 58, baseType: !36)
!35 = !DIFile(filename: "./alloc-pool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_def", file: !35, line: 32, size: 704, elements: !38)
!38 = !{!39, !43, !47, !53, !55, !56, !57, !58, !59, !60, !61}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !35, line: 34, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "elts_per_block", scope: !37, file: !35, line: 38, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 46, baseType: !46)
!45 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!46 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "returned_free_list", scope: !37, file: !35, line: 41, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool_list", file: !35, line: 30, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_list_def", file: !35, line: 26, size: 64, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !35, line: 28, baseType: !49, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_free_list", scope: !37, file: !35, line: 45, baseType: !54, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_elts_remaining", scope: !37, file: !35, line: 49, baseType: !44, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "elts_allocated", scope: !37, file: !35, line: 51, baseType: !44, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "elts_free", scope: !37, file: !35, line: 52, baseType: !44, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_allocated", scope: !37, file: !35, line: 53, baseType: !44, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "block_list", scope: !37, file: !35, line: 54, baseType: !48, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !37, file: !35, line: 55, baseType: !44, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !37, file: !35, line: 56, baseType: !44, size: 64, offset: 640)
!62 = !{i32 7, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{i32 1, !"wchar_size", i32 4}
!65 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!66 = distinct !DISubprogram(name: "et_new_tree", scope: !3, file: !3, line: 467, type: !67, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!67 = !DISubroutineType(types: !68)
!68 = !{!6, !11}
!69 = !DILocalVariable(name: "data", arg: 1, scope: !66, file: !3, line: 467, type: !11)
!70 = !DILocation(line: 467, column: 20, scope: !66)
!71 = !DILocalVariable(name: "nw", scope: !66, file: !3, line: 469, type: !6)
!72 = !DILocation(line: 469, column: 19, scope: !66)
!73 = !DILocation(line: 471, column: 8, scope: !74)
!74 = distinct !DILexicalBlock(scope: !66, file: !3, line: 471, column: 7)
!75 = !DILocation(line: 471, column: 7, scope: !66)
!76 = !DILocation(line: 472, column: 16, scope: !74)
!77 = !DILocation(line: 472, column: 14, scope: !74)
!78 = !DILocation(line: 472, column: 5, scope: !74)
!79 = !DILocation(line: 473, column: 39, scope: !66)
!80 = !DILocation(line: 473, column: 27, scope: !66)
!81 = !DILocation(line: 473, column: 8, scope: !66)
!82 = !DILocation(line: 473, column: 6, scope: !66)
!83 = !DILocation(line: 475, column: 14, scope: !66)
!84 = !DILocation(line: 475, column: 3, scope: !66)
!85 = !DILocation(line: 475, column: 7, scope: !66)
!86 = !DILocation(line: 475, column: 12, scope: !66)
!87 = !DILocation(line: 476, column: 3, scope: !66)
!88 = !DILocation(line: 476, column: 7, scope: !66)
!89 = !DILocation(line: 476, column: 14, scope: !66)
!90 = !DILocation(line: 477, column: 3, scope: !66)
!91 = !DILocation(line: 477, column: 7, scope: !66)
!92 = !DILocation(line: 477, column: 12, scope: !66)
!93 = !DILocation(line: 478, column: 3, scope: !66)
!94 = !DILocation(line: 478, column: 7, scope: !66)
!95 = !DILocation(line: 478, column: 13, scope: !66)
!96 = !DILocation(line: 479, column: 3, scope: !66)
!97 = !DILocation(line: 479, column: 7, scope: !66)
!98 = !DILocation(line: 479, column: 11, scope: !66)
!99 = !DILocation(line: 481, column: 35, scope: !66)
!100 = !DILocation(line: 481, column: 23, scope: !66)
!101 = !DILocation(line: 481, column: 3, scope: !66)
!102 = !DILocation(line: 481, column: 7, scope: !66)
!103 = !DILocation(line: 481, column: 21, scope: !66)
!104 = !DILocation(line: 482, column: 3, scope: !66)
!105 = !DILocation(line: 482, column: 7, scope: !66)
!106 = !DILocation(line: 482, column: 18, scope: !66)
!107 = !DILocation(line: 484, column: 10, scope: !66)
!108 = !DILocation(line: 484, column: 3, scope: !66)
!109 = distinct !DISubprogram(name: "et_new_occ", scope: !3, file: !3, line: 444, type: !110, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!110 = !DISubroutineType(types: !111)
!111 = !{!20, !6}
!112 = !DILocalVariable(name: "node", arg: 1, scope: !109, file: !3, line: 444, type: !6)
!113 = !DILocation(line: 444, column: 29, scope: !109)
!114 = !DILocalVariable(name: "nw", scope: !109, file: !3, line: 446, type: !20)
!115 = !DILocation(line: 446, column: 18, scope: !109)
!116 = !DILocation(line: 448, column: 8, scope: !117)
!117 = distinct !DILexicalBlock(scope: !109, file: !3, line: 448, column: 7)
!118 = !DILocation(line: 448, column: 7, scope: !109)
!119 = !DILocation(line: 449, column: 22, scope: !117)
!120 = !DILocation(line: 449, column: 20, scope: !117)
!121 = !DILocation(line: 449, column: 5, scope: !117)
!122 = !DILocation(line: 450, column: 38, scope: !109)
!123 = !DILocation(line: 450, column: 26, scope: !109)
!124 = !DILocation(line: 450, column: 8, scope: !109)
!125 = !DILocation(line: 450, column: 6, scope: !109)
!126 = !DILocation(line: 452, column: 12, scope: !109)
