; ModuleID = 'tree-nrv.c'
source_filename = "tree-nrv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }

!602 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!603 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!604 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!605 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!606 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!607 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!608 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!609 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!610 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!611 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!612 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !561, line: 727, baseType: !7, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!615 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!638 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !318, line: 58, baseType: !7, size: 32, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!641 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!642 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!643 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!644 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!645 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!646 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!647 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!648 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!649 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!650 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!651 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gf_mask", file: !561, line: 100, baseType: !7, size: 32, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!654 = !DIEnumerator(name: "GF_ASM_INPUT", value: 1, isUnsigned: true)
!655 = !DIEnumerator(name: "GF_ASM_VOLATILE", value: 2, isUnsigned: true)
!656 = !DIEnumerator(name: "GF_CALL_CANNOT_INLINE", value: 1, isUnsigned: true)
!657 = !DIEnumerator(name: "GF_CALL_FROM_THUNK", value: 2, isUnsigned: true)
!658 = !DIEnumerator(name: "GF_CALL_RETURN_SLOT_OPT", value: 4, isUnsigned: true)
!659 = !DIEnumerator(name: "GF_CALL_TAILCALL", value: 8, isUnsigned: true)
!660 = !DIEnumerator(name: "GF_CALL_VA_ARG_PACK", value: 16, isUnsigned: true)
!661 = !DIEnumerator(name: "GF_OMP_PARALLEL_COMBINED", value: 1, isUnsigned: true)
!662 = !DIEnumerator(name: "GF_OMP_RETURN_NOWAIT", value: 1, isUnsigned: true)
!663 = !DIEnumerator(name: "GF_OMP_SECTION_LAST", value: 1, isUnsigned: true)
!664 = !DIEnumerator(name: "GF_PREDICT_TAKEN", value: 32768, isUnsigned: true)
!665 = !{!666, !317, !667, !1968, !854, !1267, !830, !1970, !1989, !757}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !669)
!669 = !{!670, !1815, !1825, !1831, !1836, !1841, !1848, !1854, !1860, !1865, !1879, !1884, !1890, !1895, !1905, !1910, !1926, !1933, !1940, !1946, !1951, !1957, !1963}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !668, file: !561, line: 738, baseType: !671, size: 256)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !688, !689, !1814}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !671, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !671, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !671, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !671, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !671, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !671, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !671, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !671, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !671, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !671, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !671, file: !561, line: 316, baseType: !684, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !685, line: 58, baseType: !686)
!685 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !687, line: 44, baseType: !7)
!687 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!688 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !671, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !671, file: !561, line: 323, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !692)
!692 = !{!693, !1779, !1780, !1781, !1784, !1788, !1789, !1790, !1808, !1809, !1810, !1811, !1812, !1813}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !691, file: !513, line: 219, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !513, line: 151, baseType: !699, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !700, file: !513, line: 150, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !700, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !700, file: !513, line: 150, baseType: !705, size: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !772)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !707, line: 108, baseType: !708)
!707 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !710)
!710 = !{!711, !712, !713, !1771, !1772, !1773, !1774, !1775, !1776, !1777}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !709, file: !513, line: 124, baseType: !690, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !709, file: !513, line: 125, baseType: !690, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !709, file: !513, line: 131, baseType: !714, size: 64, offset: 128)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !715)
!715 = !{!716, !732}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !714, file: !513, line: 129, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !707, line: 66, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !720)
!720 = !{!721, !730, !731}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !719, file: !561, line: 145, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !707, line: 69, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !725)
!725 = !{!726, !728, !729}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !724, file: !561, line: 137, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !707, line: 58, baseType: !667)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !561, line: 138, baseType: !723, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !561, line: 139, baseType: !723, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !719, file: !561, line: 146, baseType: !722, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !719, file: !561, line: 152, baseType: !717, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !714, file: !513, line: 130, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !707, line: 50, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !736, line: 240, size: 384, elements: !737)
!736 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !735, file: !736, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !735, file: !736, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !735, file: !736, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !735, file: !736, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !735, file: !736, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !735, file: !736, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !735, file: !736, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !735, file: !736, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !735, file: !736, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !735, file: !736, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !735, file: !736, line: 321, baseType: !749, size: 320, offset: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !736, line: 315, size: 320, elements: !750)
!750 = !{!751, !1738, !1740, !1769, !1770}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !749, file: !736, line: 316, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 64, elements: !772)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !736, line: 183, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !736, line: 166, size: 64, elements: !755)
!755 = !{!756, !758, !759, !763, !764, !774, !775, !787, !790, !853, !1716, !1717, !1728, !1735}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !754, file: !736, line: 168, baseType: !757, size: 32)
!757 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !754, file: !736, line: 169, baseType: !7, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !754, file: !736, line: 170, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !754, file: !736, line: 171, baseType: !733, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !754, file: !736, line: 172, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !707, line: 53, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !736, line: 359, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !767, file: !736, line: 360, baseType: !757, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !767, file: !736, line: 361, baseType: !771, size: 64, offset: 64)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 64, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 1)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !754, file: !736, line: 173, baseType: !189, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !754, file: !736, line: 174, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !736, line: 133, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !736, line: 115, size: 32, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !777, file: !736, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !777, file: !736, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !777, file: !736, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !777, file: !736, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !777, file: !736, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !777, file: !736, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !777, file: !736, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !777, file: !736, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !754, file: !736, line: 175, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !736, line: 175, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !754, file: !736, line: 176, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !793, line: 75, size: 256, elements: !794)
!793 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!794 = !{!795, !810, !811, !812}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !792, file: !793, line: 76, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !793, line: 68, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !793, line: 63, size: 320, elements: !799)
!799 = !{!800, !802, !803, !804}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !793, line: 64, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !793, line: 65, baseType: !801, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !798, file: !793, line: 66, baseType: !7, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !798, file: !793, line: 67, baseType: !805, size: 128, offset: 192)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !808)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !793, line: 29, baseType: !807)
!807 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!808 = !{!809}
!809 = !DISubrange(count: 2)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !792, file: !793, line: 77, baseType: !796, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !792, file: !793, line: 78, baseType: !7, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !792, file: !793, line: 79, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !793, line: 49, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !793, line: 45, size: 832, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !815, file: !793, line: 46, baseType: !801, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !815, file: !793, line: 47, baseType: !791, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !815, file: !793, line: 48, baseType: !820, size: 704, offset: 128)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !821, line: 164, size: 704, elements: !822)
!821 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!822 = !{!823, !825, !836, !837, !838, !839, !840, !841, !845, !849, !850, !851, !852}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !820, file: !821, line: 166, baseType: !824, size: 64)
!824 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !820, file: !821, line: 167, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !821, line: 157, size: 192, elements: !828)
!828 = !{!829, !831, !832}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !827, file: !821, line: 159, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !827, file: !821, line: 160, baseType: !826, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !827, file: !821, line: 161, baseType: !833, size: 32, offset: 128)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 32, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 4)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !820, file: !821, line: 168, baseType: !830, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !820, file: !821, line: 169, baseType: !830, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !820, file: !821, line: 170, baseType: !830, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !820, file: !821, line: 171, baseType: !824, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !820, file: !821, line: 172, baseType: !757, size: 32, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !820, file: !821, line: 176, baseType: !842, size: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!826, !666, !824}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !820, file: !821, line: 177, baseType: !846, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !666, !826}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !820, file: !821, line: 178, baseType: !666, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !820, file: !821, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !820, file: !821, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !820, file: !821, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !754, file: !736, line: 177, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !707, line: 56, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !857)
!857 = !{!858, !891, !897, !908, !927, !938, !943, !950, !956, !970, !978, !1016, !1021, !1049, !1066, !1067, !1072, !1081, !1087, !1092, !1096, !1100, !1365, !1414, !1420, !1426, !1433, !1446, !1460, !1477, !1489, !1511, !1526, !1698}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !856, file: !318, line: 3372, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !859, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !859, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !859, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !859, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !859, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !859, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !859, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !859, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !859, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !859, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !859, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !859, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !859, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !859, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !859, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !859, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !859, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !859, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !859, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !859, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !859, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !859, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !859, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !859, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !859, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !859, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !859, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !859, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !859, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !859, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !318, line: 3373, baseType: !892, size: 192)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !892, file: !318, line: 403, baseType: !859, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !892, file: !318, line: 404, baseType: !854, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !892, file: !318, line: 405, baseType: !854, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !856, file: !318, line: 3374, baseType: !898, size: 320)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !318, line: 1385, baseType: !892, size: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !898, file: !318, line: 1386, baseType: !902, size: 128, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !903, line: 58, baseType: !904)
!903 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !903, line: 54, size: 128, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !904, file: !903, line: 56, baseType: !807, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !904, file: !903, line: 57, baseType: !824, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !856, file: !318, line: 3375, baseType: !909, size: 256)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !318, line: 1398, baseType: !892, size: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !909, file: !318, line: 1399, baseType: !913, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !915, line: 52, size: 256, elements: !916)
!915 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!916 = !{!917, !918, !919, !920, !921, !922, !923}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !914, file: !915, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !914, file: !915, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !914, file: !915, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !914, file: !915, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !914, file: !915, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !914, file: !915, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !914, file: !915, line: 62, baseType: !924, size: 192, offset: 64)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 192, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 3)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !856, file: !318, line: 3376, baseType: !928, size: 256)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !318, line: 1409, baseType: !892, size: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !928, file: !318, line: 1410, baseType: !932, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !934, line: 27, size: 192, elements: !935)
!934 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !933, file: !934, line: 29, baseType: !902, size: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !933, file: !934, line: 30, baseType: !189, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !856, file: !318, line: 3377, baseType: !939, size: 256)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !318, line: 1438, baseType: !892, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !939, file: !318, line: 1439, baseType: !854, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !856, file: !318, line: 3378, baseType: !944, size: 256)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !318, line: 1419, baseType: !892, size: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !944, file: !318, line: 1420, baseType: !757, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !944, file: !318, line: 1421, baseType: !949, size: 8, offset: 224)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 8, elements: !772)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !856, file: !318, line: 3379, baseType: !951, size: 320)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !318, line: 1429, baseType: !892, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !951, file: !318, line: 1430, baseType: !854, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !951, file: !318, line: 1431, baseType: !854, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !856, file: !318, line: 3380, baseType: !957, size: 320)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !318, line: 1461, baseType: !892, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !957, file: !318, line: 1462, baseType: !961, size: 128, offset: 192)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !962, line: 31, size: 128, elements: !963)
!962 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!963 = !{!964, !968, !969}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !961, file: !962, line: 32, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !961, file: !962, line: 33, baseType: !7, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !961, file: !962, line: 34, baseType: !7, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !856, file: !318, line: 3381, baseType: !971, size: 384)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !972)
!972 = !{!973, !974, !975, !976, !977}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !318, line: 2508, baseType: !892, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !971, file: !318, line: 2509, baseType: !684, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !971, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !971, file: !318, line: 2511, baseType: !854, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !971, file: !318, line: 2512, baseType: !854, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !856, file: !318, line: 3382, baseType: !979, size: 896)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !979, file: !318, line: 2653, baseType: !971, size: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !979, file: !318, line: 2654, baseType: !854, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !979, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !979, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !979, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !979, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !979, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !979, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !979, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !979, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !979, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !979, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !979, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !979, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !979, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !979, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !979, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !979, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !979, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !979, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !979, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !979, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !979, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !979, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !979, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !979, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !979, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !979, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !979, file: !318, line: 2705, baseType: !854, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !979, file: !318, line: 2706, baseType: !854, size: 64, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !979, file: !318, line: 2707, baseType: !854, size: 64, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !979, file: !318, line: 2708, baseType: !854, size: 64, offset: 768)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !979, file: !318, line: 2711, baseType: !1014, size: 64, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !856, file: !318, line: 3383, baseType: !1017, size: 960)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !318, line: 2757, baseType: !979, size: 896)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1017, file: !318, line: 2758, baseType: !733, size: 64, offset: 896)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !856, file: !318, line: 3384, baseType: !1022, size: 1472)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1023)
!1023 = !{!1024, !1045, !1046, !1047, !1048}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1022, file: !318, line: 3115, baseType: !1025, size: 1216)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !318, line: 2985, baseType: !1017, size: 960)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1025, file: !318, line: 2986, baseType: !854, size: 64, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1025, file: !318, line: 2987, baseType: !854, size: 64, offset: 1024)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1025, file: !318, line: 2988, baseType: !854, size: 64, offset: 1088)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1025, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1025, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1025, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1025, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1025, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1025, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1025, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1025, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1025, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1025, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1025, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1025, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1025, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1025, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1022, file: !318, line: 3117, baseType: !854, size: 64, offset: 1216)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1022, file: !318, line: 3119, baseType: !854, size: 64, offset: 1280)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1022, file: !318, line: 3121, baseType: !854, size: 64, offset: 1344)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1022, file: !318, line: 3123, baseType: !854, size: 64, offset: 1408)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !856, file: !318, line: 3385, baseType: !1050, size: 1088)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !318, line: 2875, baseType: !1017, size: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1050, file: !318, line: 2876, baseType: !733, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1050, file: !318, line: 2877, baseType: !1055, size: 64, offset: 1024)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1057, line: 172, size: 128, elements: !1058)
!1057 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1056, file: !1057, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1056, file: !1057, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1056, file: !1057, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1056, file: !1057, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1056, file: !1057, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1056, file: !1057, line: 195, baseType: !7, size: 32, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1056, file: !1057, line: 199, baseType: !854, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !856, file: !318, line: 3386, baseType: !1025, size: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !856, file: !318, line: 3387, baseType: !1068, size: 1280)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1069)
!1069 = !{!1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !318, line: 3094, baseType: !1025, size: 1216)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1068, file: !318, line: 3095, baseType: !1055, size: 64, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !856, file: !318, line: 3388, baseType: !1073, size: 1216)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !318, line: 2825, baseType: !979, size: 896)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1073, file: !318, line: 2827, baseType: !854, size: 64, offset: 896)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1073, file: !318, line: 2828, baseType: !854, size: 64, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1073, file: !318, line: 2829, baseType: !854, size: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1073, file: !318, line: 2830, baseType: !854, size: 64, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1073, file: !318, line: 2831, baseType: !854, size: 64, offset: 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !856, file: !318, line: 3389, baseType: !1082, size: 1024)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1082, file: !318, line: 2851, baseType: !1017, size: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1082, file: !318, line: 2852, baseType: !757, size: 32, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1082, file: !318, line: 2853, baseType: !757, size: 32, offset: 992)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !856, file: !318, line: 3390, baseType: !1088, size: 1024)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !318, line: 2857, size: 1024, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !318, line: 2858, baseType: !1017, size: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1088, file: !318, line: 2859, baseType: !1055, size: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !856, file: !318, line: 3391, baseType: !1093, size: 960)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !318, line: 2862, size: 960, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !318, line: 2863, baseType: !1017, size: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !856, file: !318, line: 3392, baseType: !1097, size: 1472)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !318, line: 3304, size: 1472, elements: !1098)
!1098 = !{!1099}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !318, line: 3305, baseType: !1022, size: 1472)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !856, file: !318, line: 3393, baseType: !1101, size: 1792)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !318, line: 3248, size: 1792, elements: !1102)
!1102 = !{!1103, !1104, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !318, line: 3249, baseType: !1022, size: 1472)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1101, file: !318, line: 3251, baseType: !1105, size: 64, offset: 1472)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1107, line: 463, size: 1152, elements: !1108)
!1107 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1108 = !{!1109, !1112, !1143, !1144, !1285, !1288, !1289, !1290, !1291, !1292, !1293, !1317, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1106, file: !1107, line: 464, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1107, line: 464, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1106, file: !1107, line: 467, baseType: !1113, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !1115)
!1115 = !{!1116, !1118, !1119, !1132, !1133, !1134, !1135, !1136, !1137, !1139, !1141, !1142}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1114, file: !513, line: 377, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !707, line: 111, baseType: !690)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1114, file: !513, line: 378, baseType: !1117, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1114, file: !513, line: 381, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !513, line: 282, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !513, line: 282, size: 128, elements: !1123)
!1123 = !{!1124}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1122, file: !513, line: 282, baseType: !1125, size: 128)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !513, line: 281, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !513, line: 281, size: 128, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1126, file: !513, line: 281, baseType: !7, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1126, file: !513, line: 281, baseType: !7, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1126, file: !513, line: 281, baseType: !1131, size: 64, offset: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 64, elements: !772)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1114, file: !513, line: 384, baseType: !757, size: 32, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1114, file: !513, line: 387, baseType: !757, size: 32, offset: 224)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1114, file: !513, line: 390, baseType: !757, size: 32, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1114, file: !513, line: 394, baseType: !1120, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1114, file: !513, line: 396, baseType: !512, size: 32, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1114, file: !513, line: 399, baseType: !1138, size: 64, offset: 416)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 64, elements: !808)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1114, file: !513, line: 402, baseType: !1140, size: 64, offset: 480)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !808)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1114, file: !513, line: 406, baseType: !757, size: 32, offset: 544)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1114, file: !513, line: 409, baseType: !757, size: 32, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1106, file: !1107, line: 470, baseType: !718, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1106, file: !1107, line: 473, baseType: !1145, size: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1057, line: 39, size: 1152, elements: !1147)
!1147 = !{!1148, !1200, !1213, !1226, !1227, !1239, !1240, !1244, !1245, !1246, !1247, !1248}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1146, file: !1057, line: 41, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1150, line: 144, baseType: !1151)
!1150 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1150, line: 100, size: 896, elements: !1153)
!1153 = !{!1154, !1162, !1167, !1172, !1174, !1177, !1178, !1179, !1180, !1181, !1186, !1188, !1189, !1194, !1199}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1152, file: !1150, line: 102, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1150, line: 52, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1150, line: 47, baseType: !7)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1152, file: !1150, line: 105, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1150, line: 59, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!757, !1160, !1160}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1152, file: !1150, line: 108, baseType: !1168, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1150, line: 63, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !666}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1152, file: !1150, line: 111, baseType: !1173, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !1150, line: 114, baseType: !1175, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1176, line: 46, baseType: !807)
!1176 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1152, file: !1150, line: 117, baseType: !1175, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1152, file: !1150, line: 120, baseType: !1175, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1152, file: !1150, line: 124, baseType: !7, size: 32, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1152, file: !1150, line: 128, baseType: !7, size: 32, offset: 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1152, file: !1150, line: 131, baseType: !1182, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1150, line: 75, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!666, !1175, !1175}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1152, file: !1150, line: 132, baseType: !1187, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1150, line: 78, baseType: !1169)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1152, file: !1150, line: 135, baseType: !666, size: 64, offset: 640)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1152, file: !1150, line: 136, baseType: !1190, size: 64, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1150, line: 82, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!666, !666, !1175, !1175}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1152, file: !1150, line: 137, baseType: !1195, size: 64, offset: 768)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1150, line: 83, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !666, !666}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1152, file: !1150, line: 141, baseType: !7, size: 32, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1146, file: !1057, line: 48, baseType: !1201, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !561, line: 35, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !561, line: 35, size: 128, elements: !1204)
!1204 = !{!1205}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1203, file: !561, line: 35, baseType: !1206, size: 128)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !561, line: 33, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !561, line: 33, size: 128, elements: !1208)
!1208 = !{!1209, !1210, !1211}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1207, file: !561, line: 33, baseType: !7, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1207, file: !561, line: 33, baseType: !7, size: 32, offset: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1207, file: !561, line: 33, baseType: !1212, size: 64, offset: 64)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 64, elements: !772)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1146, file: !1057, line: 51, baseType: !1214, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !318, line: 183, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !318, line: 183, size: 128, elements: !1217)
!1217 = !{!1218}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1216, file: !318, line: 183, baseType: !1219, size: 128)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !318, line: 182, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !318, line: 182, size: 128, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1220, file: !318, line: 182, baseType: !7, size: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1220, file: !318, line: 182, baseType: !7, size: 32, offset: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1220, file: !318, line: 182, baseType: !1225, size: 64, offset: 64)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 64, elements: !772)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1146, file: !1057, line: 54, baseType: !854, size: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1146, file: !1057, line: 57, baseType: !1228, size: 128, offset: 256)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1229, line: 31, size: 128, elements: !1230)
!1229 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1228, file: !1229, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1228, file: !1229, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1228, file: !1229, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1228, file: !1229, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1228, file: !1229, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1228, file: !1229, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1228, file: !1229, line: 56, baseType: !1238, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !707, line: 47, baseType: !791)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1146, file: !1057, line: 60, baseType: !1228, size: 128, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1146, file: !1057, line: 64, baseType: !1241, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1243, line: 33, flags: DIFlagFwdDecl)
!1243 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1146, file: !1057, line: 67, baseType: !854, size: 64, offset: 576)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1146, file: !1057, line: 73, baseType: !1149, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1146, file: !1057, line: 77, baseType: !1238, size: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1146, file: !1057, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1146, file: !1057, line: 82, baseType: !1249, size: 320, offset: 832)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1250, line: 62, size: 320, elements: !1251)
!1250 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1251 = !{!1252, !1258, !1259, !1260, !1261, !1268}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1249, file: !1250, line: 63, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1250, line: 56, size: 128, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1254, file: !1250, line: 57, baseType: !1253, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1254, file: !1250, line: 58, baseType: !949, size: 8, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1249, file: !1250, line: 64, baseType: !7, size: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1249, file: !1250, line: 66, baseType: !7, size: 32, offset: 96)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1249, file: !1250, line: 68, baseType: !967, size: 8, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1249, file: !1250, line: 70, baseType: !1262, size: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1250, line: 37, size: 128, elements: !1264)
!1264 = !{!1265, !1266}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1263, file: !1250, line: 39, baseType: !1262, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1263, file: !1250, line: 40, baseType: !1267, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1249, file: !1250, line: 71, baseType: !1269, size: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1250, line: 45, size: 320, elements: !1271)
!1271 = !{!1272, !1273}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1270, file: !1250, line: 47, baseType: !1269, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1270, file: !1250, line: 48, baseType: !1274, size: 256, offset: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1275)
!1275 = !{!1276, !1278, !1279, !1284}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1274, file: !318, line: 1884, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1274, file: !318, line: 1885, baseType: !1277, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1274, file: !318, line: 1891, baseType: !1280, size: 64, offset: 128)
!1280 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1274, file: !318, line: 1891, size: 64, elements: !1281)
!1281 = !{!1282, !1283}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1280, file: !318, line: 1891, baseType: !727, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1280, file: !318, line: 1891, baseType: !854, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1274, file: !318, line: 1892, baseType: !1267, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1106, file: !1107, line: 476, baseType: !1286, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1107, line: 476, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1106, file: !1107, line: 479, baseType: !1149, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1106, file: !1107, line: 484, baseType: !854, size: 64, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1106, file: !1107, line: 488, baseType: !854, size: 64, offset: 448)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1106, file: !1107, line: 493, baseType: !854, size: 64, offset: 512)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1106, file: !1107, line: 496, baseType: !854, size: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1106, file: !1107, line: 501, baseType: !1294, size: 64, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !524, line: 2355, size: 576, elements: !1296)
!1296 = !{!1297, !1300, !1301, !1302, !1303, !1305, !1306, !1311, !1312, !1313, !1314, !1315, !1316}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1295, file: !524, line: 2356, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !524, line: 2356, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1295, file: !524, line: 2357, baseType: !760, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1295, file: !524, line: 2358, baseType: !757, size: 32, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1295, file: !524, line: 2359, baseType: !757, size: 32, offset: 160)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1295, file: !524, line: 2360, baseType: !1304, size: 128, offset: 192)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 128, elements: !834)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1295, file: !524, line: 2364, baseType: !757, size: 32, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1295, file: !524, line: 2367, baseType: !1307, size: 128, offset: 384)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !524, line: 2349, size: 128, elements: !1308)
!1308 = !{!1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1307, file: !524, line: 2351, baseType: !733, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1307, file: !524, line: 2352, baseType: !824, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1295, file: !524, line: 2371, baseType: !523, size: 32, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1295, file: !524, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1295, file: !524, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1295, file: !524, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1295, file: !524, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1295, file: !524, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1106, file: !1107, line: 504, baseType: !1318, size: 64, offset: 704)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1107, line: 504, flags: DIFlagFwdDecl)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1106, file: !1107, line: 507, baseType: !1149, size: 64, offset: 768)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1106, file: !1107, line: 510, baseType: !757, size: 32, offset: 832)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1106, file: !1107, line: 513, baseType: !757, size: 32, offset: 864)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1106, file: !1107, line: 516, baseType: !684, size: 32, offset: 896)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1106, file: !1107, line: 519, baseType: !684, size: 32, offset: 928)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1106, file: !1107, line: 522, baseType: !7, size: 32, offset: 960)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1106, file: !1107, line: 523, baseType: !7, size: 32, offset: 992)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1106, file: !1107, line: 528, baseType: !760, size: 64, offset: 1024)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1106, file: !1107, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1106, file: !1107, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1106, file: !1107, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1106, file: !1107, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1106, file: !1107, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1106, file: !1107, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1106, file: !1107, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1106, file: !1107, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1106, file: !1107, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1106, file: !1107, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1106, file: !1107, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1106, file: !1107, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1106, file: !1107, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1106, file: !1107, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1106, file: !1107, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1106, file: !1107, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1101, file: !318, line: 3254, baseType: !854, size: 64, offset: 1536)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1101, file: !318, line: 3257, baseType: !854, size: 64, offset: 1600)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1101, file: !318, line: 3258, baseType: !854, size: 64, offset: 1664)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1101, file: !318, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1101, file: !318, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1101, file: !318, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1101, file: !318, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1101, file: !318, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1101, file: !318, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1101, file: !318, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1101, file: !318, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1101, file: !318, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1101, file: !318, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1101, file: !318, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1101, file: !318, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1101, file: !318, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1101, file: !318, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1101, file: !318, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1101, file: !318, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1101, file: !318, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1101, file: !318, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !856, file: !318, line: 3394, baseType: !1366, size: 1344)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !318, line: 2279, size: 1344, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1393, !1394, !1395, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1366, file: !318, line: 2280, baseType: !892, size: 192)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1366, file: !318, line: 2281, baseType: !854, size: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1366, file: !318, line: 2282, baseType: !854, size: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1366, file: !318, line: 2283, baseType: !854, size: 64, offset: 320)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1366, file: !318, line: 2284, baseType: !854, size: 64, offset: 384)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1366, file: !318, line: 2285, baseType: !7, size: 32, offset: 448)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1366, file: !318, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1366, file: !318, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1366, file: !318, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1366, file: !318, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1366, file: !318, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1366, file: !318, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1366, file: !318, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1366, file: !318, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1366, file: !318, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1366, file: !318, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1366, file: !318, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1366, file: !318, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1366, file: !318, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1366, file: !318, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1366, file: !318, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1366, file: !318, line: 2305, baseType: !7, size: 32, offset: 512)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1366, file: !318, line: 2306, baseType: !1391, size: 32, offset: 544)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1392, line: 31, baseType: !757)
!1392 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1366, file: !318, line: 2307, baseType: !854, size: 64, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1366, file: !318, line: 2308, baseType: !854, size: 64, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1366, file: !318, line: 2314, baseType: !1396, size: 64, offset: 704)
!1396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !318, line: 2309, size: 64, elements: !1397)
!1397 = !{!1398, !1399, !1400}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1396, file: !318, line: 2310, baseType: !757, size: 32)
