; ModuleID = 'cpp_macro.c'
source_filename = "cpp_macro.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }

!99 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!100 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!101 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!102 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!103 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!104 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!117 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!122 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!123 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!124 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!125 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!126 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 57, baseType: !7, size: 32, elements: !129)
!128 = !DIFile(filename: "./include/safe-ctype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!130 = !DIEnumerator(name: "_sch_isblank", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "_sch_iscntrl", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "_sch_isdigit", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "_sch_islower", value: 8, isUnsigned: true)
!134 = !DIEnumerator(name: "_sch_isprint", value: 16, isUnsigned: true)
!135 = !DIEnumerator(name: "_sch_ispunct", value: 32, isUnsigned: true)
!136 = !DIEnumerator(name: "_sch_isspace", value: 64, isUnsigned: true)
!137 = !DIEnumerator(name: "_sch_isupper", value: 128, isUnsigned: true)
!138 = !DIEnumerator(name: "_sch_isxdigit", value: 256, isUnsigned: true)
!139 = !DIEnumerator(name: "_sch_isidst", value: 512, isUnsigned: true)
!140 = !DIEnumerator(name: "_sch_isvsp", value: 1024, isUnsigned: true)
!141 = !DIEnumerator(name: "_sch_isnvsp", value: 2048, isUnsigned: true)
!142 = !DIEnumerator(name: "_sch_isalpha", value: 136, isUnsigned: true)
!143 = !DIEnumerator(name: "_sch_isalnum", value: 140, isUnsigned: true)
!144 = !DIEnumerator(name: "_sch_isidnum", value: 516, isUnsigned: true)
!145 = !DIEnumerator(name: "_sch_isgraph", value: 172, isUnsigned: true)
!146 = !DIEnumerator(name: "_sch_iscppsp", value: 3072, isUnsigned: true)
!147 = !DIEnumerator(name: "_sch_isbasic", value: 3088, isUnsigned: true)
!148 = !{!149, !150, !152, !155, !160, !163, !245, !246, !184, !247, !250, !194, !289, !270, !298, !299, !203}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !156, line: 7, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !158, line: 160, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!159 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 46, baseType: !162)
!161 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!162 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !167)
!167 = !{!168, !175, !176, !177, !178, !179, !180}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !166, file: !6, line: 645, baseType: !169, size: 128)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !170, line: 31, size: 128, elements: !171)
!170 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !169, file: !170, line: 32, baseType: !152, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !170, line: 33, baseType: !7, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !169, file: !170, line: 34, baseType: !7, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !166, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !166, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !166, file: !6, line: 650, baseType: !154, size: 8, offset: 136)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !166, file: !6, line: 654, baseType: !181, size: 64, offset: 192)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !182)
!182 = !{!183, !233, !243, !244}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !181, file: !6, line: 635, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !187, line: 36, size: 256, elements: !188)
!187 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !{!189, !190, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !186, file: !187, line: 42, baseType: !163, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !186, file: !187, line: 51, baseType: !191, size: 64, offset: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !187, line: 47, size: 64, elements: !192)
!192 = !{!193, !223}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !191, file: !187, line: 49, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !197)
!197 = !{!198, !201, !202, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !196, file: !6, line: 213, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !200, line: 44, baseType: !7)
!200 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !6, line: 215, baseType: !203, size: 16, offset: 48)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !196, file: !6, line: 237, baseType: !205, size: 128, offset: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !206)
!206 = !{!207, !211, !212, !217, !221, !222}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !6, line: 220, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !208, file: !6, line: 207, baseType: !164, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !205, file: !6, line: 223, baseType: !194, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !205, file: !6, line: 226, baseType: !213, size: 128)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !6, line: 163, baseType: !7, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !213, file: !6, line: 164, baseType: !152, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !205, file: !6, line: 229, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !218, file: !6, line: 197, baseType: !7, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !205, file: !6, line: 233, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !205, file: !6, line: 236, baseType: !7, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !191, file: !187, line: 50, baseType: !152, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !186, file: !187, line: 54, baseType: !199, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !186, file: !187, line: 57, baseType: !7, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !186, file: !187, line: 60, baseType: !203, size: 16, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !186, file: !187, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !186, file: !187, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !186, file: !187, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !186, file: !187, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !186, file: !187, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !186, file: !187, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !181, file: !6, line: 637, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !187, line: 28, size: 320, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !187, line: 29, baseType: !234, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !235, file: !187, line: 30, baseType: !7, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !235, file: !187, line: 31, baseType: !240, size: 192, offset: 128)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 192, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !181, file: !6, line: 639, baseType: !5, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !181, file: !6, line: 641, baseType: !203, size: 16)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !187, line: 22, baseType: !154)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !252, line: 141, baseType: !253)
!252 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !252, line: 142, size: 448, elements: !254)
!254 = !{!255, !256, !257, !277, !287, !288}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !252, line: 145, baseType: !250, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !252, line: 145, baseType: !250, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !253, file: !252, line: 164, baseType: !258, size: 128, offset: 128)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 147, size: 128, elements: !259)
!259 = !{!260, !272}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !258, file: !252, line: 156, baseType: !261, size: 128)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !252, line: 152, size: 128, elements: !262)
!262 = !{!263, !271}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !261, file: !252, line: 154, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !252, line: 121, size: 64, elements: !265)
!265 = !{!266, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !264, file: !252, line: 123, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !264, file: !252, line: 124, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !261, file: !252, line: 155, baseType: !264, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !258, file: !252, line: 163, baseType: !273, size: 128)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !252, line: 159, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !273, file: !252, line: 161, baseType: !152, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !273, file: !252, line: 162, baseType: !152, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !253, file: !252, line: 168, baseType: !278, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !252, line: 99, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !252, line: 100, size: 256, elements: !281)
!281 = !{!282, !284, !285, !286}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !252, line: 102, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !280, file: !252, line: 103, baseType: !245, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !280, file: !252, line: 103, baseType: !245, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !280, file: !252, line: 103, baseType: !245, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !253, file: !252, line: 171, baseType: !164, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !253, file: !252, line: 174, baseType: !154, size: 8, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "macro_arg", file: !3, line: 33, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macro_arg", file: !3, line: 34, size: 256, elements: !292)
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !291, file: !3, line: 36, baseType: !270, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "expanded", scope: !291, file: !3, line: 37, baseType: !270, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stringified", scope: !291, file: !3, line: 38, baseType: !267, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !291, file: !3, line: 39, baseType: !7, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "expanded_count", scope: !291, file: !3, line: 40, baseType: !7, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!301 = !{!0}
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 768, elements: !304)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!304 = !{!305}
!305 = !DISubrange(count: 12)
!306 = !{i32 7, !"Dwarf Version", i32 4}
!307 = !{i32 2, !"Debug Info Version", i32 3}
!308 = !{i32 1, !"wchar_size", i32 4}
!309 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!310 = distinct !DISubprogram(name: "_cpp_warn_if_unused_macro", scope: !3, file: !3, line: 78, type: !311, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !754)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !314, !164, !149}
!313 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !252, line: 322, size: 10432, elements: !317)
!317 = !{!318, !391, !392, !409, !439, !440, !441, !442, !443, !444, !446, !450, !451, !452, !453, !454, !455, !456, !457, !458, !461, !462, !465, !466, !498, !499, !500, !503, !504, !505, !506, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !532, !533, !534, !537, !619, !645, !648, !649, !712, !719, !720, !727, !728, !729, !730, !733, !734, !747}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !316, file: !252, line: 325, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !252, line: 249, size: 1536, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !335, !336, !337, !338, !340, !343, !344, !347, !348, !349, !350, !351, !352, !377}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !321, file: !252, line: 251, baseType: !152, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !321, file: !252, line: 252, baseType: !152, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !321, file: !252, line: 253, baseType: !152, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !321, file: !252, line: 255, baseType: !152, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !321, file: !252, line: 256, baseType: !152, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !321, file: !252, line: 258, baseType: !329, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !252, line: 235, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !252, line: 236, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !331, file: !252, line: 239, baseType: !152, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !252, line: 245, baseType: !7, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !321, file: !252, line: 259, baseType: !7, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !321, file: !252, line: 260, baseType: !7, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !321, file: !252, line: 261, baseType: !7, size: 32, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !252, line: 263, baseType: !339, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !321, file: !252, line: 267, baseType: !341, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !321, file: !252, line: 271, baseType: !152, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !321, file: !252, line: 275, baseType: !345, size: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !252, line: 275, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !321, file: !252, line: 278, baseType: !154, size: 8, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !321, file: !252, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !321, file: !252, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !321, file: !252, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !321, file: !252, line: 298, baseType: !154, size: 8, offset: 784)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !321, file: !252, line: 302, baseType: !353, size: 512, offset: 832)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !354)
!354 = !{!355, !357, !358, !359, !360, !361, !362, !364, !370, !374}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !6, line: 526, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !6, line: 529, baseType: !150, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !353, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !353, file: !6, line: 534, baseType: !154, size: 8, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !353, file: !6, line: 537, baseType: !154, size: 8, offset: 168)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !353, file: !6, line: 541, baseType: !150, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !353, file: !6, line: 545, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !353, file: !6, line: 551, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!150, !299, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !353)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !353, file: !6, line: 555, baseType: !371, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !372, line: 47, baseType: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !158, line: 148, baseType: !162)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !353, file: !6, line: 556, baseType: !375, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !372, line: 59, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !158, line: 145, baseType: !162)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !321, file: !252, line: 306, baseType: !378, size: 192, offset: 1344)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !252, line: 47, size: 192, elements: !379)
!379 = !{!380, !389, !390}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !378, file: !252, line: 49, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !252, line: 45, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!154, !385, !152, !160, !387}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !386, line: 29, baseType: !149)
!386 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !252, line: 43, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !378, file: !252, line: 50, baseType: !385, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !378, file: !252, line: 51, baseType: !313, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !316, file: !252, line: 328, baseType: !319, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !316, file: !252, line: 331, baseType: !393, size: 160, offset: 128)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !252, line: 177, size: 160, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !393, file: !252, line: 180, baseType: !154, size: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !393, file: !252, line: 185, baseType: !154, size: 8, offset: 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !393, file: !252, line: 188, baseType: !154, size: 8, offset: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !393, file: !252, line: 191, baseType: !154, size: 8, offset: 24)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !393, file: !252, line: 194, baseType: !154, size: 8, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !393, file: !252, line: 198, baseType: !154, size: 8, offset: 40)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !393, file: !252, line: 201, baseType: !154, size: 8, offset: 48)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !393, file: !252, line: 204, baseType: !154, size: 8, offset: 56)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !393, file: !252, line: 207, baseType: !154, size: 8, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !393, file: !252, line: 210, baseType: !154, size: 8, offset: 72)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !393, file: !252, line: 214, baseType: !154, size: 8, offset: 80)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !393, file: !252, line: 217, baseType: !7, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !393, file: !252, line: 220, baseType: !154, size: 8, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !393, file: !252, line: 223, baseType: !154, size: 8, offset: 136)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !316, file: !252, line: 334, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !200, line: 74, size: 448, elements: !412)
!412 = !{!413, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !411, file: !200, line: 75, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !200, line: 61, size: 192, elements: !416)
!416 = !{!417, !418, !420, !421, !422, !423, !424}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !415, file: !200, line: 62, baseType: !299, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !415, file: !200, line: 63, baseType: !419, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !200, line: 39, baseType: !7)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !415, file: !200, line: 64, baseType: !199, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !415, file: !200, line: 65, baseType: !313, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !415, file: !200, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !415, file: !200, line: 68, baseType: !154, size: 8, offset: 168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !415, file: !200, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !411, file: !200, line: 76, baseType: !7, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !411, file: !200, line: 77, baseType: !7, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !411, file: !200, line: 79, baseType: !7, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !411, file: !200, line: 84, baseType: !313, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !411, file: !200, line: 87, baseType: !7, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !411, file: !200, line: 90, baseType: !154, size: 8, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !411, file: !200, line: 93, baseType: !199, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !411, file: !200, line: 96, baseType: !199, size: 32, offset: 288)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !411, file: !200, line: 100, baseType: !7, size: 32, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !411, file: !200, line: 104, baseType: !435, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !200, line: 47, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!149, !149, !160}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !316, file: !252, line: 337, baseType: !199, size: 32, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !316, file: !252, line: 340, baseType: !278, size: 64, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !316, file: !252, line: 341, baseType: !278, size: 64, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !316, file: !252, line: 342, baseType: !278, size: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !316, file: !252, line: 345, baseType: !253, size: 448, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !316, file: !252, line: 346, baseType: !445, size: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !316, file: !252, line: 349, baseType: !447, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !252, line: 40, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !316, file: !252, line: 352, baseType: !195, size: 192, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !316, file: !252, line: 356, baseType: !199, size: 32, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !316, file: !252, line: 360, baseType: !154, size: 8, offset: 1440)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !316, file: !252, line: 363, baseType: !356, size: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !316, file: !252, line: 364, baseType: !356, size: 64, offset: 1536)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !316, file: !252, line: 365, baseType: !353, size: 512, offset: 1600)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !316, file: !252, line: 368, baseType: !341, size: 64, offset: 2112)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !316, file: !252, line: 370, baseType: !341, size: 64, offset: 2176)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !316, file: !252, line: 373, baseType: !459, size: 64, offset: 2240)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !252, line: 373, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !316, file: !252, line: 374, baseType: !459, size: 64, offset: 2304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !316, file: !252, line: 375, baseType: !463, size: 64, offset: 2368)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !252, line: 375, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !316, file: !252, line: 378, baseType: !459, size: 64, offset: 2432)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !316, file: !252, line: 379, baseType: !467, size: 704, offset: 2496)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !468, line: 164, size: 704, elements: !469)
!468 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!469 = !{!470, !471, !481, !482, !483, !484, !485, !486, !490, !494, !495, !496, !497}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !467, file: !468, line: 166, baseType: !159, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !467, file: !468, line: 167, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !468, line: 157, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !473, file: !468, line: 159, baseType: !150, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !468, line: 160, baseType: !472, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !473, file: !468, line: 161, baseType: !478, size: 32, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 4)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !467, file: !468, line: 168, baseType: !150, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !467, file: !468, line: 169, baseType: !150, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !467, file: !468, line: 170, baseType: !150, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !467, file: !468, line: 171, baseType: !159, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !467, file: !468, line: 172, baseType: !313, size: 32, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !467, file: !468, line: 176, baseType: !487, size: 64, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!472, !149, !159}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !467, file: !468, line: 177, baseType: !491, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !149, !472}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !467, file: !468, line: 178, baseType: !149, size: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !467, file: !468, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !467, file: !468, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !467, file: !468, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !316, file: !252, line: 383, baseType: !154, size: 8, offset: 3200)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !316, file: !252, line: 387, baseType: !154, size: 8, offset: 3208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !316, file: !252, line: 390, baseType: !501, size: 64, offset: 3264)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !316, file: !252, line: 391, baseType: !501, size: 64, offset: 3328)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !316, file: !252, line: 392, baseType: !154, size: 8, offset: 3392)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !316, file: !252, line: 395, baseType: !194, size: 64, offset: 3456)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !316, file: !252, line: 396, baseType: !507, size: 256, offset: 3520)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !252, line: 128, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !252, line: 129, size: 256, elements: !509)
!509 = !{!510, !512, !513, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !252, line: 131, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !252, line: 131, baseType: !511, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !252, line: 132, baseType: !194, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !508, file: !252, line: 132, baseType: !194, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !316, file: !252, line: 396, baseType: !511, size: 64, offset: 3776)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !316, file: !252, line: 397, baseType: !7, size: 32, offset: 3840)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !316, file: !252, line: 400, baseType: !7, size: 32, offset: 3872)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !316, file: !252, line: 403, baseType: !245, size: 64, offset: 3904)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !316, file: !252, line: 404, baseType: !7, size: 32, offset: 3968)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !316, file: !252, line: 408, baseType: !378, size: 192, offset: 4032)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !316, file: !252, line: 412, baseType: !378, size: 192, offset: 4224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !316, file: !252, line: 416, baseType: !378, size: 192, offset: 4416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !316, file: !252, line: 420, baseType: !378, size: 192, offset: 4608)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !316, file: !252, line: 424, baseType: !378, size: 192, offset: 4800)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !316, file: !252, line: 427, baseType: !152, size: 64, offset: 4992)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !316, file: !252, line: 428, baseType: !152, size: 64, offset: 5056)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !316, file: !252, line: 431, baseType: !195, size: 192, offset: 5120)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !316, file: !252, line: 432, baseType: !195, size: 192, offset: 5312)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !316, file: !252, line: 435, baseType: !530, size: 64, offset: 5504)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !316, file: !252, line: 439, baseType: !467, size: 704, offset: 5568)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !316, file: !252, line: 443, baseType: !467, size: 704, offset: 6272)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !316, file: !252, line: 447, baseType: !535, size: 64, offset: 6976)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !252, line: 447, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !316, file: !252, line: 450, baseType: !538, size: 1088, offset: 7040)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !539)
!539 = !{!540, !544, !550, !554, !558, !562, !563, !570, !574, !578, !582, !588, !592, !609, !610, !611, !615}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !538, file: !6, line: 475, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !314, !267, !313}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !538, file: !6, line: 481, baseType: !545, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !314, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !538, file: !6, line: 483, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !314, !299}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !538, file: !6, line: 484, baseType: !555, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !314, !7, !152, !299, !313, !270}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !538, file: !6, line: 486, baseType: !559, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !314, !7, !164}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !538, file: !6, line: 487, baseType: !559, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !538, file: !6, line: 488, baseType: !564, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !314, !7, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !213)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !538, file: !6, line: 489, baseType: !571, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !314, !7}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !538, file: !6, line: 490, baseType: !575, size: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!313, !314, !299, !313}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !538, file: !6, line: 491, baseType: !579, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !314, !299, !313, !299}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !538, file: !6, line: 492, baseType: !583, size: 64, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!299, !314, !299, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !538, file: !6, line: 496, baseType: !589, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!164, !314, !267}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !538, file: !6, line: 500, baseType: !593, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!154, !314, !313, !199, !7, !299, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !598, line: 52, baseType: !599)
!598 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !600, line: 32, baseType: !601)
!600 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 192, elements: !241)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !603, file: !3, baseType: !7, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !603, file: !3, baseType: !7, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !603, file: !3, baseType: !149, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !603, file: !3, baseType: !149, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !538, file: !6, line: 506, baseType: !559, size: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !538, file: !6, line: 507, baseType: !559, size: 64, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !538, file: !6, line: 510, baseType: !612, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !314}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !538, file: !6, line: 513, baseType: !616, size: 64, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !314, !199, !164}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !316, file: !252, line: 453, baseType: !620, size: 64, offset: 8128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !170, line: 46, size: 1152, elements: !622)
!622 = !{!623, !624, !628, !634, !638, !639, !640, !642, !643, !644}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !621, file: !170, line: 49, baseType: !467, size: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !621, file: !170, line: 51, baseType: !625, size: 64, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !170, line: 41, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !621, file: !170, line: 53, baseType: !629, size: 64, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!626, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !170, line: 40, baseType: !621)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !621, file: !170, line: 56, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!149, !160}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !621, file: !170, line: 58, baseType: !7, size: 32, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !621, file: !170, line: 59, baseType: !7, size: 32, offset: 928)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !621, file: !170, line: 62, baseType: !641, size: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !621, file: !170, line: 65, baseType: !7, size: 32, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !621, file: !170, line: 66, baseType: !7, size: 32, offset: 1056)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !621, file: !170, line: 69, baseType: !154, size: 8, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !316, file: !252, line: 456, baseType: !646, size: 64, offset: 8192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !252, line: 42, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !316, file: !252, line: 456, baseType: !646, size: 64, offset: 8256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !316, file: !252, line: 459, baseType: !650, size: 1024, offset: 8320)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !650, file: !6, line: 282, baseType: !7, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !650, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !650, file: !6, line: 288, baseType: !154, size: 8, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !650, file: !6, line: 291, baseType: !154, size: 8, offset: 72)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !650, file: !6, line: 296, baseType: !154, size: 8, offset: 80)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !650, file: !6, line: 299, baseType: !154, size: 8, offset: 88)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !650, file: !6, line: 303, baseType: !154, size: 8, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !650, file: !6, line: 306, baseType: !154, size: 8, offset: 104)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !650, file: !6, line: 309, baseType: !154, size: 8, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !650, file: !6, line: 312, baseType: !154, size: 8, offset: 120)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !650, file: !6, line: 315, baseType: !154, size: 8, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !650, file: !6, line: 318, baseType: !154, size: 8, offset: 136)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !650, file: !6, line: 321, baseType: !154, size: 8, offset: 144)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !650, file: !6, line: 324, baseType: !154, size: 8, offset: 152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !650, file: !6, line: 328, baseType: !154, size: 8, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !650, file: !6, line: 331, baseType: !154, size: 8, offset: 168)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !650, file: !6, line: 334, baseType: !154, size: 8, offset: 176)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !650, file: !6, line: 338, baseType: !154, size: 8, offset: 184)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !650, file: !6, line: 341, baseType: !154, size: 8, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !650, file: !6, line: 344, baseType: !154, size: 8, offset: 200)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !650, file: !6, line: 348, baseType: !154, size: 8, offset: 208)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !650, file: !6, line: 352, baseType: !154, size: 8, offset: 216)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !650, file: !6, line: 356, baseType: !154, size: 8, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !650, file: !6, line: 360, baseType: !154, size: 8, offset: 232)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !650, file: !6, line: 363, baseType: !154, size: 8, offset: 240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !650, file: !6, line: 366, baseType: !154, size: 8, offset: 248)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !650, file: !6, line: 370, baseType: !154, size: 8, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !650, file: !6, line: 373, baseType: !154, size: 8, offset: 264)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !650, file: !6, line: 376, baseType: !154, size: 8, offset: 272)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !650, file: !6, line: 379, baseType: !154, size: 8, offset: 280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !650, file: !6, line: 382, baseType: !154, size: 8, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !650, file: !6, line: 385, baseType: !154, size: 8, offset: 296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !650, file: !6, line: 389, baseType: !154, size: 8, offset: 304)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !650, file: !6, line: 392, baseType: !154, size: 8, offset: 312)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !650, file: !6, line: 395, baseType: !154, size: 8, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !650, file: !6, line: 398, baseType: !154, size: 8, offset: 328)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !650, file: !6, line: 401, baseType: !154, size: 8, offset: 336)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !650, file: !6, line: 404, baseType: !299, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !650, file: !6, line: 407, baseType: !299, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !650, file: !6, line: 410, baseType: !299, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !650, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !650, file: !6, line: 417, baseType: !154, size: 8, offset: 608)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !650, file: !6, line: 420, baseType: !154, size: 8, offset: 616)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !650, file: !6, line: 441, baseType: !696, size: 64, offset: 640)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !650, file: !6, line: 423, size: 64, elements: !697)
!697 = !{!698, !699, !700, !701, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !696, file: !6, line: 426, baseType: !37, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !696, file: !6, line: 429, baseType: !154, size: 8, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !696, file: !6, line: 433, baseType: !154, size: 8, offset: 40)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !696, file: !6, line: 436, baseType: !154, size: 8, offset: 48)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !696, file: !6, line: 440, baseType: !154, size: 8, offset: 56)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !650, file: !6, line: 447, baseType: !160, size: 64, offset: 704)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !650, file: !6, line: 447, baseType: !160, size: 64, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !650, file: !6, line: 447, baseType: !160, size: 64, offset: 832)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !650, file: !6, line: 447, baseType: !160, size: 64, offset: 896)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !650, file: !6, line: 450, baseType: !154, size: 8, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !650, file: !6, line: 450, baseType: !154, size: 8, offset: 968)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !650, file: !6, line: 454, baseType: !154, size: 8, offset: 976)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !650, file: !6, line: 457, baseType: !154, size: 8, offset: 984)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !650, file: !6, line: 460, baseType: !154, size: 8, offset: 992)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !316, file: !252, line: 463, baseType: !713, size: 256, offset: 9344)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !252, line: 227, size: 256, elements: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !713, file: !252, line: 229, baseType: !164, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !713, file: !252, line: 230, baseType: !164, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !713, file: !252, line: 231, baseType: !164, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !713, file: !252, line: 232, baseType: !164, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !316, file: !252, line: 466, baseType: !154, size: 8, offset: 9600)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !316, file: !252, line: 475, baseType: !721, size: 256, offset: 9664)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !316, file: !252, line: 469, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !721, file: !252, line: 471, baseType: !245, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !721, file: !252, line: 472, baseType: !245, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !721, file: !252, line: 473, baseType: !245, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !721, file: !252, line: 474, baseType: !199, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !316, file: !252, line: 478, baseType: !152, size: 64, offset: 9920)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !316, file: !252, line: 478, baseType: !152, size: 64, offset: 9984)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !316, file: !252, line: 478, baseType: !152, size: 64, offset: 10048)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !316, file: !252, line: 482, baseType: !731, size: 64, offset: 10112)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !252, line: 482, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !316, file: !252, line: 485, baseType: !7, size: 32, offset: 10176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !316, file: !252, line: 488, baseType: !735, size: 128, offset: 10240)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !737)
!737 = !{!738, !745, !746}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !736, file: !6, line: 894, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !741, file: !6, line: 883, baseType: !150, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !741, file: !6, line: 886, baseType: !199, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !736, file: !6, line: 897, baseType: !313, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !736, file: !6, line: 900, baseType: !313, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !316, file: !252, line: 491, baseType: !748, size: 64, offset: 10368)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !252, line: 310, size: 192, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !749, file: !252, line: 312, baseType: !748, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !252, line: 314, baseType: !150, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !749, file: !252, line: 316, baseType: !184, size: 64, offset: 128)
!754 = !{}
!755 = !DILocalVariable(name: "pfile", arg: 1, scope: !310, file: !3, line: 78, type: !314)
!756 = !DILocation(line: 78, column: 40, scope: !310)
!757 = !DILocalVariable(name: "node", arg: 2, scope: !310, file: !3, line: 78, type: !164)
!758 = !DILocation(line: 78, column: 61, scope: !310)
!759 = !DILocalVariable(name: "v", arg: 3, scope: !310, file: !3, line: 79, type: !149)
!760 = !DILocation(line: 79, column: 13, scope: !310)
!761 = !DILocation(line: 81, column: 7, scope: !762)
!762 = distinct !DILexicalBlock(scope: !310, file: !3, line: 81, column: 7)
!763 = !DILocation(line: 81, column: 13, scope: !762)
!764 = !DILocation(line: 81, column: 18, scope: !762)
!765 = !DILocation(line: 81, column: 30, scope: !762)
!766 = !DILocation(line: 81, column: 35, scope: !762)
!767 = !DILocation(line: 81, column: 41, scope: !762)
!768 = !DILocation(line: 81, column: 47, scope: !762)
!769 = !DILocation(line: 81, column: 7, scope: !310)
!770 = !DILocalVariable(name: "macro", scope: !771, file: !3, line: 83, type: !184)
!771 = distinct !DILexicalBlock(scope: !762, file: !3, line: 82, column: 5)
!772 = !DILocation(line: 83, column: 18, scope: !771)
!773 = !DILocation(line: 83, column: 26, scope: !771)
!774 = !DILocation(line: 83, column: 32, scope: !771)
!775 = !DILocation(line: 83, column: 38, scope: !771)
!776 = !DILocation(line: 85, column: 12, scope: !777)
!777 = distinct !DILexicalBlock(scope: !771, file: !3, line: 85, column: 11)
!778 = !DILocation(line: 85, column: 19, scope: !777)
!779 = !DILocation(line: 86, column: 4, scope: !777)
!780 = !DILocation(line: 86, column: 7, scope: !777)
!781 = !DILocation(line: 85, column: 11, scope: !771)
!782 = !DILocation(line: 87, column: 23, scope: !777)
!783 = !DILocation(line: 87, column: 46, scope: !777)
!784 = !DILocation(line: 87, column: 53, scope: !777)
!785 = !DILocation(line: 88, column: 37, scope: !777)
!786 = !DILocation(line: 87, column: 2, scope: !777)
!787 = !DILocation(line: 89, column: 5, scope: !771)
!788 = !DILocation(line: 91, column: 3, scope: !310)
!789 = distinct !DISubprogram(name: "_cpp_builtin_macro_text", scope: !3, file: !3, line: 118, type: !790, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !754)
!790 = !DISubroutineType(types: !791)
!791 = !{!152, !314, !164}
!792 = !DILocalVariable(name: "pfile", arg: 1, scope: !789, file: !3, line: 118, type: !314)
!793 = !DILocation(line: 118, column: 38, scope: !789)
!794 = !DILocalVariable(name: "node", arg: 2, scope: !789, file: !3, line: 118, type: !164)
!795 = !DILocation(line: 118, column: 59, scope: !789)
!796 = !DILocalVariable(name: "map", scope: !789, file: !3, line: 120, type: !548)
!797 = !DILocation(line: 120, column: 26, scope: !789)
!798 = !DILocalVariable(name: "result", scope: !789, file: !3, line: 121, type: !247)
!799 = !DILocation(line: 121, column: 16, scope: !789)
!800 = !DILocalVariable(name: "number", scope: !789, file: !3, line: 122, type: !419)
!801 = !DILocation(line: 122, column: 16, scope: !789)
!802 = !DILocation(line: 124, column: 11, scope: !789)
!803 = !DILocation(line: 124, column: 17, scope: !789)
!804 = !DILocation(line: 124, column: 23, scope: !789)
!805 = !DILocation(line: 124, column: 3, scope: !789)
!806 = !DILocation(line: 127, column: 18, scope: !807)
!807 = distinct !DILexicalBlock(scope: !789, file: !3, line: 125, column: 5)
!808 = !DILocation(line: 128, column: 4, scope: !807)
!809 = !DILocation(line: 127, column: 7, scope: !807)
!810 = !DILocation(line: 129, column: 7, scope: !807)
!811 = !DILocalVariable(name: "pbuffer", scope: !812, file: !3, line: 133, type: !319)
!812 = distinct !DILexicalBlock(scope: !807, file: !3, line: 132, column: 7)
!813 = !DILocation(line: 133, column: 14, scope: !812)
!814 = !DILocation(line: 133, column: 40, scope: !812)
!815 = !DILocation(line: 133, column: 24, scope: !812)
!816 = !DILocation(line: 134, column: 6, scope: !817)
!817 = distinct !DILexicalBlock(scope: !812, file: !3, line: 134, column: 6)
!818 = !DILocation(line: 134, column: 15, scope: !817)
!819 = !DILocation(line: 134, column: 25, scope: !817)
!820 = !DILocation(line: 134, column: 6, scope: !812)
!821 = !DILocalVariable(name: "file", scope: !822, file: !3, line: 137, type: !341)
!822 = distinct !DILexicalBlock(scope: !817, file: !3, line: 135, column: 4)
!823 = !DILocation(line: 137, column: 31, scope: !822)
!824 = !DILocation(line: 137, column: 52, scope: !822)
!825 = !DILocation(line: 137, column: 38, scope: !822)
!826 = !DILocation(line: 138, column: 10, scope: !827)
!827 = distinct !DILexicalBlock(scope: !822, file: !3, line: 138, column: 10)
!828 = !DILocation(line: 138, column: 10, scope: !822)
!829 = !DILocalVariable(name: "tb", scope: !830, file: !3, line: 144, type: !831)
!830 = distinct !DILexicalBlock(scope: !827, file: !3, line: 139, column: 8)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !833, line: 7, size: 448, elements: !834)
!833 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !832, file: !833, line: 9, baseType: !313, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !832, file: !833, line: 10, baseType: !313, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !832, file: !833, line: 11, baseType: !313, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !832, file: !833, line: 12, baseType: !313, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !832, file: !833, line: 13, baseType: !313, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !832, file: !833, line: 14, baseType: !313, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !832, file: !833, line: 15, baseType: !313, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !832, file: !833, line: 16, baseType: !313, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !832, file: !833, line: 17, baseType: !313, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !832, file: !833, line: 20, baseType: !159, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !832, file: !833, line: 21, baseType: !299, size: 64, offset: 384)
!846 = !DILocation(line: 144, column: 14, scope: !830)
!847 = !DILocalVariable(name: "st", scope: !830, file: !3, line: 145, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !850, line: 46, size: 1152, elements: !851)
!850 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!851 = !{!852, !853, !854, !856, !858, !860, !862, !863, !864, !866, !868, !870, !877, !878, !879}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !849, file: !850, line: 48, baseType: !376, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !849, file: !850, line: 53, baseType: !373, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !849, file: !850, line: 61, baseType: !855, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !158, line: 151, baseType: !162)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !849, file: !850, line: 62, baseType: !857, size: 32, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !158, line: 150, baseType: !7)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !849, file: !850, line: 64, baseType: !859, size: 32, offset: 224)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !158, line: 146, baseType: !7)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !849, file: !850, line: 65, baseType: !861, size: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !158, line: 147, baseType: !7)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !849, file: !850, line: 67, baseType: !313, size: 32, offset: 288)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !849, file: !850, line: 69, baseType: !376, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !849, file: !850, line: 74, baseType: !865, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !158, line: 152, baseType: !159)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !849, file: !850, line: 78, baseType: !867, size: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !158, line: 174, baseType: !159)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !849, file: !850, line: 80, baseType: !869, size: 64, offset: 512)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !158, line: 179, baseType: !159)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !849, file: !850, line: 91, baseType: !871, size: 128, offset: 576)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !872, line: 10, size: 128, elements: !873)
!872 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !871, file: !872, line: 12, baseType: !157, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !871, file: !872, line: 16, baseType: !876, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !158, line: 196, baseType: !159)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !849, file: !850, line: 92, baseType: !871, size: 128, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !849, file: !850, line: 93, baseType: !871, size: 128, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !849, file: !850, line: 106, baseType: !880, size: 192, offset: 960)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 192, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 3)
!883 = !DILocation(line: 145, column: 16, scope: !830)
!884 = !DILocation(line: 145, column: 41, scope: !830)
!885 = !DILocation(line: 145, column: 21, scope: !830)
!886 = !DILocation(line: 146, column: 7, scope: !887)
!887 = distinct !DILexicalBlock(scope: !830, file: !3, line: 146, column: 7)
!888 = !DILocation(line: 146, column: 7, scope: !830)
!889 = !DILocation(line: 147, column: 22, scope: !887)
!890 = !DILocation(line: 147, column: 26, scope: !887)
!891 = !DILocation(line: 147, column: 10, scope: !887)
!892 = !DILocation(line: 147, column: 8, scope: !887)
!893 = !DILocation(line: 147, column: 5, scope: !887)
!894 = !DILocation(line: 148, column: 7, scope: !895)
!895 = distinct !DILexicalBlock(scope: !830, file: !3, line: 148, column: 7)
!896 = !DILocation(line: 148, column: 7, scope: !830)
!897 = !DILocalVariable(name: "str", scope: !898, file: !3, line: 150, type: !150)
!898 = distinct !DILexicalBlock(scope: !895, file: !3, line: 149, column: 5)
!899 = !DILocation(line: 150, column: 13, scope: !898)
!900 = !DILocation(line: 150, column: 28, scope: !898)
!901 = !DILocation(line: 150, column: 19, scope: !898)
!902 = !DILocalVariable(name: "len", scope: !898, file: !3, line: 151, type: !160)
!903 = !DILocation(line: 151, column: 14, scope: !898)
!904 = !DILocation(line: 151, column: 28, scope: !898)
!905 = !DILocation(line: 151, column: 20, scope: !898)
!906 = !DILocalVariable(name: "buf", scope: !898, file: !3, line: 152, type: !245)
!907 = !DILocation(line: 152, column: 22, scope: !898)
!908 = !DILocation(line: 152, column: 50, scope: !898)
!909 = !DILocation(line: 152, column: 57, scope: !898)
!910 = !DILocation(line: 152, column: 61, scope: !898)
!911 = !DILocation(line: 152, column: 28, scope: !898)
!912 = !DILocation(line: 153, column: 7, scope: !898)
!913 = !DILocation(line: 153, column: 14, scope: !898)
!914 = !DILocation(line: 154, column: 24, scope: !898)
!915 = !DILocation(line: 154, column: 28, scope: !898)
!916 = !DILocation(line: 154, column: 33, scope: !898)
!917 = !DILocation(line: 154, column: 7, scope: !898)
!918 = !DILocation(line: 155, column: 7, scope: !898)
!919 = !DILocation(line: 155, column: 11, scope: !898)
!920 = !DILocation(line: 155, column: 16, scope: !898)
!921 = !DILocation(line: 156, column: 28, scope: !898)
!922 = !DILocation(line: 156, column: 7, scope: !898)
!923 = !DILocation(line: 156, column: 16, scope: !898)
!924 = !DILocation(line: 156, column: 26, scope: !898)
!925 = !DILocation(line: 157, column: 5, scope: !898)
!926 = !DILocation(line: 160, column: 18, scope: !927)
!927 = distinct !DILexicalBlock(scope: !895, file: !3, line: 159, column: 5)
!928 = !DILocation(line: 160, column: 7, scope: !927)
!929 = !DILocation(line: 162, column: 7, scope: !927)
!930 = !DILocation(line: 162, column: 16, scope: !927)
!931 = !DILocation(line: 162, column: 26, scope: !927)
!932 = !DILocation(line: 164, column: 8, scope: !830)
!933 = !DILocation(line: 165, column: 4, scope: !822)
!934 = !DILocation(line: 166, column: 11, scope: !812)
!935 = !DILocation(line: 166, column: 20, scope: !812)
!936 = !DILocation(line: 166, column: 9, scope: !812)
!937 = !DILocation(line: 168, column: 7, scope: !807)
!938 = !DILocalVariable(name: "len", scope: !939, file: !3, line: 172, type: !7)
!939 = distinct !DILexicalBlock(scope: !807, file: !3, line: 171, column: 7)
!940 = !DILocation(line: 172, column: 15, scope: !939)
!941 = !DILocalVariable(name: "name", scope: !939, file: !3, line: 173, type: !299)
!942 = !DILocation(line: 173, column: 14, scope: !939)
!943 = !DILocalVariable(name: "buf", scope: !939, file: !3, line: 174, type: !298)
!944 = !DILocation(line: 174, column: 9, scope: !939)
!945 = !DILocation(line: 175, column: 24, scope: !939)
