; ModuleID = 'hooks.c'
source_filename = "hooks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtx_def = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type opaque

; Function Attrs: noinline nounwind uwtable
define dso_local void @hook_void_void() #0 !dbg !136 {
entry:
  ret void, !dbg !140
}

; Function Attrs: noinline nounwind uwtable
define dso_local zeroext i8 @hook_bool_void_false() #0 !dbg !141 {
entry:
  ret i8 0, !dbg !145
}

; Function Attrs: noinline nounwind uwtable
define dso_local zeroext i8 @hook_bool_void_true() #0 !dbg !146 {
entry:
  ret i8 1, !dbg !147
}

; Function Attrs: noinline nounwind uwtable
define dso_local zeroext i8 @hook_bool_bool_false(i8 zeroext %a) #0 !dbg !148 {
entry:
  %a.addr = alloca i8, align 1
  store i8 %a, i8* %a.addr, align 1
  call void @llvm.dbg.declare(metadata i8* %a.addr, metadata !151, metadata !DIExpression()), !dbg !152
  ret i8 0, !dbg !153
}

; Function Attrs: nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!127 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!130 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!131 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!132 = !{i32 7, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{i32 1, !"wchar_size", i32 4}
!135 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!136 = distinct !DISubprogram(name: "hook_void_void", scope: !1, file: !1, line: 34, type: !137, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{null}
!139 = !{}
!140 = !DILocation(line: 36, column: 1, scope: !136)
!141 = distinct !DISubprogram(name: "hook_bool_void_false", scope: !1, file: !1, line: 40, type: !142, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!142 = !DISubroutineType(types: !143)
!143 = !{!144}
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DILocation(line: 42, column: 3, scope: !141)
!146 = distinct !DISubprogram(name: "hook_bool_void_true", scope: !1, file: !1, line: 47, type: !142, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!147 = !DILocation(line: 49, column: 3, scope: !146)
!148 = distinct !DISubprogram(name: "hook_bool_bool_false", scope: !1, file: !1, line: 54, type: !149, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!149 = !DISubroutineType(types: !150)
!150 = !{!144, !144}
!151 = !DILocalVariable(name: "a", arg: 1, scope: !148, file: !1, line: 54, type: !144)
!152 = !DILocation(line: 54, column: 28, scope: !148)
!153 = !DILocation(line: 56, column: 3, scope: !148)
!154 = distinct !DISubprogram(name: "hook_bool_const_int_const_int_true", scope: !1, file: !1, line: 60, type: !155, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!155 = !DISubroutineType(types: !156)
!156 = !{!144, !157, !157}
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!159 = !DILocalVariable(name: "a", arg: 1, scope: !154, file: !1, line: 60, type: !157)
!160 = !DILocation(line: 60, column: 52, scope: !154)
!161 = !DILocalVariable(name: "b", arg: 2, scope: !154, file: !1, line: 61, type: !157)
!162 = !DILocation(line: 61, column: 52, scope: !154)
!163 = !DILocation(line: 63, column: 3, scope: !154)
!164 = distinct !DISubprogram(name: "hook_bool_mode_false", scope: !1, file: !1, line: 68, type: !165, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!165 = !DISubroutineType(types: !166)
!166 = !{!144, !3}
!167 = !DILocalVariable(name: "mode", arg: 1, scope: !164, file: !1, line: 68, type: !3)
!168 = !DILocation(line: 68, column: 41, scope: !164)
!169 = !DILocation(line: 70, column: 3, scope: !164)
!170 = distinct !DISubprogram(name: "hook_bool_mode_const_rtx_false", scope: !1, file: !1, line: 75, type: !171, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!171 = !DISubroutineType(types: !172)
!172 = !{!144, !3, !173}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_rtx", file: !174, line: 51, baseType: !175)
!174 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !174, line: 49, flags: DIFlagFwdDecl)
!178 = !DILocalVariable(name: "mode", arg: 1, scope: !170, file: !1, line: 75, type: !3)
!179 = !DILocation(line: 75, column: 51, scope: !170)
!180 = !DILocalVariable(name: "value", arg: 2, scope: !170, file: !1, line: 76, type: !173)
!181 = !DILocation(line: 76, column: 15, scope: !170)
!182 = !DILocation(line: 78, column: 3, scope: !170)
!183 = distinct !DISubprogram(name: "hook_bool_mode_const_rtx_true", scope: !1, file: !1, line: 83, type: !171, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!184 = !DILocalVariable(name: "mode", arg: 1, scope: !183, file: !1, line: 83, type: !3)
!185 = !DILocation(line: 83, column: 50, scope: !183)
!186 = !DILocalVariable(name: "value", arg: 2, scope: !183, file: !1, line: 84, type: !173)
!187 = !DILocation(line: 84, column: 21, scope: !183)
!188 = !DILocation(line: 86, column: 3, scope: !183)
!189 = distinct !DISubprogram(name: "hook_void_FILEptr_constcharptr", scope: !1, file: !1, line: 91, type: !190, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !192, !254}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !194, line: 7, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !196, line: 49, size: 1728, elements: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!197 = !{!198, !199, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !215, !217, !218, !219, !223, !225, !227, !231, !234, !236, !239, !242, !243, !245, !249, !250}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !195, file: !196, line: 51, baseType: !158, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !195, file: !196, line: 54, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !195, file: !196, line: 55, baseType: !200, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !195, file: !196, line: 56, baseType: !200, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !195, file: !196, line: 57, baseType: !200, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !195, file: !196, line: 58, baseType: !200, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !195, file: !196, line: 59, baseType: !200, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !195, file: !196, line: 60, baseType: !200, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !195, file: !196, line: 61, baseType: !200, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !195, file: !196, line: 64, baseType: !200, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !195, file: !196, line: 65, baseType: !200, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !195, file: !196, line: 66, baseType: !200, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !195, file: !196, line: 68, baseType: !213, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !196, line: 36, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !195, file: !196, line: 70, baseType: !216, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !195, file: !196, line: 72, baseType: !158, size: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !195, file: !196, line: 73, baseType: !158, size: 32, offset: 928)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !195, file: !196, line: 74, baseType: !220, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !221, line: 152, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !195, file: !196, line: 77, baseType: !224, size: 16, offset: 1024)
!224 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !195, file: !196, line: 78, baseType: !226, size: 8, offset: 1040)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !195, file: !196, line: 79, baseType: !228, size: 8, offset: 1048)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 1)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !195, file: !196, line: 81, baseType: !232, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !196, line: 43, baseType: null)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !195, file: !196, line: 89, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !221, line: 153, baseType: !222)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !195, file: !196, line: 91, baseType: !237, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !196, line: 37, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !195, file: !196, line: 92, baseType: !240, size: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !196, line: 38, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !195, file: !196, line: 93, baseType: !216, size: 64, offset: 1344)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !195, file: !196, line: 94, baseType: !244, size: 64, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !195, file: !196, line: 95, baseType: !246, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !195, file: !196, line: 96, baseType: !158, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !195, file: !196, line: 98, baseType: !251, size: 160, offset: 1568)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 160, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 20)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!256 = !DILocalVariable(name: "a", arg: 1, scope: !189, file: !1, line: 91, type: !192)
!257 = !DILocation(line: 91, column: 39, scope: !189)
!258 = !DILocalVariable(name: "b", arg: 2, scope: !189, file: !1, line: 91, type: !254)
!259 = !DILocation(line: 91, column: 71, scope: !189)
!260 = !DILocation(line: 93, column: 1, scope: !189)
!261 = distinct !DISubprogram(name: "hook_bool_const_tree_hwi_hwi_const_tree_false", scope: !1, file: !1, line: 97, type: !262, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!262 = !DISubroutineType(types: !263)
!263 = !{!144, !264, !222, !222, !264}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_tree", file: !174, line: 59, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !174, line: 55, flags: DIFlagFwdDecl)
!268 = !DILocalVariable(name: "a", arg: 1, scope: !261, file: !1, line: 97, type: !264)
!269 = !DILocation(line: 97, column: 59, scope: !261)
!270 = !DILocalVariable(name: "b", arg: 2, scope: !261, file: !1, line: 98, type: !222)
!271 = !DILocation(line: 98, column: 27, scope: !261)
!272 = !DILocalVariable(name: "c", arg: 3, scope: !261, file: !1, line: 99, type: !222)
!273 = !DILocation(line: 99, column: 27, scope: !261)
!274 = !DILocalVariable(name: "d", arg: 4, scope: !261, file: !1, line: 100, type: !264)
!275 = !DILocation(line: 100, column: 24, scope: !261)
!276 = !DILocation(line: 102, column: 3, scope: !261)
!277 = distinct !DISubprogram(name: "hook_bool_const_tree_hwi_hwi_const_tree_true", scope: !1, file: !1, line: 106, type: !262, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!278 = !DILocalVariable(name: "a", arg: 1, scope: !277, file: !1, line: 106, type: !264)
!279 = !DILocation(line: 106, column: 58, scope: !277)
!280 = !DILocalVariable(name: "b", arg: 2, scope: !277, file: !1, line: 107, type: !222)
!281 = !DILocation(line: 107, column: 26, scope: !277)
!282 = !DILocalVariable(name: "c", arg: 3, scope: !277, file: !1, line: 108, type: !222)
!283 = !DILocation(line: 108, column: 26, scope: !277)
!284 = !DILocalVariable(name: "d", arg: 4, scope: !277, file: !1, line: 109, type: !264)
!285 = !DILocation(line: 109, column: 23, scope: !277)
!286 = !DILocation(line: 111, column: 3, scope: !277)
!287 = distinct !DISubprogram(name: "hook_bool_constcharptr_size_t_false", scope: !1, file: !1, line: 115, type: !288, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!288 = !DISubroutineType(types: !289)
!289 = !{!144, !254, !246}
!290 = !DILocalVariable(name: "a", arg: 1, scope: !287, file: !1, line: 115, type: !254)
!291 = !DILocation(line: 115, column: 50, scope: !287)
!292 = !DILocalVariable(name: "b", arg: 2, scope: !287, file: !1, line: 116, type: !246)
!293 = !DILocation(line: 116, column: 17, scope: !287)
!294 = !DILocation(line: 118, column: 3, scope: !287)
!295 = distinct !DISubprogram(name: "hook_bool_size_t_constcharptr_int_true", scope: !1, file: !1, line: 122, type: !296, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !139)
!296 = !DISubroutineType(types: !297)
!297 = !{!144, !246, !254, !158}
!298 = !DILocalVariable(name: "a", arg: 1, scope: !295, file: !1, line: 122, type: !246)
!299 = !DILocation(line: 122, column: 48, scope: !295)
