; ModuleID = 'tree-profile.c'
source_filename = "tree-profile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.profile_hooks = type { void ()*, void (i32, %struct.edge_def*)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)* }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }
%struct.gimple_bb_info = type { %struct.gimple_seq_d*, %struct.gimple_seq_d* }

!719 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!720 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!721 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!722 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!723 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!724 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!725 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!726 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!727 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!728 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!729 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!730 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!731 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!732 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!733 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!734 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!735 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!736 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!737 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!738 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!739 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!740 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!741 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!742 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!743 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !318, line: 295, baseType: !7, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!746 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!747 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!748 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!749 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!750 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!751 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!752 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!753 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!754 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!755 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!756 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!757 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "integer_type_kind", file: !334, line: 3745, baseType: !7, size: 32, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!760 = !DIEnumerator(name: "itk_char", value: 0, isUnsigned: true)
!761 = !DIEnumerator(name: "itk_signed_char", value: 1, isUnsigned: true)
!762 = !DIEnumerator(name: "itk_unsigned_char", value: 2, isUnsigned: true)
!763 = !DIEnumerator(name: "itk_short", value: 3, isUnsigned: true)
!764 = !DIEnumerator(name: "itk_unsigned_short", value: 4, isUnsigned: true)
!765 = !DIEnumerator(name: "itk_int", value: 5, isUnsigned: true)
!766 = !DIEnumerator(name: "itk_unsigned_int", value: 6, isUnsigned: true)
!767 = !DIEnumerator(name: "itk_long", value: 7, isUnsigned: true)
!768 = !DIEnumerator(name: "itk_unsigned_long", value: 8, isUnsigned: true)
!769 = !DIEnumerator(name: "itk_long_long", value: 9, isUnsigned: true)
!770 = !DIEnumerator(name: "itk_unsigned_long_long", value: 10, isUnsigned: true)
!771 = !DIEnumerator(name: "itk_none", value: 11, isUnsigned: true)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "size_type_kind", file: !334, line: 4288, baseType: !7, size: 32, elements: !773)
!773 = !{!774, !775, !776, !777, !778}
!774 = !DIEnumerator(name: "SIZETYPE", value: 0, isUnsigned: true)
!775 = !DIEnumerator(name: "SSIZETYPE", value: 1, isUnsigned: true)
!776 = !DIEnumerator(name: "BITSIZETYPE", value: 2, isUnsigned: true)
!777 = !DIEnumerator(name: "SBITSIZETYPE", value: 3, isUnsigned: true)
!778 = !DIEnumerator(name: "TYPE_KIND_LAST", value: 4, isUnsigned: true)
!779 = !{!780, !1064, !910, !366, !877}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !781, line: 56, baseType: !782)
!781 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !784)
!784 = !{!785, !818, !824, !837, !856, !867, !872, !883, !889, !903, !915, !953, !1449, !1477, !1494, !1495, !1500, !1509, !1515, !1520, !1524, !1528, !1765, !1812, !1818, !1824, !1831, !1844, !1858, !1875, !1887, !1909, !1924, !2096}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !783, file: !334, line: 3372, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !786, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !786, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !786, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !786, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !786, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !786, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !786, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !786, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !786, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !786, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !786, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !786, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !786, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !786, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !786, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !786, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !786, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !786, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !786, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !786, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !786, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !786, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !786, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !786, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !786, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !786, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !786, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !786, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !786, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !786, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !334, line: 3373, baseType: !819, size: 192)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !819, file: !334, line: 403, baseType: !786, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !819, file: !334, line: 404, baseType: !780, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !819, file: !334, line: 405, baseType: !780, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !783, file: !334, line: 3374, baseType: !825, size: 320)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !334, line: 1385, baseType: !819, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !825, file: !334, line: 1386, baseType: !829, size: 128, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !830, line: 58, baseType: !831)
!830 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 54, size: 128, elements: !832)
!832 = !{!833, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !831, file: !830, line: 56, baseType: !834, size: 64)
!834 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !831, file: !830, line: 57, baseType: !836, size: 64, offset: 64)
!836 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !783, file: !334, line: 3375, baseType: !838, size: 256)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !334, line: 1398, baseType: !819, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !838, file: !334, line: 1399, baseType: !842, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !844, line: 52, size: 256, elements: !845)
!844 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!845 = !{!846, !847, !848, !849, !850, !851, !852}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !843, file: !844, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !843, file: !844, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !843, file: !844, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !843, file: !844, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !843, file: !844, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !843, file: !844, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !843, file: !844, line: 62, baseType: !853, size: 192, offset: 64)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 192, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 3)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !783, file: !334, line: 3376, baseType: !857, size: 256)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !334, line: 1409, baseType: !819, size: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !857, file: !334, line: 1410, baseType: !861, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !863, line: 27, size: 192, elements: !864)
!863 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !862, file: !863, line: 29, baseType: !829, size: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !862, file: !863, line: 30, baseType: !189, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !783, file: !334, line: 3377, baseType: !868, size: 256)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !868, file: !334, line: 1438, baseType: !819, size: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !868, file: !334, line: 1439, baseType: !780, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !783, file: !334, line: 3378, baseType: !873, size: 256)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !874)
!874 = !{!875, !876, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !334, line: 1419, baseType: !819, size: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !873, file: !334, line: 1420, baseType: !877, size: 32, offset: 192)
!877 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !873, file: !334, line: 1421, baseType: !879, size: 8, offset: 224)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 8, elements: !881)
!880 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!881 = !{!882}
!882 = !DISubrange(count: 1)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !783, file: !334, line: 3379, baseType: !884, size: 320)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !334, line: 1429, baseType: !819, size: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !884, file: !334, line: 1430, baseType: !780, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !884, file: !334, line: 1431, baseType: !780, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !783, file: !334, line: 3380, baseType: !890, size: 320)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !890, file: !334, line: 1461, baseType: !819, size: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !890, file: !334, line: 1462, baseType: !894, size: 128, offset: 192)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !895, line: 31, size: 128, elements: !896)
!895 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!896 = !{!897, !901, !902}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !894, file: !895, line: 32, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !894, file: !895, line: 33, baseType: !7, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !894, file: !895, line: 34, baseType: !7, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !783, file: !334, line: 3381, baseType: !904, size: 384)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !905)
!905 = !{!906, !907, !912, !913, !914}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !334, line: 2508, baseType: !819, size: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !904, file: !334, line: 2509, baseType: !908, size: 32, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !909, line: 58, baseType: !910)
!909 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !911, line: 44, baseType: !7)
!911 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !904, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !334, line: 2511, baseType: !780, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !904, file: !334, line: 2512, baseType: !780, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !783, file: !334, line: 3382, baseType: !916, size: 896)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !334, line: 2653, baseType: !904, size: 384)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !916, file: !334, line: 2654, baseType: !780, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !916, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !916, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !916, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !916, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !916, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !916, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !916, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !916, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !916, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !916, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !916, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !916, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !916, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !916, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !916, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !916, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !916, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !916, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !916, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !916, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !916, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !916, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !916, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !916, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !916, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !916, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !916, file: !334, line: 2705, baseType: !780, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !916, file: !334, line: 2706, baseType: !780, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !916, file: !334, line: 2707, baseType: !780, size: 64, offset: 704)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !916, file: !334, line: 2708, baseType: !780, size: 64, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !916, file: !334, line: 2711, baseType: !951, size: 64, offset: 832)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !783, file: !334, line: 3383, baseType: !954, size: 960)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !334, line: 2757, baseType: !916, size: 896)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !954, file: !334, line: 2758, baseType: !958, size: 64, offset: 896)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !781, line: 50, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !961, line: 240, size: 384, elements: !962)
!961 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !960, file: !961, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !960, file: !961, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !960, file: !961, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !960, file: !961, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !960, file: !961, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !960, file: !961, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !960, file: !961, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !960, file: !961, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !960, file: !961, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !960, file: !961, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !960, file: !961, line: 321, baseType: !974, size: 320, offset: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !961, line: 315, size: 320, elements: !975)
!975 = !{!976, !1382, !1384, !1447, !1448}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !974, file: !961, line: 316, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 64, elements: !881)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !961, line: 183, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !961, line: 166, size: 64, elements: !980)
!980 = !{!981, !982, !983, !986, !987, !995, !996, !1008, !1011, !1073, !1074, !1359, !1372, !1379}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !979, file: !961, line: 168, baseType: !877, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !979, file: !961, line: 169, baseType: !7, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !979, file: !961, line: 170, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !979, file: !961, line: 171, baseType: !958, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !979, file: !961, line: 172, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !781, line: 53, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !961, line: 359, size: 128, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !990, file: !961, line: 360, baseType: !877, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !990, file: !961, line: 361, baseType: !994, size: 64, offset: 64)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, elements: !881)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !979, file: !961, line: 173, baseType: !189, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !979, file: !961, line: 174, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !961, line: 133, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !961, line: 115, size: 32, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !998, file: !961, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !998, file: !961, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !998, file: !961, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !998, file: !961, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !998, file: !961, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !998, file: !961, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !998, file: !961, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !998, file: !961, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !979, file: !961, line: 175, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !961, line: 175, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !979, file: !961, line: 176, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1014, line: 75, size: 256, elements: !1015)
!1014 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1015 = !{!1016, !1030, !1031, !1032}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1013, file: !1014, line: 76, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1014, line: 68, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1014, line: 63, size: 320, elements: !1020)
!1020 = !{!1021, !1023, !1024, !1025}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !1014, line: 64, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1019, file: !1014, line: 65, baseType: !1022, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1019, file: !1014, line: 66, baseType: !7, size: 32, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1019, file: !1014, line: 67, baseType: !1026, size: 128, offset: 192)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 128, elements: !1028)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1014, line: 29, baseType: !834)
!1028 = !{!1029}
!1029 = !DISubrange(count: 2)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1013, file: !1014, line: 77, baseType: !1017, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1013, file: !1014, line: 78, baseType: !7, size: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1013, file: !1014, line: 79, baseType: !1033, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1014, line: 49, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1014, line: 45, size: 832, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1035, file: !1014, line: 46, baseType: !1022, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1035, file: !1014, line: 47, baseType: !1012, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1035, file: !1014, line: 48, baseType: !1040, size: 704, offset: 128)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1041, line: 164, size: 704, elements: !1042)
!1041 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1042 = !{!1043, !1044, !1055, !1056, !1057, !1058, !1059, !1060, !1065, !1069, !1070, !1071, !1072}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1040, file: !1041, line: 166, baseType: !836, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1040, file: !1041, line: 167, baseType: !1045, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1041, line: 157, size: 192, elements: !1047)
!1047 = !{!1048, !1050, !1051}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1046, file: !1041, line: 159, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1046, file: !1041, line: 160, baseType: !1045, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1046, file: !1041, line: 161, baseType: !1052, size: 32, offset: 128)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 32, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 4)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1040, file: !1041, line: 168, baseType: !1049, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1040, file: !1041, line: 169, baseType: !1049, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1040, file: !1041, line: 170, baseType: !1049, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1040, file: !1041, line: 171, baseType: !836, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1040, file: !1041, line: 172, baseType: !877, size: 32, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1040, file: !1041, line: 176, baseType: !1061, size: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1045, !1064, !836}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1040, file: !1041, line: 177, baseType: !1066, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !1064, !1045}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1040, file: !1041, line: 178, baseType: !1064, size: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1040, file: !1041, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1040, file: !1041, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1040, file: !1041, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !979, file: !961, line: 177, baseType: !780, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !979, file: !961, line: 178, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1077)
!1077 = !{!1078, !1324, !1325, !1326, !1329, !1333, !1334, !1335, !1353, !1354, !1355, !1356, !1357, !1358}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1076, file: !318, line: 219, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1082)
!1082 = !{!1083}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1081, file: !318, line: 151, baseType: !1084, size: 128)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1086)
!1086 = !{!1087, !1088, !1089}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1085, file: !318, line: 150, baseType: !7, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1085, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1085, file: !318, line: 150, baseType: !1090, size: 64, offset: 64)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 64, elements: !881)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !781, line: 108, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1093, file: !318, line: 124, baseType: !1075, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1093, file: !318, line: 125, baseType: !1075, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1093, file: !318, line: 131, baseType: !1098, size: 64, offset: 128)
!1098 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1099)
!1099 = !{!1100, !1315}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1098, file: !318, line: 129, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !781, line: 66, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !605, line: 143, size: 192, elements: !1104)
!1104 = !{!1105, !1313, !1314}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1103, file: !605, line: 145, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !781, line: 69, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !605, line: 136, size: 192, elements: !1109)
!1109 = !{!1110, !1311, !1312}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1108, file: !605, line: 137, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !781, line: 58, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !605, line: 737, size: 768, elements: !1114)
!1114 = !{!1115, !1132, !1166, !1172, !1177, !1182, !1189, !1195, !1201, !1206, !1220, !1225, !1231, !1236, !1246, !1251, !1269, !1276, !1283, !1289, !1294, !1300, !1306}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1113, file: !605, line: 738, baseType: !1116, size: 256)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !605, line: 271, size: 256, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1116, file: !605, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1116, file: !605, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1116, file: !605, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1116, file: !605, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1116, file: !605, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1116, file: !605, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1116, file: !605, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1116, file: !605, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1116, file: !605, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1116, file: !605, line: 312, baseType: !7, size: 32, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1116, file: !605, line: 316, baseType: !908, size: 32, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1116, file: !605, line: 319, baseType: !7, size: 32, offset: 96)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1116, file: !605, line: 323, baseType: !1075, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1116, file: !605, line: 327, baseType: !780, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1113, file: !605, line: 739, baseType: !1133, size: 448)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !605, line: 350, size: 448, elements: !1134)
!1134 = !{!1135, !1164}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1133, file: !605, line: 353, baseType: !1136, size: 384)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !605, line: 333, size: 384, elements: !1137)
!1137 = !{!1138, !1139, !1147}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1136, file: !605, line: 336, baseType: !1116, size: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1136, file: !605, line: 343, baseType: !1140, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1142, line: 37, size: 128, elements: !1143)
!1142 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !1142, line: 39, baseType: !1140, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1141, file: !1142, line: 40, baseType: !1146, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1136, file: !605, line: 344, baseType: !1148, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1142, line: 45, size: 320, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1149, file: !1142, line: 47, baseType: !1148, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1149, file: !1142, line: 48, baseType: !1153, size: 256, offset: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1154)
!1154 = !{!1155, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1153, file: !334, line: 1884, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !334, line: 1885, baseType: !1156, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1153, file: !334, line: 1891, baseType: !1159, size: 64, offset: 128)
!1159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1153, file: !334, line: 1891, size: 64, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1159, file: !334, line: 1891, baseType: !1111, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1159, file: !334, line: 1891, baseType: !780, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1153, file: !334, line: 1892, baseType: !1146, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1133, file: !605, line: 359, baseType: !1165, size: 64, offset: 384)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 64, elements: !881)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1113, file: !605, line: 740, baseType: !1167, size: 512)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !605, line: 365, size: 512, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1167, file: !605, line: 368, baseType: !1136, size: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1167, file: !605, line: 373, baseType: !780, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1167, file: !605, line: 374, baseType: !780, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1113, file: !605, line: 741, baseType: !1173, size: 576)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !605, line: 380, size: 576, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1173, file: !605, line: 383, baseType: !1167, size: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1173, file: !605, line: 389, baseType: !1165, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1113, file: !605, line: 742, baseType: !1178, size: 320)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !605, line: 395, size: 320, elements: !1179)
!1179 = !{!1180, !1181}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1178, file: !605, line: 397, baseType: !1116, size: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1178, file: !605, line: 400, baseType: !1101, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1113, file: !605, line: 743, baseType: !1183, size: 448)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !605, line: 406, size: 448, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1183, file: !605, line: 408, baseType: !1116, size: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1183, file: !605, line: 412, baseType: !780, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1183, file: !605, line: 420, baseType: !780, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1183, file: !605, line: 423, baseType: !1101, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1113, file: !605, line: 744, baseType: !1190, size: 384)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !605, line: 429, size: 384, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1190, file: !605, line: 431, baseType: !1116, size: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1190, file: !605, line: 434, baseType: !780, size: 64, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1190, file: !605, line: 437, baseType: !1101, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1113, file: !605, line: 745, baseType: !1196, size: 384)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !605, line: 443, size: 384, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1196, file: !605, line: 445, baseType: !1116, size: 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1196, file: !605, line: 449, baseType: !780, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1196, file: !605, line: 453, baseType: !1101, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1113, file: !605, line: 746, baseType: !1202, size: 320)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !605, line: 459, size: 320, elements: !1203)
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1202, file: !605, line: 461, baseType: !1116, size: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1202, file: !605, line: 464, baseType: !780, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1113, file: !605, line: 747, baseType: !1207, size: 768)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !605, line: 469, size: 768, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1207, file: !605, line: 471, baseType: !1116, size: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1207, file: !605, line: 474, baseType: !7, size: 32, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1207, file: !605, line: 475, baseType: !7, size: 32, offset: 288)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1207, file: !605, line: 478, baseType: !780, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1207, file: !605, line: 481, baseType: !1214, size: 384, offset: 384)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 384, elements: !881)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1215, file: !334, line: 1920, baseType: !1153, size: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1215, file: !334, line: 1921, baseType: !780, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1215, file: !334, line: 1922, baseType: !908, size: 32, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1113, file: !605, line: 748, baseType: !1221, size: 320)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !605, line: 487, size: 320, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1221, file: !605, line: 490, baseType: !1116, size: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1221, file: !605, line: 494, baseType: !877, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1113, file: !605, line: 749, baseType: !1226, size: 384)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !605, line: 500, size: 384, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1226, file: !605, line: 502, baseType: !1116, size: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1226, file: !605, line: 506, baseType: !1101, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1226, file: !605, line: 510, baseType: !1101, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1113, file: !605, line: 750, baseType: !1232, size: 320)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !605, line: 529, size: 320, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1232, file: !605, line: 531, baseType: !1116, size: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1232, file: !605, line: 540, baseType: !1101, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1113, file: !605, line: 751, baseType: !1237, size: 704)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !605, line: 546, size: 704, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1237, file: !605, line: 549, baseType: !1167, size: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1237, file: !605, line: 553, baseType: !984, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1237, file: !605, line: 557, baseType: !900, size: 8, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1237, file: !605, line: 558, baseType: !900, size: 8, offset: 584)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1237, file: !605, line: 559, baseType: !900, size: 8, offset: 592)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1237, file: !605, line: 560, baseType: !900, size: 8, offset: 600)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1237, file: !605, line: 566, baseType: !1165, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1113, file: !605, line: 752, baseType: !1247, size: 384)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !605, line: 571, size: 384, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1247, file: !605, line: 573, baseType: !1178, size: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1247, file: !605, line: 577, baseType: !780, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1113, file: !605, line: 753, baseType: !1252, size: 576)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !605, line: 600, size: 576, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1259, !1268}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1252, file: !605, line: 602, baseType: !1178, size: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1252, file: !605, line: 605, baseType: !780, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1252, file: !605, line: 609, baseType: !1257, size: 64, offset: 384)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1258, line: 46, baseType: !834)
!1258 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1252, file: !605, line: 612, baseType: !1260, size: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !605, line: 581, size: 320, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1261, file: !605, line: 583, baseType: !366, size: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1261, file: !605, line: 586, baseType: !780, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1261, file: !605, line: 589, baseType: !780, size: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1261, file: !605, line: 592, baseType: !780, size: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1261, file: !605, line: 595, baseType: !780, size: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1252, file: !605, line: 616, baseType: !1101, size: 64, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1113, file: !605, line: 754, baseType: !1270, size: 512)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !605, line: 622, size: 512, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1270, file: !605, line: 624, baseType: !1178, size: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1270, file: !605, line: 628, baseType: !780, size: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1270, file: !605, line: 632, baseType: !780, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1270, file: !605, line: 636, baseType: !780, size: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1113, file: !605, line: 755, baseType: !1277, size: 704)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !605, line: 642, size: 704, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1277, file: !605, line: 644, baseType: !1270, size: 512)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1277, file: !605, line: 648, baseType: !780, size: 64, offset: 512)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1277, file: !605, line: 652, baseType: !780, size: 64, offset: 576)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1277, file: !605, line: 653, baseType: !780, size: 64, offset: 640)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1113, file: !605, line: 756, baseType: !1284, size: 448)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !605, line: 663, size: 448, elements: !1285)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1284, file: !605, line: 665, baseType: !1178, size: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1284, file: !605, line: 668, baseType: !780, size: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1284, file: !605, line: 673, baseType: !780, size: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1113, file: !605, line: 757, baseType: !1290, size: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !605, line: 694, size: 384, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1290, file: !605, line: 696, baseType: !1178, size: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1290, file: !605, line: 699, baseType: !780, size: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1113, file: !605, line: 758, baseType: !1295, size: 384)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !605, line: 681, size: 384, elements: !1296)
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1295, file: !605, line: 683, baseType: !1116, size: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1295, file: !605, line: 686, baseType: !780, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1295, file: !605, line: 689, baseType: !780, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1113, file: !605, line: 759, baseType: !1301, size: 384)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !605, line: 707, size: 384, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1301, file: !605, line: 709, baseType: !1116, size: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1301, file: !605, line: 712, baseType: !780, size: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1301, file: !605, line: 712, baseType: !780, size: 64, offset: 320)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1113, file: !605, line: 760, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !605, line: 718, size: 320, elements: !1308)
!1308 = !{!1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1307, file: !605, line: 720, baseType: !1116, size: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1307, file: !605, line: 723, baseType: !780, size: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1108, file: !605, line: 138, baseType: !1107, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !605, line: 139, baseType: !1107, size: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1103, file: !605, line: 146, baseType: !1106, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1103, file: !605, line: 152, baseType: !1101, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1098, file: !318, line: 130, baseType: !958, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1093, file: !318, line: 134, baseType: !1064, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1093, file: !318, line: 137, baseType: !780, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1093, file: !318, line: 138, baseType: !908, size: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1093, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !318, line: 144, baseType: !877, size: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1093, file: !318, line: 145, baseType: !877, size: 32, offset: 416)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1093, file: !318, line: 146, baseType: !1323, size: 64, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !836)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1076, file: !318, line: 220, baseType: !1079, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1076, file: !318, line: 223, baseType: !1064, size: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1076, file: !318, line: 226, baseType: !1327, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1076, file: !318, line: 229, baseType: !1330, size: 128, offset: 256)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1331, size: 128, elements: !1028)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1076, file: !318, line: 232, baseType: !1075, size: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1076, file: !318, line: 233, baseType: !1075, size: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1076, file: !318, line: 238, baseType: !1336, size: 64, offset: 512)
!1336 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1337)
!1337 = !{!1338, !1344}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1336, file: !318, line: 236, baseType: !1339, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1340, file: !318, line: 275, baseType: !1101, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1340, file: !318, line: 278, baseType: !1101, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1336, file: !318, line: 237, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1346, file: !318, line: 261, baseType: !958, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1346, file: !318, line: 262, baseType: !958, size: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1346, file: !318, line: 266, baseType: !958, size: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1346, file: !318, line: 267, baseType: !958, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1346, file: !318, line: 270, baseType: !877, size: 32, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1076, file: !318, line: 241, baseType: !1323, size: 64, offset: 576)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1076, file: !318, line: 244, baseType: !877, size: 32, offset: 640)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1076, file: !318, line: 247, baseType: !877, size: 32, offset: 672)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1076, file: !318, line: 250, baseType: !877, size: 32, offset: 704)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1076, file: !318, line: 253, baseType: !877, size: 32, offset: 736)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1076, file: !318, line: 256, baseType: !877, size: 32, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !979, file: !961, line: 179, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !961, line: 150, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !961, line: 142, size: 320, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1370, !1371}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1362, file: !961, line: 144, baseType: !780, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1362, file: !961, line: 145, baseType: !958, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1362, file: !961, line: 146, baseType: !958, size: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1362, file: !961, line: 147, baseType: !1368, size: 32, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1369, line: 31, baseType: !877)
!1369 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1362, file: !961, line: 148, baseType: !7, size: 32, offset: 224)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1362, file: !961, line: 149, baseType: !900, size: 8, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !979, file: !961, line: 180, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !961, line: 162, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !961, line: 159, size: 128, elements: !1376)
!1376 = !{!1377, !1378}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1375, file: !961, line: 160, baseType: !780, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1375, file: !961, line: 161, baseType: !836, size: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !979, file: !961, line: 181, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !961, line: 181, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !974, file: !961, line: 317, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 64, elements: !881)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !974, file: !961, line: 318, baseType: !1385, size: 320)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !961, line: 188, size: 320, elements: !1386)
!1386 = !{!1387, !1389, !1446}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1385, file: !961, line: 190, baseType: !1388, size: 192)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 192, elements: !854)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1385, file: !961, line: 193, baseType: !1390, size: 64, offset: 192)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !961, line: 206, size: 320, elements: !1392)
!1392 = !{!1393, !1431, !1432, !1433, !1445}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1391, file: !961, line: 208, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !781, line: 62, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1397, line: 538, size: 256, elements: !1398)
!1397 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1398 = !{!1399, !1403, !1409, !1422}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1396, file: !1397, line: 539, baseType: !1400, size: 32)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1397, line: 482, size: 32, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !1397, line: 484, baseType: !7, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1396, file: !1397, line: 540, baseType: !1404, size: 192)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1397, line: 488, size: 192, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1404, file: !1397, line: 489, baseType: !1400, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !1397, line: 492, baseType: !984, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1404, file: !1397, line: 496, baseType: !780, size: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1396, file: !1397, line: 541, baseType: !1410, size: 256)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1397, line: 504, size: 256, elements: !1411)
!1411 = !{!1412, !1413, !1420, !1421}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !1397, line: 505, baseType: !1400, size: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1410, file: !1397, line: 509, baseType: !1414, size: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1397, line: 501, baseType: !1415)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1410, file: !1397, line: 510, baseType: !1418, size: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1410, file: !1397, line: 513, baseType: !1394, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1396, file: !1397, line: 542, baseType: !1423, size: 128)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1397, line: 530, size: 128, elements: !1424)
!1424 = !{!1425, !1426}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1423, file: !1397, line: 531, baseType: !1400, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1423, file: !1397, line: 534, baseType: !1427, size: 64, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1397, line: 525, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!900, !780, !984, !834, !834}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1391, file: !961, line: 211, baseType: !7, size: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1391, file: !961, line: 214, baseType: !836, size: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1391, file: !961, line: 224, baseType: !1434, size: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !961, line: 202, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !961, line: 202, size: 128, elements: !1437)
!1437 = !{!1438}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1436, file: !961, line: 202, baseType: !1439, size: 128)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !961, line: 200, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !961, line: 200, size: 128, elements: !1441)
!1441 = !{!1442, !1443, !1444}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1440, file: !961, line: 200, baseType: !7, size: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1440, file: !961, line: 200, baseType: !7, size: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1440, file: !961, line: 200, baseType: !994, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1391, file: !961, line: 234, baseType: !1434, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1385, file: !961, line: 197, baseType: !836, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !974, file: !961, line: 319, baseType: !843, size: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !974, file: !961, line: 320, baseType: !862, size: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !783, file: !334, line: 3384, baseType: !1450, size: 1472)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1451)
!1451 = !{!1452, !1473, !1474, !1475, !1476}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !334, line: 3115, baseType: !1453, size: 1216)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1454)
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1453, file: !334, line: 2985, baseType: !954, size: 960)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1453, file: !334, line: 2986, baseType: !780, size: 64, offset: 960)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1453, file: !334, line: 2987, baseType: !780, size: 64, offset: 1024)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1453, file: !334, line: 2988, baseType: !780, size: 64, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1453, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1453, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1453, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1453, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1453, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1453, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1453, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1453, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1453, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1453, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1453, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1453, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1453, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1453, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1450, file: !334, line: 3117, baseType: !780, size: 64, offset: 1216)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1450, file: !334, line: 3119, baseType: !780, size: 64, offset: 1280)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1450, file: !334, line: 3121, baseType: !780, size: 64, offset: 1344)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1450, file: !334, line: 3123, baseType: !780, size: 64, offset: 1408)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !783, file: !334, line: 3385, baseType: !1478, size: 1088)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1479)
!1479 = !{!1480, !1481, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1478, file: !334, line: 2875, baseType: !954, size: 960)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1478, file: !334, line: 2876, baseType: !958, size: 64, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1478, file: !334, line: 2877, baseType: !1483, size: 64, offset: 1024)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1485, line: 172, size: 128, elements: !1486)
!1485 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1484, file: !1485, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1484, file: !1485, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1484, file: !1485, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1484, file: !1485, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1484, file: !1485, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1484, file: !1485, line: 195, baseType: !7, size: 32, offset: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1484, file: !1485, line: 199, baseType: !780, size: 64, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !783, file: !334, line: 3386, baseType: !1453, size: 1216)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !783, file: !334, line: 3387, baseType: !1496, size: 1280)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1497)
!1497 = !{!1498, !1499}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1496, file: !334, line: 3094, baseType: !1453, size: 1216)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1496, file: !334, line: 3095, baseType: !1483, size: 64, offset: 1216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !783, file: !334, line: 3388, baseType: !1501, size: 1216)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1501, file: !334, line: 2825, baseType: !916, size: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1501, file: !334, line: 2827, baseType: !780, size: 64, offset: 896)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1501, file: !334, line: 2828, baseType: !780, size: 64, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1501, file: !334, line: 2829, baseType: !780, size: 64, offset: 1024)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1501, file: !334, line: 2830, baseType: !780, size: 64, offset: 1088)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1501, file: !334, line: 2831, baseType: !780, size: 64, offset: 1152)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !783, file: !334, line: 3389, baseType: !1510, size: 1024)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1511)
!1511 = !{!1512, !1513, !1514}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1510, file: !334, line: 2851, baseType: !954, size: 960)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1510, file: !334, line: 2852, baseType: !877, size: 32, offset: 960)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1510, file: !334, line: 2853, baseType: !877, size: 32, offset: 992)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !783, file: !334, line: 3390, baseType: !1516, size: 1024)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1517)
!1517 = !{!1518, !1519}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1516, file: !334, line: 2858, baseType: !954, size: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1516, file: !334, line: 2859, baseType: !1483, size: 64, offset: 960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !783, file: !334, line: 3391, baseType: !1521, size: 960)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1522)
!1522 = !{!1523}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1521, file: !334, line: 2863, baseType: !954, size: 960)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !783, file: !334, line: 3392, baseType: !1525, size: 1472)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1526)
!1526 = !{!1527}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1525, file: !334, line: 3305, baseType: !1450, size: 1472)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !783, file: !334, line: 3393, baseType: !1529, size: 1792)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1530)
!1530 = !{!1531, !1532, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1529, file: !334, line: 3249, baseType: !1450, size: 1472)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1529, file: !334, line: 3251, baseType: !1533, size: 64, offset: 1472)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1535, line: 463, size: 1152, elements: !1536)
!1535 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1536 = !{!1537, !1540, !1571, !1572, !1685, !1688, !1689, !1690, !1691, !1692, !1693, !1717, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1534, file: !1535, line: 464, baseType: !1538, size: 64)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1535, line: 464, flags: DIFlagFwdDecl)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1534, file: !1535, line: 467, baseType: !1541, size: 64, offset: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1543)
!1543 = !{!1544, !1546, !1547, !1560, !1561, !1562, !1563, !1564, !1565, !1567, !1569, !1570}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1542, file: !318, line: 377, baseType: !1545, size: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !781, line: 111, baseType: !1075)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1542, file: !318, line: 378, baseType: !1545, size: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1542, file: !318, line: 381, baseType: !1548, size: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1551)
!1551 = !{!1552}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1550, file: !318, line: 282, baseType: !1553, size: 128)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1554)
