; ModuleID = 'tree-object-size.c'
source_filename = "tree-object-size.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }

!1348 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_START", value: 683, isUnsigned: true)
!1349 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_START", value: 684, isUnsigned: true)
!1350 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_START", value: 685, isUnsigned: true)
!1351 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_NEXT", value: 686, isUnsigned: true)
!1352 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_NEXT", value: 687, isUnsigned: true)
!1353 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_NEXT", value: 688, isUnsigned: true)
!1354 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_NEXT", value: 689, isUnsigned: true)
!1355 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_NEXT", value: 690, isUnsigned: true)
!1356 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1357 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1358 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1359 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1360 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1361 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1362 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1363 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1364 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1365 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1366 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1367 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1368 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1369 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1370 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1371 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1372 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1373 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1374 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1375 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1376 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1377 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1378 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1379 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1380 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1381 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1382 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1383 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !202, line: 295, baseType: !7, size: 32, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396}
!1385 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!1386 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!1387 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!1388 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!1389 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!1390 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!1391 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!1392 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!1393 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!1394 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!1395 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!1396 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!1397 = !{!5, !1398, !1399, !1400, !1466, !1453, !1467, !1418, !1576, !625, !1761, !2581, !1795, !1441}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1401, line: 47, baseType: !1402)
!1401 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1404, line: 75, size: 256, elements: !1405)
!1404 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1405 = !{!1406, !1421, !1422, !1423}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1403, file: !1404, line: 76, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1404, line: 68, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1404, line: 63, size: 320, elements: !1410)
!1410 = !{!1411, !1413, !1414, !1415}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1409, file: !1404, line: 64, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1409, file: !1404, line: 65, baseType: !1412, size: 64, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1409, file: !1404, line: 66, baseType: !7, size: 32, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1409, file: !1404, line: 67, baseType: !1416, size: 128, offset: 192)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1417, size: 128, elements: !1419)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1404, line: 29, baseType: !1418)
!1418 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1419 = !{!1420}
!1420 = !DISubrange(count: 2)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1403, file: !1404, line: 77, baseType: !1407, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1403, file: !1404, line: 78, baseType: !7, size: 32, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1403, file: !1404, line: 79, baseType: !1424, size: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1404, line: 49, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1404, line: 45, size: 832, elements: !1427)
!1427 = !{!1428, !1429, !1430}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1426, file: !1404, line: 46, baseType: !1412, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1426, file: !1404, line: 47, baseType: !1402, size: 64, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1426, file: !1404, line: 48, baseType: !1431, size: 704, offset: 128)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1432, line: 164, size: 704, elements: !1433)
!1432 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1433 = !{!1434, !1436, !1448, !1449, !1450, !1451, !1452, !1454, !1458, !1462, !1463, !1464, !1465}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1431, file: !1432, line: 166, baseType: !1435, size: 64)
!1435 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1431, file: !1432, line: 167, baseType: !1437, size: 64, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1432, line: 157, size: 192, elements: !1439)
!1439 = !{!1440, !1443, !1444}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1438, file: !1432, line: 159, baseType: !1441, size: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1438, file: !1432, line: 160, baseType: !1437, size: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1438, file: !1432, line: 161, baseType: !1445, size: 32, offset: 128)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1442, size: 32, elements: !1446)
!1446 = !{!1447}
!1447 = !DISubrange(count: 4)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1431, file: !1432, line: 168, baseType: !1441, size: 64, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1431, file: !1432, line: 169, baseType: !1441, size: 64, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1431, file: !1432, line: 170, baseType: !1441, size: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1431, file: !1432, line: 171, baseType: !1435, size: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1431, file: !1432, line: 172, baseType: !1453, size: 32, offset: 384)
!1453 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1431, file: !1432, line: 176, baseType: !1455, size: 64, offset: 448)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!1437, !1398, !1435}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1431, file: !1432, line: 177, baseType: !1459, size: 64, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{null, !1398, !1437}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1431, file: !1432, line: 178, baseType: !1398, size: 64, offset: 576)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1431, file: !1432, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1431, file: !1432, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1431, file: !1432, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1401, line: 56, baseType: !1468)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !1470)
!1470 = !{!1471, !1504, !1510, !1521, !1528, !1535, !1540, !1549, !1555, !1569, !1581, !1619, !1627, !1655, !1672, !1673, !1678, !1687, !1693, !1698, !1702, !1706, !2230, !2279, !2285, !2291, !2298, !2311, !2325, !2342, !2354, !2376, !2391, !2563}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1469, file: !6, line: 3372, baseType: !1472, size: 64)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1472, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1472, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1472, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1472, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1472, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1472, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1472, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1472, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1472, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1472, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1472, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1472, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1472, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1472, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1472, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1472, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1472, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1472, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1472, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1472, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1472, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1472, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1472, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1472, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1472, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1472, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1472, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1472, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1472, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1472, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1469, file: !6, line: 3373, baseType: !1505, size: 192)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !1506)
!1506 = !{!1507, !1508, !1509}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1505, file: !6, line: 403, baseType: !1472, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1505, file: !6, line: 404, baseType: !1467, size: 64, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1505, file: !6, line: 405, baseType: !1467, size: 64, offset: 128)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1469, file: !6, line: 3374, baseType: !1511, size: 320)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !1512)
!1512 = !{!1513, !1514}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1511, file: !6, line: 1385, baseType: !1505, size: 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1511, file: !6, line: 1386, baseType: !1515, size: 128, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1516, line: 58, baseType: !1517)
!1516 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1516, line: 54, size: 128, elements: !1518)
!1518 = !{!1519, !1520}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1517, file: !1516, line: 56, baseType: !1418, size: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1517, file: !1516, line: 57, baseType: !1435, size: 64, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1469, file: !6, line: 3375, baseType: !1522, size: 256)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !1523)
!1523 = !{!1524, !1525}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1522, file: !6, line: 1398, baseType: !1505, size: 192)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1522, file: !6, line: 1399, baseType: !1526, size: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1469, file: !6, line: 3376, baseType: !1529, size: 256)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !1530)
!1530 = !{!1531, !1532}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1529, file: !6, line: 1409, baseType: !1505, size: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1529, file: !6, line: 1410, baseType: !1533, size: 64, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1469, file: !6, line: 3377, baseType: !1536, size: 256)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !1537)
!1537 = !{!1538, !1539}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1536, file: !6, line: 1438, baseType: !1505, size: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1536, file: !6, line: 1439, baseType: !1467, size: 64, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1469, file: !6, line: 3378, baseType: !1541, size: 256)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !1542)
!1542 = !{!1543, !1544, !1545}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1541, file: !6, line: 1419, baseType: !1505, size: 192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1541, file: !6, line: 1420, baseType: !1453, size: 32, offset: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1541, file: !6, line: 1421, baseType: !1546, size: 8, offset: 224)
!1546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1442, size: 8, elements: !1547)
!1547 = !{!1548}
!1548 = !DISubrange(count: 1)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1469, file: !6, line: 3379, baseType: !1550, size: 320)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !1551)
!1551 = !{!1552, !1553, !1554}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1550, file: !6, line: 1429, baseType: !1505, size: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1550, file: !6, line: 1430, baseType: !1467, size: 64, offset: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1550, file: !6, line: 1431, baseType: !1467, size: 64, offset: 256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1469, file: !6, line: 3380, baseType: !1556, size: 320)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !1557)
!1557 = !{!1558, !1559}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1556, file: !6, line: 1461, baseType: !1505, size: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1556, file: !6, line: 1462, baseType: !1560, size: 128, offset: 192)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1561, line: 31, size: 128, elements: !1562)
!1561 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1562 = !{!1563, !1567, !1568}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1560, file: !1561, line: 32, baseType: !1564, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1566)
!1566 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1560, file: !1561, line: 33, baseType: !7, size: 32, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1560, file: !1561, line: 34, baseType: !7, size: 32, offset: 96)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1469, file: !6, line: 3381, baseType: !1570, size: 384)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !1571)
!1571 = !{!1572, !1573, !1578, !1579, !1580}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1570, file: !6, line: 2508, baseType: !1505, size: 192)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1570, file: !6, line: 2509, baseType: !1574, size: 32, offset: 192)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1575, line: 58, baseType: !1576)
!1575 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1577, line: 44, baseType: !7)
!1577 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1570, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1570, file: !6, line: 2511, baseType: !1467, size: 64, offset: 256)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1570, file: !6, line: 2512, baseType: !1467, size: 64, offset: 320)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1469, file: !6, line: 3382, baseType: !1582, size: 896)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1582, file: !6, line: 2653, baseType: !1570, size: 384)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1582, file: !6, line: 2654, baseType: !1467, size: 64, offset: 384)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1582, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1582, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1582, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1582, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1582, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1582, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1582, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1582, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1582, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1582, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1582, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1582, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1582, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1582, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1582, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1582, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1582, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1582, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1582, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1582, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1582, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1582, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1582, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1582, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1582, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1582, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1582, file: !6, line: 2705, baseType: !1467, size: 64, offset: 576)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1582, file: !6, line: 2706, baseType: !1467, size: 64, offset: 640)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1582, file: !6, line: 2707, baseType: !1467, size: 64, offset: 704)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1582, file: !6, line: 2708, baseType: !1467, size: 64, offset: 768)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1582, file: !6, line: 2711, baseType: !1617, size: 64, offset: 832)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1469, file: !6, line: 3383, baseType: !1620, size: 960)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !1621)
!1621 = !{!1622, !1623}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1620, file: !6, line: 2757, baseType: !1582, size: 896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1620, file: !6, line: 2758, baseType: !1624, size: 64, offset: 896)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1401, line: 50, baseType: !1625)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64)
!1626 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1401, line: 49, flags: DIFlagFwdDecl)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1469, file: !6, line: 3384, baseType: !1628, size: 1472)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !1629)
!1629 = !{!1630, !1651, !1652, !1653, !1654}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1628, file: !6, line: 3115, baseType: !1631, size: 1216)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1631, file: !6, line: 2985, baseType: !1620, size: 960)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1631, file: !6, line: 2986, baseType: !1467, size: 64, offset: 960)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1631, file: !6, line: 2987, baseType: !1467, size: 64, offset: 1024)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1631, file: !6, line: 2988, baseType: !1467, size: 64, offset: 1088)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1631, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1631, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1631, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1631, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1631, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1631, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1631, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1631, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1631, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1631, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1631, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1631, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1631, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1631, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1628, file: !6, line: 3117, baseType: !1467, size: 64, offset: 1216)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1628, file: !6, line: 3119, baseType: !1467, size: 64, offset: 1280)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1628, file: !6, line: 3121, baseType: !1467, size: 64, offset: 1344)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1628, file: !6, line: 3123, baseType: !1467, size: 64, offset: 1408)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1469, file: !6, line: 3385, baseType: !1656, size: 1088)
!1656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !1657)
!1657 = !{!1658, !1659, !1660}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1656, file: !6, line: 2875, baseType: !1620, size: 960)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1656, file: !6, line: 2876, baseType: !1624, size: 64, offset: 960)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1656, file: !6, line: 2877, baseType: !1661, size: 64, offset: 1024)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1663, line: 172, size: 128, elements: !1664)
!1663 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1664 = !{!1665, !1666, !1667, !1668, !1669, !1670, !1671}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1662, file: !1663, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1662, file: !1663, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1662, file: !1663, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1662, file: !1663, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1662, file: !1663, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1662, file: !1663, line: 195, baseType: !7, size: 32, offset: 32)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1662, file: !1663, line: 199, baseType: !1467, size: 64, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1469, file: !6, line: 3386, baseType: !1631, size: 1216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1469, file: !6, line: 3387, baseType: !1674, size: 1280)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !1675)
!1675 = !{!1676, !1677}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1674, file: !6, line: 3094, baseType: !1631, size: 1216)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1674, file: !6, line: 3095, baseType: !1661, size: 64, offset: 1216)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1469, file: !6, line: 3388, baseType: !1679, size: 1216)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1679, file: !6, line: 2825, baseType: !1582, size: 896)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1679, file: !6, line: 2827, baseType: !1467, size: 64, offset: 896)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1679, file: !6, line: 2828, baseType: !1467, size: 64, offset: 960)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1679, file: !6, line: 2829, baseType: !1467, size: 64, offset: 1024)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1679, file: !6, line: 2830, baseType: !1467, size: 64, offset: 1088)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1679, file: !6, line: 2831, baseType: !1467, size: 64, offset: 1152)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1469, file: !6, line: 3389, baseType: !1688, size: 1024)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !1689)
!1689 = !{!1690, !1691, !1692}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1688, file: !6, line: 2851, baseType: !1620, size: 960)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1688, file: !6, line: 2852, baseType: !1453, size: 32, offset: 960)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1688, file: !6, line: 2853, baseType: !1453, size: 32, offset: 992)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1469, file: !6, line: 3390, baseType: !1694, size: 1024)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !1695)
!1695 = !{!1696, !1697}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1694, file: !6, line: 2858, baseType: !1620, size: 960)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1694, file: !6, line: 2859, baseType: !1661, size: 64, offset: 960)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1469, file: !6, line: 3391, baseType: !1699, size: 960)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !1700)
!1700 = !{!1701}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1699, file: !6, line: 2863, baseType: !1620, size: 960)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1469, file: !6, line: 3392, baseType: !1703, size: 1472)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !1704)
!1704 = !{!1705}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1703, file: !6, line: 3305, baseType: !1628, size: 1472)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1469, file: !6, line: 3393, baseType: !1707, size: 1792)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !1708)
!1708 = !{!1709, !1710, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1707, file: !6, line: 3249, baseType: !1628, size: 1472)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1707, file: !6, line: 3251, baseType: !1711, size: 64, offset: 1472)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1713, line: 463, size: 1152, elements: !1714)
!1713 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1714 = !{!1715, !1718, !2035, !2036, !2150, !2153, !2154, !2155, !2156, !2157, !2158, !2182, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1712, file: !1713, line: 464, baseType: !1716, size: 64)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1717 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1713, line: 464, flags: DIFlagFwdDecl)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1712, file: !1713, line: 467, baseType: !1719, size: 64, offset: 64)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !1721)
!1721 = !{!1722, !2010, !2011, !2024, !2025, !2026, !2027, !2028, !2029, !2031, !2033, !2034}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1720, file: !202, line: 377, baseType: !1723, size: 64)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1401, line: 111, baseType: !1724)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !1726)
!1726 = !{!1727, !1975, !1976, !1977, !1980, !1984, !1985, !1986, !2004, !2005, !2006, !2007, !2008, !2009}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1725, file: !202, line: 219, baseType: !1728, size: 64)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64)
!1729 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !1730)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !1731)
!1731 = !{!1732}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1730, file: !202, line: 151, baseType: !1733, size: 128)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !1735)
!1735 = !{!1736, !1737, !1738}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1734, file: !202, line: 150, baseType: !7, size: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1734, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1734, file: !202, line: 150, baseType: !1739, size: 64, offset: 64)
!1739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1740, size: 64, elements: !1547)
!1740 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1401, line: 108, baseType: !1741)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64)
!1742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !1743)
!1743 = !{!1744, !1745, !1746, !1967, !1968, !1969, !1970, !1971, !1972, !1973}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1742, file: !202, line: 124, baseType: !1724, size: 64)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1742, file: !202, line: 125, baseType: !1724, size: 64, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1742, file: !202, line: 131, baseType: !1747, size: 64, offset: 128)
!1747 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !1748)
!1748 = !{!1749, !1966}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1747, file: !202, line: 129, baseType: !1750, size: 64)
!1750 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1401, line: 66, baseType: !1751)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64)
!1752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !587, line: 143, size: 192, elements: !1753)
!1753 = !{!1754, !1964, !1965}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1752, file: !587, line: 145, baseType: !1755, size: 64)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1401, line: 69, baseType: !1756)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64)
!1757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !587, line: 136, size: 192, elements: !1758)
!1758 = !{!1759, !1962, !1963}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1757, file: !587, line: 137, baseType: !1760, size: 64)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1401, line: 58, baseType: !1761)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !587, line: 737, size: 768, elements: !1763)
!1763 = !{!1764, !1781, !1815, !1821, !1826, !1831, !1838, !1844, !1850, !1855, !1869, !1874, !1880, !1885, !1897, !1902, !1920, !1927, !1934, !1940, !1945, !1951, !1957}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1762, file: !587, line: 738, baseType: !1765, size: 256)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !587, line: 271, size: 256, elements: !1766)
!1766 = !{!1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1765, file: !587, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1765, file: !587, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1765, file: !587, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1765, file: !587, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1765, file: !587, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1765, file: !587, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1765, file: !587, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1765, file: !587, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1765, file: !587, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1765, file: !587, line: 312, baseType: !7, size: 32, offset: 32)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1765, file: !587, line: 316, baseType: !1574, size: 32, offset: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1765, file: !587, line: 319, baseType: !7, size: 32, offset: 96)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1765, file: !587, line: 323, baseType: !1724, size: 64, offset: 128)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1765, file: !587, line: 327, baseType: !1467, size: 64, offset: 192)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1762, file: !587, line: 739, baseType: !1782, size: 448)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !587, line: 350, size: 448, elements: !1783)
!1783 = !{!1784, !1813}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1782, file: !587, line: 353, baseType: !1785, size: 384)
!1785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !587, line: 333, size: 384, elements: !1786)
!1786 = !{!1787, !1788, !1796}
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1785, file: !587, line: 336, baseType: !1765, size: 256)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1785, file: !587, line: 343, baseType: !1789, size: 64, offset: 256)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1791, line: 37, size: 128, elements: !1792)
!1791 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1792 = !{!1793, !1794}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1790, file: !1791, line: 39, baseType: !1789, size: 64)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1790, file: !1791, line: 40, baseType: !1795, size: 64, offset: 64)
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1785, file: !587, line: 344, baseType: !1797, size: 64, offset: 320)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1791, line: 45, size: 320, elements: !1799)
!1799 = !{!1800, !1801}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1798, file: !1791, line: 47, baseType: !1797, size: 64)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1798, file: !1791, line: 48, baseType: !1802, size: 256, offset: 64)
!1802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !1803)
!1803 = !{!1804, !1806, !1807, !1812}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1802, file: !6, line: 1884, baseType: !1805, size: 64)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1802, file: !6, line: 1885, baseType: !1805, size: 64, offset: 64)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1802, file: !6, line: 1891, baseType: !1808, size: 64, offset: 128)
!1808 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1802, file: !6, line: 1891, size: 64, elements: !1809)
!1809 = !{!1810, !1811}
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1808, file: !6, line: 1891, baseType: !1760, size: 64)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1808, file: !6, line: 1891, baseType: !1467, size: 64)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1802, file: !6, line: 1892, baseType: !1795, size: 64, offset: 192)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1782, file: !587, line: 359, baseType: !1814, size: 64, offset: 384)
!1814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1467, size: 64, elements: !1547)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1762, file: !587, line: 740, baseType: !1816, size: 512)
!1816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !587, line: 365, size: 512, elements: !1817)
!1817 = !{!1818, !1819, !1820}
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1816, file: !587, line: 368, baseType: !1785, size: 384)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1816, file: !587, line: 373, baseType: !1467, size: 64, offset: 384)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1816, file: !587, line: 374, baseType: !1467, size: 64, offset: 448)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1762, file: !587, line: 741, baseType: !1822, size: 576)
!1822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !587, line: 380, size: 576, elements: !1823)
!1823 = !{!1824, !1825}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1822, file: !587, line: 383, baseType: !1816, size: 512)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1822, file: !587, line: 389, baseType: !1814, size: 64, offset: 512)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1762, file: !587, line: 742, baseType: !1827, size: 320)
!1827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !587, line: 395, size: 320, elements: !1828)
!1828 = !{!1829, !1830}
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1827, file: !587, line: 397, baseType: !1765, size: 256)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1827, file: !587, line: 400, baseType: !1750, size: 64, offset: 256)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1762, file: !587, line: 743, baseType: !1832, size: 448)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !587, line: 406, size: 448, elements: !1833)
!1833 = !{!1834, !1835, !1836, !1837}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1832, file: !587, line: 408, baseType: !1765, size: 256)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1832, file: !587, line: 412, baseType: !1467, size: 64, offset: 256)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1832, file: !587, line: 420, baseType: !1467, size: 64, offset: 320)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1832, file: !587, line: 423, baseType: !1750, size: 64, offset: 384)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1762, file: !587, line: 744, baseType: !1839, size: 384)
!1839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !587, line: 429, size: 384, elements: !1840)
!1840 = !{!1841, !1842, !1843}
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1839, file: !587, line: 431, baseType: !1765, size: 256)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1839, file: !587, line: 434, baseType: !1467, size: 64, offset: 256)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1839, file: !587, line: 437, baseType: !1750, size: 64, offset: 320)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1762, file: !587, line: 745, baseType: !1845, size: 384)
!1845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !587, line: 443, size: 384, elements: !1846)
!1846 = !{!1847, !1848, !1849}
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1845, file: !587, line: 445, baseType: !1765, size: 256)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1845, file: !587, line: 449, baseType: !1467, size: 64, offset: 256)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1845, file: !587, line: 453, baseType: !1750, size: 64, offset: 320)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1762, file: !587, line: 746, baseType: !1851, size: 320)
!1851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !587, line: 459, size: 320, elements: !1852)
!1852 = !{!1853, !1854}
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1851, file: !587, line: 461, baseType: !1765, size: 256)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1851, file: !587, line: 464, baseType: !1467, size: 64, offset: 256)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1762, file: !587, line: 747, baseType: !1856, size: 768)
!1856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !587, line: 469, size: 768, elements: !1857)
!1857 = !{!1858, !1859, !1860, !1861, !1862}
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1856, file: !587, line: 471, baseType: !1765, size: 256)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1856, file: !587, line: 474, baseType: !7, size: 32, offset: 256)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1856, file: !587, line: 475, baseType: !7, size: 32, offset: 288)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1856, file: !587, line: 478, baseType: !1467, size: 64, offset: 320)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1856, file: !587, line: 481, baseType: !1863, size: 384, offset: 384)
!1863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1864, size: 384, elements: !1547)
!1864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !1865)
!1865 = !{!1866, !1867, !1868}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1864, file: !6, line: 1920, baseType: !1802, size: 256)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1864, file: !6, line: 1921, baseType: !1467, size: 64, offset: 256)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1864, file: !6, line: 1922, baseType: !1574, size: 32, offset: 320)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1762, file: !587, line: 748, baseType: !1870, size: 320)
!1870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !587, line: 487, size: 320, elements: !1871)
!1871 = !{!1872, !1873}
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1870, file: !587, line: 490, baseType: !1765, size: 256)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1870, file: !587, line: 494, baseType: !1453, size: 32, offset: 256)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1762, file: !587, line: 749, baseType: !1875, size: 384)
!1875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !587, line: 500, size: 384, elements: !1876)
!1876 = !{!1877, !1878, !1879}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1875, file: !587, line: 502, baseType: !1765, size: 256)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1875, file: !587, line: 506, baseType: !1750, size: 64, offset: 256)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1875, file: !587, line: 510, baseType: !1750, size: 64, offset: 320)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1762, file: !587, line: 750, baseType: !1881, size: 320)
!1881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !587, line: 529, size: 320, elements: !1882)
!1882 = !{!1883, !1884}
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1881, file: !587, line: 531, baseType: !1765, size: 256)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1881, file: !587, line: 540, baseType: !1750, size: 64, offset: 256)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1762, file: !587, line: 751, baseType: !1886, size: 704)
!1886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !587, line: 546, size: 704, elements: !1887)
!1887 = !{!1888, !1889, !1892, !1893, !1894, !1895, !1896}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1886, file: !587, line: 549, baseType: !1816, size: 512)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1886, file: !587, line: 553, baseType: !1890, size: 64, offset: 512)
!1890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1891, size: 64)
!1891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1442)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1886, file: !587, line: 557, baseType: !1566, size: 8, offset: 576)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1886, file: !587, line: 558, baseType: !1566, size: 8, offset: 584)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1886, file: !587, line: 559, baseType: !1566, size: 8, offset: 592)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1886, file: !587, line: 560, baseType: !1566, size: 8, offset: 600)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1886, file: !587, line: 566, baseType: !1814, size: 64, offset: 640)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1762, file: !587, line: 752, baseType: !1898, size: 384)
!1898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !587, line: 571, size: 384, elements: !1899)
!1899 = !{!1900, !1901}
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1898, file: !587, line: 573, baseType: !1827, size: 320)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1898, file: !587, line: 577, baseType: !1467, size: 64, offset: 320)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1762, file: !587, line: 753, baseType: !1903, size: 576)
!1903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !587, line: 600, size: 576, elements: !1904)
!1904 = !{!1905, !1906, !1907, !1910, !1919}
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1903, file: !587, line: 602, baseType: !1827, size: 320)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1903, file: !587, line: 605, baseType: !1467, size: 64, offset: 320)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1903, file: !587, line: 609, baseType: !1908, size: 64, offset: 384)
!1908 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1909, line: 46, baseType: !1418)
!1909 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1903, file: !587, line: 612, baseType: !1911, size: 64, offset: 448)
!1911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1912, size: 64)
!1912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !587, line: 581, size: 320, elements: !1913)
!1913 = !{!1914, !1915, !1916, !1917, !1918}
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1912, file: !587, line: 583, baseType: !5, size: 32)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1912, file: !587, line: 586, baseType: !1467, size: 64, offset: 64)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1912, file: !587, line: 589, baseType: !1467, size: 64, offset: 128)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1912, file: !587, line: 592, baseType: !1467, size: 64, offset: 192)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1912, file: !587, line: 595, baseType: !1467, size: 64, offset: 256)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1903, file: !587, line: 616, baseType: !1750, size: 64, offset: 512)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1762, file: !587, line: 754, baseType: !1921, size: 512)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !587, line: 622, size: 512, elements: !1922)
!1922 = !{!1923, !1924, !1925, !1926}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1921, file: !587, line: 624, baseType: !1827, size: 320)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1921, file: !587, line: 628, baseType: !1467, size: 64, offset: 320)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1921, file: !587, line: 632, baseType: !1467, size: 64, offset: 384)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1921, file: !587, line: 636, baseType: !1467, size: 64, offset: 448)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1762, file: !587, line: 755, baseType: !1928, size: 704)
!1928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !587, line: 642, size: 704, elements: !1929)
!1929 = !{!1930, !1931, !1932, !1933}
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1928, file: !587, line: 644, baseType: !1921, size: 512)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1928, file: !587, line: 648, baseType: !1467, size: 64, offset: 512)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1928, file: !587, line: 652, baseType: !1467, size: 64, offset: 576)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1928, file: !587, line: 653, baseType: !1467, size: 64, offset: 640)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1762, file: !587, line: 756, baseType: !1935, size: 448)
!1935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !587, line: 663, size: 448, elements: !1936)
!1936 = !{!1937, !1938, !1939}
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1935, file: !587, line: 665, baseType: !1827, size: 320)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1935, file: !587, line: 668, baseType: !1467, size: 64, offset: 320)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1935, file: !587, line: 673, baseType: !1467, size: 64, offset: 384)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1762, file: !587, line: 757, baseType: !1941, size: 384)
!1941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !587, line: 694, size: 384, elements: !1942)
!1942 = !{!1943, !1944}
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1941, file: !587, line: 696, baseType: !1827, size: 320)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1941, file: !587, line: 699, baseType: !1467, size: 64, offset: 320)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1762, file: !587, line: 758, baseType: !1946, size: 384)
!1946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !587, line: 681, size: 384, elements: !1947)
!1947 = !{!1948, !1949, !1950}
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1946, file: !587, line: 683, baseType: !1765, size: 256)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1946, file: !587, line: 686, baseType: !1467, size: 64, offset: 256)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1946, file: !587, line: 689, baseType: !1467, size: 64, offset: 320)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1762, file: !587, line: 759, baseType: !1952, size: 384)
!1952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !587, line: 707, size: 384, elements: !1953)
!1953 = !{!1954, !1955, !1956}
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1952, file: !587, line: 709, baseType: !1765, size: 256)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1952, file: !587, line: 712, baseType: !1467, size: 64, offset: 256)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1952, file: !587, line: 712, baseType: !1467, size: 64, offset: 320)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1762, file: !587, line: 760, baseType: !1958, size: 320)
!1958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !587, line: 718, size: 320, elements: !1959)
!1959 = !{!1960, !1961}
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1958, file: !587, line: 720, baseType: !1765, size: 256)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1958, file: !587, line: 723, baseType: !1467, size: 64, offset: 256)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1757, file: !587, line: 138, baseType: !1756, size: 64, offset: 64)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1757, file: !587, line: 139, baseType: !1756, size: 64, offset: 128)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1752, file: !587, line: 146, baseType: !1755, size: 64, offset: 64)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1752, file: !587, line: 152, baseType: !1750, size: 64, offset: 128)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1747, file: !202, line: 130, baseType: !1624, size: 64)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1742, file: !202, line: 134, baseType: !1398, size: 64, offset: 192)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1742, file: !202, line: 137, baseType: !1467, size: 64, offset: 256)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1742, file: !202, line: 138, baseType: !1574, size: 32, offset: 320)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1742, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1742, file: !202, line: 144, baseType: !1453, size: 32, offset: 384)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1742, file: !202, line: 145, baseType: !1453, size: 32, offset: 416)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1742, file: !202, line: 146, baseType: !1974, size: 64, offset: 448)
!1974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !1435)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1725, file: !202, line: 220, baseType: !1728, size: 64, offset: 64)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1725, file: !202, line: 223, baseType: !1398, size: 64, offset: 128)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1725, file: !202, line: 226, baseType: !1978, size: 64, offset: 192)
!1978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1979, size: 64)
!1979 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1725, file: !202, line: 229, baseType: !1981, size: 128, offset: 256)
!1981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1982, size: 128, elements: !1419)
!1982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1983, size: 64)
!1983 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1725, file: !202, line: 232, baseType: !1724, size: 64, offset: 384)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1725, file: !202, line: 233, baseType: !1724, size: 64, offset: 448)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1725, file: !202, line: 238, baseType: !1987, size: 64, offset: 512)
!1987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1988)
!1988 = !{!1989, !1995}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1987, file: !202, line: 236, baseType: !1990, size: 64)
!1990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1991, size: 64)
!1991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1992)
!1992 = !{!1993, !1994}
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1991, file: !202, line: 275, baseType: !1750, size: 64)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1991, file: !202, line: 278, baseType: !1750, size: 64, offset: 64)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1987, file: !202, line: 237, baseType: !1996, size: 64)
!1996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1997, size: 64)
!1997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1998)
!1998 = !{!1999, !2000, !2001, !2002, !2003}
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1997, file: !202, line: 261, baseType: !1624, size: 64)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1997, file: !202, line: 262, baseType: !1624, size: 64, offset: 64)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1997, file: !202, line: 266, baseType: !1624, size: 64, offset: 128)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1997, file: !202, line: 267, baseType: !1624, size: 64, offset: 192)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1997, file: !202, line: 270, baseType: !1453, size: 32, offset: 256)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1725, file: !202, line: 241, baseType: !1974, size: 64, offset: 576)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1725, file: !202, line: 244, baseType: !1453, size: 32, offset: 640)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1725, file: !202, line: 247, baseType: !1453, size: 32, offset: 672)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1725, file: !202, line: 250, baseType: !1453, size: 32, offset: 704)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1725, file: !202, line: 253, baseType: !1453, size: 32, offset: 736)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1725, file: !202, line: 256, baseType: !1453, size: 32, offset: 768)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1720, file: !202, line: 378, baseType: !1723, size: 64, offset: 64)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1720, file: !202, line: 381, baseType: !2012, size: 64, offset: 128)
!2012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2013, size: 64)
!2013 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !2014)
!2014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !2015)
!2015 = !{!2016}
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2014, file: !202, line: 282, baseType: !2017, size: 128)
!2017 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !2018)
!2018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !2019)
!2019 = !{!2020, !2021, !2022}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2018, file: !202, line: 281, baseType: !7, size: 32)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2018, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2018, file: !202, line: 281, baseType: !2023, size: 64, offset: 64)
!2023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1723, size: 64, elements: !1547)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1720, file: !202, line: 384, baseType: !1453, size: 32, offset: 192)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1720, file: !202, line: 387, baseType: !1453, size: 32, offset: 224)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1720, file: !202, line: 390, baseType: !1453, size: 32, offset: 256)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1720, file: !202, line: 394, baseType: !2012, size: 64, offset: 320)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1720, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1720, file: !202, line: 399, baseType: !2030, size: 64, offset: 416)
!2030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !1419)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1720, file: !202, line: 402, baseType: !2032, size: 64, offset: 480)
!2032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1419)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1720, file: !202, line: 406, baseType: !1453, size: 32, offset: 544)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1720, file: !202, line: 409, baseType: !1453, size: 32, offset: 576)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1712, file: !1713, line: 470, baseType: !1751, size: 64, offset: 128)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1712, file: !1713, line: 473, baseType: !2037, size: 64, offset: 192)
!2037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2038, size: 64)
!2038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1663, line: 39, size: 1152, elements: !2039)
!2039 = !{!2040, !2090, !2103, !2115, !2116, !2127, !2128, !2132, !2133, !2134, !2135, !2136}
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !2038, file: !1663, line: 41, baseType: !2041, size: 64)
!2041 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2042, line: 144, baseType: !2043)
!2042 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2044, size: 64)
!2044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2042, line: 100, size: 896, elements: !2045)
!2045 = !{!2046, !2054, !2059, !2064, !2066, !2067, !2068, !2069, !2070, !2071, !2076, !2078, !2079, !2084, !2089}
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2044, file: !2042, line: 102, baseType: !2047, size: 64)
!2047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2042, line: 52, baseType: !2048)
!2048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2049, size: 64)
!2049 = !DISubroutineType(types: !2050)
!2050 = !{!2051, !2052}
!2051 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2042, line: 47, baseType: !7)
!2052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2053, size: 64)
!2053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2044, file: !2042, line: 105, baseType: !2055, size: 64, offset: 64)
!2055 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2042, line: 59, baseType: !2056)
!2056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2057, size: 64)
!2057 = !DISubroutineType(types: !2058)
!2058 = !{!1453, !2052, !2052}
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2044, file: !2042, line: 108, baseType: !2060, size: 64, offset: 128)
!2060 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2042, line: 63, baseType: !2061)
!2061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2062, size: 64)
!2062 = !DISubroutineType(types: !2063)
!2063 = !{null, !1398}
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2044, file: !2042, line: 111, baseType: !2065, size: 64, offset: 192)
!2065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2044, file: !2042, line: 114, baseType: !1908, size: 64, offset: 256)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2044, file: !2042, line: 117, baseType: !1908, size: 64, offset: 320)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2044, file: !2042, line: 120, baseType: !1908, size: 64, offset: 384)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2044, file: !2042, line: 124, baseType: !7, size: 32, offset: 448)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2044, file: !2042, line: 128, baseType: !7, size: 32, offset: 480)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2044, file: !2042, line: 131, baseType: !2072, size: 64, offset: 512)
!2072 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2042, line: 75, baseType: !2073)
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64)
!2074 = !DISubroutineType(types: !2075)
!2075 = !{!1398, !1908, !1908}
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2044, file: !2042, line: 132, baseType: !2077, size: 64, offset: 576)
!2077 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2042, line: 78, baseType: !2061)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2044, file: !2042, line: 135, baseType: !1398, size: 64, offset: 640)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2044, file: !2042, line: 136, baseType: !2080, size: 64, offset: 704)
!2080 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2042, line: 82, baseType: !2081)
!2081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2082, size: 64)
!2082 = !DISubroutineType(types: !2083)
!2083 = !{!1398, !1398, !1908, !1908}
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2044, file: !2042, line: 137, baseType: !2085, size: 64, offset: 768)
!2085 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2042, line: 83, baseType: !2086)
!2086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2087, size: 64)
!2087 = !DISubroutineType(types: !2088)
!2088 = !{null, !1398, !1398}
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2044, file: !2042, line: 141, baseType: !7, size: 32, offset: 832)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !2038, file: !1663, line: 48, baseType: !2091, size: 64, offset: 64)
!2091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2092, size: 64)
!2092 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !587, line: 35, baseType: !2093)
!2093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !587, line: 35, size: 128, elements: !2094)
!2094 = !{!2095}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2093, file: !587, line: 35, baseType: !2096, size: 128)
!2096 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !587, line: 33, baseType: !2097)
!2097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !587, line: 33, size: 128, elements: !2098)
!2098 = !{!2099, !2100, !2101}
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2097, file: !587, line: 33, baseType: !7, size: 32)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2097, file: !587, line: 33, baseType: !7, size: 32, offset: 32)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2097, file: !587, line: 33, baseType: !2102, size: 64, offset: 64)
!2102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1760, size: 64, elements: !1547)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !2038, file: !1663, line: 51, baseType: !2104, size: 64, offset: 128)
!2104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2105, size: 64)
!2105 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !2106)
!2106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !2107)
!2107 = !{!2108}
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2106, file: !6, line: 183, baseType: !2109, size: 128)
!2109 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !2110)
!2110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !2111)
!2111 = !{!2112, !2113, !2114}
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2110, file: !6, line: 182, baseType: !7, size: 32)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2110, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2110, file: !6, line: 182, baseType: !1814, size: 64, offset: 64)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !2038, file: !1663, line: 54, baseType: !1467, size: 64, offset: 192)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2038, file: !1663, line: 57, baseType: !2117, size: 128, offset: 256)
!2117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !2118, line: 31, size: 128, elements: !2119)
!2118 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2119 = !{!2120, !2121, !2122, !2123, !2124, !2125, !2126}
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !2117, file: !2118, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !2117, file: !2118, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2117, file: !2118, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !2117, file: !2118, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !2117, file: !2118, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !2117, file: !2118, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2117, file: !2118, line: 56, baseType: !1400, size: 64, offset: 64)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !2038, file: !1663, line: 60, baseType: !2117, size: 128, offset: 384)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !2038, file: !1663, line: 64, baseType: !2129, size: 64, offset: 512)
!2129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2130, size: 64)
!2130 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !2131, line: 33, flags: DIFlagFwdDecl)
!2131 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !2038, file: !1663, line: 67, baseType: !1467, size: 64, offset: 576)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !2038, file: !1663, line: 73, baseType: !2041, size: 64, offset: 640)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !2038, file: !1663, line: 77, baseType: !1400, size: 64, offset: 704)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !2038, file: !1663, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !2038, file: !1663, line: 82, baseType: !2137, size: 320, offset: 832)
!2137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1791, line: 62, size: 320, elements: !2138)
!2138 = !{!2139, !2145, !2146, !2147, !2148, !2149}
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !2137, file: !1791, line: 63, baseType: !2140, size: 64)
!2140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2141, size: 64)
!2141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1791, line: 56, size: 128, elements: !2142)
!2142 = !{!2143, !2144}
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2141, file: !1791, line: 57, baseType: !2140, size: 64)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !2141, file: !1791, line: 58, baseType: !1546, size: 8, offset: 64)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !2137, file: !1791, line: 64, baseType: !7, size: 32, offset: 64)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !2137, file: !1791, line: 66, baseType: !7, size: 32, offset: 96)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !2137, file: !1791, line: 68, baseType: !1566, size: 8, offset: 128)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !2137, file: !1791, line: 70, baseType: !1789, size: 64, offset: 192)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !2137, file: !1791, line: 71, baseType: !1797, size: 64, offset: 256)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1712, file: !1713, line: 476, baseType: !2151, size: 64, offset: 256)
!2151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2152, size: 64)
!2152 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1713, line: 476, flags: DIFlagFwdDecl)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1712, file: !1713, line: 479, baseType: !2041, size: 64, offset: 320)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1712, file: !1713, line: 484, baseType: !1467, size: 64, offset: 384)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1712, file: !1713, line: 488, baseType: !1467, size: 64, offset: 448)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1712, file: !1713, line: 493, baseType: !1467, size: 64, offset: 512)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1712, file: !1713, line: 496, baseType: !1467, size: 64, offset: 576)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1712, file: !1713, line: 501, baseType: !2159, size: 64, offset: 640)
!2159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2160, size: 64)
!2160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !2161)
!2161 = !{!2162, !2165, !2166, !2167, !2168, !2170, !2171, !2176, !2177, !2178, !2179, !2180, !2181}
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2160, file: !213, line: 2356, baseType: !2163, size: 64)
!2163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2164, size: 64)
!2164 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2160, file: !213, line: 2357, baseType: !1890, size: 64, offset: 64)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2160, file: !213, line: 2358, baseType: !1453, size: 32, offset: 128)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2160, file: !213, line: 2359, baseType: !1453, size: 32, offset: 160)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2160, file: !213, line: 2360, baseType: !2169, size: 128, offset: 192)
!2169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1453, size: 128, elements: !1446)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2160, file: !213, line: 2364, baseType: !1453, size: 32, offset: 320)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2160, file: !213, line: 2367, baseType: !2172, size: 128, offset: 384)
!2172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !2173)
!2173 = !{!2174, !2175}
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2172, file: !213, line: 2351, baseType: !1624, size: 64)
