; ModuleID = 'resource.c'
source_filename = "resource.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }
%struct.rtx_constant_pool = type opaque
%struct.incoming_args = type { i32, i32, i32, %struct.rtx_def*, %struct.ix86_args, %struct.rtx_def* }
%struct.ix86_args = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.function_subsections = type { i8*, i8*, i8*, i8*, i8* }

!647 = !DIEnumerator(name: "PARAM_MAX_SCHED_REGION_INSNS", value: 78, isUnsigned: true)
!648 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_BLOCKS", value: 79, isUnsigned: true)
!649 = !DIEnumerator(name: "PARAM_MAX_PIPELINE_REGION_INSNS", value: 80, isUnsigned: true)
!650 = !DIEnumerator(name: "PARAM_MIN_SPEC_PROB", value: 81, isUnsigned: true)
!651 = !DIEnumerator(name: "PARAM_MAX_SCHED_EXTEND_REGIONS_ITERS", value: 82, isUnsigned: true)
!652 = !DIEnumerator(name: "PARAM_MAX_SCHED_INSN_CONFLICT_DELAY", value: 83, isUnsigned: true)
!653 = !DIEnumerator(name: "PARAM_SCHED_SPEC_PROB_CUTOFF", value: 84, isUnsigned: true)
!654 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_LOOKAHEAD", value: 85, isUnsigned: true)
!655 = !DIEnumerator(name: "PARAM_SELSCHED_MAX_SCHED_TIMES", value: 86, isUnsigned: true)
!656 = !DIEnumerator(name: "PARAM_SELSCHED_INSNS_TO_RENAME", value: 87, isUnsigned: true)
!657 = !DIEnumerator(name: "PARAM_SCHED_MEM_TRUE_DEP_COST", value: 88, isUnsigned: true)
!658 = !DIEnumerator(name: "PARAM_MAX_LAST_VALUE_RTL", value: 89, isUnsigned: true)
!659 = !DIEnumerator(name: "PARAM_INTEGER_SHARE_LIMIT", value: 90, isUnsigned: true)
!660 = !DIEnumerator(name: "PARAM_MIN_VIRTUAL_MAPPINGS", value: 91, isUnsigned: true)
!661 = !DIEnumerator(name: "PARAM_VIRTUAL_MAPPINGS_TO_SYMS_RATIO", value: 92, isUnsigned: true)
!662 = !DIEnumerator(name: "PARAM_SSP_BUFFER_SIZE", value: 93, isUnsigned: true)
!663 = !DIEnumerator(name: "PARAM_MAX_JUMP_THREAD_DUPLICATION_STMTS", value: 94, isUnsigned: true)
!664 = !DIEnumerator(name: "PARAM_MAX_FIELDS_FOR_FIELD_SENSITIVE", value: 95, isUnsigned: true)
!665 = !DIEnumerator(name: "PARAM_MAX_SCHED_READY_INSNS", value: 96, isUnsigned: true)
!666 = !DIEnumerator(name: "PARAM_PREFETCH_LATENCY", value: 97, isUnsigned: true)
!667 = !DIEnumerator(name: "PARAM_SIMULTANEOUS_PREFETCHES", value: 98, isUnsigned: true)
!668 = !DIEnumerator(name: "PARAM_L1_CACHE_SIZE", value: 99, isUnsigned: true)
!669 = !DIEnumerator(name: "PARAM_L1_CACHE_LINE_SIZE", value: 100, isUnsigned: true)
!670 = !DIEnumerator(name: "PARAM_L2_CACHE_SIZE", value: 101, isUnsigned: true)
!671 = !DIEnumerator(name: "PARAM_USE_CANONICAL_TYPES", value: 102, isUnsigned: true)
!672 = !DIEnumerator(name: "PARAM_MAX_PARTIAL_ANTIC_LENGTH", value: 103, isUnsigned: true)
!673 = !DIEnumerator(name: "PARAM_SCCVN_MAX_SCC_SIZE", value: 104, isUnsigned: true)
!674 = !DIEnumerator(name: "PARAM_IRA_MAX_LOOPS_NUM", value: 105, isUnsigned: true)
!675 = !DIEnumerator(name: "PARAM_IRA_MAX_CONFLICT_TABLE_SIZE", value: 106, isUnsigned: true)
!676 = !DIEnumerator(name: "PARAM_IRA_LOOP_RESERVED_REGS", value: 107, isUnsigned: true)
!677 = !DIEnumerator(name: "PARAM_SWITCH_CONVERSION_BRANCH_RATIO", value: 108, isUnsigned: true)
!678 = !DIEnumerator(name: "PARAM_LOOP_BLOCK_TILE_SIZE", value: 109, isUnsigned: true)
!679 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_NB_SCOP_PARAMS", value: 110, isUnsigned: true)
!680 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_BBS_PER_FUNCTION", value: 111, isUnsigned: true)
!681 = !DIEnumerator(name: "PARAM_LOOP_INVARIANT_MAX_BBS_IN_LOOP", value: 112, isUnsigned: true)
!682 = !DIEnumerator(name: "PARAM_SLP_MAX_INSNS_IN_BB", value: 113, isUnsigned: true)
!683 = !DIEnumerator(name: "PARAM_MIN_INSN_TO_PREFETCH_RATIO", value: 114, isUnsigned: true)
!684 = !DIEnumerator(name: "PARAM_PREFETCH_MIN_INSN_TO_MEM_RATIO", value: 115, isUnsigned: true)
!685 = !DIEnumerator(name: "PARAM_MAX_VARTRACK_SIZE", value: 116, isUnsigned: true)
!686 = !DIEnumerator(name: "PARAM_MIN_NONDEBUG_INSN_UID", value: 117, isUnsigned: true)
!687 = !DIEnumerator(name: "PARAM_IPA_SRA_PTR_GROWTH_FACTOR", value: 118, isUnsigned: true)
!688 = !DIEnumerator(name: "LAST_PARAM", value: 119, isUnsigned: true)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !385, line: 956, baseType: !7, size: 32, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!691 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!692 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!693 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!694 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!695 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!696 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!697 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!698 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!699 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!700 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!701 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!702 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!703 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!704 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!705 = !{!384, !706, !5, !709, !710, !711, !527, !719, !720, !721}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !707, line: 42, baseType: !708)
!707 = !DIFile(filename: "./hard-reg-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!708 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!709 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "target_info", file: !3, line: 44, size: 256, elements: !713)
!713 = !{!714, !715, !716, !717, !718}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !712, file: !3, line: 46, baseType: !709, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !3, line: 47, baseType: !711, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "live_regs", scope: !712, file: !3, line: 48, baseType: !706, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !712, file: !3, line: 49, baseType: !709, size: 32, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bb_tick", scope: !712, file: !3, line: 50, baseType: !709, size: 32, offset: 224)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_lr_bb_info", file: !723, line: 826, size: 256, elements: !724)
!723 = !DIFile(filename: "./df.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!724 = !{!725, !790, !791, !792}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !722, file: !723, line: 829, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !727, line: 47, baseType: !728)
!727 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !730, line: 75, size: 256, elements: !731)
!730 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!731 = !{!732, !746, !747, !748}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !729, file: !730, line: 76, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !730, line: 68, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !730, line: 63, size: 320, elements: !736)
!736 = !{!737, !739, !740, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !730, line: 64, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !735, file: !730, line: 65, baseType: !738, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !735, file: !730, line: 66, baseType: !7, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !735, file: !730, line: 67, baseType: !742, size: 128, offset: 192)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 128, elements: !744)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !730, line: 29, baseType: !708)
!744 = !{!745}
!745 = !DISubrange(count: 2)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !729, file: !730, line: 77, baseType: !733, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !729, file: !730, line: 78, baseType: !7, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !729, file: !730, line: 79, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !730, line: 49, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !730, line: 45, size: 832, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !751, file: !730, line: 46, baseType: !738, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !751, file: !730, line: 47, baseType: !728, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !751, file: !730, line: 48, baseType: !756, size: 704, offset: 128)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !757, line: 164, size: 704, elements: !758)
!757 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!758 = !{!759, !761, !773, !774, !775, !776, !777, !778, !782, !786, !787, !788, !789}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !756, file: !757, line: 166, baseType: !760, size: 64)
!760 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !756, file: !757, line: 167, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !757, line: 157, size: 192, elements: !764)
!764 = !{!765, !768, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !763, file: !757, line: 159, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !763, file: !757, line: 160, baseType: !762, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !763, file: !757, line: 161, baseType: !770, size: 32, offset: 128)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 32, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 4)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !756, file: !757, line: 168, baseType: !766, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !756, file: !757, line: 169, baseType: !766, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !756, file: !757, line: 170, baseType: !766, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !756, file: !757, line: 171, baseType: !760, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !756, file: !757, line: 172, baseType: !709, size: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !756, file: !757, line: 176, baseType: !779, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!762, !710, !760}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !756, file: !757, line: 177, baseType: !783, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !710, !762}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !756, file: !757, line: 178, baseType: !710, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !756, file: !757, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !756, file: !757, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !756, file: !757, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !722, file: !723, line: 831, baseType: !726, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !722, file: !723, line: 834, baseType: !726, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !722, file: !723, line: 835, baseType: !726, size: 64, offset: 192)
!793 = !{!794, !0, !803, !805, !807, !809}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "start_of_epilogue_needs", scope: !2, file: !3, line: 56, type: !796, isLocal: true, isDefinition: true)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "resources", file: !562, line: 33, size: 128, elements: !797)
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !796, file: !562, line: 35, baseType: !767, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "unch_memory", scope: !796, file: !562, line: 36, baseType: !767, size: 8, offset: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !796, file: !562, line: 37, baseType: !767, size: 8, offset: 16)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !796, file: !562, line: 38, baseType: !767, size: 8, offset: 24)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !796, file: !562, line: 39, baseType: !706, size: 64, offset: 64)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "bb_ticks", scope: !2, file: !3, line: 69, type: !720, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "current_live_regs", scope: !2, file: !3, line: 74, type: !706, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "pending_dead_regs", scope: !2, file: !3, line: 79, type: !706, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "target_hash_table", scope: !2, file: !3, line: 62, type: !719, isLocal: true, isDefinition: true)
!811 = !{i32 7, !"Dwarf Version", i32 4}
!812 = !{i32 2, !"Debug Info Version", i32 3}
!813 = !{i32 1, !"wchar_size", i32 4}
!814 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!815 = distinct !DISubprogram(name: "mark_referenced_resources", scope: !3, file: !3, line: 205, type: !816, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1928)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !818, !1927, !987}
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !727, line: 50, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !820, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !820, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !820, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !820, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !820, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !820, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !820, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !820, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !820, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !820, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !820, file: !385, line: 321, baseType: !833, size: 320, offset: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !834)
!834 = !{!835, !1862, !1864, !1925, !1926}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !833, file: !385, line: 316, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 64, elements: !854)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !839)
!839 = !{!840, !841, !842, !845, !846, !856, !857, !869, !872, !873, !1840, !1841, !1852, !1859}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !838, file: !385, line: 168, baseType: !709, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !838, file: !385, line: 169, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !838, file: !385, line: 170, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !838, file: !385, line: 171, baseType: !818, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !838, file: !385, line: 172, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !727, line: 53, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !849, file: !385, line: 360, baseType: !709, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !849, file: !385, line: 361, baseType: !853, size: 64, offset: 64)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 64, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 1)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !838, file: !385, line: 173, baseType: !5, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !838, file: !385, line: 174, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !859, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !859, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !859, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !859, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !859, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !859, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !859, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !859, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !838, file: !385, line: 175, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !838, file: !385, line: 176, baseType: !728, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !838, file: !385, line: 177, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !727, line: 56, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !877)
!877 = !{!878, !911, !917, !928, !947, !958, !963, !970, !976, !990, !1002, !1040, !1045, !1073, !1081, !1082, !1087, !1096, !1102, !1107, !1111, !1115, !1476, !1525, !1531, !1537, !1544, !1570, !1584, !1601, !1613, !1635, !1650, !1822}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !876, file: !158, line: 3372, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !879, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !879, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !879, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !879, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !879, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !879, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !879, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !879, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !879, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !879, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !879, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !879, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !879, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !879, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !879, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !879, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !879, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !879, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !879, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !879, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !879, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !879, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !879, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !879, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !879, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !879, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !879, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !879, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !879, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !879, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !158, line: 3373, baseType: !912, size: 192)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !913)
!913 = !{!914, !915, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !912, file: !158, line: 403, baseType: !879, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !912, file: !158, line: 404, baseType: !874, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !912, file: !158, line: 405, baseType: !874, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !876, file: !158, line: 3374, baseType: !918, size: 320)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !158, line: 1385, baseType: !912, size: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !918, file: !158, line: 1386, baseType: !922, size: 128, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !923, line: 58, baseType: !924)
!923 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !923, line: 54, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !924, file: !923, line: 56, baseType: !708, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !924, file: !923, line: 57, baseType: !760, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !876, file: !158, line: 3375, baseType: !929, size: 256)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !158, line: 1398, baseType: !912, size: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !929, file: !158, line: 1399, baseType: !933, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !935, line: 52, size: 256, elements: !936)
!935 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!936 = !{!937, !938, !939, !940, !941, !942, !943}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !934, file: !935, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !934, file: !935, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !934, file: !935, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !934, file: !935, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !934, file: !935, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !934, file: !935, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !934, file: !935, line: 62, baseType: !944, size: 192, offset: 64)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 192, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 3)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !876, file: !158, line: 3376, baseType: !948, size: 256)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !158, line: 1409, baseType: !912, size: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !948, file: !158, line: 1410, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !954, line: 27, size: 192, elements: !955)
!954 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !953, file: !954, line: 29, baseType: !922, size: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !953, file: !954, line: 30, baseType: !5, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !876, file: !158, line: 3377, baseType: !959, size: 256)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !158, line: 1438, baseType: !912, size: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !959, file: !158, line: 1439, baseType: !874, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !876, file: !158, line: 3378, baseType: !964, size: 256)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !158, line: 1419, baseType: !912, size: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !964, file: !158, line: 1420, baseType: !709, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !964, file: !158, line: 1421, baseType: !969, size: 8, offset: 224)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 8, elements: !854)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !876, file: !158, line: 3379, baseType: !971, size: 320)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !158, line: 1429, baseType: !912, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !971, file: !158, line: 1430, baseType: !874, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !971, file: !158, line: 1431, baseType: !874, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !876, file: !158, line: 3380, baseType: !977, size: 320)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !158, line: 1461, baseType: !912, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !977, file: !158, line: 1462, baseType: !981, size: 128, offset: 192)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !982, line: 31, size: 128, elements: !983)
!982 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!983 = !{!984, !988, !989}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !981, file: !982, line: 32, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !981, file: !982, line: 33, baseType: !7, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !981, file: !982, line: 34, baseType: !7, size: 32, offset: 96)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !876, file: !158, line: 3381, baseType: !991, size: 384)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !992)
!992 = !{!993, !994, !999, !1000, !1001}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !991, file: !158, line: 2508, baseType: !912, size: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !991, file: !158, line: 2509, baseType: !995, size: 32, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !996, line: 58, baseType: !997)
!996 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !998, line: 44, baseType: !7)
!998 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!999 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !991, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !158, line: 2511, baseType: !874, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !991, file: !158, line: 2512, baseType: !874, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !876, file: !158, line: 3382, baseType: !1003, size: 896)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !158, line: 2653, baseType: !991, size: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1003, file: !158, line: 2654, baseType: !874, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1003, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1003, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1003, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1003, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1003, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1003, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1003, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1003, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1003, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1003, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1003, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1003, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1003, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1003, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1003, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1003, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1003, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1003, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1003, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1003, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1003, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1003, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1003, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1003, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1003, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1003, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1003, file: !158, line: 2705, baseType: !874, size: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1003, file: !158, line: 2706, baseType: !874, size: 64, offset: 640)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1003, file: !158, line: 2707, baseType: !874, size: 64, offset: 704)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1003, file: !158, line: 2708, baseType: !874, size: 64, offset: 768)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1003, file: !158, line: 2711, baseType: !1038, size: 64, offset: 832)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !876, file: !158, line: 3383, baseType: !1041, size: 960)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !158, line: 2757, baseType: !1003, size: 896)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1041, file: !158, line: 2758, baseType: !818, size: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !876, file: !158, line: 3384, baseType: !1046, size: 1472)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1047)
!1047 = !{!1048, !1069, !1070, !1071, !1072}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !158, line: 3115, baseType: !1049, size: 1216)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1049, file: !158, line: 2985, baseType: !1041, size: 960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1049, file: !158, line: 2986, baseType: !874, size: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1049, file: !158, line: 2987, baseType: !874, size: 64, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1049, file: !158, line: 2988, baseType: !874, size: 64, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1049, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1049, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1049, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1049, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1049, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1049, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1049, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1049, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1049, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1049, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1049, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1049, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1049, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1049, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1046, file: !158, line: 3117, baseType: !874, size: 64, offset: 1216)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1046, file: !158, line: 3119, baseType: !874, size: 64, offset: 1280)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1046, file: !158, line: 3121, baseType: !874, size: 64, offset: 1344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1046, file: !158, line: 3123, baseType: !874, size: 64, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !876, file: !158, line: 3385, baseType: !1074, size: 1088)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !158, line: 2875, baseType: !1041, size: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1074, file: !158, line: 2876, baseType: !818, size: 64, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1074, file: !158, line: 2877, baseType: !1079, size: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !876, file: !158, line: 3386, baseType: !1049, size: 1216)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !876, file: !158, line: 3387, baseType: !1083, size: 1280)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !158, line: 3094, baseType: !1049, size: 1216)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1083, file: !158, line: 3095, baseType: !1079, size: 64, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !876, file: !158, line: 3388, baseType: !1088, size: 1216)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !158, line: 2825, baseType: !1003, size: 896)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1088, file: !158, line: 2827, baseType: !874, size: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1088, file: !158, line: 2828, baseType: !874, size: 64, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1088, file: !158, line: 2829, baseType: !874, size: 64, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1088, file: !158, line: 2830, baseType: !874, size: 64, offset: 1088)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1088, file: !158, line: 2831, baseType: !874, size: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !876, file: !158, line: 3389, baseType: !1097, size: 1024)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !158, line: 2851, baseType: !1041, size: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1097, file: !158, line: 2852, baseType: !709, size: 32, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1097, file: !158, line: 2853, baseType: !709, size: 32, offset: 992)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !876, file: !158, line: 3390, baseType: !1103, size: 1024)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !158, line: 2858, baseType: !1041, size: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1103, file: !158, line: 2859, baseType: !1079, size: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !876, file: !158, line: 3391, baseType: !1108, size: 960)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1109)
!1109 = !{!1110}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !158, line: 2863, baseType: !1041, size: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !876, file: !158, line: 3392, baseType: !1112, size: 1472)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !158, line: 3305, baseType: !1046, size: 1472)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !876, file: !158, line: 3393, baseType: !1116, size: 1792)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1117)
!1117 = !{!1118, !1119, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !158, line: 3249, baseType: !1046, size: 1472)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1116, file: !158, line: 3251, baseType: !1120, size: 64, offset: 1472)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1122, line: 463, size: 1152, elements: !1123)
!1122 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1123 = !{!1124, !1288, !1392, !1393, !1396, !1399, !1400, !1401, !1402, !1403, !1404, !1428, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1121, file: !1122, line: 464, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1127)
!1127 = !{!1128, !1177, !1190, !1204, !1256, !1269}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1126, file: !135, line: 197, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1165, !1174, !1175, !1176}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1131, file: !135, line: 119, baseType: !1130, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1131, file: !135, line: 122, baseType: !1130, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1131, file: !135, line: 123, baseType: !1130, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1131, file: !135, line: 126, baseType: !709, size: 32, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1131, file: !135, line: 165, baseType: !1139, size: 192, offset: 256)
!1139 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1140)
!1140 = !{!1141, !1154, !1160}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1139, file: !135, line: 137, baseType: !1142, size: 128)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1143)
!1143 = !{!1144, !1153}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1142, file: !135, line: 135, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1146, file: !135, line: 96, baseType: !1145, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1146, file: !135, line: 97, baseType: !1145, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1146, file: !135, line: 101, baseType: !874, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1146, file: !135, line: 106, baseType: !874, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1146, file: !135, line: 111, baseType: !874, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1142, file: !135, line: 136, baseType: !1145, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1139, file: !135, line: 151, baseType: !1155, size: 192)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1156)
!1156 = !{!1157, !1158, !1159}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1155, file: !135, line: 141, baseType: !874, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1155, file: !135, line: 145, baseType: !874, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1155, file: !135, line: 150, baseType: !709, size: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1139, file: !135, line: 164, baseType: !1161, size: 128)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1162)
!1162 = !{!1163, !1164}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1161, file: !135, line: 161, baseType: !874, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1161, file: !135, line: 163, baseType: !995, size: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1131, file: !135, line: 168, baseType: !1166, size: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1167, file: !135, line: 70, baseType: !1166, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1167, file: !135, line: 73, baseType: !1130, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1167, file: !135, line: 78, baseType: !874, size: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1167, file: !135, line: 85, baseType: !818, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1167, file: !135, line: 88, baseType: !709, size: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1131, file: !135, line: 173, baseType: !818, size: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1131, file: !135, line: 173, baseType: !818, size: 64, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1131, file: !135, line: 177, baseType: !987, size: 8, offset: 640)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1126, file: !135, line: 200, baseType: !1178, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1181)
!1181 = !{!1182}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1180, file: !135, line: 185, baseType: !1183, size: 128)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1185)
!1185 = !{!1186, !1187, !1188}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1184, file: !135, line: 184, baseType: !7, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1184, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1184, file: !135, line: 184, baseType: !1189, size: 64, offset: 64)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 64, elements: !854)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1126, file: !135, line: 203, baseType: !1191, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1194)
!1194 = !{!1195}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1193, file: !135, line: 189, baseType: !1196, size: 128)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !135, line: 188, baseType: !7, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1197, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1197, file: !135, line: 188, baseType: !1202, size: 64, offset: 64)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 64, elements: !854)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1166)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1126, file: !135, line: 207, baseType: !1205, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1206, line: 144, baseType: !1207)
!1206 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1206, line: 100, size: 896, elements: !1209)
!1209 = !{!1210, !1218, !1223, !1228, !1230, !1233, !1234, !1235, !1236, !1237, !1242, !1244, !1245, !1250, !1255}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1208, file: !1206, line: 102, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1206, line: 52, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1206, line: 47, baseType: !7)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1208, file: !1206, line: 105, baseType: !1219, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1206, line: 59, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!709, !1216, !1216}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1208, file: !1206, line: 108, baseType: !1224, size: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1206, line: 63, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{null, !710}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1208, file: !1206, line: 111, baseType: !1229, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !1206, line: 114, baseType: !1231, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1232, line: 46, baseType: !708)
!1232 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1208, file: !1206, line: 117, baseType: !1231, size: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1208, file: !1206, line: 120, baseType: !1231, size: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1208, file: !1206, line: 124, baseType: !7, size: 32, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1208, file: !1206, line: 128, baseType: !7, size: 32, offset: 480)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1208, file: !1206, line: 131, baseType: !1238, size: 64, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1206, line: 75, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!710, !1231, !1231}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1208, file: !1206, line: 132, baseType: !1243, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1206, line: 78, baseType: !1225)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1208, file: !1206, line: 135, baseType: !710, size: 64, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1208, file: !1206, line: 136, baseType: !1246, size: 64, offset: 704)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1206, line: 82, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!710, !710, !1231, !1231}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1208, file: !1206, line: 137, baseType: !1251, size: 64, offset: 768)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1206, line: 83, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !710, !710}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1208, file: !1206, line: 141, baseType: !7, size: 32, offset: 832)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1126, file: !135, line: 211, baseType: !1257, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1260)
!1260 = !{!1261}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1259, file: !158, line: 183, baseType: !1262, size: 128)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1264)
!1264 = !{!1265, !1266, !1267}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1263, file: !158, line: 182, baseType: !7, size: 32)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1263, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1263, file: !158, line: 182, baseType: !1268, size: 64, offset: 64)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 64, elements: !854)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1126, file: !135, line: 220, baseType: !1270, size: 64, offset: 320)
!1270 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1271)
!1271 = !{!1272, !1273}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1270, file: !135, line: 218, baseType: !1257, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1270, file: !135, line: 219, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1276, line: 29, baseType: !1277)
!1276 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1276, line: 29, size: 96, elements: !1278)
!1278 = !{!1279}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1277, file: !1276, line: 29, baseType: !1280, size: 96)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1276, line: 27, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1276, line: 27, size: 96, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1281, file: !1276, line: 27, baseType: !7, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1281, file: !1276, line: 27, baseType: !7, size: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1281, file: !1276, line: 27, baseType: !1286, size: 8, offset: 64)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1287, size: 8, elements: !854)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1276, line: 26, baseType: !987)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1121, file: !1122, line: 467, baseType: !1289, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1291)
!1291 = !{!1292, !1367, !1368, !1381, !1382, !1383, !1384, !1385, !1386, !1388, !1390, !1391}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1290, file: !142, line: 377, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !727, line: 111, baseType: !1294)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1296)
!1296 = !{!1297, !1332, !1333, !1334, !1337, !1341, !1342, !1343, !1361, !1362, !1363, !1364, !1365, !1366}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1295, file: !142, line: 219, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1301)
!1301 = !{!1302}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1300, file: !142, line: 151, baseType: !1303, size: 128)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1305)
!1305 = !{!1306, !1307, !1308}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1304, file: !142, line: 150, baseType: !7, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1304, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1304, file: !142, line: 150, baseType: !1309, size: 64, offset: 64)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1310, size: 64, elements: !854)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !727, line: 108, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1324, !1325, !1326, !1327, !1328, !1329, !1330}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1312, file: !142, line: 124, baseType: !1294, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1312, file: !142, line: 125, baseType: !1294, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1312, file: !142, line: 131, baseType: !1317, size: 64, offset: 128)
!1317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1318)
!1318 = !{!1319, !1323}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1317, file: !142, line: 129, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !727, line: 66, baseType: !1321)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !727, line: 65, flags: DIFlagFwdDecl)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1317, file: !142, line: 130, baseType: !818, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1312, file: !142, line: 134, baseType: !710, size: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1312, file: !142, line: 137, baseType: !874, size: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1312, file: !142, line: 138, baseType: !995, size: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1312, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1312, file: !142, line: 144, baseType: !709, size: 32, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1312, file: !142, line: 145, baseType: !709, size: 32, offset: 416)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1312, file: !142, line: 146, baseType: !1331, size: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !760)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1295, file: !142, line: 220, baseType: !1298, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1295, file: !142, line: 223, baseType: !710, size: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1295, file: !142, line: 226, baseType: !1335, size: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1295, file: !142, line: 229, baseType: !1338, size: 128, offset: 256)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 128, elements: !744)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1295, file: !142, line: 232, baseType: !1294, size: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1295, file: !142, line: 233, baseType: !1294, size: 64, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1295, file: !142, line: 238, baseType: !1344, size: 64, offset: 512)
!1344 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1345)
!1345 = !{!1346, !1352}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1344, file: !142, line: 236, baseType: !1347, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1348, file: !142, line: 275, baseType: !1320, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1348, file: !142, line: 278, baseType: !1320, size: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1344, file: !142, line: 237, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1354, file: !142, line: 261, baseType: !818, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1354, file: !142, line: 262, baseType: !818, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1354, file: !142, line: 266, baseType: !818, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1354, file: !142, line: 267, baseType: !818, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1354, file: !142, line: 270, baseType: !709, size: 32, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1295, file: !142, line: 241, baseType: !1331, size: 64, offset: 576)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1295, file: !142, line: 244, baseType: !709, size: 32, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1295, file: !142, line: 247, baseType: !709, size: 32, offset: 672)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1295, file: !142, line: 250, baseType: !709, size: 32, offset: 704)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1295, file: !142, line: 253, baseType: !709, size: 32, offset: 736)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1295, file: !142, line: 256, baseType: !709, size: 32, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1290, file: !142, line: 378, baseType: !1293, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1290, file: !142, line: 381, baseType: !1369, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1372)
!1372 = !{!1373}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1371, file: !142, line: 282, baseType: !1374, size: 128)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1376)
!1376 = !{!1377, !1378, !1379}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1375, file: !142, line: 281, baseType: !7, size: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1375, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1375, file: !142, line: 281, baseType: !1380, size: 64, offset: 64)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1293, size: 64, elements: !854)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1290, file: !142, line: 384, baseType: !709, size: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1290, file: !142, line: 387, baseType: !709, size: 32, offset: 224)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1290, file: !142, line: 390, baseType: !709, size: 32, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1290, file: !142, line: 394, baseType: !1369, size: 64, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1290, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1290, file: !142, line: 399, baseType: !1387, size: 64, offset: 416)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !744)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1290, file: !142, line: 402, baseType: !1389, size: 64, offset: 480)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !744)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1290, file: !142, line: 406, baseType: !709, size: 32, offset: 544)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1290, file: !142, line: 409, baseType: !709, size: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1121, file: !1122, line: 470, baseType: !1321, size: 64, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1121, file: !1122, line: 473, baseType: !1394, size: 64, offset: 192)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1122, line: 166, flags: DIFlagFwdDecl)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1121, file: !1122, line: 476, baseType: !1397, size: 64, offset: 256)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1122, line: 476, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1121, file: !1122, line: 479, baseType: !1205, size: 64, offset: 320)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1121, file: !1122, line: 484, baseType: !874, size: 64, offset: 384)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1121, file: !1122, line: 488, baseType: !874, size: 64, offset: 448)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1121, file: !1122, line: 493, baseType: !874, size: 64, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1121, file: !1122, line: 496, baseType: !874, size: 64, offset: 576)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1121, file: !1122, line: 501, baseType: !1405, size: 64, offset: 640)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1407)
!1407 = !{!1408, !1411, !1412, !1413, !1414, !1416, !1417, !1422, !1423, !1424, !1425, !1426, !1427}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1406, file: !153, line: 2356, baseType: !1409, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1406, file: !153, line: 2357, baseType: !843, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1406, file: !153, line: 2358, baseType: !709, size: 32, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1406, file: !153, line: 2359, baseType: !709, size: 32, offset: 160)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1406, file: !153, line: 2360, baseType: !1415, size: 128, offset: 192)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 128, elements: !771)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1406, file: !153, line: 2364, baseType: !709, size: 32, offset: 320)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1406, file: !153, line: 2367, baseType: !1418, size: 128, offset: 384)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1418, file: !153, line: 2351, baseType: !818, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1418, file: !153, line: 2352, baseType: !760, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1406, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1406, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1406, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1406, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1406, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1406, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1121, file: !1122, line: 504, baseType: !1429, size: 64, offset: 704)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1122, line: 504, flags: DIFlagFwdDecl)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1121, file: !1122, line: 507, baseType: !1205, size: 64, offset: 768)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1121, file: !1122, line: 510, baseType: !709, size: 32, offset: 832)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1121, file: !1122, line: 513, baseType: !709, size: 32, offset: 864)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1121, file: !1122, line: 516, baseType: !995, size: 32, offset: 896)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1121, file: !1122, line: 519, baseType: !995, size: 32, offset: 928)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1121, file: !1122, line: 522, baseType: !7, size: 32, offset: 960)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1121, file: !1122, line: 523, baseType: !7, size: 32, offset: 992)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1121, file: !1122, line: 528, baseType: !843, size: 64, offset: 1024)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1121, file: !1122, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1121, file: !1122, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1121, file: !1122, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1121, file: !1122, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1121, file: !1122, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1121, file: !1122, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1121, file: !1122, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1121, file: !1122, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1121, file: !1122, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1121, file: !1122, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1121, file: !1122, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1121, file: !1122, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1121, file: !1122, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1121, file: !1122, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1121, file: !1122, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1121, file: !1122, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1116, file: !158, line: 3254, baseType: !874, size: 64, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1116, file: !158, line: 3257, baseType: !874, size: 64, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1116, file: !158, line: 3258, baseType: !874, size: 64, offset: 1664)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1116, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1116, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1116, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1116, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1116, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1116, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1116, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1116, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1116, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1116, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1116, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
