; ModuleID = 'ggc-page.c'
source_filename = "ggc-page.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.globals = type { [84 x %struct.page_entry*], [84 x %struct.page_entry*], %struct.page_table_chain*, i64, i64, i64, i64, i64, i64, i64, i16, %struct.page_entry*, %struct.page_group*, %struct._IO_FILE*, i32, i32, i32*, i32, i32, %struct.page_entry**, i64** }
%struct.page_table_chain = type { %struct.page_table_chain*, i64, [256 x %struct.page_entry**] }
%struct.page_entry = type { %struct.page_entry*, %struct.page_entry*, i64, i8*, %struct.page_group*, i64, i16, i16, i16, i8, [1 x i64] }
%struct.page_group = type { %struct.page_group*, i8*, i64, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon = type { i64, i32 }
%struct.alloc_zone = type opaque
%struct.ggc_statistics = type { i32 }
%struct.ggc_pch_data = type { %struct.ggc_pch_ondisk, [84 x i64], [84 x i64] }
%struct.ggc_pch_ondisk = type { [84 x i32] }

@.str = private unnamed_addr constant [19 x i8] c"Head=%p, Tail=%p:\0A\00", align 1

!177 = !DIEnumerator(name: "gt_ggc_e_9cpp_macro", value: 168, isUnsigned: true)
!178 = !DIEnumerator(name: "gt_ggc_e_9cpp_token", value: 169, isUnsigned: true)
!179 = !DIEnumerator(name: "gt_ggc_e_9line_maps", value: 170, isUnsigned: true)
!180 = !DIEnumerator(name: "gt_e_II17splay_tree_node_s", value: 171, isUnsigned: true)
!181 = !DIEnumerator(name: "gt_e_SP9tree_node17splay_tree_node_s", value: 172, isUnsigned: true)
!182 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node17splay_tree_node_s", value: 173, isUnsigned: true)
!183 = !DIEnumerator(name: "gt_e_IP9tree_node17splay_tree_node_s", value: 174, isUnsigned: true)
!184 = !DIEnumerator(name: "gt_e_P15interface_tuple4htab", value: 175, isUnsigned: true)
!185 = !DIEnumerator(name: "gt_e_P16volatilized_type4htab", value: 176, isUnsigned: true)
!186 = !DIEnumerator(name: "gt_e_P17string_descriptor4htab", value: 177, isUnsigned: true)
!187 = !DIEnumerator(name: "gt_e_P14type_assertion4htab", value: 178, isUnsigned: true)
!188 = !DIEnumerator(name: "gt_e_P18treetreehash_entry4htab", value: 179, isUnsigned: true)
!189 = !DIEnumerator(name: "gt_e_P17module_htab_entry4htab", value: 180, isUnsigned: true)
!190 = !DIEnumerator(name: "gt_e_P21pending_abstract_type4htab", value: 181, isUnsigned: true)
!191 = !DIEnumerator(name: "gt_e_P10spec_entry4htab", value: 182, isUnsigned: true)
!192 = !DIEnumerator(name: "gt_e_P16cxx_int_tree_map4htab", value: 183, isUnsigned: true)
!193 = !DIEnumerator(name: "gt_e_P17named_label_entry4htab", value: 184, isUnsigned: true)
!194 = !DIEnumerator(name: "gt_e_P12tree_int_map4htab", value: 185, isUnsigned: true)
!195 = !DIEnumerator(name: "gt_e_P20lto_symtab_entry_def4htab", value: 186, isUnsigned: true)
!196 = !DIEnumerator(name: "gt_e_IP9tree_node12splay_tree_s", value: 187, isUnsigned: true)
!197 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node12splay_tree_s", value: 188, isUnsigned: true)
!198 = !DIEnumerator(name: "gt_e_P12varpool_node4htab", value: 189, isUnsigned: true)
!199 = !DIEnumerator(name: "gt_e_P13scev_info_str4htab", value: 190, isUnsigned: true)
!200 = !DIEnumerator(name: "gt_e_P23constant_descriptor_rtx4htab", value: 191, isUnsigned: true)
!201 = !DIEnumerator(name: "gt_e_P24constant_descriptor_tree4htab", value: 192, isUnsigned: true)
!202 = !DIEnumerator(name: "gt_e_P12object_block4htab", value: 193, isUnsigned: true)
!203 = !DIEnumerator(name: "gt_e_P7section4htab", value: 194, isUnsigned: true)
!204 = !DIEnumerator(name: "gt_e_P17tree_priority_map4htab", value: 195, isUnsigned: true)
!205 = !DIEnumerator(name: "gt_e_P8tree_map4htab", value: 196, isUnsigned: true)
!206 = !DIEnumerator(name: "gt_e_P9type_hash4htab", value: 197, isUnsigned: true)
!207 = !DIEnumerator(name: "gt_e_P13libfunc_entry4htab", value: 198, isUnsigned: true)
!208 = !DIEnumerator(name: "gt_e_P23temp_slot_address_entry4htab", value: 199, isUnsigned: true)
!209 = !DIEnumerator(name: "gt_e_P15throw_stmt_node4htab", value: 200, isUnsigned: true)
!210 = !DIEnumerator(name: "gt_e_P9reg_attrs4htab", value: 201, isUnsigned: true)
!211 = !DIEnumerator(name: "gt_e_P9mem_attrs4htab", value: 202, isUnsigned: true)
!212 = !DIEnumerator(name: "gt_e_P7rtx_def4htab", value: 203, isUnsigned: true)
!213 = !DIEnumerator(name: "gt_e_SP9tree_node12splay_tree_s", value: 204, isUnsigned: true)
!214 = !DIEnumerator(name: "gt_e_P10vcall_insn4htab", value: 205, isUnsigned: true)
!215 = !DIEnumerator(name: "gt_e_P16var_loc_list_def4htab", value: 206, isUnsigned: true)
!216 = !DIEnumerator(name: "gt_e_P10die_struct4htab", value: 207, isUnsigned: true)
!217 = !DIEnumerator(name: "gt_e_P15dwarf_file_data4htab", value: 208, isUnsigned: true)
!218 = !DIEnumerator(name: "gt_e_P20indirect_string_node4htab", value: 209, isUnsigned: true)
!219 = !DIEnumerator(name: "gt_e_P11cgraph_node4htab", value: 210, isUnsigned: true)
!220 = !DIEnumerator(name: "gt_e_II12splay_tree_s", value: 211, isUnsigned: true)
!221 = !DIEnumerator(name: "gt_e_P27cgraph_node_set_element_def4htab", value: 212, isUnsigned: true)
!222 = !DIEnumerator(name: "gt_e_P11cgraph_edge4htab", value: 213, isUnsigned: true)
!223 = !DIEnumerator(name: "gt_e_P9loop_exit4htab", value: 214, isUnsigned: true)
!224 = !DIEnumerator(name: "gt_e_P24types_used_by_vars_entry4htab", value: 215, isUnsigned: true)
!225 = !DIEnumerator(name: "gt_e_P9tree_node4htab", value: 216, isUnsigned: true)
!226 = !DIEnumerator(name: "gt_types_enum_last", value: 217, isUnsigned: true)
!227 = !{!228, !229, !230, !233, !235, !237, !238, !268, !270, !248, !244, !283, !269, !285}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!229 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 46, baseType: !229)
!236 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_entry", file: !3, line: 304, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_entry", file: !3, line: 260, size: 512, elements: !242)
!242 = !{!243, !245, !246, !247, !249, !257, !258, !260, !261, !262, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !3, line: 264, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !241, file: !3, line: 269, baseType: !244, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !241, file: !3, line: 273, baseType: !235, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !241, file: !3, line: 276, baseType: !248, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !241, file: !3, line: 280, baseType: !250, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_group", file: !3, line: 309, size: 256, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !3, line: 312, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "allocation", scope: !251, file: !3, line: 315, baseType: !248, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !251, file: !3, line: 318, baseType: !235, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !251, file: !3, line: 321, baseType: !7, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "index_by_depth", scope: !241, file: !3, line: 285, baseType: !229, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth", scope: !241, file: !3, line: 288, baseType: !259, size: 16, offset: 384)
!259 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num_free_objects", scope: !241, file: !3, line: 291, baseType: !259, size: 16, offset: 400)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next_bit_hint", scope: !241, file: !3, line: 295, baseType: !259, size: 16, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !241, file: !3, line: 298, baseType: !263, size: 8, offset: 432)
!263 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "in_use_p", scope: !241, file: !3, line: 303, baseType: !265, size: 64, offset: 448)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 64, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 1)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_pch_data", file: !3, line: 2108, size: 13440, elements: !272)
!272 = !{!273, !280, !282}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !271, file: !3, line: 2110, baseType: !274, size: 2688)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_pch_ondisk", file: !3, line: 2103, size: 2688, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "totals", scope: !274, file: !3, line: 2105, baseType: !277, size: 2688)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2688, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 84)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !3, line: 2111, baseType: !281, size: 5376, offset: 2688)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 5376, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !271, file: !3, line: 2112, baseType: !281, size: 5376, offset: 8064)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_group", file: !3, line: 322, baseType: !251)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page_table_chain", file: !3, line: 335, size: 16512, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !3, line: 337, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "high_bits", scope: !286, file: !3, line: 338, baseType: !235, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !286, file: !3, line: 339, baseType: !291, size: 16384, offset: 128)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 16384, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 256)
!294 = !{!295, !356, !358, !360, !0, !367, !372}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "emptyBytes", scope: !297, file: !3, line: 2200, type: !355, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "ggc_pch_write_object", scope: !3, file: !3, line: 2195, type: !298, scopeLine: 2198, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !354)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !270, !300, !228, !228, !235, !263}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !302, line: 7, baseType: !303)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !304, line: 49, size: 1728, elements: !305)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!305 = !{!306, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !322, !324, !325, !326, !330, !331, !333, !335, !338, !340, !343, !346, !347, !348, !349, !350}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !303, file: !304, line: 51, baseType: !307, size: 32)
!307 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !303, file: !304, line: 54, baseType: !248, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !303, file: !304, line: 55, baseType: !248, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !303, file: !304, line: 56, baseType: !248, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !303, file: !304, line: 57, baseType: !248, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !303, file: !304, line: 58, baseType: !248, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !303, file: !304, line: 59, baseType: !248, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !303, file: !304, line: 60, baseType: !248, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !303, file: !304, line: 61, baseType: !248, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !303, file: !304, line: 64, baseType: !248, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !303, file: !304, line: 65, baseType: !248, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !303, file: !304, line: 66, baseType: !248, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !303, file: !304, line: 68, baseType: !320, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !304, line: 36, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !303, file: !304, line: 70, baseType: !323, size: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !303, file: !304, line: 72, baseType: !307, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !303, file: !304, line: 73, baseType: !307, size: 32, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !303, file: !304, line: 74, baseType: !327, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !328, line: 152, baseType: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!329 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !303, file: !304, line: 77, baseType: !259, size: 16, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !303, file: !304, line: 78, baseType: !332, size: 8, offset: 1040)
!332 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !303, file: !304, line: 79, baseType: !334, size: 8, offset: 1048)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 8, elements: !266)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !303, file: !304, line: 81, baseType: !336, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !304, line: 43, baseType: null)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !303, file: !304, line: 89, baseType: !339, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !328, line: 153, baseType: !329)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !303, file: !304, line: 91, baseType: !341, size: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !304, line: 37, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !303, file: !304, line: 92, baseType: !344, size: 64, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !304, line: 38, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !303, file: !304, line: 93, baseType: !323, size: 64, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !303, file: !304, line: 94, baseType: !228, size: 64, offset: 1408)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !303, file: !304, line: 95, baseType: !235, size: 64, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !303, file: !304, line: 96, baseType: !307, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !303, file: !304, line: 98, baseType: !351, size: 160, offset: 1568)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 160, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 20)
!354 = !{}
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 2048, elements: !292)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "objects_per_page_table", scope: !2, file: !3, line: 241, type: !277, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "object_size_table", scope: !2, file: !3, line: 245, type: !281, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "inverse_table", scope: !2, file: !3, line: 256, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 10752, elements: !278)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 251, size: 128, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !363, file: !3, line: 253, baseType: !235, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !363, file: !3, line: 254, baseType: !7, size: 32, offset: 64)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "size_lookup", scope: !2, file: !3, line: 1041, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 4096, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 512)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "extra_order_size_table", scope: !2, file: !3, line: 200, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 1280, elements: !352)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "globals", file: !3, line: 355, size: 11840, elements: !377)
!377 = !{!378, !380, !381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !376, file: !3, line: 361, baseType: !379, size: 5376)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 5376, elements: !278)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "page_tails", scope: !376, file: !3, line: 366, baseType: !379, size: 5376, offset: 5376)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !376, file: !3, line: 369, baseType: !382, size: 64, offset: 10752)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "page_table", file: !3, line: 340, baseType: !285)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pagesize", scope: !376, file: !3, line: 372, baseType: !235, size: 64, offset: 10816)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lg_pagesize", scope: !376, file: !3, line: 373, baseType: !235, size: 64, offset: 10880)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !376, file: !3, line: 376, baseType: !235, size: 64, offset: 10944)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_last_gc", scope: !376, file: !3, line: 379, baseType: !235, size: 64, offset: 11008)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_mapped", scope: !376, file: !3, line: 382, baseType: !235, size: 64, offset: 11072)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth_allocations", scope: !376, file: !3, line: 385, baseType: !229, size: 64, offset: 11136)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth_collections", scope: !376, file: !3, line: 388, baseType: !229, size: 64, offset: 11200)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "context_depth", scope: !376, file: !3, line: 391, baseType: !259, size: 16, offset: 11264)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "free_pages", scope: !376, file: !3, line: 399, baseType: !239, size: 64, offset: 11328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "page_groups", scope: !376, file: !3, line: 402, baseType: !283, size: 64, offset: 11392)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "debug_file", scope: !376, file: !3, line: 406, baseType: !300, size: 64, offset: 11456)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "depth_in_use", scope: !376, file: !3, line: 409, baseType: !7, size: 32, offset: 11520)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "depth_max", scope: !376, file: !3, line: 412, baseType: !7, size: 32, offset: 11552)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !376, file: !3, line: 417, baseType: !237, size: 64, offset: 11584)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth_in_use", scope: !376, file: !3, line: 420, baseType: !7, size: 32, offset: 11648)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth_max", scope: !376, file: !3, line: 423, baseType: !7, size: 32, offset: 11680)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "by_depth", scope: !376, file: !3, line: 430, baseType: !238, size: 64, offset: 11712)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "save_in_use", scope: !376, file: !3, line: 435, baseType: !268, size: 64, offset: 11776)
!401 = !{i32 7, !"Dwarf Version", i32 4}
!402 = !{i32 2, !"Debug Info Version", i32 3}
!403 = !{i32 1, !"wchar_size", i32 4}
!404 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!405 = distinct !DISubprogram(name: "debug_print_page_list", scope: !3, file: !3, line: 655, type: !406, scopeLine: 656, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !354)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !307}
!408 = !DILocalVariable(name: "order", arg: 1, scope: !405, file: !3, line: 655, type: !307)
!409 = !DILocation(line: 655, column: 28, scope: !405)
!410 = !DILocalVariable(name: "p", scope: !405, file: !3, line: 657, type: !239)
!411 = !DILocation(line: 657, column: 15, scope: !405)
!412 = !DILocation(line: 658, column: 51, scope: !405)
!413 = !DILocation(line: 658, column: 43, scope: !405)
!414 = !DILocation(line: 658, column: 34, scope: !405)
!415 = !DILocation(line: 659, column: 26, scope: !405)
!416 = !DILocation(line: 659, column: 13, scope: !405)
!417 = !DILocation(line: 659, column: 4, scope: !405)
!418 = !DILocation(line: 658, column: 3, scope: !405)
!419 = !DILocation(line: 660, column: 15, scope: !405)
!420 = !DILocation(line: 660, column: 7, scope: !405)
!421 = !DILocation(line: 660, column: 5, scope: !405)
!422 = !DILocation(line: 661, column: 3, scope: !405)
!423 = !DILocation(line: 661, column: 10, scope: !405)
!424 = !DILocation(line: 661, column: 12, scope: !405)
!425 = !DILocation(line: 663, column: 43, scope: !426)
!426 = distinct !DILexicalBlock(scope: !405, file: !3, line: 662, column: 5)
!427 = !DILocation(line: 663, column: 34, scope: !426)
!428 = !DILocation(line: 663, column: 46, scope: !426)
!429 = !DILocation(line: 663, column: 49, scope: !426)
!430 = !DILocation(line: 664, column: 8, scope: !426)
!431 = !DILocation(line: 664, column: 11, scope: !426)
!432 = !DILocation(line: 663, column: 7, scope: !426)
!433 = !DILocation(line: 665, column: 11, scope: !426)
!434 = !DILocation(line: 665, column: 14, scope: !426)
!435 = !DILocation(line: 665, column: 9, scope: !426)
!436 = distinct !{!436, !422, !437}
!437 = !DILocation(line: 666, column: 5, scope: !405)
!438 = !DILocation(line: 667, column: 3, scope: !405)
!439 = !DILocation(line: 668, column: 11, scope: !405)
!440 = !DILocation(line: 668, column: 3, scope: !405)
!441 = !DILocation(line: 669, column: 1, scope: !405)
!442 = distinct !DISubprogram(name: "ggc_alloc_typed_stat", scope: !3, file: !3, line: 1080, type: !443, scopeLine: 1082, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !354)
!443 = !DISubroutineType(types: !444)
!444 = !{!228, !5, !235}
!445 = !DILocalVariable(name: "type", arg: 1, scope: !442, file: !3, line: 1080, type: !5)
!446 = !DILocation(line: 1080, column: 42, scope: !442)
!447 = !DILocalVariable(name: "size", arg: 2, scope: !442, file: !3, line: 1080, type: !235)
!448 = !DILocation(line: 1080, column: 72, scope: !442)
!449 = !DILocation(line: 1083, column: 26, scope: !442)
!450 = !DILocation(line: 1083, column: 10, scope: !442)
!451 = !DILocation(line: 1083, column: 3, scope: !442)
!452 = distinct !DISubprogram(name: "ggc_alloc_stat", scope: !3, file: !3, line: 1089, type: !453, scopeLine: 1090, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !354)
!453 = !DISubroutineType(types: !454)
!454 = !{!228, !235}
!455 = !DILocalVariable(name: "size", arg: 1, scope: !452, file: !3, line: 1089, type: !235)
!456 = !DILocation(line: 1089, column: 24, scope: !452)
!457 = !DILocalVariable(name: "order", scope: !452, file: !3, line: 1091, type: !235)
!458 = !DILocation(line: 1091, column: 10, scope: !452)
!459 = !DILocalVariable(name: "word", scope: !452, file: !3, line: 1091, type: !235)
!460 = !DILocation(line: 1091, column: 17, scope: !452)
