; ModuleID = 'cfg.c'
source_filename = "cfg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bitnames", scope: !2, file: !3, line: 700, type: !2060, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "dump_edge_info", scope: !3, file: !3, line: 678, type: !4, scopeLine: 679, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1939, retainedNodes: !2008)
!3 = !DIFile(filename: "cfg.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !69, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 7, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !10, line: 49, size: 1728, elements: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!11 = !{!12, !14, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !30, !32, !33, !34, !38, !40, !42, !46, !49, !51, !54, !57, !58, !60, !64, !65}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !9, file: !10, line: 51, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !9, file: !10, line: 54, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !9, file: !10, line: 55, baseType: !15, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !9, file: !10, line: 56, baseType: !15, size: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !9, file: !10, line: 57, baseType: !15, size: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !9, file: !10, line: 58, baseType: !15, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !9, file: !10, line: 59, baseType: !15, size: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !9, file: !10, line: 60, baseType: !15, size: 64, offset: 448)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !9, file: !10, line: 61, baseType: !15, size: 64, offset: 512)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !9, file: !10, line: 64, baseType: !15, size: 64, offset: 576)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !9, file: !10, line: 65, baseType: !15, size: 64, offset: 640)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !9, file: !10, line: 66, baseType: !15, size: 64, offset: 704)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !9, file: !10, line: 68, baseType: !28, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !10, line: 36, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !9, file: !10, line: 70, baseType: !31, size: 64, offset: 832)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !9, file: !10, line: 72, baseType: !13, size: 32, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !9, file: !10, line: 73, baseType: !13, size: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !9, file: !10, line: 74, baseType: !35, size: 64, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !36, line: 152, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !9, file: !10, line: 77, baseType: !39, size: 16, offset: 1024)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !9, file: !10, line: 78, baseType: !41, size: 8, offset: 1040)
!41 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !9, file: !10, line: 79, baseType: !43, size: 8, offset: 1048)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !9, file: !10, line: 81, baseType: !47, size: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !10, line: 43, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !9, file: !10, line: 89, baseType: !50, size: 64, offset: 1152)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !36, line: 153, baseType: !37)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !9, file: !10, line: 91, baseType: !52, size: 64, offset: 1216)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !10, line: 37, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !9, file: !10, line: 92, baseType: !55, size: 64, offset: 1280)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !10, line: 38, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !9, file: !10, line: 93, baseType: !31, size: 64, offset: 1344)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !9, file: !10, line: 94, baseType: !59, size: 64, offset: 1408)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !9, file: !10, line: 95, baseType: !61, size: 64, offset: 1472)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!63 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !9, file: !10, line: 96, baseType: !13, size: 32, offset: 1536)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !9, file: !10, line: 98, baseType: !66, size: 160, offset: 1568)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 20)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !70, line: 108, baseType: !71)
!70 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !73, line: 122, size: 512, elements: !74)
!73 = !DIFile(filename: "./basic-block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !{!75, !1926, !1927, !1932, !1933, !1934, !1935, !1936, !1937, !1938}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !72, file: !73, line: 124, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !73, line: 217, size: 832, elements: !78)
!78 = !{!79, !93, !94, !95, !1895, !1899, !1900, !1901, !1919, !1921, !1922, !1923, !1924, !1925}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !77, file: !73, line: 219, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !73, line: 151, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !73, line: 151, size: 128, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !82, file: !73, line: 151, baseType: !85, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !73, line: 150, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !73, line: 150, size: 128, elements: !87)
!87 = !{!88, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !86, file: !73, line: 150, baseType: !89, size: 32)
!89 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !86, file: !73, line: 150, baseType: !89, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !86, file: !73, line: 150, baseType: !92, size: 64, offset: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !44)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !77, file: !73, line: 220, baseType: !80, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !77, file: !73, line: 223, baseType: !59, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !77, file: !73, line: 226, baseType: !96, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !98, line: 100, size: 1216, elements: !99)
!98 = !DIFile(filename: "./cfgloop.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !{!100, !101, !102, !103, !104, !117, !118, !119, !133, !134, !135, !136, !1868, !1869, !1870, !1871, !1872, !1877, !1885, !1893, !1894}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !97, file: !98, line: 102, baseType: !13, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !97, file: !98, line: 105, baseType: !89, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !97, file: !98, line: 108, baseType: !76, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !97, file: !98, line: 111, baseType: !76, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !97, file: !98, line: 114, baseType: !105, size: 64, offset: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !98, line: 41, size: 64, elements: !106)
!106 = !{!107, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !105, file: !98, line: 42, baseType: !108, size: 32)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lpt_dec", file: !98, line: 31, baseType: !89, size: 32, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115}
!110 = !DIEnumerator(name: "LPT_NONE", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "LPT_PEEL_COMPLETELY", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "LPT_PEEL_SIMPLE", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "LPT_UNROLL_CONSTANT", value: 3, isUnsigned: true)
!114 = !DIEnumerator(name: "LPT_UNROLL_RUNTIME", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "LPT_UNROLL_STUPID", value: 5, isUnsigned: true)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !105, file: !98, line: 43, baseType: !89, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !97, file: !98, line: 117, baseType: !89, size: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !97, file: !98, line: 120, baseType: !89, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !97, file: !98, line: 123, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !98, line: 87, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !98, line: 87, size: 128, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !122, file: !98, line: 87, baseType: !125, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !98, line: 85, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !98, line: 85, size: 128, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !126, file: !98, line: 85, baseType: !89, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !98, line: 85, baseType: !89, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !126, file: !98, line: 85, baseType: !131, size: 64, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !44)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !98, line: 84, baseType: !96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !97, file: !98, line: 126, baseType: !96, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !98, line: 129, baseType: !96, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !97, file: !98, line: 132, baseType: !59, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !97, file: !98, line: 139, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !70, line: 56, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !141)
!140 = !DIFile(filename: "./tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !{!142, !175, !181, !192, !211, !350, !355, !361, !367, !381, !393, !431, !641, !669, !686, !687, !692, !701, !707, !712, !716, !720, !1488, !1535, !1541, !1547, !1554, !1567, !1581, !1598, !1610, !1632, !1679, !1850}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !139, file: !140, line: 3372, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !143, file: !140, line: 361, baseType: !89, size: 16, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !143, file: !140, line: 363, baseType: !89, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !143, file: !140, line: 364, baseType: !89, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !143, file: !140, line: 365, baseType: !89, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !143, file: !140, line: 366, baseType: !89, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !143, file: !140, line: 367, baseType: !89, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !143, file: !140, line: 368, baseType: !89, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !143, file: !140, line: 369, baseType: !89, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !143, file: !140, line: 370, baseType: !89, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !143, file: !140, line: 372, baseType: !89, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !143, file: !140, line: 373, baseType: !89, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !143, file: !140, line: 374, baseType: !89, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !143, file: !140, line: 375, baseType: !89, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !143, file: !140, line: 376, baseType: !89, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !143, file: !140, line: 377, baseType: !89, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !143, file: !140, line: 378, baseType: !89, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !143, file: !140, line: 379, baseType: !89, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !143, file: !140, line: 381, baseType: !89, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !143, file: !140, line: 382, baseType: !89, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !143, file: !140, line: 383, baseType: !89, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !143, file: !140, line: 384, baseType: !89, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !143, file: !140, line: 385, baseType: !89, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !143, file: !140, line: 386, baseType: !89, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !143, file: !140, line: 387, baseType: !89, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !143, file: !140, line: 388, baseType: !89, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !143, file: !140, line: 390, baseType: !89, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !143, file: !140, line: 391, baseType: !89, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !143, file: !140, line: 392, baseType: !89, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !143, file: !140, line: 394, baseType: !89, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !143, file: !140, line: 399, baseType: !89, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !139, file: !140, line: 3373, baseType: !176, size: 192)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !176, file: !140, line: 403, baseType: !143, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !176, file: !140, line: 404, baseType: !137, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !140, line: 405, baseType: !137, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !139, file: !140, line: 3374, baseType: !182, size: 320)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !182, file: !140, line: 1385, baseType: !176, size: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !182, file: !140, line: 1386, baseType: !186, size: 128, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !187, line: 58, baseType: !188)
!187 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !187, line: 54, size: 128, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !188, file: !187, line: 56, baseType: !63, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !188, file: !187, line: 57, baseType: !37, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !139, file: !140, line: 3375, baseType: !193, size: 256)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !193, file: !140, line: 1398, baseType: !176, size: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !193, file: !140, line: 1399, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !199, line: 52, size: 256, elements: !200)
!199 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!200 = !{!201, !202, !203, !204, !205, !206, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !198, file: !199, line: 56, baseType: !89, size: 2, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !198, file: !199, line: 57, baseType: !89, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !198, file: !199, line: 58, baseType: !89, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !198, file: !199, line: 59, baseType: !89, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !198, file: !199, line: 60, baseType: !89, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !198, file: !199, line: 61, baseType: !89, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !198, file: !199, line: 62, baseType: !208, size: 192, offset: 64)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !139, file: !140, line: 3376, baseType: !212, size: 256)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !212, file: !140, line: 1409, baseType: !176, size: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !212, file: !140, line: 1410, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !218, line: 27, size: 192, elements: !219)
!218 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !218, line: 29, baseType: !186, size: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !217, file: !218, line: 30, baseType: !222, size: 32, offset: 128)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "machine_mode", file: !223, line: 7, baseType: !89, size: 32, elements: !224)
!223 = !DIFile(filename: "./insn-modes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!225 = !DIEnumerator(name: "VOIDmode", value: 0, isUnsigned: true)
!226 = !DIEnumerator(name: "BLKmode", value: 1, isUnsigned: true)
!227 = !DIEnumerator(name: "CCmode", value: 2, isUnsigned: true)
!228 = !DIEnumerator(name: "CCGCmode", value: 3, isUnsigned: true)
!229 = !DIEnumerator(name: "CCGOCmode", value: 4, isUnsigned: true)
!230 = !DIEnumerator(name: "CCNOmode", value: 5, isUnsigned: true)
!231 = !DIEnumerator(name: "CCAmode", value: 6, isUnsigned: true)
!232 = !DIEnumerator(name: "CCCmode", value: 7, isUnsigned: true)
!233 = !DIEnumerator(name: "CCOmode", value: 8, isUnsigned: true)
!234 = !DIEnumerator(name: "CCSmode", value: 9, isUnsigned: true)
!235 = !DIEnumerator(name: "CCZmode", value: 10, isUnsigned: true)
!236 = !DIEnumerator(name: "CCFPmode", value: 11, isUnsigned: true)
!237 = !DIEnumerator(name: "CCFPUmode", value: 12, isUnsigned: true)
!238 = !DIEnumerator(name: "BImode", value: 13, isUnsigned: true)
!239 = !DIEnumerator(name: "QImode", value: 14, isUnsigned: true)
!240 = !DIEnumerator(name: "HImode", value: 15, isUnsigned: true)
!241 = !DIEnumerator(name: "SImode", value: 16, isUnsigned: true)
!242 = !DIEnumerator(name: "DImode", value: 17, isUnsigned: true)
!243 = !DIEnumerator(name: "TImode", value: 18, isUnsigned: true)
!244 = !DIEnumerator(name: "OImode", value: 19, isUnsigned: true)
!245 = !DIEnumerator(name: "QQmode", value: 20, isUnsigned: true)
!246 = !DIEnumerator(name: "HQmode", value: 21, isUnsigned: true)
!247 = !DIEnumerator(name: "SQmode", value: 22, isUnsigned: true)
!248 = !DIEnumerator(name: "DQmode", value: 23, isUnsigned: true)
!249 = !DIEnumerator(name: "TQmode", value: 24, isUnsigned: true)
!250 = !DIEnumerator(name: "UQQmode", value: 25, isUnsigned: true)
!251 = !DIEnumerator(name: "UHQmode", value: 26, isUnsigned: true)
!252 = !DIEnumerator(name: "USQmode", value: 27, isUnsigned: true)
!253 = !DIEnumerator(name: "UDQmode", value: 28, isUnsigned: true)
!254 = !DIEnumerator(name: "UTQmode", value: 29, isUnsigned: true)
!255 = !DIEnumerator(name: "HAmode", value: 30, isUnsigned: true)
!256 = !DIEnumerator(name: "SAmode", value: 31, isUnsigned: true)
!257 = !DIEnumerator(name: "DAmode", value: 32, isUnsigned: true)
!258 = !DIEnumerator(name: "TAmode", value: 33, isUnsigned: true)
!259 = !DIEnumerator(name: "UHAmode", value: 34, isUnsigned: true)
!260 = !DIEnumerator(name: "USAmode", value: 35, isUnsigned: true)
!261 = !DIEnumerator(name: "UDAmode", value: 36, isUnsigned: true)
!262 = !DIEnumerator(name: "UTAmode", value: 37, isUnsigned: true)
!263 = !DIEnumerator(name: "SFmode", value: 38, isUnsigned: true)
!264 = !DIEnumerator(name: "DFmode", value: 39, isUnsigned: true)
!265 = !DIEnumerator(name: "XFmode", value: 40, isUnsigned: true)
!266 = !DIEnumerator(name: "TFmode", value: 41, isUnsigned: true)
!267 = !DIEnumerator(name: "SDmode", value: 42, isUnsigned: true)
!268 = !DIEnumerator(name: "DDmode", value: 43, isUnsigned: true)
!269 = !DIEnumerator(name: "TDmode", value: 44, isUnsigned: true)
!270 = !DIEnumerator(name: "CQImode", value: 45, isUnsigned: true)
!271 = !DIEnumerator(name: "CHImode", value: 46, isUnsigned: true)
!272 = !DIEnumerator(name: "CSImode", value: 47, isUnsigned: true)
!273 = !DIEnumerator(name: "CDImode", value: 48, isUnsigned: true)
!274 = !DIEnumerator(name: "CTImode", value: 49, isUnsigned: true)
!275 = !DIEnumerator(name: "COImode", value: 50, isUnsigned: true)
!276 = !DIEnumerator(name: "SCmode", value: 51, isUnsigned: true)
!277 = !DIEnumerator(name: "DCmode", value: 52, isUnsigned: true)
!278 = !DIEnumerator(name: "XCmode", value: 53, isUnsigned: true)
!279 = !DIEnumerator(name: "TCmode", value: 54, isUnsigned: true)
!280 = !DIEnumerator(name: "V2QImode", value: 55, isUnsigned: true)
!281 = !DIEnumerator(name: "V4QImode", value: 56, isUnsigned: true)
!282 = !DIEnumerator(name: "V2HImode", value: 57, isUnsigned: true)
!283 = !DIEnumerator(name: "V1SImode", value: 58, isUnsigned: true)
!284 = !DIEnumerator(name: "V8QImode", value: 59, isUnsigned: true)
!285 = !DIEnumerator(name: "V4HImode", value: 60, isUnsigned: true)
!286 = !DIEnumerator(name: "V2SImode", value: 61, isUnsigned: true)
!287 = !DIEnumerator(name: "V1DImode", value: 62, isUnsigned: true)
!288 = !DIEnumerator(name: "V16QImode", value: 63, isUnsigned: true)
!289 = !DIEnumerator(name: "V8HImode", value: 64, isUnsigned: true)
!290 = !DIEnumerator(name: "V4SImode", value: 65, isUnsigned: true)
!291 = !DIEnumerator(name: "V2DImode", value: 66, isUnsigned: true)
!292 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!293 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!294 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!295 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!296 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!297 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!298 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!299 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!300 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!301 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!302 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!303 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!304 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!305 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!306 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!307 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!308 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!309 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!310 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!311 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!312 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!313 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!314 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!318 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!319 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!321 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!322 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!323 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!324 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!325 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!326 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!327 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!328 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!329 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!330 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!331 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!332 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!333 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!334 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!335 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!336 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!337 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!338 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!339 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!340 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!341 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!342 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!347 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!348 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!349 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !139, file: !140, line: 3377, baseType: !351, size: 256)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !351, file: !140, line: 1438, baseType: !176, size: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !351, file: !140, line: 1439, baseType: !137, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !139, file: !140, line: 3378, baseType: !356, size: 256)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !356, file: !140, line: 1419, baseType: !176, size: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !356, file: !140, line: 1420, baseType: !13, size: 32, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !356, file: !140, line: 1421, baseType: !43, size: 8, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !139, file: !140, line: 3379, baseType: !362, size: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !362, file: !140, line: 1429, baseType: !176, size: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !362, file: !140, line: 1430, baseType: !137, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !362, file: !140, line: 1431, baseType: !137, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !139, file: !140, line: 3380, baseType: !368, size: 320)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !368, file: !140, line: 1461, baseType: !176, size: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !368, file: !140, line: 1462, baseType: !372, size: 128, offset: 192)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !373, line: 31, size: 128, elements: !374)
!373 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !{!375, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !372, file: !373, line: 32, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !372, file: !373, line: 33, baseType: !89, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !372, file: !373, line: 34, baseType: !89, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !139, file: !140, line: 3381, baseType: !382, size: 384)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !383)
!383 = !{!384, !385, !390, !391, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !382, file: !140, line: 2508, baseType: !176, size: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !382, file: !140, line: 2509, baseType: !386, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !387, line: 58, baseType: !388)
!387 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !389, line: 44, baseType: !89)
!389 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !382, file: !140, line: 2510, baseType: !89, size: 32, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !140, line: 2511, baseType: !137, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !382, file: !140, line: 2512, baseType: !137, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !139, file: !140, line: 3382, baseType: !394, size: 896)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !394, file: !140, line: 2653, baseType: !382, size: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !140, line: 2654, baseType: !137, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !394, file: !140, line: 2656, baseType: !89, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !394, file: !140, line: 2658, baseType: !89, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !394, file: !140, line: 2659, baseType: !89, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !394, file: !140, line: 2660, baseType: !89, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !394, file: !140, line: 2661, baseType: !89, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !394, file: !140, line: 2662, baseType: !89, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !394, file: !140, line: 2663, baseType: !89, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !394, file: !140, line: 2664, baseType: !89, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !394, file: !140, line: 2666, baseType: !89, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !394, file: !140, line: 2667, baseType: !89, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !394, file: !140, line: 2668, baseType: !89, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !394, file: !140, line: 2669, baseType: !89, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !394, file: !140, line: 2670, baseType: !89, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !394, file: !140, line: 2671, baseType: !89, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !394, file: !140, line: 2672, baseType: !89, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !394, file: !140, line: 2673, baseType: !89, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !394, file: !140, line: 2674, baseType: !89, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !394, file: !140, line: 2678, baseType: !89, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !394, file: !140, line: 2682, baseType: !89, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !394, file: !140, line: 2685, baseType: !89, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !394, file: !140, line: 2688, baseType: !89, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !394, file: !140, line: 2690, baseType: !89, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !394, file: !140, line: 2692, baseType: !89, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !394, file: !140, line: 2695, baseType: !89, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !394, file: !140, line: 2698, baseType: !89, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !394, file: !140, line: 2703, baseType: !89, size: 32, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !394, file: !140, line: 2705, baseType: !137, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !394, file: !140, line: 2706, baseType: !137, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !394, file: !140, line: 2707, baseType: !137, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !394, file: !140, line: 2708, baseType: !137, size: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !394, file: !140, line: 2711, baseType: !429, size: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !139, file: !140, line: 3383, baseType: !432, size: 960)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !432, file: !140, line: 2757, baseType: !394, size: 896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !432, file: !140, line: 2758, baseType: !436, size: 64, offset: 896)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !70, line: 50, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !439, line: 240, size: 384, elements: !440)
!439 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !438, file: !439, line: 242, baseType: !89, size: 16, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !438, file: !439, line: 245, baseType: !89, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !438, file: !439, line: 252, baseType: !89, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !438, file: !439, line: 257, baseType: !89, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !438, file: !439, line: 265, baseType: !89, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !438, file: !439, line: 277, baseType: !89, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !438, file: !439, line: 291, baseType: !89, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !438, file: !439, line: 298, baseType: !89, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !438, file: !439, line: 305, baseType: !89, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !438, file: !439, line: 310, baseType: !89, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !438, file: !439, line: 321, baseType: !452, size: 320, offset: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !439, line: 315, size: 320, elements: !453)
!453 = !{!454, !574, !576, !639, !640}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !452, file: !439, line: 316, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, elements: !44)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !439, line: 183, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !439, line: 166, size: 64, elements: !458)
!458 = !{!459, !460, !461, !464, !465, !473, !474, !486, !489, !549, !550, !551, !564, !571}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !457, file: !439, line: 168, baseType: !13, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !457, file: !439, line: 169, baseType: !89, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !457, file: !439, line: 170, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !457, file: !439, line: 171, baseType: !436, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !457, file: !439, line: 172, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !70, line: 53, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !439, line: 359, size: 128, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !468, file: !439, line: 360, baseType: !13, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !468, file: !439, line: 361, baseType: !472, size: 64, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 64, elements: !44)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !457, file: !439, line: 173, baseType: !222, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !457, file: !439, line: 174, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !439, line: 133, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 115, size: 32, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !476, file: !439, line: 118, baseType: !89, size: 8, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !476, file: !439, line: 120, baseType: !89, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !476, file: !439, line: 121, baseType: !89, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !476, file: !439, line: 123, baseType: !89, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !476, file: !439, line: 125, baseType: !89, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !476, file: !439, line: 127, baseType: !89, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !476, file: !439, line: 130, baseType: !89, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !476, file: !439, line: 132, baseType: !89, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !457, file: !439, line: 175, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !439, line: 175, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !457, file: !439, line: 176, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !492, line: 75, size: 256, elements: !493)
!492 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !{!494, !508, !509, !510}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !491, file: !492, line: 76, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !492, line: 68, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !492, line: 63, size: 320, elements: !498)
!498 = !{!499, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !492, line: 64, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !497, file: !492, line: 65, baseType: !500, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !497, file: !492, line: 66, baseType: !89, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !497, file: !492, line: 67, baseType: !504, size: 128, offset: 192)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 128, elements: !506)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !492, line: 29, baseType: !63)
!506 = !{!507}
!507 = !DISubrange(count: 2)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !491, file: !492, line: 77, baseType: !495, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !491, file: !492, line: 78, baseType: !89, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !491, file: !492, line: 79, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !492, line: 49, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !492, line: 45, size: 832, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !513, file: !492, line: 46, baseType: !500, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !513, file: !492, line: 47, baseType: !490, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !513, file: !492, line: 48, baseType: !518, size: 704, offset: 128)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !519, line: 164, size: 704, elements: !520)
!519 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !{!521, !522, !532, !533, !534, !535, !536, !537, !541, !545, !546, !547, !548}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !518, file: !519, line: 166, baseType: !37, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !518, file: !519, line: 167, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !519, line: 157, size: 192, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !524, file: !519, line: 159, baseType: !15, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !519, line: 160, baseType: !523, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !524, file: !519, line: 161, baseType: !529, size: 32, offset: 128)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 4)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !518, file: !519, line: 168, baseType: !15, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !518, file: !519, line: 169, baseType: !15, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !518, file: !519, line: 170, baseType: !15, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !518, file: !519, line: 171, baseType: !37, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !518, file: !519, line: 172, baseType: !13, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !518, file: !519, line: 176, baseType: !538, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!523, !59, !37}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !518, file: !519, line: 177, baseType: !542, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !59, !523}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !518, file: !519, line: 178, baseType: !59, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !518, file: !519, line: 179, baseType: !89, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !518, file: !519, line: 180, baseType: !89, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !518, file: !519, line: 184, baseType: !89, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !457, file: !439, line: 177, baseType: !137, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !457, file: !439, line: 178, baseType: !76, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !457, file: !439, line: 179, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !439, line: 150, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !439, line: 142, size: 320, elements: !555)
!555 = !{!556, !557, !558, !559, !562, !563}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !554, file: !439, line: 144, baseType: !137, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !554, file: !439, line: 145, baseType: !436, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !439, line: 146, baseType: !436, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !554, file: !439, line: 147, baseType: !560, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !561, line: 31, baseType: !13)
!561 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !554, file: !439, line: 148, baseType: !89, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !554, file: !439, line: 149, baseType: !378, size: 8, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !457, file: !439, line: 180, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !439, line: 162, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !439, line: 159, size: 128, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !567, file: !439, line: 160, baseType: !137, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !567, file: !439, line: 161, baseType: !37, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !457, file: !439, line: 181, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !439, line: 181, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !452, file: !439, line: 317, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !44)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !452, file: !439, line: 318, baseType: !577, size: 320)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !439, line: 188, size: 320, elements: !578)
!578 = !{!579, !581, !638}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !577, file: !439, line: 190, baseType: !580, size: 192)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 192, elements: !209)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !577, file: !439, line: 193, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !439, line: 206, size: 320, elements: !584)
!584 = !{!585, !623, !624, !625, !637}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !583, file: !439, line: 208, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !70, line: 62, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !589, line: 538, size: 256, elements: !590)
!589 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!590 = !{!591, !595, !601, !614}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !589, line: 539, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !589, line: 482, size: 32, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !589, line: 484, baseType: !89, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !588, file: !589, line: 540, baseType: !596, size: 192)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !589, line: 488, size: 192, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !589, line: 489, baseType: !592, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !589, line: 492, baseType: !462, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !596, file: !589, line: 496, baseType: !137, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !588, file: !589, line: 541, baseType: !602, size: 256)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !589, line: 504, size: 256, elements: !603)
!603 = !{!604, !605, !612, !613}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !602, file: !589, line: 505, baseType: !592, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !602, file: !589, line: 509, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !589, line: 501, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !589, line: 510, baseType: !610, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !589, line: 513, baseType: !586, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !588, file: !589, line: 542, baseType: !615, size: 128)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !589, line: 530, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !589, line: 531, baseType: !592, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !615, file: !589, line: 534, baseType: !619, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !589, line: 525, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!378, !137, !462, !63, !63}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !583, file: !439, line: 211, baseType: !89, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !439, line: 214, baseType: !37, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !583, file: !439, line: 224, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !439, line: 202, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !439, line: 202, size: 128, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !628, file: !439, line: 202, baseType: !631, size: 128)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !439, line: 200, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !439, line: 200, size: 128, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !632, file: !439, line: 200, baseType: !89, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !632, file: !439, line: 200, baseType: !89, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !632, file: !439, line: 200, baseType: !472, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !583, file: !439, line: 234, baseType: !626, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !577, file: !439, line: 197, baseType: !37, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !452, file: !439, line: 319, baseType: !198, size: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !452, file: !439, line: 320, baseType: !217, size: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !139, file: !140, line: 3384, baseType: !642, size: 1472)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !643)
!643 = !{!644, !665, !666, !667, !668}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !642, file: !140, line: 3115, baseType: !645, size: 1216)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !140, line: 2985, baseType: !432, size: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !645, file: !140, line: 2986, baseType: !137, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !645, file: !140, line: 2987, baseType: !137, size: 64, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !645, file: !140, line: 2988, baseType: !137, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !645, file: !140, line: 2991, baseType: !89, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !645, file: !140, line: 2992, baseType: !89, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !645, file: !140, line: 2993, baseType: !89, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !645, file: !140, line: 2994, baseType: !89, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !645, file: !140, line: 2995, baseType: !89, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !645, file: !140, line: 2996, baseType: !89, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !645, file: !140, line: 2998, baseType: !89, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !645, file: !140, line: 3000, baseType: !89, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !645, file: !140, line: 3002, baseType: !89, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !645, file: !140, line: 3003, baseType: !89, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !645, file: !140, line: 3004, baseType: !89, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !645, file: !140, line: 3005, baseType: !89, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !645, file: !140, line: 3007, baseType: !89, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !645, file: !140, line: 3010, baseType: !89, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !642, file: !140, line: 3117, baseType: !137, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !642, file: !140, line: 3119, baseType: !137, size: 64, offset: 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !642, file: !140, line: 3121, baseType: !137, size: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !642, file: !140, line: 3123, baseType: !137, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !139, file: !140, line: 3385, baseType: !670, size: 1088)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !140, line: 2875, baseType: !432, size: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !670, file: !140, line: 2876, baseType: !436, size: 64, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !670, file: !140, line: 2877, baseType: !675, size: 64, offset: 1024)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !677, line: 172, size: 128, elements: !678)
!677 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!678 = !{!679, !680, !681, !682, !683, !684, !685}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !676, file: !677, line: 174, baseType: !89, size: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !676, file: !677, line: 178, baseType: !89, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !676, file: !677, line: 183, baseType: !89, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !676, file: !677, line: 187, baseType: !89, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !676, file: !677, line: 192, baseType: !89, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !676, file: !677, line: 195, baseType: !89, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !676, file: !677, line: 199, baseType: !137, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !139, file: !140, line: 3386, baseType: !645, size: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !139, file: !140, line: 3387, baseType: !688, size: 1280)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !688, file: !140, line: 3094, baseType: !645, size: 1216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !688, file: !140, line: 3095, baseType: !675, size: 64, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !139, file: !140, line: 3388, baseType: !693, size: 1216)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !140, line: 2825, baseType: !394, size: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !693, file: !140, line: 2827, baseType: !137, size: 64, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !693, file: !140, line: 2828, baseType: !137, size: 64, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !693, file: !140, line: 2829, baseType: !137, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !693, file: !140, line: 2830, baseType: !137, size: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !693, file: !140, line: 2831, baseType: !137, size: 64, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !139, file: !140, line: 3389, baseType: !702, size: 1024)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !702, file: !140, line: 2851, baseType: !432, size: 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !702, file: !140, line: 2852, baseType: !13, size: 32, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !702, file: !140, line: 2853, baseType: !13, size: 32, offset: 992)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !139, file: !140, line: 3390, baseType: !708, size: 1024)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !140, line: 2858, baseType: !432, size: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !708, file: !140, line: 2859, baseType: !675, size: 64, offset: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !139, file: !140, line: 3391, baseType: !713, size: 960)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !140, line: 2863, baseType: !432, size: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !139, file: !140, line: 3392, baseType: !717, size: 1472)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !140, line: 3305, baseType: !642, size: 1472)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !139, file: !140, line: 3393, baseType: !721, size: 1792)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !722)
!722 = !{!723, !724, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !140, line: 3249, baseType: !642, size: 1472)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !721, file: !140, line: 3251, baseType: !725, size: 64, offset: 1472)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !727, line: 463, size: 1152, elements: !728)
!727 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !{!729, !896, !937, !1344, !1398, !1406, !1407, !1408, !1409, !1410, !1411, !1440, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !726, file: !727, line: 464, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !732, line: 194, size: 384, elements: !733)
!732 = !DIFile(filename: "./except.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!733 = !{!734, !789, !802, !816, !864, !877}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !731, file: !732, line: 197, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !732, line: 182, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !732, line: 116, size: 704, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !750, !777, !786, !787, !788}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !737, file: !732, line: 119, baseType: !736, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !737, file: !732, line: 122, baseType: !736, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !737, file: !732, line: 123, baseType: !736, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !737, file: !732, line: 126, baseType: !13, size: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !732, line: 129, baseType: !744, size: 32, offset: 224)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eh_region_type", file: !732, line: 30, baseType: !89, size: 32, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIEnumerator(name: "ERT_CLEANUP", value: 0, isUnsigned: true)
!747 = !DIEnumerator(name: "ERT_TRY", value: 1, isUnsigned: true)
!748 = !DIEnumerator(name: "ERT_ALLOWED_EXCEPTIONS", value: 2, isUnsigned: true)
!749 = !DIEnumerator(name: "ERT_MUST_NOT_THROW", value: 3, isUnsigned: true)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !737, file: !732, line: 165, baseType: !751, size: 192, offset: 256)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !732, line: 132, size: 192, elements: !752)
!752 = !{!753, !766, !772}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !751, file: !732, line: 137, baseType: !754, size: 128)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !732, line: 133, size: 128, elements: !755)
!755 = !{!756, !765}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !754, file: !732, line: 135, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !732, line: 93, size: 320, elements: !759)
!759 = !{!760, !761, !762, !763, !764}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !758, file: !732, line: 96, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !758, file: !732, line: 97, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !758, file: !732, line: 101, baseType: !137, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !758, file: !732, line: 106, baseType: !137, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !758, file: !732, line: 111, baseType: !137, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !754, file: !732, line: 136, baseType: !757, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !751, file: !732, line: 151, baseType: !767, size: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !732, line: 139, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !767, file: !732, line: 141, baseType: !137, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !767, file: !732, line: 145, baseType: !137, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !767, file: !732, line: 150, baseType: !13, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !751, file: !732, line: 164, baseType: !773, size: 128)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !732, line: 153, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !773, file: !732, line: 161, baseType: !137, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !773, file: !732, line: 163, baseType: !386, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !737, file: !732, line: 168, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !732, line: 67, size: 320, elements: !780)
!780 = !{!781, !782, !783, !784, !785}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !779, file: !732, line: 70, baseType: !778, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !779, file: !732, line: 73, baseType: !736, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !779, file: !732, line: 78, baseType: !137, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !779, file: !732, line: 85, baseType: !436, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !779, file: !732, line: 88, baseType: !13, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !737, file: !732, line: 173, baseType: !436, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !737, file: !732, line: 173, baseType: !436, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !737, file: !732, line: 177, baseType: !378, size: 8, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !731, file: !732, line: 200, baseType: !790, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !732, line: 185, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !732, line: 185, size: 128, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !792, file: !732, line: 185, baseType: !795, size: 128)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !732, line: 184, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !732, line: 184, size: 128, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !796, file: !732, line: 184, baseType: !89, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !796, file: !732, line: 184, baseType: !89, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !796, file: !732, line: 184, baseType: !801, size: 64, offset: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 64, elements: !44)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !731, file: !732, line: 203, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !732, line: 189, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !732, line: 189, size: 128, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !805, file: !732, line: 189, baseType: !808, size: 128)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !732, line: 188, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !732, line: 188, size: 128, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !809, file: !732, line: 188, baseType: !89, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !809, file: !732, line: 188, baseType: !89, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !809, file: !732, line: 188, baseType: !814, size: 64, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 64, elements: !44)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !732, line: 180, baseType: !778)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !731, file: !732, line: 207, baseType: !817, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !818, line: 144, baseType: !819)
!818 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !818, line: 100, size: 896, elements: !821)
!821 = !{!822, !828, !833, !838, !840, !841, !842, !843, !844, !845, !850, !852, !853, !858, !863}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !820, file: !818, line: 102, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !818, line: 52, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !610}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !818, line: 47, baseType: !89)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !820, file: !818, line: 105, baseType: !829, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !818, line: 59, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!13, !610, !610}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !820, file: !818, line: 108, baseType: !834, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !818, line: 63, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !59}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !820, file: !818, line: 111, baseType: !839, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !820, file: !818, line: 114, baseType: !61, size: 64, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !820, file: !818, line: 117, baseType: !61, size: 64, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !820, file: !818, line: 120, baseType: !61, size: 64, offset: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !820, file: !818, line: 124, baseType: !89, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !820, file: !818, line: 128, baseType: !89, size: 32, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !820, file: !818, line: 131, baseType: !846, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !818, line: 75, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!59, !61, !61}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !820, file: !818, line: 132, baseType: !851, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !818, line: 78, baseType: !835)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !820, file: !818, line: 135, baseType: !59, size: 64, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !820, file: !818, line: 136, baseType: !854, size: 64, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !818, line: 82, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!59, !59, !61, !61}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !820, file: !818, line: 137, baseType: !859, size: 64, offset: 768)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !818, line: 83, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !59, !59}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !820, file: !818, line: 141, baseType: !89, size: 32, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !731, file: !732, line: 211, baseType: !865, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !867, file: !140, line: 183, baseType: !870, size: 128)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !871, file: !140, line: 182, baseType: !89, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !871, file: !140, line: 182, baseType: !89, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !871, file: !140, line: 182, baseType: !876, size: 64, offset: 64)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !44)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !731, file: !732, line: 220, baseType: !878, size: 64, offset: 320)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !732, line: 217, size: 64, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !878, file: !732, line: 218, baseType: !865, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !878, file: !732, line: 219, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !884, line: 29, baseType: !885)
!884 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !884, line: 29, size: 96, elements: !886)
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !885, file: !884, line: 29, baseType: !888, size: 96)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !884, line: 27, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !884, line: 27, size: 96, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !889, file: !884, line: 27, baseType: !89, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !889, file: !884, line: 27, baseType: !89, size: 32, offset: 32)
