; ModuleID = 'profile.c'
source_filename = "profile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!357 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!358 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!362 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!363 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!364 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!365 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!366 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!367 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!370 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!371 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!372 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!373 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!374 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!375 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!376 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!377 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!378 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!379 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!380 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!381 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!382 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!383 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!384 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!385 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!386 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!387 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!388 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!389 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hist_type", file: !391, line: 24, baseType: !7, size: 32, elements: !392)
!391 = !DIFile(filename: "./value-prof.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIEnumerator(name: "HIST_TYPE_INTERVAL", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "HIST_TYPE_POW2", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "HIST_TYPE_SINGLE_VALUE", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "HIST_TYPE_CONST_DELTA", value: 3, isUnsigned: true)
!397 = !DIEnumerator(name: "HIST_TYPE_INDIR_CALL", value: 4, isUnsigned: true)
!398 = !DIEnumerator(name: "HIST_TYPE_AVERAGE", value: 5, isUnsigned: true)
!399 = !DIEnumerator(name: "HIST_TYPE_IOR", value: 6, isUnsigned: true)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ir_type", file: !401, line: 80, baseType: !7, size: 32, elements: !402)
!401 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!402 = !{!403, !404, !405}
!403 = !DIEnumerator(name: "IR_GIMPLE", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "IR_RTL_CFGRTL", value: 1, isUnsigned: true)
!405 = !DIEnumerator(name: "IR_RTL_CFGLAYOUT", value: 2, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !135, line: 295, baseType: !7, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!408 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!409 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!410 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!411 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!412 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!413 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!414 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!415 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!416 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!417 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!418 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!419 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!420 = !{!421, !423, !430, !7, !432, !433, !441, !439, !442, !443}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !422, line: 44, baseType: !7)
!422 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_info", file: !425, line: 27, size: 32, elements: !426)
!425 = !DIFile(filename: "./profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !424, file: !425, line: 29, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "on_tree", scope: !424, file: !425, line: 32, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !424, file: !425, line: 36, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_unsigned_t", file: !431, line: 205, baseType: !7)
!431 = !DIFile(filename: "./gcov-io.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bb_info", file: !3, line: 77, size: 192, elements: !435)
!435 = !{!436, !437, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !434, file: !3, line: 78, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "succ_count", scope: !434, file: !3, line: 81, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !439)
!439 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pred_count", scope: !434, file: !3, line: 82, baseType: !438, size: 64, offset: 128)
!441 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !401, line: 111, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !446)
!446 = !{!447, !1796, !1797, !1798, !1799, !1803, !1804, !1805, !1823, !1824, !1825, !1826, !1827, !1828}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !445, file: !135, line: 219, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !450, file: !135, line: 151, baseType: !453, size: 128)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !454, file: !135, line: 150, baseType: !7, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !454, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !454, file: !135, line: 150, baseType: !459, size: 64, offset: 64)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 64, elements: !602)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !401, line: 108, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !463)
!463 = !{!464, !465, !466, !1789, !1790, !1791, !1792, !1793, !1794, !1795}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !462, file: !135, line: 124, baseType: !444, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !462, file: !135, line: 125, baseType: !444, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !462, file: !135, line: 131, baseType: !467, size: 64, offset: 128)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !468)
!468 = !{!469, !1788}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !467, file: !135, line: 129, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !401, line: 66, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !473, line: 143, size: 192, elements: !474)
!473 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!474 = !{!475, !1786, !1787}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !472, file: !473, line: 145, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !401, line: 69, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !473, line: 136, size: 192, elements: !479)
!479 = !{!480, !1784, !1785}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !478, file: !473, line: 137, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !401, line: 58, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !473, line: 737, size: 768, elements: !484)
!484 = !{!485, !1631, !1641, !1647, !1652, !1657, !1664, !1670, !1676, !1681, !1695, !1700, !1706, !1711, !1721, !1726, !1742, !1749, !1756, !1762, !1767, !1773, !1779}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !483, file: !473, line: 738, baseType: !486, size: 256)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !473, line: 271, size: 256, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !501, !502, !503}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !486, file: !473, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !486, file: !473, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !486, file: !473, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !486, file: !473, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !486, file: !473, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !486, file: !473, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !486, file: !473, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !486, file: !473, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !486, file: !473, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !486, file: !473, line: 312, baseType: !7, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !486, file: !473, line: 316, baseType: !499, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !500, line: 58, baseType: !421)
!500 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !486, file: !473, line: 319, baseType: !7, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !486, file: !473, line: 323, baseType: !444, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !486, file: !473, line: 327, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !401, line: 56, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !507)
!507 = !{!508, !541, !547, !559, !578, !589, !594, !604, !610, !624, !632, !670, !881, !909, !926, !927, !932, !941, !947, !952, !956, !960, !1282, !1329, !1335, !1341, !1348, !1361, !1375, !1392, !1404, !1426, !1441, !1613}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !506, file: !164, line: 3372, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !509, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !509, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !509, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !509, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !509, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !509, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !509, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !509, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !509, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !509, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !509, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !509, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !509, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !509, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !509, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !509, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !509, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !509, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !509, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !509, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !509, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !509, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !509, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !509, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !509, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !509, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !509, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !509, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !509, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !509, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !164, line: 3373, baseType: !542, size: 192)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !542, file: !164, line: 403, baseType: !509, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !542, file: !164, line: 404, baseType: !504, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !164, line: 405, baseType: !504, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !506, file: !164, line: 3374, baseType: !548, size: 320)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !164, line: 1385, baseType: !542, size: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !548, file: !164, line: 1386, baseType: !552, size: 128, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !553, line: 58, baseType: !554)
!553 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 54, size: 128, elements: !555)
!555 = !{!556, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !554, file: !553, line: 56, baseType: !557, size: 64)
!557 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !554, file: !553, line: 57, baseType: !439, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !506, file: !164, line: 3375, baseType: !560, size: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !164, line: 1398, baseType: !542, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !560, file: !164, line: 1399, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !566, line: 52, size: 256, elements: !567)
!566 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!567 = !{!568, !569, !570, !571, !572, !573, !574}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !565, file: !566, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !565, file: !566, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !565, file: !566, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !565, file: !566, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !565, file: !566, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !565, file: !566, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !565, file: !566, line: 62, baseType: !575, size: 192, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 192, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 3)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !506, file: !164, line: 3376, baseType: !579, size: 256)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !579, file: !164, line: 1409, baseType: !542, size: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !579, file: !164, line: 1410, baseType: !583, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !585, line: 27, size: 192, elements: !586)
!585 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !584, file: !585, line: 29, baseType: !552, size: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !584, file: !585, line: 30, baseType: !5, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !506, file: !164, line: 3377, baseType: !590, size: 256)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !590, file: !164, line: 1438, baseType: !542, size: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !590, file: !164, line: 1439, baseType: !504, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !506, file: !164, line: 3378, baseType: !595, size: 256)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !595, file: !164, line: 1419, baseType: !542, size: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !595, file: !164, line: 1420, baseType: !441, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !595, file: !164, line: 1421, baseType: !600, size: 8, offset: 224)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 8, elements: !602)
!601 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!602 = !{!603}
!603 = !DISubrange(count: 1)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !506, file: !164, line: 3379, baseType: !605, size: 320)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !164, line: 1429, baseType: !542, size: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !605, file: !164, line: 1430, baseType: !504, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !605, file: !164, line: 1431, baseType: !504, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !506, file: !164, line: 3380, baseType: !611, size: 320)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !164, line: 1461, baseType: !542, size: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !611, file: !164, line: 1462, baseType: !615, size: 128, offset: 192)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !616, line: 31, size: 128, elements: !617)
!616 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !622, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !615, file: !616, line: 32, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !615, file: !616, line: 33, baseType: !7, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !615, file: !616, line: 34, baseType: !7, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !506, file: !164, line: 3381, baseType: !625, size: 384)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !626)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !625, file: !164, line: 2508, baseType: !542, size: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !625, file: !164, line: 2509, baseType: !499, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !625, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !164, line: 2511, baseType: !504, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !625, file: !164, line: 2512, baseType: !504, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !506, file: !164, line: 3382, baseType: !633, size: 896)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !164, line: 2653, baseType: !625, size: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !633, file: !164, line: 2654, baseType: !504, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !633, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !633, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !633, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !633, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !633, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !633, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !633, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !633, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !633, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !633, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !633, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !633, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !633, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !633, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !633, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !633, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !633, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !633, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !633, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !633, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !633, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !633, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !633, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !633, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !633, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !633, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !633, file: !164, line: 2705, baseType: !504, size: 64, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !633, file: !164, line: 2706, baseType: !504, size: 64, offset: 640)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !633, file: !164, line: 2707, baseType: !504, size: 64, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !633, file: !164, line: 2708, baseType: !504, size: 64, offset: 768)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !633, file: !164, line: 2711, baseType: !668, size: 64, offset: 832)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !506, file: !164, line: 3383, baseType: !671, size: 960)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !671, file: !164, line: 2757, baseType: !633, size: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !671, file: !164, line: 2758, baseType: !675, size: 64, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !401, line: 50, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !678, line: 240, size: 384, elements: !679)
!678 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !677, file: !678, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !677, file: !678, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !677, file: !678, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !677, file: !678, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !677, file: !678, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !677, file: !678, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !677, file: !678, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !677, file: !678, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !677, file: !678, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !677, file: !678, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !677, file: !678, line: 321, baseType: !691, size: 320, offset: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !678, line: 315, size: 320, elements: !692)
!692 = !{!693, !814, !816, !879, !880}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !691, file: !678, line: 316, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 64, elements: !602)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !678, line: 183, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !678, line: 166, size: 64, elements: !697)
!697 = !{!698, !699, !700, !703, !704, !712, !713, !725, !728, !789, !790, !791, !804, !811}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !696, file: !678, line: 168, baseType: !441, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !696, file: !678, line: 169, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !696, file: !678, line: 170, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !696, file: !678, line: 171, baseType: !675, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !696, file: !678, line: 172, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !401, line: 53, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !678, line: 359, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !707, file: !678, line: 360, baseType: !441, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !707, file: !678, line: 361, baseType: !711, size: 64, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !602)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !696, file: !678, line: 173, baseType: !5, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !696, file: !678, line: 174, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !678, line: 133, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 115, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !715, file: !678, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !715, file: !678, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !715, file: !678, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !715, file: !678, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !715, file: !678, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !715, file: !678, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !715, file: !678, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !715, file: !678, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !696, file: !678, line: 175, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !678, line: 175, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !696, file: !678, line: 176, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !731, line: 75, size: 256, elements: !732)
!731 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !{!733, !747, !748, !749}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !730, file: !731, line: 76, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !731, line: 68, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !731, line: 63, size: 320, elements: !737)
!737 = !{!738, !740, !741, !742}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !731, line: 64, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !736, file: !731, line: 65, baseType: !739, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !736, file: !731, line: 66, baseType: !7, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !736, file: !731, line: 67, baseType: !743, size: 128, offset: 192)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128, elements: !745)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !731, line: 29, baseType: !557)
!745 = !{!746}
!746 = !DISubrange(count: 2)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !730, file: !731, line: 77, baseType: !734, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !730, file: !731, line: 78, baseType: !7, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !730, file: !731, line: 79, baseType: !750, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !731, line: 49, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !731, line: 45, size: 832, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !752, file: !731, line: 46, baseType: !739, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !752, file: !731, line: 47, baseType: !729, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !752, file: !731, line: 48, baseType: !757, size: 704, offset: 128)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !758, line: 164, size: 704, elements: !759)
!758 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !{!760, !761, !772, !773, !774, !775, !776, !777, !781, !785, !786, !787, !788}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !757, file: !758, line: 166, baseType: !439, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !757, file: !758, line: 167, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !758, line: 157, size: 192, elements: !764)
!764 = !{!765, !767, !768}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !763, file: !758, line: 159, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !763, file: !758, line: 160, baseType: !762, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !763, file: !758, line: 161, baseType: !769, size: 32, offset: 128)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 32, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 4)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !757, file: !758, line: 168, baseType: !766, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !757, file: !758, line: 169, baseType: !766, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !757, file: !758, line: 170, baseType: !766, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !757, file: !758, line: 171, baseType: !439, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !757, file: !758, line: 172, baseType: !441, size: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !757, file: !758, line: 176, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!762, !432, !439}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !757, file: !758, line: 177, baseType: !782, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !432, !762}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !757, file: !758, line: 178, baseType: !432, size: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !757, file: !758, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !757, file: !758, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !757, file: !758, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !696, file: !678, line: 177, baseType: !504, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !696, file: !678, line: 178, baseType: !444, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !696, file: !678, line: 179, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !678, line: 150, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !678, line: 142, size: 320, elements: !795)
!795 = !{!796, !797, !798, !799, !802, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !794, file: !678, line: 144, baseType: !504, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !794, file: !678, line: 145, baseType: !675, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !678, line: 146, baseType: !675, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !794, file: !678, line: 147, baseType: !800, size: 32, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !801, line: 31, baseType: !441)
!801 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !794, file: !678, line: 148, baseType: !7, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !794, file: !678, line: 149, baseType: !621, size: 8, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !696, file: !678, line: 180, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !678, line: 162, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !678, line: 159, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !807, file: !678, line: 160, baseType: !504, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !807, file: !678, line: 161, baseType: !439, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !696, file: !678, line: 181, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !678, line: 181, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !691, file: !678, line: 317, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !602)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !691, file: !678, line: 318, baseType: !817, size: 320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !678, line: 188, size: 320, elements: !818)
!818 = !{!819, !821, !878}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !817, file: !678, line: 190, baseType: !820, size: 192)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 192, elements: !576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !817, file: !678, line: 193, baseType: !822, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !678, line: 206, size: 320, elements: !824)
!824 = !{!825, !863, !864, !865, !877}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !823, file: !678, line: 208, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !401, line: 62, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !829, line: 538, size: 256, elements: !830)
!829 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!830 = !{!831, !835, !841, !854}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !829, line: 539, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !829, line: 482, size: 32, elements: !833)
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !832, file: !829, line: 484, baseType: !7, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !828, file: !829, line: 540, baseType: !836, size: 192)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !829, line: 488, size: 192, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !836, file: !829, line: 489, baseType: !832, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !829, line: 492, baseType: !701, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !836, file: !829, line: 496, baseType: !504, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !828, file: !829, line: 541, baseType: !842, size: 256)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !829, line: 504, size: 256, elements: !843)
!843 = !{!844, !845, !852, !853}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !829, line: 505, baseType: !832, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !842, file: !829, line: 509, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !829, line: 501, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !842, file: !829, line: 510, baseType: !850, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !842, file: !829, line: 513, baseType: !826, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !828, file: !829, line: 542, baseType: !855, size: 128)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !829, line: 530, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !829, line: 531, baseType: !832, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !855, file: !829, line: 534, baseType: !859, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !829, line: 525, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!621, !504, !701, !557, !557}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !823, file: !678, line: 211, baseType: !7, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !823, file: !678, line: 214, baseType: !439, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !823, file: !678, line: 224, baseType: !866, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !678, line: 202, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !678, line: 202, size: 128, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !868, file: !678, line: 202, baseType: !871, size: 128)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !678, line: 200, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !678, line: 200, size: 128, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !872, file: !678, line: 200, baseType: !7, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !872, file: !678, line: 200, baseType: !7, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !872, file: !678, line: 200, baseType: !711, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !823, file: !678, line: 234, baseType: !866, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !817, file: !678, line: 197, baseType: !439, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !691, file: !678, line: 319, baseType: !565, size: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !691, file: !678, line: 320, baseType: !584, size: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !506, file: !164, line: 3384, baseType: !882, size: 1472)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !883)
!883 = !{!884, !905, !906, !907, !908}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !164, line: 3115, baseType: !885, size: 1216)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !885, file: !164, line: 2985, baseType: !671, size: 960)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !885, file: !164, line: 2986, baseType: !504, size: 64, offset: 960)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !885, file: !164, line: 2987, baseType: !504, size: 64, offset: 1024)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !885, file: !164, line: 2988, baseType: !504, size: 64, offset: 1088)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !885, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !885, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !885, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !885, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !885, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !885, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !885, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !885, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !885, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !885, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !885, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !885, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !885, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !885, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !882, file: !164, line: 3117, baseType: !504, size: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !882, file: !164, line: 3119, baseType: !504, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !882, file: !164, line: 3121, baseType: !504, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !882, file: !164, line: 3123, baseType: !504, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !506, file: !164, line: 3385, baseType: !910, size: 1088)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !164, line: 2875, baseType: !671, size: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !910, file: !164, line: 2876, baseType: !675, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !910, file: !164, line: 2877, baseType: !915, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !917, line: 172, size: 128, elements: !918)
!917 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!918 = !{!919, !920, !921, !922, !923, !924, !925}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !916, file: !917, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !916, file: !917, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !916, file: !917, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !916, file: !917, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !916, file: !917, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !916, file: !917, line: 195, baseType: !7, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !916, file: !917, line: 199, baseType: !504, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !506, file: !164, line: 3386, baseType: !885, size: 1216)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !506, file: !164, line: 3387, baseType: !928, size: 1280)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !164, line: 3094, baseType: !885, size: 1216)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !928, file: !164, line: 3095, baseType: !915, size: 64, offset: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !506, file: !164, line: 3388, baseType: !933, size: 1216)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !164, line: 2825, baseType: !633, size: 896)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !933, file: !164, line: 2827, baseType: !504, size: 64, offset: 896)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !933, file: !164, line: 2828, baseType: !504, size: 64, offset: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !933, file: !164, line: 2829, baseType: !504, size: 64, offset: 1024)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !933, file: !164, line: 2830, baseType: !504, size: 64, offset: 1088)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !933, file: !164, line: 2831, baseType: !504, size: 64, offset: 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !506, file: !164, line: 3389, baseType: !942, size: 1024)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !164, line: 2851, baseType: !671, size: 960)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !942, file: !164, line: 2852, baseType: !441, size: 32, offset: 960)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !942, file: !164, line: 2853, baseType: !441, size: 32, offset: 992)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !506, file: !164, line: 3390, baseType: !948, size: 1024)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !164, line: 2858, baseType: !671, size: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !948, file: !164, line: 2859, baseType: !915, size: 64, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !506, file: !164, line: 3391, baseType: !953, size: 960)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !953, file: !164, line: 2863, baseType: !671, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !506, file: !164, line: 3392, baseType: !957, size: 1472)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !164, line: 3305, baseType: !882, size: 1472)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !506, file: !164, line: 3393, baseType: !961, size: 1792)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !962)
!962 = !{!963, !964, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !961, file: !164, line: 3249, baseType: !882, size: 1472)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !961, file: !164, line: 3251, baseType: !965, size: 64, offset: 1472)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !967, line: 463, size: 1152, elements: !968)
!967 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!968 = !{!969, !972, !1002, !1003, !1142, !1205, !1206, !1207, !1208, !1209, !1210, !1234, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !966, file: !967, line: 464, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !967, line: 464, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !966, file: !967, line: 467, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !975)
!975 = !{!976, !977, !978, !991, !992, !993, !994, !995, !996, !998, !1000, !1001}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !974, file: !135, line: 377, baseType: !443, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !974, file: !135, line: 378, baseType: !443, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !974, file: !135, line: 381, baseType: !979, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !981, file: !135, line: 282, baseType: !984, size: 128)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !985, file: !135, line: 281, baseType: !7, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !985, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !985, file: !135, line: 281, baseType: !990, size: 64, offset: 64)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 64, elements: !602)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !974, file: !135, line: 384, baseType: !441, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !974, file: !135, line: 387, baseType: !441, size: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !974, file: !135, line: 390, baseType: !441, size: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !974, file: !135, line: 394, baseType: !979, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !974, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !974, file: !135, line: 399, baseType: !997, size: 64, offset: 416)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !745)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !974, file: !135, line: 402, baseType: !999, size: 64, offset: 480)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !745)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !974, file: !135, line: 406, baseType: !441, size: 32, offset: 544)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !974, file: !135, line: 409, baseType: !441, size: 32, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !966, file: !967, line: 470, baseType: !471, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !966, file: !967, line: 473, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !917, line: 39, size: 1152, elements: !1006)
!1006 = !{!1007, !1057, !1070, !1083, !1084, !1096, !1097, !1101, !1102, !1103, !1104, !1105}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1005, file: !917, line: 41, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1009, line: 144, baseType: !1010)
!1009 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1009, line: 100, size: 896, elements: !1012)
!1012 = !{!1013, !1019, !1024, !1029, !1031, !1034, !1035, !1036, !1037, !1038, !1043, !1045, !1046, !1051, !1056}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1011, file: !1009, line: 102, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1009, line: 52, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018, !850}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1009, line: 47, baseType: !7)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1011, file: !1009, line: 105, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1009, line: 59, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!441, !850, !850}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1011, file: !1009, line: 108, baseType: !1025, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1009, line: 63, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !432}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1011, file: !1009, line: 111, baseType: !1030, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1011, file: !1009, line: 114, baseType: !1032, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1033, line: 46, baseType: !557)
!1033 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1011, file: !1009, line: 117, baseType: !1032, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1011, file: !1009, line: 120, baseType: !1032, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1011, file: !1009, line: 124, baseType: !7, size: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1011, file: !1009, line: 128, baseType: !7, size: 32, offset: 480)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1011, file: !1009, line: 131, baseType: !1039, size: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1009, line: 75, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!432, !1032, !1032}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1011, file: !1009, line: 132, baseType: !1044, size: 64, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1009, line: 78, baseType: !1026)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1011, file: !1009, line: 135, baseType: !432, size: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1011, file: !1009, line: 136, baseType: !1047, size: 64, offset: 704)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1009, line: 82, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!432, !432, !1032, !1032}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1011, file: !1009, line: 137, baseType: !1052, size: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1009, line: 83, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !432, !432}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1011, file: !1009, line: 141, baseType: !7, size: 32, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1005, file: !917, line: 48, baseType: !1058, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !473, line: 35, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !473, line: 35, size: 128, elements: !1061)
!1061 = !{!1062}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1060, file: !473, line: 35, baseType: !1063, size: 128)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !473, line: 33, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !473, line: 33, size: 128, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1064, file: !473, line: 33, baseType: !7, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1064, file: !473, line: 33, baseType: !7, size: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1064, file: !473, line: 33, baseType: !1069, size: 64, offset: 64)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 64, elements: !602)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1005, file: !917, line: 51, baseType: !1071, size: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1073, file: !164, line: 183, baseType: !1076, size: 128)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !164, line: 182, size: 128, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1077, file: !164, line: 182, baseType: !7, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1077, file: !164, line: 182, baseType: !7, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1077, file: !164, line: 182, baseType: !1082, size: 64, offset: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 64, elements: !602)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1005, file: !917, line: 54, baseType: !504, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1005, file: !917, line: 57, baseType: !1085, size: 128, offset: 256)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1086, line: 31, size: 128, elements: !1087)
!1086 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1085, file: !1086, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1085, file: !1086, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1085, file: !1086, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1085, file: !1086, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1085, file: !1086, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1085, file: !1086, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1085, file: !1086, line: 56, baseType: !1095, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !401, line: 47, baseType: !729)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1005, file: !917, line: 60, baseType: !1085, size: 128, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1005, file: !917, line: 64, baseType: !1098, size: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1100, line: 33, flags: DIFlagFwdDecl)
!1100 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1005, file: !917, line: 67, baseType: !504, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1005, file: !917, line: 73, baseType: !1008, size: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1005, file: !917, line: 77, baseType: !1095, size: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1005, file: !917, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1005, file: !917, line: 82, baseType: !1106, size: 320, offset: 832)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1107, line: 62, size: 320, elements: !1108)
!1107 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1108 = !{!1109, !1115, !1116, !1117, !1118, !1125}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1106, file: !1107, line: 63, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1107, line: 56, size: 128, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1111, file: !1107, line: 57, baseType: !1110, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1111, file: !1107, line: 58, baseType: !600, size: 8, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1106, file: !1107, line: 64, baseType: !7, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1106, file: !1107, line: 66, baseType: !7, size: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1106, file: !1107, line: 68, baseType: !621, size: 8, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1106, file: !1107, line: 70, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1107, line: 37, size: 128, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !1107, line: 39, baseType: !1119, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1120, file: !1107, line: 40, baseType: !1124, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1106, file: !1107, line: 71, baseType: !1126, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1107, line: 45, size: 320, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1127, file: !1107, line: 47, baseType: !1126, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1127, file: !1107, line: 48, baseType: !1131, size: 256, offset: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1132)
!1132 = !{!1133, !1135, !1136, !1141}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1131, file: !164, line: 1884, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !164, line: 1885, baseType: !1134, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1131, file: !164, line: 1891, baseType: !1137, size: 64, offset: 128)
!1137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1131, file: !164, line: 1891, size: 64, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1137, file: !164, line: 1891, baseType: !481, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1137, file: !164, line: 1891, baseType: !504, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1131, file: !164, line: 1892, baseType: !1124, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !966, file: !967, line: 476, baseType: !1143, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1145)
!1145 = !{!1146, !1147, !1203, !1204}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1144, file: !146, line: 189, baseType: !441, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1144, file: !146, line: 192, baseType: !1148, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1151)
!1151 = !{!1152}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1150, file: !146, line: 87, baseType: !1153, size: 128)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1154, file: !146, line: 85, baseType: !7, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1154, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1154, file: !146, line: 85, baseType: !1159, size: 64, offset: 64)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 64, elements: !602)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1193, !1201, !1202}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1162, file: !146, line: 102, baseType: !441, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1162, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1162, file: !146, line: 108, baseType: !444, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1162, file: !146, line: 111, baseType: !444, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1162, file: !146, line: 114, baseType: !1169, size: 64, offset: 192)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1169, file: !146, line: 42, baseType: !145, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1169, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1162, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1162, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1162, file: !146, line: 123, baseType: !1148, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1162, file: !146, line: 126, baseType: !1161, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1162, file: !146, line: 129, baseType: !1161, size: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1162, file: !146, line: 132, baseType: !432, size: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1162, file: !146, line: 139, baseType: !504, size: 64, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1162, file: !146, line: 143, baseType: !552, size: 128, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1162, file: !146, line: 146, baseType: !552, size: 128, offset: 768)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1162, file: !146, line: 148, baseType: !621, size: 8, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1162, file: !146, line: 149, baseType: !621, size: 8, offset: 904)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1162, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1162, file: !146, line: 156, baseType: !1186, size: 64, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1187, file: !146, line: 50, baseType: !481, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1187, file: !146, line: 59, baseType: !552, size: 128, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1187, file: !146, line: 64, baseType: !621, size: 8, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1187, file: !146, line: 67, baseType: !1186, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1162, file: !146, line: 159, baseType: !1194, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1195, file: !146, line: 74, baseType: !461, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1195, file: !146, line: 77, baseType: !1194, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1195, file: !146, line: 78, baseType: !1194, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1195, file: !146, line: 81, baseType: !1194, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1162, file: !146, line: 162, baseType: !621, size: 8, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1162, file: !146, line: 166, baseType: !504, size: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1144, file: !146, line: 197, baseType: !1008, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1144, file: !146, line: 200, baseType: !1161, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !966, file: !967, line: 479, baseType: !1008, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !966, file: !967, line: 484, baseType: !504, size: 64, offset: 384)
