; ModuleID = 'insn-modes.c'
source_filename = "insn-modes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.real_format = type { void (%struct.real_format*, i64*, %struct.real_value*)*, void (%struct.real_format*, %struct.real_value*, i64*)*, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.real_value = type { i32, [3 x i64] }

@.str = private unnamed_addr constant [5 x i8] c"VOID\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"BLK\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"CC\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"CCGC\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"CCGOC\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"CCNO\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"CCA\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"CCC\00", align 1
@.str.8 = private unnamed_addr constant [4 x i8] c"CCO\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"CCS\00", align 1
@.str.10 = private unnamed_addr constant [4 x i8] c"CCZ\00", align 1
@.str.11 = private unnamed_addr constant [5 x i8] c"CCFP\00", align 1
@.str.12 = private unnamed_addr constant [6 x i8] c"CCFPU\00", align 1
@.str.13 = private unnamed_addr constant [3 x i8] c"BI\00", align 1
@.str.14 = private unnamed_addr constant [3 x i8] c"QI\00", align 1

!141 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!142 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!143 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!144 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!145 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!146 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!147 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!148 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!149 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!150 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!151 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!152 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!153 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!154 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!155 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!156 = !{!134}
!157 = !{!0, !158, !165, !170, !173, !175, !177, !179, !184, !186, !188, !193, !246, !248}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "mode_class", scope: !2, file: !3, line: 102, type: !160, isLocal: false, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 696, elements: !163)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!163 = !{!164}
!164 = !DISubrange(count: 87)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "mode_precision", scope: !2, file: !3, line: 193, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1392, elements: !163)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "mode_size", scope: !2, file: !3, line: 284, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 696, elements: !163)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "mode_nunits", scope: !2, file: !3, line: 375, type: !160, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "mode_wider", scope: !2, file: !3, line: 466, type: !160, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "mode_2xwider", scope: !2, file: !3, line: 557, type: !160, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "mode_mask_array", scope: !2, file: !3, line: 648, type: !181, isLocal: false, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 5568, elements: !163)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "mode_inner", scope: !2, file: !3, line: 745, type: !160, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "mode_base_align", scope: !2, file: !3, line: 836, type: !172, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "class_narrowest_mode", scope: !2, file: !3, line: 927, type: !190, isLocal: false, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 144, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 18)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "real_format_for_mode", scope: !2, file: !3, line: 950, type: !195, isLocal: false, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 448, elements: !244)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_format", file: !199, line: 124, size: 448, elements: !200)
!199 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!200 = !{!201, !221, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !198, file: !199, line: 127, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !196, !205, !207}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !199, line: 52, size: 256, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !209, file: !199, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !209, file: !199, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !209, file: !199, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !209, file: !199, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !209, file: !199, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !209, file: !199, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !209, file: !199, line: 62, baseType: !218, size: 192, offset: 64)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 192, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 3)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !198, file: !199, line: 129, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !196, !225, !226}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !198, file: !199, line: 133, baseType: !229, size: 32, offset: 128)
!229 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !198, file: !199, line: 136, baseType: !229, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pnan", scope: !198, file: !199, line: 139, baseType: !229, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !198, file: !199, line: 142, baseType: !229, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !198, file: !199, line: 145, baseType: !229, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_ro", scope: !198, file: !199, line: 149, baseType: !229, size: 32, offset: 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_rw", scope: !198, file: !199, line: 153, baseType: !229, size: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "round_towards_zero", scope: !198, file: !199, line: 156, baseType: !162, size: 8, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "has_sign_dependent_rounding", scope: !198, file: !199, line: 157, baseType: !162, size: 8, offset: 360)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "has_nans", scope: !198, file: !199, line: 160, baseType: !162, size: 8, offset: 368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "has_inf", scope: !198, file: !199, line: 161, baseType: !162, size: 8, offset: 376)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "has_denorm", scope: !198, file: !199, line: 162, baseType: !162, size: 8, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "has_signed_zero", scope: !198, file: !199, line: 163, baseType: !162, size: 8, offset: 392)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "qnan_msb_set", scope: !198, file: !199, line: 164, baseType: !162, size: 8, offset: 400)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_nan_lsbs_set", scope: !198, file: !199, line: 165, baseType: !162, size: 8, offset: 408)
!244 = !{!245}
!245 = !DISubrange(count: 7)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "mode_ibit", scope: !2, file: !3, line: 982, type: !160, isLocal: false, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "mode_fbit", scope: !2, file: !3, line: 1073, type: !160, isLocal: false, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 5568, elements: !163)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!255 = !{i32 7, !"Dwarf Version", i32 4}
!256 = !{i32 2, !"Debug Info Version", i32 3}
!257 = !{i32 1, !"wchar_size", i32 4}
!258 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!259 = distinct !DISubprogram(name: "init_adjust_machine_modes", scope: !3, file: !3, line: 962, type: !260, scopeLine: 963, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{null}
!262 = !{}
!263 = !DILocalVariable(name: "s", scope: !259, file: !3, line: 964, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !265, line: 46, baseType: !183)
!265 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!266 = !DILocation(line: 964, column: 10, scope: !259)
!267 = !DILocation(line: 967, column: 7, scope: !259)
!268 = !DILocation(line: 967, column: 5, scope: !259)
!269 = !DILocation(line: 968, column: 23, scope: !259)
!270 = !DILocation(line: 968, column: 21, scope: !259)
!271 = !DILocation(line: 969, column: 29, scope: !259)
!272 = !DILocation(line: 969, column: 35, scope: !259)
!273 = !DILocation(line: 969, column: 34, scope: !259)
!274 = !DILocation(line: 969, column: 37, scope: !259)
!275 = !DILocation(line: 969, column: 31, scope: !259)
!276 = !DILocation(line: 969, column: 27, scope: !259)
!277 = !DILocation(line: 970, column: 25, scope: !259)
!278 = !DILocation(line: 970, column: 24, scope: !259)
!279 = !DILocation(line: 970, column: 23, scope: !259)
!280 = !DILocation(line: 970, column: 21, scope: !259)
!281 = !DILocation(line: 971, column: 29, scope: !259)
!282 = !DILocation(line: 971, column: 35, scope: !259)
!283 = !DILocation(line: 971, column: 34, scope: !259)
!284 = !DILocation(line: 971, column: 37, scope: !259)
!285 = !DILocation(line: 971, column: 31, scope: !259)
!286 = !DILocation(line: 971, column: 27, scope: !259)
!287 = !DILocation(line: 974, column: 7, scope: !259)
!288 = !DILocation(line: 974, column: 5, scope: !259)
!289 = !DILocation(line: 975, column: 29, scope: !259)
!290 = !DILocation(line: 975, column: 27, scope: !259)
!291 = !DILocation(line: 976, column: 29, scope: !259)
!292 = !DILocation(line: 976, column: 27, scope: !259)
!293 = !DILocation(line: 979, column: 32, scope: !259)
!294 = !DILocation(line: 979, column: 3, scope: !259)
!295 = !DILocation(line: 979, column: 29, scope: !259)
!296 = !DILocation(line: 980, column: 1, scope: !259)
