; ModuleID = 'tree-ssa-phiopt.c'
source_filename = "tree-ssa-phiopt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!760 = !DIEnumerator(name: "TI_SAT_QQ_TYPE", value: 99, isUnsigned: true)
!761 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!762 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!763 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!764 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!765 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!766 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!767 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!768 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!769 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!770 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!771 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!772 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!773 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!774 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!775 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!776 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!777 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!778 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!779 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!780 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!781 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!782 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!783 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!784 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!785 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!786 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!787 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!788 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!789 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!790 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!791 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!792 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !794, line: 36, baseType: !7, size: 32, elements: !795)
!794 = !DIFile(filename: "./machmode.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!796 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!797 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!798 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!799 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!800 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!801 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!802 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!803 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!804 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!805 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!806 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!807 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!808 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!809 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!810 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!811 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!812 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!813 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!814 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!815 = !{!816, !7, !933, !1159, !880, !2118, !183, !2125, !856, !2126, !1470, !1144, !648, !976, !875, !793, !5}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !818, line: 111, baseType: !819)
!818 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !821)
!821 = !{!822, !2083, !2084, !2085, !2088, !2092, !2093, !2094, !2112, !2113, !2114, !2115, !2116, !2117}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !820, file: !135, line: 219, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !825, file: !135, line: 151, baseType: !828, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !829, file: !135, line: 150, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !829, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !829, file: !135, line: 150, baseType: !834, size: 64, offset: 64)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 64, elements: !980)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !818, line: 108, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !838)
!838 = !{!839, !840, !841, !2075, !2076, !2077, !2078, !2079, !2080, !2081}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !837, file: !135, line: 124, baseType: !819, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !837, file: !135, line: 125, baseType: !819, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !837, file: !135, line: 131, baseType: !842, size: 64, offset: 128)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !843)
!843 = !{!844, !2074}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !842, file: !135, line: 129, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !818, line: 66, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !848)
!848 = !{!849, !2072, !2073}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !847, file: !561, line: 145, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !818, line: 69, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !853)
!853 = !{!854, !2070, !2071}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !852, file: !561, line: 137, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !818, line: 58, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !858)
!858 = !{!859, !1917, !1927, !1933, !1938, !1943, !1950, !1956, !1962, !1967, !1981, !1986, !1992, !1997, !2007, !2012, !2028, !2035, !2042, !2048, !2053, !2059, !2065}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !857, file: !561, line: 738, baseType: !860, size: 256)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !877, !878, !879}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !860, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !860, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !860, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !860, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !860, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !860, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !860, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !860, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !860, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !860, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !860, file: !561, line: 316, baseType: !873, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !874, line: 58, baseType: !875)
!874 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !876, line: 44, baseType: !7)
!876 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!877 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !860, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !860, file: !561, line: 323, baseType: !819, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !860, file: !561, line: 327, baseType: !880, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !818, line: 56, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !883)
!883 = !{!884, !917, !923, !936, !955, !966, !971, !982, !988, !1002, !1010, !1048, !1226, !1254, !1271, !1272, !1277, !1286, !1292, !1297, !1301, !1305, !1568, !1615, !1621, !1627, !1634, !1647, !1661, !1678, !1690, !1712, !1727, !1899}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !882, file: !151, line: 3372, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !885, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !885, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !885, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !885, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !885, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !885, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !885, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !885, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !885, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !885, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !885, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !885, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !885, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !885, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !885, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !885, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !885, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !885, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !885, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !885, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !885, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !885, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !885, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !885, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !885, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !885, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !885, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !885, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !885, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !885, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !151, line: 3373, baseType: !918, size: 192)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !918, file: !151, line: 403, baseType: !885, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !918, file: !151, line: 404, baseType: !880, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !918, file: !151, line: 405, baseType: !880, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !882, file: !151, line: 3374, baseType: !924, size: 320)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !151, line: 1385, baseType: !918, size: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !924, file: !151, line: 1386, baseType: !928, size: 128, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !929, line: 58, baseType: !930)
!929 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !929, line: 54, size: 128, elements: !931)
!931 = !{!932, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !930, file: !929, line: 56, baseType: !933, size: 64)
!933 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !930, file: !929, line: 57, baseType: !935, size: 64, offset: 64)
!935 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !882, file: !151, line: 3375, baseType: !937, size: 256)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !151, line: 1398, baseType: !918, size: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !937, file: !151, line: 1399, baseType: !941, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !943, line: 52, size: 256, elements: !944)
!943 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!944 = !{!945, !946, !947, !948, !949, !950, !951}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !942, file: !943, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !942, file: !943, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !942, file: !943, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !942, file: !943, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !942, file: !943, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !942, file: !943, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !942, file: !943, line: 62, baseType: !952, size: 192, offset: 64)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 192, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 3)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !882, file: !151, line: 3376, baseType: !956, size: 256)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !956, file: !151, line: 1409, baseType: !918, size: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !956, file: !151, line: 1410, baseType: !960, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !962, line: 27, size: 192, elements: !963)
!962 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !961, file: !962, line: 29, baseType: !928, size: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !961, file: !962, line: 30, baseType: !5, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !882, file: !151, line: 3377, baseType: !967, size: 256)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !151, line: 1438, baseType: !918, size: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !967, file: !151, line: 1439, baseType: !880, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !882, file: !151, line: 3378, baseType: !972, size: 256)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !973)
!973 = !{!974, !975, !977}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !151, line: 1419, baseType: !918, size: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !972, file: !151, line: 1420, baseType: !976, size: 32, offset: 192)
!976 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !972, file: !151, line: 1421, baseType: !978, size: 8, offset: 224)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 8, elements: !980)
!979 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!980 = !{!981}
!981 = !DISubrange(count: 1)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !882, file: !151, line: 3379, baseType: !983, size: 320)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !151, line: 1429, baseType: !918, size: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !983, file: !151, line: 1430, baseType: !880, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !983, file: !151, line: 1431, baseType: !880, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !882, file: !151, line: 3380, baseType: !989, size: 320)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !151, line: 1461, baseType: !918, size: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !989, file: !151, line: 1462, baseType: !993, size: 128, offset: 192)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !994, line: 31, size: 128, elements: !995)
!994 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!995 = !{!996, !1000, !1001}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !994, line: 32, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !993, file: !994, line: 33, baseType: !7, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !993, file: !994, line: 34, baseType: !7, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !882, file: !151, line: 3381, baseType: !1003, size: 384)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !151, line: 2508, baseType: !918, size: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1003, file: !151, line: 2509, baseType: !873, size: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1003, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !151, line: 2511, baseType: !880, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1003, file: !151, line: 2512, baseType: !880, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !882, file: !151, line: 3382, baseType: !1011, size: 896)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !151, line: 2653, baseType: !1003, size: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1011, file: !151, line: 2654, baseType: !880, size: 64, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1011, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1011, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1011, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1011, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1011, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1011, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1011, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1011, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1011, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1011, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1011, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1011, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1011, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1011, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1011, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1011, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1011, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1011, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1011, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1011, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1011, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1011, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1011, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1011, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1011, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1011, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1011, file: !151, line: 2705, baseType: !880, size: 64, offset: 576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1011, file: !151, line: 2706, baseType: !880, size: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1011, file: !151, line: 2707, baseType: !880, size: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1011, file: !151, line: 2708, baseType: !880, size: 64, offset: 768)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1011, file: !151, line: 2711, baseType: !1046, size: 64, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !882, file: !151, line: 3383, baseType: !1049, size: 960)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1049, file: !151, line: 2757, baseType: !1011, size: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1049, file: !151, line: 2758, baseType: !1053, size: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !818, line: 50, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1056, line: 240, size: 384, elements: !1057)
!1056 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1055, file: !1056, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1055, file: !1056, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1055, file: !1056, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1055, file: !1056, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1055, file: !1056, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1055, file: !1056, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1055, file: !1056, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1055, file: !1056, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1055, file: !1056, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1055, file: !1056, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1055, file: !1056, line: 321, baseType: !1069, size: 320, offset: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1056, line: 315, size: 320, elements: !1070)
!1070 = !{!1071, !1193, !1195, !1224, !1225}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1069, file: !1056, line: 316, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 64, elements: !980)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1056, line: 183, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1056, line: 166, size: 64, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1081, !1082, !1090, !1091, !1103, !1106, !1168, !1169, !1170, !1183, !1190}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1074, file: !1056, line: 168, baseType: !976, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1074, file: !1056, line: 169, baseType: !7, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1074, file: !1056, line: 170, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1074, file: !1056, line: 171, baseType: !1053, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1074, file: !1056, line: 172, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !818, line: 53, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1056, line: 359, size: 128, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1085, file: !1056, line: 360, baseType: !976, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1085, file: !1056, line: 361, baseType: !1089, size: 64, offset: 64)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 64, elements: !980)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1074, file: !1056, line: 173, baseType: !5, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1074, file: !1056, line: 174, baseType: !1092, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1056, line: 133, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1056, line: 115, size: 32, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1093, file: !1056, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1093, file: !1056, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1093, file: !1056, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1093, file: !1056, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1093, file: !1056, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1093, file: !1056, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1093, file: !1056, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1093, file: !1056, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1074, file: !1056, line: 175, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1056, line: 175, flags: DIFlagFwdDecl)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1074, file: !1056, line: 176, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1109, line: 75, size: 256, elements: !1110)
!1109 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1110 = !{!1111, !1125, !1126, !1127}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1108, file: !1109, line: 76, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1109, line: 68, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1109, line: 63, size: 320, elements: !1115)
!1115 = !{!1116, !1118, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !1109, line: 64, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1114, file: !1109, line: 65, baseType: !1117, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1114, file: !1109, line: 66, baseType: !7, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1114, file: !1109, line: 67, baseType: !1121, size: 128, offset: 192)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 128, elements: !1123)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1109, line: 29, baseType: !933)
!1123 = !{!1124}
!1124 = !DISubrange(count: 2)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1108, file: !1109, line: 77, baseType: !1112, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1108, file: !1109, line: 78, baseType: !7, size: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1108, file: !1109, line: 79, baseType: !1128, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1109, line: 49, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1109, line: 45, size: 832, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1130, file: !1109, line: 46, baseType: !1117, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1130, file: !1109, line: 47, baseType: !1107, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1130, file: !1109, line: 48, baseType: !1135, size: 704, offset: 128)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1136, line: 164, size: 704, elements: !1137)
!1136 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1137 = !{!1138, !1139, !1150, !1151, !1152, !1153, !1154, !1155, !1160, !1164, !1165, !1166, !1167}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1135, file: !1136, line: 166, baseType: !935, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1135, file: !1136, line: 167, baseType: !1140, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1136, line: 157, size: 192, elements: !1142)
!1142 = !{!1143, !1145, !1146}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1141, file: !1136, line: 159, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1141, file: !1136, line: 160, baseType: !1140, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1141, file: !1136, line: 161, baseType: !1147, size: 32, offset: 128)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 32, elements: !1148)
!1148 = !{!1149}
!1149 = !DISubrange(count: 4)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1135, file: !1136, line: 168, baseType: !1144, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1135, file: !1136, line: 169, baseType: !1144, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1135, file: !1136, line: 170, baseType: !1144, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1135, file: !1136, line: 171, baseType: !935, size: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1135, file: !1136, line: 172, baseType: !976, size: 32, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1135, file: !1136, line: 176, baseType: !1156, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1140, !1159, !935}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1135, file: !1136, line: 177, baseType: !1161, size: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !1159, !1140}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1135, file: !1136, line: 178, baseType: !1159, size: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1135, file: !1136, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1135, file: !1136, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1135, file: !1136, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1074, file: !1056, line: 177, baseType: !880, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1074, file: !1056, line: 178, baseType: !819, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1074, file: !1056, line: 179, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1056, line: 150, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1056, line: 142, size: 320, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1181, !1182}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1173, file: !1056, line: 144, baseType: !880, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1173, file: !1056, line: 145, baseType: !1053, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !1056, line: 146, baseType: !1053, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1173, file: !1056, line: 147, baseType: !1179, size: 32, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1180, line: 31, baseType: !976)
!1180 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1173, file: !1056, line: 148, baseType: !7, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1173, file: !1056, line: 149, baseType: !999, size: 8, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1074, file: !1056, line: 180, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1056, line: 162, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1056, line: 159, size: 128, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1186, file: !1056, line: 160, baseType: !880, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1186, file: !1056, line: 161, baseType: !935, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1074, file: !1056, line: 181, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1056, line: 181, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1069, file: !1056, line: 317, baseType: !1194, size: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 64, elements: !980)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1069, file: !1056, line: 318, baseType: !1196, size: 320)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1056, line: 188, size: 320, elements: !1197)
!1197 = !{!1198, !1200, !1223}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1196, file: !1056, line: 190, baseType: !1199, size: 192)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 192, elements: !953)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1196, file: !1056, line: 193, baseType: !1201, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1056, line: 206, size: 320, elements: !1203)
!1203 = !{!1204, !1208, !1209, !1210, !1222}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1202, file: !1056, line: 208, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !818, line: 62, baseType: !1207)
!1207 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !818, line: 61, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1202, file: !1056, line: 211, baseType: !7, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !1056, line: 214, baseType: !935, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1202, file: !1056, line: 224, baseType: !1211, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1056, line: 202, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1056, line: 202, size: 128, elements: !1214)
!1214 = !{!1215}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1213, file: !1056, line: 202, baseType: !1216, size: 128)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1056, line: 200, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1056, line: 200, size: 128, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1217, file: !1056, line: 200, baseType: !7, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1217, file: !1056, line: 200, baseType: !7, size: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1217, file: !1056, line: 200, baseType: !1089, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1202, file: !1056, line: 234, baseType: !1211, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1196, file: !1056, line: 197, baseType: !935, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1069, file: !1056, line: 319, baseType: !942, size: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1069, file: !1056, line: 320, baseType: !961, size: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !882, file: !151, line: 3384, baseType: !1227, size: 1472)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1228)
!1228 = !{!1229, !1250, !1251, !1252, !1253}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !151, line: 3115, baseType: !1230, size: 1216)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !151, line: 2985, baseType: !1049, size: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1230, file: !151, line: 2986, baseType: !880, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1230, file: !151, line: 2987, baseType: !880, size: 64, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1230, file: !151, line: 2988, baseType: !880, size: 64, offset: 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1230, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1230, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1230, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1230, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1230, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1230, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1230, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1230, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1230, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1230, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1230, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1230, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1230, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1230, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1227, file: !151, line: 3117, baseType: !880, size: 64, offset: 1216)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1227, file: !151, line: 3119, baseType: !880, size: 64, offset: 1280)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1227, file: !151, line: 3121, baseType: !880, size: 64, offset: 1344)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1227, file: !151, line: 3123, baseType: !880, size: 64, offset: 1408)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !882, file: !151, line: 3385, baseType: !1255, size: 1088)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1255, file: !151, line: 2875, baseType: !1049, size: 960)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1255, file: !151, line: 2876, baseType: !1053, size: 64, offset: 960)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1255, file: !151, line: 2877, baseType: !1260, size: 64, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1262, line: 172, size: 128, elements: !1263)
!1262 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1263 = !{!1264, !1265, !1266, !1267, !1268, !1269, !1270}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1261, file: !1262, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1261, file: !1262, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1261, file: !1262, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1261, file: !1262, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1261, file: !1262, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1261, file: !1262, line: 195, baseType: !7, size: 32, offset: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1261, file: !1262, line: 199, baseType: !880, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !882, file: !151, line: 3386, baseType: !1230, size: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !882, file: !151, line: 3387, baseType: !1273, size: 1280)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1274)
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1273, file: !151, line: 3094, baseType: !1230, size: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1273, file: !151, line: 3095, baseType: !1260, size: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !882, file: !151, line: 3388, baseType: !1278, size: 1216)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1278, file: !151, line: 2825, baseType: !1011, size: 896)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1278, file: !151, line: 2827, baseType: !880, size: 64, offset: 896)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1278, file: !151, line: 2828, baseType: !880, size: 64, offset: 960)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1278, file: !151, line: 2829, baseType: !880, size: 64, offset: 1024)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1278, file: !151, line: 2830, baseType: !880, size: 64, offset: 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1278, file: !151, line: 2831, baseType: !880, size: 64, offset: 1152)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !882, file: !151, line: 3389, baseType: !1287, size: 1024)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !151, line: 2851, baseType: !1049, size: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1287, file: !151, line: 2852, baseType: !976, size: 32, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1287, file: !151, line: 2853, baseType: !976, size: 32, offset: 992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !882, file: !151, line: 3390, baseType: !1293, size: 1024)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1294)
!1294 = !{!1295, !1296}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1293, file: !151, line: 2858, baseType: !1049, size: 960)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1293, file: !151, line: 2859, baseType: !1260, size: 64, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !882, file: !151, line: 3391, baseType: !1298, size: 960)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1298, file: !151, line: 2863, baseType: !1049, size: 960)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !882, file: !151, line: 3392, baseType: !1302, size: 1472)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1303)
!1303 = !{!1304}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1302, file: !151, line: 3305, baseType: !1227, size: 1472)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !882, file: !151, line: 3393, baseType: !1306, size: 1792)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1307)
!1307 = !{!1308, !1309, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1306, file: !151, line: 3249, baseType: !1227, size: 1472)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1306, file: !151, line: 3251, baseType: !1310, size: 64, offset: 1472)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1312, line: 463, size: 1152, elements: !1313)
!1312 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1313 = !{!1314, !1317, !1347, !1348, !1488, !1491, !1492, !1493, !1494, !1495, !1496, !1520, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1311, file: !1312, line: 464, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1312, line: 464, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1311, file: !1312, line: 467, baseType: !1318, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1336, !1337, !1338, !1339, !1340, !1341, !1343, !1345, !1346}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1319, file: !135, line: 377, baseType: !817, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1319, file: !135, line: 378, baseType: !817, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1319, file: !135, line: 381, baseType: !1324, size: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1327)
!1327 = !{!1328}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1326, file: !135, line: 282, baseType: !1329, size: 128)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1331)
!1331 = !{!1332, !1333, !1334}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1330, file: !135, line: 281, baseType: !7, size: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1330, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1330, file: !135, line: 281, baseType: !1335, size: 64, offset: 64)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 64, elements: !980)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1319, file: !135, line: 384, baseType: !976, size: 32, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1319, file: !135, line: 387, baseType: !976, size: 32, offset: 224)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1319, file: !135, line: 390, baseType: !976, size: 32, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1319, file: !135, line: 394, baseType: !1324, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1319, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1319, file: !135, line: 399, baseType: !1342, size: 64, offset: 416)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !1123)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1319, file: !135, line: 402, baseType: !1344, size: 64, offset: 480)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1123)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1319, file: !135, line: 406, baseType: !976, size: 32, offset: 544)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1319, file: !135, line: 409, baseType: !976, size: 32, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1311, file: !1312, line: 470, baseType: !846, size: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1311, file: !1312, line: 473, baseType: !1349, size: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1262, line: 39, size: 1152, elements: !1351)
!1351 = !{!1352, !1403, !1416, !1429, !1430, !1442, !1443, !1447, !1448, !1449, !1450, !1451}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1350, file: !1262, line: 41, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !618, line: 144, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !618, line: 100, size: 896, elements: !1356)
!1356 = !{!1357, !1365, !1370, !1375, !1377, !1380, !1381, !1382, !1383, !1384, !1389, !1391, !1392, !1397, !1402}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1355, file: !618, line: 102, baseType: !1358, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !618, line: 52, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1362, !1363}
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !618, line: 47, baseType: !7)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1355, file: !618, line: 105, baseType: !1366, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !618, line: 59, baseType: !1367)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!976, !1363, !1363}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1355, file: !618, line: 108, baseType: !1371, size: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !618, line: 63, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{null, !1159}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1355, file: !618, line: 111, baseType: !1376, size: 64, offset: 192)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1355, file: !618, line: 114, baseType: !1378, size: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1379, line: 46, baseType: !933)
!1379 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1355, file: !618, line: 117, baseType: !1378, size: 64, offset: 320)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1355, file: !618, line: 120, baseType: !1378, size: 64, offset: 384)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1355, file: !618, line: 124, baseType: !7, size: 32, offset: 448)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1355, file: !618, line: 128, baseType: !7, size: 32, offset: 480)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1355, file: !618, line: 131, baseType: !1385, size: 64, offset: 512)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !618, line: 75, baseType: !1386)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!1159, !1378, !1378}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1355, file: !618, line: 132, baseType: !1390, size: 64, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !618, line: 78, baseType: !1372)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1355, file: !618, line: 135, baseType: !1159, size: 64, offset: 640)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1355, file: !618, line: 136, baseType: !1393, size: 64, offset: 704)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !618, line: 82, baseType: !1394)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!1159, !1159, !1378, !1378}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1355, file: !618, line: 137, baseType: !1398, size: 64, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !618, line: 83, baseType: !1399)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{null, !1159, !1159}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1355, file: !618, line: 141, baseType: !7, size: 32, offset: 832)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1350, file: !1262, line: 48, baseType: !1404, size: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !561, line: 35, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !561, line: 35, size: 128, elements: !1407)
!1407 = !{!1408}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1406, file: !561, line: 35, baseType: !1409, size: 128)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !561, line: 33, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !561, line: 33, size: 128, elements: !1411)
!1411 = !{!1412, !1413, !1414}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1410, file: !561, line: 33, baseType: !7, size: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1410, file: !561, line: 33, baseType: !7, size: 32, offset: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1410, file: !561, line: 33, baseType: !1415, size: 64, offset: 64)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 64, elements: !980)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1350, file: !1262, line: 51, baseType: !1417, size: 64, offset: 128)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1420)
!1420 = !{!1421}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1419, file: !151, line: 183, baseType: !1422, size: 128)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1424)
!1424 = !{!1425, !1426, !1427}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1423, file: !151, line: 182, baseType: !7, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1423, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1423, file: !151, line: 182, baseType: !1428, size: 64, offset: 64)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 64, elements: !980)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1350, file: !1262, line: 54, baseType: !880, size: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1350, file: !1262, line: 57, baseType: !1431, size: 128, offset: 256)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1432, line: 31, size: 128, elements: !1433)
!1432 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1433 = !{!1434, !1435, !1436, !1437, !1438, !1439, !1440}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1431, file: !1432, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1431, file: !1432, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1431, file: !1432, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1431, file: !1432, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1431, file: !1432, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1431, file: !1432, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1431, file: !1432, line: 56, baseType: !1441, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !818, line: 47, baseType: !1107)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1350, file: !1262, line: 60, baseType: !1431, size: 128, offset: 384)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1350, file: !1262, line: 64, baseType: !1444, size: 64, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1446, line: 33, flags: DIFlagFwdDecl)
!1446 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1350, file: !1262, line: 67, baseType: !880, size: 64, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1350, file: !1262, line: 73, baseType: !1353, size: 64, offset: 640)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1350, file: !1262, line: 77, baseType: !1441, size: 64, offset: 704)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1350, file: !1262, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1350, file: !1262, line: 82, baseType: !1452, size: 320, offset: 832)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1453, line: 62, size: 320, elements: !1454)
!1453 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1454 = !{!1455, !1461, !1462, !1463, !1464, !1471}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1452, file: !1453, line: 63, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1453, line: 56, size: 128, elements: !1458)
!1458 = !{!1459, !1460}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1457, file: !1453, line: 57, baseType: !1456, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1457, file: !1453, line: 58, baseType: !978, size: 8, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1452, file: !1453, line: 64, baseType: !7, size: 32, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1452, file: !1453, line: 66, baseType: !7, size: 32, offset: 96)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1452, file: !1453, line: 68, baseType: !999, size: 8, offset: 128)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1452, file: !1453, line: 70, baseType: !1465, size: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1453, line: 37, size: 128, elements: !1467)
!1467 = !{!1468, !1469}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1466, file: !1453, line: 39, baseType: !1465, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1466, file: !1453, line: 40, baseType: !1470, size: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1452, file: !1453, line: 71, baseType: !1472, size: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1453, line: 45, size: 320, elements: !1474)
!1474 = !{!1475, !1476}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1473, file: !1453, line: 47, baseType: !1472, size: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1473, file: !1453, line: 48, baseType: !1477, size: 256, offset: 64)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1478)
!1478 = !{!1479, !1481, !1482, !1487}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1477, file: !151, line: 1884, baseType: !1480, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1477, file: !151, line: 1885, baseType: !1480, size: 64, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1477, file: !151, line: 1891, baseType: !1483, size: 64, offset: 128)
!1483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1477, file: !151, line: 1891, size: 64, elements: !1484)
!1484 = !{!1485, !1486}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1483, file: !151, line: 1891, baseType: !855, size: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1483, file: !151, line: 1891, baseType: !880, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1477, file: !151, line: 1892, baseType: !1470, size: 64, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1311, file: !1312, line: 476, baseType: !1489, size: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1312, line: 476, flags: DIFlagFwdDecl)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1311, file: !1312, line: 479, baseType: !1353, size: 64, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1311, file: !1312, line: 484, baseType: !880, size: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1311, file: !1312, line: 488, baseType: !880, size: 64, offset: 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1311, file: !1312, line: 493, baseType: !880, size: 64, offset: 512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1311, file: !1312, line: 496, baseType: !880, size: 64, offset: 576)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1311, file: !1312, line: 501, baseType: !1497, size: 64, offset: 640)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1499)
!1499 = !{!1500, !1503, !1504, !1505, !1506, !1508, !1509, !1514, !1515, !1516, !1517, !1518, !1519}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1498, file: !146, line: 2356, baseType: !1501, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1498, file: !146, line: 2357, baseType: !1079, size: 64, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1498, file: !146, line: 2358, baseType: !976, size: 32, offset: 128)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1498, file: !146, line: 2359, baseType: !976, size: 32, offset: 160)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1498, file: !146, line: 2360, baseType: !1507, size: 128, offset: 192)
!1507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 128, elements: !1148)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1498, file: !146, line: 2364, baseType: !976, size: 32, offset: 320)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1498, file: !146, line: 2367, baseType: !1510, size: 128, offset: 384)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1511)
!1511 = !{!1512, !1513}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1510, file: !146, line: 2351, baseType: !1053, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1510, file: !146, line: 2352, baseType: !935, size: 64, offset: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1498, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1498, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1498, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1498, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1498, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1498, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1311, file: !1312, line: 504, baseType: !1521, size: 64, offset: 704)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1312, line: 504, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1311, file: !1312, line: 507, baseType: !1353, size: 64, offset: 768)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1311, file: !1312, line: 510, baseType: !976, size: 32, offset: 832)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1311, file: !1312, line: 513, baseType: !976, size: 32, offset: 864)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1311, file: !1312, line: 516, baseType: !873, size: 32, offset: 896)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1311, file: !1312, line: 519, baseType: !873, size: 32, offset: 928)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1311, file: !1312, line: 522, baseType: !7, size: 32, offset: 960)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1311, file: !1312, line: 523, baseType: !7, size: 32, offset: 992)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1311, file: !1312, line: 528, baseType: !1079, size: 64, offset: 1024)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1311, file: !1312, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1311, file: !1312, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1311, file: !1312, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1311, file: !1312, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1311, file: !1312, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1311, file: !1312, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1311, file: !1312, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1311, file: !1312, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1311, file: !1312, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1311, file: !1312, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1311, file: !1312, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1311, file: !1312, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1311, file: !1312, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1311, file: !1312, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1311, file: !1312, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1311, file: !1312, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1306, file: !151, line: 3254, baseType: !880, size: 64, offset: 1536)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1306, file: !151, line: 3257, baseType: !880, size: 64, offset: 1600)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1306, file: !151, line: 3258, baseType: !880, size: 64, offset: 1664)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1306, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1306, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1306, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1306, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1306, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1306, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1306, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1306, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1306, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1306, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1306, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1306, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1306, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1306, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1306, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1306, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
