; ModuleID = 'floatformat.c'
source_filename = "floatformat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.floatformat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, {}*, %struct.floatformat* }

@.str = private unnamed_addr constant [28 x i8] c"floatformat_ieee_single_big\00", align 1
@floatformat_ieee_single_big = dso_local constant { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i32 (%struct.floatformat*, i8*)*, %struct.floatformat* } { i32 1, i32 32, i32 0, i32 1, i32 8, i32 127, i32 255, i32 9, i32 23, i32 1, i8* getelementptr inbounds ([28 x i8], [28 x i8]* @.str, i32 0, i32 0), i32 (%struct.floatformat*, i8*)* @floatformat_always_valid, %struct.floatformat* null }, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"floatformat_ieee_single_little\00", align 1
@floatformat_ieee_single_little = dso_local constant { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i32 (%struct.floatformat*, i8*)*, %struct.floatformat* } { i32 0, i32 32, i32 0, i32 1, i32 8, i32 127, i32 255, i32 9, i32 23, i32 1, i8* getelementptr inbounds ([31 x i8], [31 x i8]* @.str.1, i32 0, i32 0), i32 (%struct.floatformat*, i8*)* @floatformat_always_valid, %struct.floatformat* null }, align 8, !dbg !25
@.str.2 = private unnamed_addr constant [28 x i8] c"floatformat_ieee_double_big\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "floatformat_ieee_single_big", scope: !2, file: !3, line: 81, type: !27, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "floatformat.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "floatformat_byteorders", file: !6, line: 34, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/floatformat.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "floatformat_little", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "floatformat_big", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "floatformat_littlebyte_bigword", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "floatformat_vax", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "floatformat_intbit", file: !6, line: 54, baseType: !7, size: 32, elements: !14)
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "floatformat_intbit_yes", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "floatformat_intbit_no", value: 1, isUnsigned: true)
!17 = !{!18, !21, !22, !23, !7}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!24 = !{!0, !25, !53, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !75, !77, !79, !81, !83, !85, !87}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "floatformat_ieee_single_little", scope: !2, file: !3, line: 89, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "floatformat", file: !6, line: 56, size: 512, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !37, !38, !39, !40, !41, !45, !52}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "byteorder", scope: !28, file: !6, line: 58, baseType: !5, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !28, file: !6, line: 59, baseType: !7, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sign_start", scope: !28, file: !6, line: 62, baseType: !7, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "exp_start", scope: !28, file: !6, line: 64, baseType: !7, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "exp_len", scope: !28, file: !6, line: 65, baseType: !7, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "exp_bias", scope: !28, file: !6, line: 71, baseType: !36, size: 32, offset: 160)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "exp_nan", scope: !28, file: !6, line: 75, baseType: !7, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "man_start", scope: !28, file: !6, line: 77, baseType: !7, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "man_len", scope: !28, file: !6, line: 78, baseType: !7, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "intbit", scope: !28, file: !6, line: 81, baseType: !13, size: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !6, line: 84, baseType: !42, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !28, file: !6, line: 87, baseType: !46, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!36, !49, !50}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "split_half", scope: !28, file: !6, line: 94, baseType: !49, size: 64, offset: 448)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_big", scope: !2, file: !3, line: 97, type: !27, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_little", scope: !2, file: !3, line: 105, type: !27, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "floatformat_ieee_double_littlebyte_bigword", scope: !2, file: !3, line: 117, type: !27, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "floatformat_vax_f", scope: !2, file: !3, line: 128, type: !27, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "floatformat_vax_d", scope: !2, file: !3, line: 136, type: !27, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "floatformat_vax_g", scope: !2, file: !3, line: 144, type: !27, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "floatformat_i387_ext", scope: !2, file: !3, line: 177, type: !27, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "floatformat_m68881_ext", scope: !2, file: !3, line: 185, type: !27, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "floatformat_i960_ext", scope: !2, file: !3, line: 194, type: !27, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "floatformat_m88110_ext", scope: !2, file: !3, line: 203, type: !27, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "floatformat_m88110_harris_ext", scope: !2, file: !3, line: 211, type: !27, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "floatformat_arm_ext_big", scope: !2, file: !3, line: 221, type: !27, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "floatformat_arm_ext_littlebyte_bigword", scope: !2, file: !3, line: 230, type: !27, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "floatformat_ia64_spill_big", scope: !2, file: !3, line: 239, type: !27, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "floatformat_ia64_spill_little", scope: !2, file: !3, line: 247, type: !27, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "floatformat_ia64_quad_big", scope: !2, file: !3, line: 255, type: !27, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "floatformat_ia64_quad_little", scope: !2, file: !3, line: 263, type: !27, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "floatformat_ibm_long_double", scope: !2, file: !3, line: 358, type: !27, isLocal: false, isDefinition: true)
