; ModuleID = 'cfgloopmanip.c'
source_filename = "cfgloopmanip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!590 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!613 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !405, line: 727, baseType: !7, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!616 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!639 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ir_type", file: !641, line: 80, baseType: !7, size: 32, elements: !642)
!641 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!642 = !{!643, !644, !645}
!643 = !DIEnumerator(name: "IR_GIMPLE", value: 0, isUnsigned: true)
!644 = !DIEnumerator(name: "IR_RTL_CFGRTL", value: 1, isUnsigned: true)
!645 = !DIEnumerator(name: "IR_RTL_CFGLAYOUT", value: 2, isUnsigned: true)
!646 = !{!647, !7, !710, !988, !2038, !2039, !1240, !1303, !428, !2040, !763, !2043, !665, !1356, !686, !2048, !1332, !973, !2050, !648, !2055, !1368, !806}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !641, line: 111, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !144, line: 217, size: 832, elements: !651)
!651 = !{!652, !2005, !2006, !2007, !2008, !2012, !2013, !2014, !2032, !2033, !2034, !2035, !2036, !2037}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !650, file: !144, line: 219, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !144, line: 151, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !144, line: 151, size: 128, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !655, file: !144, line: 151, baseType: !658, size: 128)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !144, line: 150, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !144, line: 150, size: 128, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !659, file: !144, line: 150, baseType: !7, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !659, file: !144, line: 150, baseType: !7, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !659, file: !144, line: 150, baseType: !664, size: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !810)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !641, line: 108, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !144, line: 122, size: 512, elements: !668)
!668 = !{!669, !670, !671, !1997, !1998, !1999, !2000, !2001, !2002, !2003}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !667, file: !144, line: 124, baseType: !649, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !667, file: !144, line: 125, baseType: !649, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !667, file: !144, line: 131, baseType: !672, size: 64, offset: 128)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !144, line: 128, size: 64, elements: !673)
!673 = !{!674, !1996}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !672, file: !144, line: 129, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !641, line: 66, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !405, line: 143, size: 192, elements: !678)
!678 = !{!679, !1994, !1995}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !677, file: !405, line: 145, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !641, line: 69, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !405, line: 136, size: 192, elements: !683)
!683 = !{!684, !1992, !1993}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !682, file: !405, line: 137, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !641, line: 58, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !405, line: 737, size: 768, elements: !688)
!688 = !{!689, !1839, !1849, !1855, !1860, !1865, !1872, !1878, !1884, !1889, !1903, !1908, !1914, !1919, !1929, !1934, !1950, !1957, !1964, !1970, !1975, !1981, !1987}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !687, file: !405, line: 738, baseType: !690, size: 256)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !405, line: 271, size: 256, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !707, !708, !709}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !690, file: !405, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !690, file: !405, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !690, file: !405, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !690, file: !405, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !690, file: !405, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !690, file: !405, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !690, file: !405, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !690, file: !405, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !690, file: !405, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !690, file: !405, line: 312, baseType: !7, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !690, file: !405, line: 316, baseType: !703, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !704, line: 58, baseType: !705)
!704 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !706, line: 44, baseType: !7)
!706 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !690, file: !405, line: 319, baseType: !7, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !690, file: !405, line: 323, baseType: !649, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !690, file: !405, line: 327, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !641, line: 56, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !155, line: 3371, size: 1792, elements: !713)
!713 = !{!714, !747, !753, !766, !785, !796, !801, !812, !818, !832, !840, !878, !1089, !1117, !1134, !1135, !1140, !1149, !1155, !1160, !1164, !1168, !1490, !1537, !1543, !1549, !1556, !1569, !1583, !1600, !1612, !1634, !1649, !1821}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !155, line: 3372, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !155, line: 360, size: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !715, file: !155, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !715, file: !155, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !715, file: !155, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !715, file: !155, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !715, file: !155, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !715, file: !155, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !715, file: !155, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !715, file: !155, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !715, file: !155, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !715, file: !155, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !715, file: !155, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !715, file: !155, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !715, file: !155, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !715, file: !155, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !715, file: !155, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !715, file: !155, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !715, file: !155, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !715, file: !155, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !715, file: !155, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !715, file: !155, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !715, file: !155, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !715, file: !155, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !715, file: !155, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !715, file: !155, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !715, file: !155, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !715, file: !155, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !715, file: !155, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !715, file: !155, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !715, file: !155, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !715, file: !155, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !155, line: 3373, baseType: !748, size: 192)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !155, line: 402, size: 192, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !748, file: !155, line: 403, baseType: !715, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !748, file: !155, line: 404, baseType: !710, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !155, line: 405, baseType: !710, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !155, line: 3374, baseType: !754, size: 320)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !155, line: 1384, size: 320, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !155, line: 1385, baseType: !748, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !754, file: !155, line: 1386, baseType: !758, size: 128, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !759, line: 58, baseType: !760)
!759 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 54, size: 128, elements: !761)
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !760, file: !759, line: 56, baseType: !763, size: 64)
!763 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !760, file: !759, line: 57, baseType: !765, size: 64, offset: 64)
!765 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !712, file: !155, line: 3375, baseType: !767, size: 256)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !155, line: 1397, size: 256, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !155, line: 1398, baseType: !748, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !767, file: !155, line: 1399, baseType: !771, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !773, line: 52, size: 256, elements: !774)
!773 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !{!775, !776, !777, !778, !779, !780, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !772, file: !773, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !772, file: !773, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !772, file: !773, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !772, file: !773, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !772, file: !773, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !772, file: !773, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !772, file: !773, line: 62, baseType: !782, size: 192, offset: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 192, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 3)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !712, file: !155, line: 3376, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !155, line: 1408, size: 256, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !155, line: 1409, baseType: !748, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !786, file: !155, line: 1410, baseType: !790, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !792, line: 27, size: 192, elements: !793)
!792 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !792, line: 29, baseType: !758, size: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !791, file: !792, line: 30, baseType: !15, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !712, file: !155, line: 3377, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !155, line: 1437, size: 256, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !155, line: 1438, baseType: !748, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !797, file: !155, line: 1439, baseType: !710, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !712, file: !155, line: 3378, baseType: !802, size: 256)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !155, line: 1418, size: 256, elements: !803)
!803 = !{!804, !805, !807}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !155, line: 1419, baseType: !748, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !802, file: !155, line: 1420, baseType: !806, size: 32, offset: 192)
!806 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !802, file: !155, line: 1421, baseType: !808, size: 8, offset: 224)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 8, elements: !810)
!809 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!810 = !{!811}
!811 = !DISubrange(count: 1)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !712, file: !155, line: 3379, baseType: !813, size: 320)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !155, line: 1428, size: 320, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !813, file: !155, line: 1429, baseType: !748, size: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !813, file: !155, line: 1430, baseType: !710, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !813, file: !155, line: 1431, baseType: !710, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !712, file: !155, line: 3380, baseType: !819, size: 320)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !155, line: 1460, size: 320, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !155, line: 1461, baseType: !748, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !819, file: !155, line: 1462, baseType: !823, size: 128, offset: 192)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !824, line: 31, size: 128, elements: !825)
!824 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!825 = !{!826, !830, !831}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !823, file: !824, line: 32, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !823, file: !824, line: 33, baseType: !7, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !823, file: !824, line: 34, baseType: !7, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !712, file: !155, line: 3381, baseType: !833, size: 384)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !155, line: 2507, size: 384, elements: !834)
!834 = !{!835, !836, !837, !838, !839}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !833, file: !155, line: 2508, baseType: !748, size: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !833, file: !155, line: 2509, baseType: !703, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !833, file: !155, line: 2510, baseType: !7, size: 32, offset: 224)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !833, file: !155, line: 2511, baseType: !710, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !833, file: !155, line: 2512, baseType: !710, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !712, file: !155, line: 3382, baseType: !841, size: 896)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !155, line: 2652, size: 896, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !155, line: 2653, baseType: !833, size: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !841, file: !155, line: 2654, baseType: !710, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !841, file: !155, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !841, file: !155, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !841, file: !155, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !841, file: !155, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !841, file: !155, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !841, file: !155, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !841, file: !155, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !841, file: !155, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !841, file: !155, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !841, file: !155, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !841, file: !155, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !841, file: !155, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !841, file: !155, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !841, file: !155, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !841, file: !155, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !841, file: !155, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !841, file: !155, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !841, file: !155, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !841, file: !155, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !841, file: !155, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !841, file: !155, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !841, file: !155, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !841, file: !155, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !841, file: !155, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !841, file: !155, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !841, file: !155, line: 2703, baseType: !7, size: 32, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !841, file: !155, line: 2705, baseType: !710, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !841, file: !155, line: 2706, baseType: !710, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !841, file: !155, line: 2707, baseType: !710, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !841, file: !155, line: 2708, baseType: !710, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !841, file: !155, line: 2711, baseType: !876, size: 64, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !155, line: 2711, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !712, file: !155, line: 3383, baseType: !879, size: 960)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !155, line: 2756, size: 960, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !879, file: !155, line: 2757, baseType: !841, size: 896)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !879, file: !155, line: 2758, baseType: !883, size: 64, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !641, line: 50, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !429, line: 240, size: 384, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !885, file: !429, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !885, file: !429, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !885, file: !429, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !885, file: !429, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !885, file: !429, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !885, file: !429, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !885, file: !429, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !885, file: !429, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !885, file: !429, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !885, file: !429, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !885, file: !429, line: 321, baseType: !898, size: 320, offset: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !429, line: 315, size: 320, elements: !899)
!899 = !{!900, !1022, !1024, !1087, !1088}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !898, file: !429, line: 316, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 64, elements: !810)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !429, line: 183, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !429, line: 166, size: 64, elements: !904)
!904 = !{!905, !906, !907, !910, !911, !919, !920, !932, !935, !997, !998, !999, !1012, !1019}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !903, file: !429, line: 168, baseType: !806, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !903, file: !429, line: 169, baseType: !7, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !903, file: !429, line: 170, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !903, file: !429, line: 171, baseType: !883, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !903, file: !429, line: 172, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !641, line: 53, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !429, line: 359, size: 128, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !914, file: !429, line: 360, baseType: !806, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !914, file: !429, line: 361, baseType: !918, size: 64, offset: 64)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 64, elements: !810)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !903, file: !429, line: 173, baseType: !15, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !903, file: !429, line: 174, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !429, line: 133, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 115, size: 32, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !922, file: !429, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !922, file: !429, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !922, file: !429, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !922, file: !429, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !922, file: !429, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !922, file: !429, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !922, file: !429, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !922, file: !429, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !903, file: !429, line: 175, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !429, line: 175, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !903, file: !429, line: 176, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !938, line: 75, size: 256, elements: !939)
!938 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!939 = !{!940, !954, !955, !956}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !937, file: !938, line: 76, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !938, line: 68, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !938, line: 63, size: 320, elements: !944)
!944 = !{!945, !947, !948, !949}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !943, file: !938, line: 64, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !943, file: !938, line: 65, baseType: !946, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !943, file: !938, line: 66, baseType: !7, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !943, file: !938, line: 67, baseType: !950, size: 128, offset: 192)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 128, elements: !952)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !938, line: 29, baseType: !763)
!952 = !{!953}
!953 = !DISubrange(count: 2)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !937, file: !938, line: 77, baseType: !941, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !937, file: !938, line: 78, baseType: !7, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !937, file: !938, line: 79, baseType: !957, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !938, line: 49, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !938, line: 45, size: 832, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !959, file: !938, line: 46, baseType: !946, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !959, file: !938, line: 47, baseType: !936, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !959, file: !938, line: 48, baseType: !964, size: 704, offset: 128)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !965, line: 164, size: 704, elements: !966)
!965 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!966 = !{!967, !968, !979, !980, !981, !982, !983, !984, !989, !993, !994, !995, !996}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !964, file: !965, line: 166, baseType: !765, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !964, file: !965, line: 167, baseType: !969, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !965, line: 157, size: 192, elements: !971)
!971 = !{!972, !974, !975}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !970, file: !965, line: 159, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !965, line: 160, baseType: !969, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !970, file: !965, line: 161, baseType: !976, size: 32, offset: 128)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 32, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 4)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !964, file: !965, line: 168, baseType: !973, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !964, file: !965, line: 169, baseType: !973, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !964, file: !965, line: 170, baseType: !973, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !964, file: !965, line: 171, baseType: !765, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !964, file: !965, line: 172, baseType: !806, size: 32, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !964, file: !965, line: 176, baseType: !985, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!969, !988, !765}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !964, file: !965, line: 177, baseType: !990, size: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !988, !969}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !964, file: !965, line: 178, baseType: !988, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !964, file: !965, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !964, file: !965, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !964, file: !965, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !903, file: !429, line: 177, baseType: !710, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !903, file: !429, line: 178, baseType: !649, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !903, file: !429, line: 179, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !429, line: 150, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !429, line: 142, size: 320, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1010, !1011}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1002, file: !429, line: 144, baseType: !710, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1002, file: !429, line: 145, baseType: !883, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1002, file: !429, line: 146, baseType: !883, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1002, file: !429, line: 147, baseType: !1008, size: 32, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1009, line: 31, baseType: !806)
!1009 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1002, file: !429, line: 148, baseType: !7, size: 32, offset: 224)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1002, file: !429, line: 149, baseType: !829, size: 8, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !903, file: !429, line: 180, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !429, line: 162, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !429, line: 159, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1015, file: !429, line: 160, baseType: !710, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1015, file: !429, line: 161, baseType: !765, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !903, file: !429, line: 181, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !429, line: 181, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !898, file: !429, line: 317, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 64, elements: !810)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !898, file: !429, line: 318, baseType: !1025, size: 320)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !429, line: 188, size: 320, elements: !1026)
!1026 = !{!1027, !1029, !1086}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1025, file: !429, line: 190, baseType: !1028, size: 192)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 192, elements: !783)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1025, file: !429, line: 193, baseType: !1030, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !429, line: 206, size: 320, elements: !1032)
!1032 = !{!1033, !1071, !1072, !1073, !1085}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1031, file: !429, line: 208, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !641, line: 62, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1037, line: 538, size: 256, elements: !1038)
!1037 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1038 = !{!1039, !1043, !1049, !1062}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1036, file: !1037, line: 539, baseType: !1040, size: 32)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1037, line: 482, size: 32, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1040, file: !1037, line: 484, baseType: !7, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1036, file: !1037, line: 540, baseType: !1044, size: 192)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1037, line: 488, size: 192, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !1037, line: 489, baseType: !1040, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1044, file: !1037, line: 492, baseType: !908, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1044, file: !1037, line: 496, baseType: !710, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1036, file: !1037, line: 541, baseType: !1050, size: 256)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1037, line: 504, size: 256, elements: !1051)
!1051 = !{!1052, !1053, !1060, !1061}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !1037, line: 505, baseType: !1040, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1050, file: !1037, line: 509, baseType: !1054, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1037, line: 501, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !1037, line: 510, baseType: !1058, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !1037, line: 513, baseType: !1034, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1036, file: !1037, line: 542, baseType: !1063, size: 128)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1037, line: 530, size: 128, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !1037, line: 531, baseType: !1040, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1063, file: !1037, line: 534, baseType: !1067, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1037, line: 525, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!829, !710, !908, !763, !763}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1031, file: !429, line: 211, baseType: !7, size: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1031, file: !429, line: 214, baseType: !765, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1031, file: !429, line: 224, baseType: !1074, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !429, line: 202, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !429, line: 202, size: 128, elements: !1077)
!1077 = !{!1078}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1076, file: !429, line: 202, baseType: !1079, size: 128)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !429, line: 200, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !429, line: 200, size: 128, elements: !1081)
!1081 = !{!1082, !1083, !1084}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1080, file: !429, line: 200, baseType: !7, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1080, file: !429, line: 200, baseType: !7, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1080, file: !429, line: 200, baseType: !918, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1031, file: !429, line: 234, baseType: !1074, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1025, file: !429, line: 197, baseType: !765, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !898, file: !429, line: 319, baseType: !772, size: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !898, file: !429, line: 320, baseType: !791, size: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !712, file: !155, line: 3384, baseType: !1090, size: 1472)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !155, line: 3114, size: 1472, elements: !1091)
!1091 = !{!1092, !1113, !1114, !1115, !1116}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !155, line: 3115, baseType: !1093, size: 1216)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !155, line: 2984, size: 1216, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !155, line: 2985, baseType: !879, size: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1093, file: !155, line: 2986, baseType: !710, size: 64, offset: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1093, file: !155, line: 2987, baseType: !710, size: 64, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1093, file: !155, line: 2988, baseType: !710, size: 64, offset: 1088)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1093, file: !155, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1093, file: !155, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1093, file: !155, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1093, file: !155, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1093, file: !155, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1093, file: !155, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1093, file: !155, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1093, file: !155, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1093, file: !155, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1093, file: !155, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1093, file: !155, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1093, file: !155, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1093, file: !155, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1093, file: !155, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1090, file: !155, line: 3117, baseType: !710, size: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1090, file: !155, line: 3119, baseType: !710, size: 64, offset: 1280)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1090, file: !155, line: 3121, baseType: !710, size: 64, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1090, file: !155, line: 3123, baseType: !710, size: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !712, file: !155, line: 3385, baseType: !1118, size: 1088)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !155, line: 2874, size: 1088, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !155, line: 2875, baseType: !879, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1118, file: !155, line: 2876, baseType: !883, size: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1118, file: !155, line: 2877, baseType: !1123, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1125, line: 172, size: 128, elements: !1126)
!1125 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1124, file: !1125, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1124, file: !1125, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1124, file: !1125, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1124, file: !1125, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1124, file: !1125, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1124, file: !1125, line: 195, baseType: !7, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1124, file: !1125, line: 199, baseType: !710, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !712, file: !155, line: 3386, baseType: !1093, size: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !712, file: !155, line: 3387, baseType: !1136, size: 1280)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !155, line: 3093, size: 1280, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !155, line: 3094, baseType: !1093, size: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1136, file: !155, line: 3095, baseType: !1123, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !712, file: !155, line: 3388, baseType: !1141, size: 1216)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !155, line: 2824, size: 1216, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !155, line: 2825, baseType: !841, size: 896)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1141, file: !155, line: 2827, baseType: !710, size: 64, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1141, file: !155, line: 2828, baseType: !710, size: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1141, file: !155, line: 2829, baseType: !710, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1141, file: !155, line: 2830, baseType: !710, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1141, file: !155, line: 2831, baseType: !710, size: 64, offset: 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !712, file: !155, line: 3389, baseType: !1150, size: 1024)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !155, line: 2850, size: 1024, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !155, line: 2851, baseType: !879, size: 960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1150, file: !155, line: 2852, baseType: !806, size: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1150, file: !155, line: 2853, baseType: !806, size: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !712, file: !155, line: 3390, baseType: !1156, size: 1024)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !155, line: 2857, size: 1024, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !155, line: 2858, baseType: !879, size: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1156, file: !155, line: 2859, baseType: !1123, size: 64, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !712, file: !155, line: 3391, baseType: !1161, size: 960)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !155, line: 2862, size: 960, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !155, line: 2863, baseType: !879, size: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !712, file: !155, line: 3392, baseType: !1165, size: 1472)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !155, line: 3304, size: 1472, elements: !1166)
!1166 = !{!1167}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !155, line: 3305, baseType: !1090, size: 1472)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !712, file: !155, line: 3393, baseType: !1169, size: 1792)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !155, line: 3248, size: 1792, elements: !1170)
!1170 = !{!1171, !1172, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1169, file: !155, line: 3249, baseType: !1090, size: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1169, file: !155, line: 3251, baseType: !1173, size: 64, offset: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1175, line: 463, size: 1152, elements: !1176)
!1175 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1176 = !{!1177, !1180, !1210, !1211, !1350, !1413, !1414, !1415, !1416, !1417, !1418, !1442, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1174, file: !1175, line: 464, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1175, line: 464, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1174, file: !1175, line: 467, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !144, line: 374, size: 640, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1208, !1209}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1182, file: !144, line: 377, baseType: !648, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1182, file: !144, line: 378, baseType: !648, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1182, file: !144, line: 381, baseType: !1187, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !144, line: 282, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !144, line: 282, size: 128, elements: !1190)
!1190 = !{!1191}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1189, file: !144, line: 282, baseType: !1192, size: 128)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !144, line: 281, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !144, line: 281, size: 128, elements: !1194)
!1194 = !{!1195, !1196, !1197}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1193, file: !144, line: 281, baseType: !7, size: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1193, file: !144, line: 281, baseType: !7, size: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1193, file: !144, line: 281, baseType: !1198, size: 64, offset: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 64, elements: !810)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1182, file: !144, line: 384, baseType: !806, size: 32, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1182, file: !144, line: 387, baseType: !806, size: 32, offset: 224)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1182, file: !144, line: 390, baseType: !806, size: 32, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1182, file: !144, line: 394, baseType: !1187, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1182, file: !144, line: 396, baseType: !143, size: 32, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1182, file: !144, line: 399, baseType: !1205, size: 64, offset: 416)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !952)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1182, file: !144, line: 402, baseType: !1207, size: 64, offset: 480)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !952)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1182, file: !144, line: 406, baseType: !806, size: 32, offset: 544)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1182, file: !144, line: 409, baseType: !806, size: 32, offset: 576)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1174, file: !1175, line: 470, baseType: !676, size: 64, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1174, file: !1175, line: 473, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1125, line: 39, size: 1152, elements: !1214)
!1214 = !{!1215, !1265, !1278, !1291, !1292, !1304, !1305, !1309, !1310, !1311, !1312, !1313}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1213, file: !1125, line: 41, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1217, line: 144, baseType: !1218)
!1217 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1217, line: 100, size: 896, elements: !1220)
!1220 = !{!1221, !1227, !1232, !1237, !1239, !1242, !1243, !1244, !1245, !1246, !1251, !1253, !1254, !1259, !1264}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1219, file: !1217, line: 102, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1217, line: 52, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!1226, !1058}
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1217, line: 47, baseType: !7)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1219, file: !1217, line: 105, baseType: !1228, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1217, line: 59, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!806, !1058, !1058}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1219, file: !1217, line: 108, baseType: !1233, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1217, line: 63, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !988}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1219, file: !1217, line: 111, baseType: !1238, size: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1219, file: !1217, line: 114, baseType: !1240, size: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1241, line: 46, baseType: !763)
!1241 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1219, file: !1217, line: 117, baseType: !1240, size: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1219, file: !1217, line: 120, baseType: !1240, size: 64, offset: 384)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1219, file: !1217, line: 124, baseType: !7, size: 32, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1219, file: !1217, line: 128, baseType: !7, size: 32, offset: 480)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1219, file: !1217, line: 131, baseType: !1247, size: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1217, line: 75, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!988, !1240, !1240}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1219, file: !1217, line: 132, baseType: !1252, size: 64, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1217, line: 78, baseType: !1234)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1219, file: !1217, line: 135, baseType: !988, size: 64, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1219, file: !1217, line: 136, baseType: !1255, size: 64, offset: 704)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1217, line: 82, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!988, !988, !1240, !1240}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1219, file: !1217, line: 137, baseType: !1260, size: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1217, line: 83, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !988, !988}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1219, file: !1217, line: 141, baseType: !7, size: 32, offset: 832)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1213, file: !1125, line: 48, baseType: !1266, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !405, line: 35, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !405, line: 35, size: 128, elements: !1269)
!1269 = !{!1270}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1268, file: !405, line: 35, baseType: !1271, size: 128)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !405, line: 33, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !405, line: 33, size: 128, elements: !1273)
!1273 = !{!1274, !1275, !1276}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1272, file: !405, line: 33, baseType: !7, size: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1272, file: !405, line: 33, baseType: !7, size: 32, offset: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1272, file: !405, line: 33, baseType: !1277, size: 64, offset: 64)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 64, elements: !810)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1213, file: !1125, line: 51, baseType: !1279, size: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !155, line: 183, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !155, line: 183, size: 128, elements: !1282)
!1282 = !{!1283}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1281, file: !155, line: 183, baseType: !1284, size: 128)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !155, line: 182, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !155, line: 182, size: 128, elements: !1286)
!1286 = !{!1287, !1288, !1289}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1285, file: !155, line: 182, baseType: !7, size: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1285, file: !155, line: 182, baseType: !7, size: 32, offset: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1285, file: !155, line: 182, baseType: !1290, size: 64, offset: 64)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 64, elements: !810)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1213, file: !1125, line: 54, baseType: !710, size: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1213, file: !1125, line: 57, baseType: !1293, size: 128, offset: 256)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1294, line: 31, size: 128, elements: !1295)
!1294 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1295 = !{!1296, !1297, !1298, !1299, !1300, !1301, !1302}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1293, file: !1294, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1293, file: !1294, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1293, file: !1294, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1293, file: !1294, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1293, file: !1294, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1293, file: !1294, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1293, file: !1294, line: 56, baseType: !1303, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !641, line: 47, baseType: !936)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1213, file: !1125, line: 60, baseType: !1293, size: 128, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1213, file: !1125, line: 64, baseType: !1306, size: 64, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1308, line: 33, flags: DIFlagFwdDecl)
!1308 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1213, file: !1125, line: 67, baseType: !710, size: 64, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1213, file: !1125, line: 73, baseType: !1216, size: 64, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1213, file: !1125, line: 77, baseType: !1303, size: 64, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1213, file: !1125, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1213, file: !1125, line: 82, baseType: !1314, size: 320, offset: 832)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1315, line: 62, size: 320, elements: !1316)
!1315 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1316 = !{!1317, !1323, !1324, !1325, !1326, !1333}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1314, file: !1315, line: 63, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1315, line: 56, size: 128, elements: !1320)
!1320 = !{!1321, !1322}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1319, file: !1315, line: 57, baseType: !1318, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1319, file: !1315, line: 58, baseType: !808, size: 8, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1314, file: !1315, line: 64, baseType: !7, size: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1314, file: !1315, line: 66, baseType: !7, size: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1314, file: !1315, line: 68, baseType: !829, size: 8, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1314, file: !1315, line: 70, baseType: !1327, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1315, line: 37, size: 128, elements: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1328, file: !1315, line: 39, baseType: !1327, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1328, file: !1315, line: 40, baseType: !1332, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1314, file: !1315, line: 71, baseType: !1334, size: 64, offset: 256)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1315, line: 45, size: 320, elements: !1336)
!1336 = !{!1337, !1338}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1335, file: !1315, line: 47, baseType: !1334, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1335, file: !1315, line: 48, baseType: !1339, size: 256, offset: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !155, line: 1883, size: 256, elements: !1340)
!1340 = !{!1341, !1343, !1344, !1349}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1339, file: !155, line: 1884, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1339, file: !155, line: 1885, baseType: !1342, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1339, file: !155, line: 1891, baseType: !1345, size: 64, offset: 128)
!1345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1339, file: !155, line: 1891, size: 64, elements: !1346)
!1346 = !{!1347, !1348}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1345, file: !155, line: 1891, baseType: !685, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1345, file: !155, line: 1891, baseType: !710, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1339, file: !155, line: 1892, baseType: !1332, size: 64, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1174, file: !1175, line: 476, baseType: !1351, size: 64, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !6, line: 187, size: 256, elements: !1353)
!1353 = !{!1354, !1355, !1411, !1412}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1352, file: !6, line: 189, baseType: !806, size: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1352, file: !6, line: 192, baseType: !1356, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !6, line: 87, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !6, line: 87, size: 128, elements: !1359)
!1359 = !{!1360}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1358, file: !6, line: 87, baseType: !1361, size: 128)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !6, line: 85, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !6, line: 85, size: 128, elements: !1363)
!1363 = !{!1364, !1365, !1366}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1362, file: !6, line: 85, baseType: !7, size: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1362, file: !6, line: 85, baseType: !7, size: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1362, file: !6, line: 85, baseType: !1367, size: 64, offset: 64)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 64, elements: !810)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !6, line: 84, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !6, line: 100, size: 1216, elements: !1371)
!1371 = !{!1372, !1373, !1374, !1375, !1376, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1401, !1409, !1410}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1370, file: !6, line: 102, baseType: !806, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1370, file: !6, line: 105, baseType: !7, size: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1370, file: !6, line: 108, baseType: !649, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1370, file: !6, line: 111, baseType: !649, size: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1370, file: !6, line: 114, baseType: !1377, size: 64, offset: 192)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !6, line: 41, size: 64, elements: !1378)
!1378 = !{!1379, !1380}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1377, file: !6, line: 42, baseType: !5, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1377, file: !6, line: 43, baseType: !7, size: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1370, file: !6, line: 117, baseType: !7, size: 32, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1370, file: !6, line: 120, baseType: !7, size: 32, offset: 288)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1370, file: !6, line: 123, baseType: !1356, size: 64, offset: 320)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1370, file: !6, line: 126, baseType: !1369, size: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1370, file: !6, line: 129, baseType: !1369, size: 64, offset: 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1370, file: !6, line: 132, baseType: !988, size: 64, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1370, file: !6, line: 139, baseType: !710, size: 64, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1370, file: !6, line: 143, baseType: !758, size: 128, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1370, file: !6, line: 146, baseType: !758, size: 128, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1370, file: !6, line: 148, baseType: !829, size: 8, offset: 896)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1370, file: !6, line: 149, baseType: !829, size: 8, offset: 904)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1370, file: !6, line: 153, baseType: !386, size: 32, offset: 928)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1370, file: !6, line: 156, baseType: !1394, size: 64, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !6, line: 48, size: 320, elements: !1396)
!1396 = !{!1397, !1398, !1399, !1400}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1395, file: !6, line: 50, baseType: !685, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1395, file: !6, line: 59, baseType: !758, size: 128, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1395, file: !6, line: 64, baseType: !829, size: 8, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1395, file: !6, line: 67, baseType: !1394, size: 64, offset: 256)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1370, file: !6, line: 159, baseType: !1402, size: 64, offset: 1024)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !6, line: 72, size: 256, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1403, file: !6, line: 74, baseType: !666, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1403, file: !6, line: 77, baseType: !1402, size: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1403, file: !6, line: 78, baseType: !1402, size: 64, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1403, file: !6, line: 81, baseType: !1402, size: 64, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1370, file: !6, line: 162, baseType: !829, size: 8, offset: 1088)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1370, file: !6, line: 166, baseType: !710, size: 64, offset: 1152)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1352, file: !6, line: 197, baseType: !1216, size: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1352, file: !6, line: 200, baseType: !1369, size: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1174, file: !1175, line: 479, baseType: !1216, size: 64, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1174, file: !1175, line: 484, baseType: !710, size: 64, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1174, file: !1175, line: 488, baseType: !710, size: 64, offset: 448)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1174, file: !1175, line: 493, baseType: !710, size: 64, offset: 512)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1174, file: !1175, line: 496, baseType: !710, size: 64, offset: 576)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1174, file: !1175, line: 501, baseType: !1419, size: 64, offset: 640)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !350, line: 2355, size: 576, elements: !1421)
!1421 = !{!1422, !1425, !1426, !1427, !1428, !1430, !1431, !1436, !1437, !1438, !1439, !1440, !1441}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1420, file: !350, line: 2356, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !350, line: 2356, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1420, file: !350, line: 2357, baseType: !908, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1420, file: !350, line: 2358, baseType: !806, size: 32, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1420, file: !350, line: 2359, baseType: !806, size: 32, offset: 160)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1420, file: !350, line: 2360, baseType: !1429, size: 128, offset: 192)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !977)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1420, file: !350, line: 2364, baseType: !806, size: 32, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1420, file: !350, line: 2367, baseType: !1432, size: 128, offset: 384)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !350, line: 2349, size: 128, elements: !1433)
