; ModuleID = 'cpp_directives.c'
source_filename = "cpp_directives.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.directive = type { void (%struct.cpp_reader*)*, i8*, i16, i8, i8 }
%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.3, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }

!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lc_reason", file: !123, line: 36, baseType: !7, size: 32, elements: !124)
!123 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !{!125, !126, !127, !128}
!125 = !DIEnumerator(name: "LC_ENTER", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "LC_LEAVE", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "LC_RENAME", value: 2, isUnsigned: true)
!128 = !DIEnumerator(name: "LC_RENAME_VERBATIM", value: 3, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 174, baseType: !7, size: 32, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!131 = !DIEnumerator(name: "T_DEFINE", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "T_INCLUDE", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "T_ENDIF", value: 2, isUnsigned: true)
!134 = !DIEnumerator(name: "T_IFDEF", value: 3, isUnsigned: true)
!135 = !DIEnumerator(name: "T_IF", value: 4, isUnsigned: true)
!136 = !DIEnumerator(name: "T_ELSE", value: 5, isUnsigned: true)
!137 = !DIEnumerator(name: "T_IFNDEF", value: 6, isUnsigned: true)
!138 = !DIEnumerator(name: "T_UNDEF", value: 7, isUnsigned: true)
!139 = !DIEnumerator(name: "T_LINE", value: 8, isUnsigned: true)
!140 = !DIEnumerator(name: "T_ELIF", value: 9, isUnsigned: true)
!141 = !DIEnumerator(name: "T_ERROR", value: 10, isUnsigned: true)
!142 = !DIEnumerator(name: "T_PRAGMA", value: 11, isUnsigned: true)
!143 = !DIEnumerator(name: "T_WARNING", value: 12, isUnsigned: true)
!144 = !DIEnumerator(name: "T_INCLUDE_NEXT", value: 13, isUnsigned: true)
!145 = !DIEnumerator(name: "T_IDENT", value: 14, isUnsigned: true)
!146 = !DIEnumerator(name: "T_IMPORT", value: 15, isUnsigned: true)
!147 = !DIEnumerator(name: "T_ASSERT", value: 16, isUnsigned: true)
!148 = !DIEnumerator(name: "T_UNASSERT", value: 17, isUnsigned: true)
!149 = !DIEnumerator(name: "T_SCCS", value: 18, isUnsigned: true)
!150 = !DIEnumerator(name: "N_DIRECTIVES", value: 19, isUnsigned: true)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "node_type", file: !6, line: 584, baseType: !7, size: 32, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "NT_VOID", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "NT_MACRO", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "NT_ASSERTION", value: 2, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "include_type", file: !157, line: 119, baseType: !7, size: 32, elements: !158)
!157 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!158 = !{!159, !160, !161, !162}
!159 = !DIEnumerator(name: "IT_INCLUDE", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "IT_INCLUDE_NEXT", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "IT_IMPORT", value: 2, isUnsigned: true)
!162 = !DIEnumerator(name: "IT_CMDLINE", value: 3, isUnsigned: true)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 57, baseType: !7, size: 32, elements: !165)
!164 = !DIFile(filename: "./include/safe-ctype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!166 = !DIEnumerator(name: "_sch_isblank", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "_sch_iscntrl", value: 2, isUnsigned: true)
!168 = !DIEnumerator(name: "_sch_isdigit", value: 4, isUnsigned: true)
!169 = !DIEnumerator(name: "_sch_islower", value: 8, isUnsigned: true)
!170 = !DIEnumerator(name: "_sch_isprint", value: 16, isUnsigned: true)
!171 = !DIEnumerator(name: "_sch_ispunct", value: 32, isUnsigned: true)
!172 = !DIEnumerator(name: "_sch_isspace", value: 64, isUnsigned: true)
!173 = !DIEnumerator(name: "_sch_isupper", value: 128, isUnsigned: true)
!174 = !DIEnumerator(name: "_sch_isxdigit", value: 256, isUnsigned: true)
!175 = !DIEnumerator(name: "_sch_isidst", value: 512, isUnsigned: true)
!176 = !DIEnumerator(name: "_sch_isvsp", value: 1024, isUnsigned: true)
!177 = !DIEnumerator(name: "_sch_isnvsp", value: 2048, isUnsigned: true)
!178 = !DIEnumerator(name: "_sch_isalpha", value: 136, isUnsigned: true)
!179 = !DIEnumerator(name: "_sch_isalnum", value: 140, isUnsigned: true)
!180 = !DIEnumerator(name: "_sch_isidnum", value: 516, isUnsigned: true)
!181 = !DIEnumerator(name: "_sch_isgraph", value: 172, isUnsigned: true)
!182 = !DIEnumerator(name: "_sch_iscppsp", value: 3072, isUnsigned: true)
!183 = !DIEnumerator(name: "_sch_isbasic", value: 3088, isUnsigned: true)
!184 = !{!185, !186, !187, !189, !192, !362, !7, !364, !366, !218, !329, !266, !258, !297, !369, !785, !456, !489, !447, !356}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !157, line: 249, size: 1536, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !208, !209, !210, !211, !213, !216, !217, !312, !313, !314, !315, !316, !317, !346}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !194, file: !157, line: 251, baseType: !189, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !194, file: !157, line: 252, baseType: !189, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !194, file: !157, line: 253, baseType: !189, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !194, file: !157, line: 255, baseType: !189, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !194, file: !157, line: 256, baseType: !189, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !194, file: !157, line: 258, baseType: !202, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !157, line: 235, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !157, line: 236, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !204, file: !157, line: 239, baseType: !189, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !157, line: 245, baseType: !7, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !194, file: !157, line: 259, baseType: !7, size: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !194, file: !157, line: 260, baseType: !7, size: 32, offset: 416)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !194, file: !157, line: 261, baseType: !7, size: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !157, line: 263, baseType: !212, size: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !194, file: !157, line: 267, baseType: !214, size: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !194, file: !157, line: 271, baseType: !189, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !194, file: !157, line: 275, baseType: !218, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !3, line: 33, size: 256, elements: !220)
!220 = !{!221, !222, !224, !308, !309, !310}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !3, line: 35, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !3, line: 36, baseType: !223, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !123, line: 39, baseType: !7)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !219, file: !3, line: 37, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !229)
!229 = !{!230, !237, !238, !239, !240, !241, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !228, file: !6, line: 645, baseType: !231, size: 128)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !232, line: 31, size: 128, elements: !233)
!232 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !231, file: !232, line: 32, baseType: !189, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !232, line: 33, baseType: !7, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !231, file: !232, line: 34, baseType: !7, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !228, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !228, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !228, file: !6, line: 650, baseType: !191, size: 8, offset: 136)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !228, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !6, line: 654, baseType: !243, size: 64, offset: 192)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !244)
!244 = !{!245, !296, !306, !307}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !243, file: !6, line: 635, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !249, line: 36, size: 256, elements: !250)
!249 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !{!251, !254, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !248, file: !249, line: 42, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !248, file: !249, line: 51, baseType: !255, size: 64, offset: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !249, line: 47, size: 64, elements: !256)
!256 = !{!257, !286}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !255, file: !249, line: 49, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !261)
!261 = !{!262, !264, !265, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !260, file: !6, line: 213, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !123, line: 44, baseType: !7)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !260, file: !6, line: 215, baseType: !266, size: 16, offset: 48)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !260, file: !6, line: 237, baseType: !268, size: 128, offset: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !269)
!269 = !{!270, !274, !275, !280, !284, !285}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !268, file: !6, line: 220, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !271, file: !6, line: 207, baseType: !253, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !268, file: !6, line: 223, baseType: !258, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !268, file: !6, line: 226, baseType: !276, size: 128)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !276, file: !6, line: 163, baseType: !7, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !276, file: !6, line: 164, baseType: !189, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !268, file: !6, line: 229, baseType: !281, size: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !281, file: !6, line: 197, baseType: !7, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !268, file: !6, line: 233, baseType: !7, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !268, file: !6, line: 236, baseType: !7, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !255, file: !249, line: 50, baseType: !189, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !248, file: !249, line: 54, baseType: !263, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !248, file: !249, line: 57, baseType: !7, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !248, file: !249, line: 60, baseType: !266, size: 16, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !248, file: !249, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !248, file: !249, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !248, file: !249, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !248, file: !249, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !248, file: !249, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !248, file: !249, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !243, file: !6, line: 637, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !249, line: 28, size: 320, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !249, line: 29, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !298, file: !249, line: 30, baseType: !7, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !298, file: !249, line: 31, baseType: !303, size: 192, offset: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 192, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 1)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !243, file: !6, line: 639, baseType: !5, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !243, file: !6, line: 641, baseType: !266, size: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "skip_elses", scope: !219, file: !3, line: 38, baseType: !191, size: 8, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "was_skipping", scope: !219, file: !3, line: 39, baseType: !191, size: 8, offset: 200)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !3, line: 40, baseType: !311, size: 32, offset: 224)
!311 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !194, file: !157, line: 278, baseType: !191, size: 8, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !194, file: !157, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !194, file: !157, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !194, file: !157, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !194, file: !157, line: 298, baseType: !191, size: 8, offset: 784)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !194, file: !157, line: 302, baseType: !318, size: 512, offset: 832)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !319)
!319 = !{!320, !322, !323, !324, !325, !326, !327, !331, !337, !343}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !6, line: 526, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !6, line: 529, baseType: !187, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !318, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !318, file: !6, line: 534, baseType: !191, size: 8, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !318, file: !6, line: 537, baseType: !191, size: 8, offset: 168)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !318, file: !6, line: 541, baseType: !187, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !318, file: !6, line: 545, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !318, file: !6, line: 551, baseType: !332, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!187, !329, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !318)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !318, file: !6, line: 555, baseType: !338, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !339, line: 47, baseType: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !341, line: 148, baseType: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!342 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !318, file: !6, line: 556, baseType: !344, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !339, line: 59, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !341, line: 145, baseType: !342)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !194, file: !157, line: 306, baseType: !347, size: 192, offset: 1344)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !157, line: 47, size: 192, elements: !348)
!348 = !{!349, !360, !361}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !347, file: !157, line: 49, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !157, line: 45, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!191, !354, !189, !356, !358}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !355, line: 29, baseType: !185)
!355 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !357, line: 46, baseType: !342)
!357 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !157, line: 43, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !347, file: !157, line: 50, baseType: !354, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !347, file: !157, line: 51, baseType: !311, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !357, line: 35, baseType: !363)
!363 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !249, line: 22, baseType: !191)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !3, line: 45, size: 256, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !3, line: 47, baseType: !369, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !370, file: !3, line: 48, baseType: !225, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_nspace", scope: !370, file: !3, line: 49, baseType: !191, size: 8, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal", scope: !370, file: !3, line: 50, baseType: !191, size: 8, offset: 136)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "is_deferred", scope: !370, file: !3, line: 51, baseType: !191, size: 8, offset: 144)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "allow_expansion", scope: !370, file: !3, line: 52, baseType: !191, size: 8, offset: 152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !370, file: !3, line: 57, baseType: !379, size: 64, offset: 192)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !370, file: !3, line: 53, size: 64, elements: !380)
!380 = !{!381, !791, !792}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !379, file: !3, line: 54, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "pragma_cb", file: !3, line: 44, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !157, line: 322, size: 10432, elements: !389)
!389 = !{!390, !391, !392, !409, !438, !439, !450, !451, !452, !479, !481, !494, !495, !496, !497, !498, !499, !500, !501, !502, !505, !506, !509, !510, !542, !543, !544, !545, !546, !547, !548, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !574, !575, !576, !577, !656, !682, !685, !686, !749, !756, !757, !764, !765, !766, !767, !770, !771, !784}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !388, file: !157, line: 325, baseType: !192, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !388, file: !157, line: 328, baseType: !192, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !388, file: !157, line: 331, baseType: !393, size: 160, offset: 128)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !157, line: 177, size: 160, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !393, file: !157, line: 180, baseType: !191, size: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !393, file: !157, line: 185, baseType: !191, size: 8, offset: 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !393, file: !157, line: 188, baseType: !191, size: 8, offset: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !393, file: !157, line: 191, baseType: !191, size: 8, offset: 24)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !393, file: !157, line: 194, baseType: !191, size: 8, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !393, file: !157, line: 198, baseType: !191, size: 8, offset: 40)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !393, file: !157, line: 201, baseType: !191, size: 8, offset: 48)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !393, file: !157, line: 204, baseType: !191, size: 8, offset: 56)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !393, file: !157, line: 207, baseType: !191, size: 8, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !393, file: !157, line: 210, baseType: !191, size: 8, offset: 72)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !393, file: !157, line: 214, baseType: !191, size: 8, offset: 80)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !393, file: !157, line: 217, baseType: !7, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !393, file: !157, line: 220, baseType: !191, size: 8, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !393, file: !157, line: 223, baseType: !191, size: 8, offset: 136)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !388, file: !157, line: 334, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !123, line: 74, size: 448, elements: !412)
!412 = !{!413, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !411, file: !123, line: 75, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !123, line: 61, size: 192, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !415, file: !123, line: 62, baseType: !329, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !415, file: !123, line: 63, baseType: !223, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !415, file: !123, line: 64, baseType: !263, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !415, file: !123, line: 65, baseType: !311, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !415, file: !123, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !415, file: !123, line: 68, baseType: !191, size: 8, offset: 168)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !415, file: !123, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !411, file: !123, line: 76, baseType: !7, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !411, file: !123, line: 77, baseType: !7, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !411, file: !123, line: 79, baseType: !7, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !411, file: !123, line: 84, baseType: !311, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !411, file: !123, line: 87, baseType: !7, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !411, file: !123, line: 90, baseType: !191, size: 8, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !411, file: !123, line: 93, baseType: !263, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !411, file: !123, line: 96, baseType: !263, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !411, file: !123, line: 100, baseType: !7, size: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !411, file: !123, line: 104, baseType: !434, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !123, line: 47, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!185, !185, !356}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !388, file: !157, line: 337, baseType: !263, size: 32, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !388, file: !157, line: 340, baseType: !440, size: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !157, line: 99, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !157, line: 100, size: 256, elements: !443)
!443 = !{!444, !446, !448, !449}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !157, line: 102, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !157, line: 103, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !442, file: !157, line: 103, baseType: !447, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !442, file: !157, line: 103, baseType: !447, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !388, file: !157, line: 341, baseType: !440, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !388, file: !157, line: 342, baseType: !440, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !388, file: !157, line: 345, baseType: !453, size: 448, offset: 640)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !157, line: 142, size: 448, elements: !454)
!454 = !{!455, !458, !459, !476, !477, !478}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !157, line: 145, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !157, line: 141, baseType: !453)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !157, line: 145, baseType: !456, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !453, file: !157, line: 164, baseType: !460, size: 128, offset: 128)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !157, line: 147, size: 128, elements: !461)
!461 = !{!462, !471}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !460, file: !157, line: 156, baseType: !463, size: 128)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !157, line: 152, size: 128, elements: !464)
!464 = !{!465, !470}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !463, file: !157, line: 154, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !157, line: 121, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !466, file: !157, line: 123, baseType: !367, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !466, file: !157, line: 124, baseType: !366, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !463, file: !157, line: 155, baseType: !466, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !460, file: !157, line: 163, baseType: !472, size: 128)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !157, line: 159, size: 128, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !472, file: !157, line: 161, baseType: !189, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !472, file: !157, line: 162, baseType: !189, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !453, file: !157, line: 168, baseType: !440, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !453, file: !157, line: 171, baseType: !253, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !453, file: !157, line: 174, baseType: !191, size: 8, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !388, file: !157, line: 346, baseType: !480, size: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !388, file: !157, line: 349, baseType: !482, size: 64, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !3, line: 84, size: 192, elements: !485)
!485 = !{!486, !488, !491, !492, !493}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !484, file: !3, line: 86, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "directive_handler", file: !3, line: 82, baseType: !383)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !3, line: 87, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !484, file: !3, line: 88, baseType: !266, size: 16, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !484, file: !3, line: 89, baseType: !191, size: 8, offset: 144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !484, file: !3, line: 90, baseType: !191, size: 8, offset: 152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !388, file: !157, line: 352, baseType: !259, size: 192, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !388, file: !157, line: 356, baseType: !263, size: 32, offset: 1408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !388, file: !157, line: 360, baseType: !191, size: 8, offset: 1440)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !388, file: !157, line: 363, baseType: !321, size: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !388, file: !157, line: 364, baseType: !321, size: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !388, file: !157, line: 365, baseType: !318, size: 512, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !388, file: !157, line: 368, baseType: !214, size: 64, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !388, file: !157, line: 370, baseType: !214, size: 64, offset: 2176)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !388, file: !157, line: 373, baseType: !503, size: 64, offset: 2240)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !157, line: 373, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !388, file: !157, line: 374, baseType: !503, size: 64, offset: 2304)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !388, file: !157, line: 375, baseType: !507, size: 64, offset: 2368)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !157, line: 375, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !388, file: !157, line: 378, baseType: !503, size: 64, offset: 2432)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !388, file: !157, line: 379, baseType: !511, size: 704, offset: 2496)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !512, line: 164, size: 704, elements: !513)
!512 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !{!514, !515, !525, !526, !527, !528, !529, !530, !534, !538, !539, !540, !541}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !511, file: !512, line: 166, baseType: !363, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !511, file: !512, line: 167, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !512, line: 157, size: 192, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !517, file: !512, line: 159, baseType: !187, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !517, file: !512, line: 160, baseType: !516, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !517, file: !512, line: 161, baseType: !522, size: 32, offset: 128)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 4)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !511, file: !512, line: 168, baseType: !187, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !511, file: !512, line: 169, baseType: !187, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !511, file: !512, line: 170, baseType: !187, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !511, file: !512, line: 171, baseType: !363, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !511, file: !512, line: 172, baseType: !311, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !511, file: !512, line: 176, baseType: !531, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!516, !185, !363}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !511, file: !512, line: 177, baseType: !535, size: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !185, !516}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !511, file: !512, line: 178, baseType: !185, size: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !511, file: !512, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !511, file: !512, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !511, file: !512, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !388, file: !157, line: 383, baseType: !191, size: 8, offset: 3200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !388, file: !157, line: 387, baseType: !191, size: 8, offset: 3208)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !388, file: !157, line: 390, baseType: !225, size: 64, offset: 3264)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !388, file: !157, line: 391, baseType: !225, size: 64, offset: 3328)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !388, file: !157, line: 392, baseType: !191, size: 8, offset: 3392)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !388, file: !157, line: 395, baseType: !258, size: 64, offset: 3456)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !388, file: !157, line: 396, baseType: !549, size: 256, offset: 3520)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !157, line: 128, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !157, line: 129, size: 256, elements: !551)
!551 = !{!552, !554, !555, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !157, line: 131, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !550, file: !157, line: 131, baseType: !553, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !157, line: 132, baseType: !258, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !550, file: !157, line: 132, baseType: !258, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !388, file: !157, line: 396, baseType: !553, size: 64, offset: 3776)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !388, file: !157, line: 397, baseType: !7, size: 32, offset: 3840)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !388, file: !157, line: 400, baseType: !7, size: 32, offset: 3872)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !388, file: !157, line: 403, baseType: !447, size: 64, offset: 3904)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !388, file: !157, line: 404, baseType: !7, size: 32, offset: 3968)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !388, file: !157, line: 408, baseType: !347, size: 192, offset: 4032)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !388, file: !157, line: 412, baseType: !347, size: 192, offset: 4224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !388, file: !157, line: 416, baseType: !347, size: 192, offset: 4416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !388, file: !157, line: 420, baseType: !347, size: 192, offset: 4608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !388, file: !157, line: 424, baseType: !347, size: 192, offset: 4800)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !388, file: !157, line: 427, baseType: !189, size: 64, offset: 4992)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !388, file: !157, line: 428, baseType: !189, size: 64, offset: 5056)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !388, file: !157, line: 431, baseType: !259, size: 192, offset: 5120)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !388, file: !157, line: 432, baseType: !259, size: 192, offset: 5312)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !388, file: !157, line: 435, baseType: !572, size: 64, offset: 5504)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !388, file: !157, line: 439, baseType: !511, size: 704, offset: 5568)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !388, file: !157, line: 443, baseType: !511, size: 704, offset: 6272)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !388, file: !157, line: 447, baseType: !369, size: 64, offset: 6976)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !388, file: !157, line: 450, baseType: !578, size: 1088, offset: 7040)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !579)
!579 = !{!580, !584, !590, !594, !598, !602, !603, !610, !614, !618, !622, !628, !632, !649, !650, !651, !652}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !578, file: !6, line: 475, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !386, !367, !311}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !578, file: !6, line: 481, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !386, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !578, file: !6, line: 483, baseType: !591, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !386, !329}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !578, file: !6, line: 484, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !386, !7, !189, !329, !311, !366}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !578, file: !6, line: 486, baseType: !599, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !386, !7, !253}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !578, file: !6, line: 487, baseType: !599, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !578, file: !6, line: 488, baseType: !604, size: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !386, !7, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !276)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !578, file: !6, line: 489, baseType: !611, size: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !386, !7}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !578, file: !6, line: 490, baseType: !615, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!311, !386, !329, !311}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !578, file: !6, line: 491, baseType: !619, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !386, !329, !311, !329}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !578, file: !6, line: 492, baseType: !623, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!329, !386, !329, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !578, file: !6, line: 496, baseType: !629, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!253, !386, !367}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !578, file: !6, line: 500, baseType: !633, size: 64, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!191, !386, !311, !263, !7, !329, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !638, line: 52, baseType: !639)
!638 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !640, line: 32, baseType: !641)
!640 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 192, elements: !304)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !643, file: !3, baseType: !7, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !643, file: !3, baseType: !7, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !643, file: !3, baseType: !185, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !643, file: !3, baseType: !185, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !578, file: !6, line: 506, baseType: !599, size: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !578, file: !6, line: 507, baseType: !599, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !578, file: !6, line: 510, baseType: !383, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !578, file: !6, line: 513, baseType: !653, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !386, !263, !253}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !388, file: !157, line: 453, baseType: !657, size: 64, offset: 8128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !232, line: 46, size: 1152, elements: !659)
!659 = !{!660, !661, !665, !671, !675, !676, !677, !679, !680, !681}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !658, file: !232, line: 49, baseType: !511, size: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !658, file: !232, line: 51, baseType: !662, size: 64, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !232, line: 41, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !658, file: !232, line: 53, baseType: !666, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!663, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !232, line: 40, baseType: !658)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !658, file: !232, line: 56, baseType: !672, size: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!185, !356}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !658, file: !232, line: 58, baseType: !7, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !658, file: !232, line: 59, baseType: !7, size: 32, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !658, file: !232, line: 62, baseType: !678, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !658, file: !232, line: 65, baseType: !7, size: 32, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !658, file: !232, line: 66, baseType: !7, size: 32, offset: 1056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !658, file: !232, line: 69, baseType: !191, size: 8, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !388, file: !157, line: 456, baseType: !683, size: 64, offset: 8192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !157, line: 42, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !388, file: !157, line: 456, baseType: !683, size: 64, offset: 8256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !388, file: !157, line: 459, baseType: !687, size: 1024, offset: 8320)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !687, file: !6, line: 282, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !687, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !687, file: !6, line: 288, baseType: !191, size: 8, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !687, file: !6, line: 291, baseType: !191, size: 8, offset: 72)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !687, file: !6, line: 296, baseType: !191, size: 8, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !687, file: !6, line: 299, baseType: !191, size: 8, offset: 88)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !687, file: !6, line: 303, baseType: !191, size: 8, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !687, file: !6, line: 306, baseType: !191, size: 8, offset: 104)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !687, file: !6, line: 309, baseType: !191, size: 8, offset: 112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !687, file: !6, line: 312, baseType: !191, size: 8, offset: 120)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !687, file: !6, line: 315, baseType: !191, size: 8, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !687, file: !6, line: 318, baseType: !191, size: 8, offset: 136)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !687, file: !6, line: 321, baseType: !191, size: 8, offset: 144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !687, file: !6, line: 324, baseType: !191, size: 8, offset: 152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !687, file: !6, line: 328, baseType: !191, size: 8, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !687, file: !6, line: 331, baseType: !191, size: 8, offset: 168)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !687, file: !6, line: 334, baseType: !191, size: 8, offset: 176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !687, file: !6, line: 338, baseType: !191, size: 8, offset: 184)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !687, file: !6, line: 341, baseType: !191, size: 8, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !687, file: !6, line: 344, baseType: !191, size: 8, offset: 200)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !687, file: !6, line: 348, baseType: !191, size: 8, offset: 208)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !687, file: !6, line: 352, baseType: !191, size: 8, offset: 216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !687, file: !6, line: 356, baseType: !191, size: 8, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !687, file: !6, line: 360, baseType: !191, size: 8, offset: 232)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !687, file: !6, line: 363, baseType: !191, size: 8, offset: 240)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !687, file: !6, line: 366, baseType: !191, size: 8, offset: 248)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !687, file: !6, line: 370, baseType: !191, size: 8, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !687, file: !6, line: 373, baseType: !191, size: 8, offset: 264)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !687, file: !6, line: 376, baseType: !191, size: 8, offset: 272)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !687, file: !6, line: 379, baseType: !191, size: 8, offset: 280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !687, file: !6, line: 382, baseType: !191, size: 8, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !687, file: !6, line: 385, baseType: !191, size: 8, offset: 296)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !687, file: !6, line: 389, baseType: !191, size: 8, offset: 304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !687, file: !6, line: 392, baseType: !191, size: 8, offset: 312)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !687, file: !6, line: 395, baseType: !191, size: 8, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !687, file: !6, line: 398, baseType: !191, size: 8, offset: 328)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !687, file: !6, line: 401, baseType: !191, size: 8, offset: 336)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !687, file: !6, line: 404, baseType: !329, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !687, file: !6, line: 407, baseType: !329, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !687, file: !6, line: 410, baseType: !329, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !687, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !687, file: !6, line: 417, baseType: !191, size: 8, offset: 608)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !687, file: !6, line: 420, baseType: !191, size: 8, offset: 616)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !687, file: !6, line: 441, baseType: !733, size: 64, offset: 640)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !6, line: 423, size: 64, elements: !734)
!734 = !{!735, !736, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !733, file: !6, line: 426, baseType: !37, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !733, file: !6, line: 429, baseType: !191, size: 8, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !733, file: !6, line: 433, baseType: !191, size: 8, offset: 40)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !733, file: !6, line: 436, baseType: !191, size: 8, offset: 48)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !733, file: !6, line: 440, baseType: !191, size: 8, offset: 56)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !687, file: !6, line: 447, baseType: !356, size: 64, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !687, file: !6, line: 447, baseType: !356, size: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !687, file: !6, line: 447, baseType: !356, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !687, file: !6, line: 447, baseType: !356, size: 64, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !687, file: !6, line: 450, baseType: !191, size: 8, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !687, file: !6, line: 450, baseType: !191, size: 8, offset: 968)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !687, file: !6, line: 454, baseType: !191, size: 8, offset: 976)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !687, file: !6, line: 457, baseType: !191, size: 8, offset: 984)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !687, file: !6, line: 460, baseType: !191, size: 8, offset: 992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !388, file: !157, line: 463, baseType: !750, size: 256, offset: 9344)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !157, line: 227, size: 256, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !750, file: !157, line: 229, baseType: !253, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !750, file: !157, line: 230, baseType: !253, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !750, file: !157, line: 231, baseType: !253, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !750, file: !157, line: 232, baseType: !253, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !388, file: !157, line: 466, baseType: !191, size: 8, offset: 9600)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !388, file: !157, line: 475, baseType: !758, size: 256, offset: 9664)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !157, line: 469, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !758, file: !157, line: 471, baseType: !447, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !758, file: !157, line: 472, baseType: !447, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !758, file: !157, line: 473, baseType: !447, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !758, file: !157, line: 474, baseType: !263, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !388, file: !157, line: 478, baseType: !189, size: 64, offset: 9920)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !388, file: !157, line: 478, baseType: !189, size: 64, offset: 9984)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !388, file: !157, line: 478, baseType: !189, size: 64, offset: 10048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !388, file: !157, line: 482, baseType: !768, size: 64, offset: 10112)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !157, line: 482, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !388, file: !157, line: 485, baseType: !7, size: 32, offset: 10176)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !388, file: !157, line: 488, baseType: !772, size: 128, offset: 10240)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !774)
!774 = !{!775, !782, !783}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !773, file: !6, line: 894, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !778, file: !6, line: 883, baseType: !187, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !778, file: !6, line: 886, baseType: !263, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !6, line: 897, baseType: !311, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !773, file: !6, line: 900, baseType: !311, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !388, file: !157, line: 491, baseType: !785, size: 64, offset: 10368)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !157, line: 310, size: 192, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !786, file: !157, line: 312, baseType: !785, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !157, line: 314, baseType: !187, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !786, file: !157, line: 316, baseType: !246, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !379, file: !3, line: 55, baseType: !369, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !379, file: !3, line: 56, baseType: !7, size: 32)
!793 = !{!0, !794}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "linemarker_dir", scope: !2, file: !3, line: 194, type: !796, isLocal: true, isDefinition: true)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "directive", file: !3, line: 83, baseType: !484)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 3648, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 19)
!801 = !{i32 7, !"Dwarf Version", i32 4}
!802 = !{i32 2, !"Debug Info Version", i32 3}
!803 = !{i32 1, !"wchar_size", i32 4}
!804 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!805 = distinct !DISubprogram(name: "_cpp_handle_directive", scope: !3, file: !3, line: 391, type: !806, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!311, !386, !311}
!808 = !{}
!809 = !DILocalVariable(name: "pfile", arg: 1, scope: !805, file: !3, line: 391, type: !386)
!810 = !DILocation(line: 391, column: 36, scope: !805)
!811 = !DILocalVariable(name: "indented", arg: 2, scope: !805, file: !3, line: 391, type: !311)
!812 = !DILocation(line: 391, column: 47, scope: !805)
!813 = !DILocalVariable(name: "dir", scope: !805, file: !3, line: 393, type: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!815 = !DILocation(line: 393, column: 20, scope: !805)
!816 = !DILocalVariable(name: "dname", scope: !805, file: !3, line: 394, type: !367)
!817 = !DILocation(line: 394, column: 20, scope: !805)
!818 = !DILocalVariable(name: "was_parsing_args", scope: !805, file: !3, line: 395, type: !191)
!819 = !DILocation(line: 395, column: 8, scope: !805)
!820 = !DILocation(line: 395, column: 27, scope: !805)
!821 = !DILocation(line: 395, column: 34, scope: !805)
!822 = !DILocation(line: 395, column: 40, scope: !805)
!823 = !DILocalVariable(name: "was_discarding_output", scope: !805, file: !3, line: 396, type: !191)
!824 = !DILocation(line: 396, column: 8, scope: !805)
!825 = !DILocation(line: 396, column: 32, scope: !805)
!826 = !DILocation(line: 396, column: 39, scope: !805)
!827 = !DILocation(line: 396, column: 45, scope: !805)
!828 = !DILocalVariable(name: "skip", scope: !805, file: !3, line: 397, type: !311)
!829 = !DILocation(line: 397, column: 7, scope: !805)
!830 = !DILocation(line: 399, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !805, file: !3, line: 399, column: 7)
!832 = !DILocation(line: 399, column: 7, scope: !805)
!833 = !DILocation(line: 400, column: 5, scope: !831)
!834 = !DILocation(line: 400, column: 12, scope: !831)
!835 = !DILocation(line: 400, column: 18, scope: !831)
!836 = !DILocation(line: 400, column: 36, scope: !831)
!837 = !DILocation(line: 402, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !805, file: !3, line: 402, column: 7)
!839 = !DILocation(line: 402, column: 7, scope: !805)
!840 = !DILocation(line: 404, column: 11, scope: !841)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 404, column: 11)
!842 = distinct !DILexicalBlock(scope: !838, file: !3, line: 403, column: 5)
!843 = !DILocation(line: 404, column: 11, scope: !842)
!844 = !DILocation(line: 405, column: 13, scope: !841)
!845 = !DILocation(line: 405, column: 2, scope: !841)
!846 = !DILocation(line: 407, column: 7, scope: !842)
!847 = !DILocation(line: 407, column: 14, scope: !842)
!848 = !DILocation(line: 407, column: 20, scope: !842)
