; ModuleID = 'regrename.c'
source_filename = "regrename.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }

!774 = !DIEnumerator(name: "mark_access", value: 5, isUnsigned: true)
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !571, line: 836, baseType: !7, size: 32, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!777 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!778 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!779 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!780 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!781 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!782 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!783 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!784 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!785 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!786 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!787 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!788 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!789 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!790 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!791 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!792 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!793 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!794 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!795 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!796 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!797 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!798 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!799 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!800 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!801 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!802 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!803 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!804 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!805 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!806 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!807 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!808 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_rtl_index", file: !571, line: 1994, baseType: !7, size: 32, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!811 = !DIEnumerator(name: "GR_PC", value: 0, isUnsigned: true)
!812 = !DIEnumerator(name: "GR_CC0", value: 1, isUnsigned: true)
!813 = !DIEnumerator(name: "GR_STACK_POINTER", value: 2, isUnsigned: true)
!814 = !DIEnumerator(name: "GR_FRAME_POINTER", value: 3, isUnsigned: true)
!815 = !DIEnumerator(name: "GR_HARD_FRAME_POINTER", value: 4, isUnsigned: true)
!816 = !DIEnumerator(name: "GR_ARG_POINTER", value: 5, isUnsigned: true)
!817 = !DIEnumerator(name: "GR_VIRTUAL_INCOMING_ARGS", value: 6, isUnsigned: true)
!818 = !DIEnumerator(name: "GR_VIRTUAL_STACK_ARGS", value: 7, isUnsigned: true)
!819 = !DIEnumerator(name: "GR_VIRTUAL_STACK_DYNAMIC", value: 8, isUnsigned: true)
!820 = !DIEnumerator(name: "GR_VIRTUAL_OUTGOING_ARGS", value: 9, isUnsigned: true)
!821 = !DIEnumerator(name: "GR_VIRTUAL_CFA", value: 10, isUnsigned: true)
!822 = !DIEnumerator(name: "GR_MAX", value: 11, isUnsigned: true)
!823 = !{!824, !829, !832, !827, !834, !570, !189, !836, !837, !839, !1943, !862, !775, !1944, !852, !857, !7, !2009, !886, !851}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!828 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !827}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !835, line: 42, baseType: !836)
!835 = !DIFile(filename: "./hard-reg-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!836 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !838, line: 35, baseType: !828)
!838 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_du_head_p_heap", file: !3, line: 126, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_du_head_p_heap", file: !3, line: 126, size: 128, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !841, file: !3, line: 126, baseType: !844, size: 128)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_du_head_p_base", file: !3, line: 125, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_du_head_p_base", file: !3, line: 125, size: 128, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !845, file: !3, line: 125, baseType: !7, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !845, file: !3, line: 125, baseType: !7, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !845, file: !3, line: 125, baseType: !850, size: 64, offset: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 64, elements: !900)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "du_head_p", file: !3, line: 124, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "du_head", file: !3, line: 49, size: 704, elements: !854)
!854 = !{!855, !856, !1933, !1934, !1935, !1936, !1937, !1939, !1940, !1941, !1942}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next_chain", scope: !853, file: !3, line: 52, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !853, file: !3, line: 54, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "du_chain", file: !3, line: 76, size: 256, elements: !859)
!859 = !{!860, !861, !1930, !1932}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next_use", scope: !858, file: !3, line: 79, baseType: !857, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !858, file: !3, line: 82, baseType: !862, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !863, line: 50, baseType: !864)
!863 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !571, line: 240, size: 384, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !865, file: !571, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !865, file: !571, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !865, file: !571, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !865, file: !571, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !865, file: !571, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !865, file: !571, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !865, file: !571, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !865, file: !571, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !865, file: !571, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !865, file: !571, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !865, file: !571, line: 321, baseType: !878, size: 320, offset: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !571, line: 315, size: 320, elements: !879)
!879 = !{!880, !1865, !1867, !1928, !1929}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !878, file: !571, line: 316, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 64, elements: !900)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !571, line: 183, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !571, line: 166, size: 64, elements: !884)
!884 = !{!885, !887, !888, !891, !892, !902, !903, !915, !918, !978, !1843, !1844, !1855, !1862}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !883, file: !571, line: 168, baseType: !886, size: 32)
!886 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !883, file: !571, line: 169, baseType: !7, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !883, file: !571, line: 170, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !833)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !883, file: !571, line: 171, baseType: !862, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !883, file: !571, line: 172, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !863, line: 53, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !571, line: 359, size: 128, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !895, file: !571, line: 360, baseType: !886, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !895, file: !571, line: 361, baseType: !899, size: 64, offset: 64)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 1)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !883, file: !571, line: 173, baseType: !189, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !883, file: !571, line: 174, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !571, line: 133, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 115, size: 32, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !905, file: !571, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !905, file: !571, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !905, file: !571, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !905, file: !571, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !905, file: !571, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !905, file: !571, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !905, file: !571, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !905, file: !571, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !883, file: !571, line: 175, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !571, line: 175, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !883, file: !571, line: 176, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !921, line: 75, size: 256, elements: !922)
!921 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!922 = !{!923, !937, !938, !939}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !920, file: !921, line: 76, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !921, line: 68, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !921, line: 63, size: 320, elements: !927)
!927 = !{!928, !930, !931, !932}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !921, line: 64, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !926, file: !921, line: 65, baseType: !929, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !926, file: !921, line: 66, baseType: !7, size: 32, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !926, file: !921, line: 67, baseType: !933, size: 128, offset: 192)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 128, elements: !935)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !921, line: 29, baseType: !836)
!935 = !{!936}
!936 = !DISubrange(count: 2)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !920, file: !921, line: 77, baseType: !924, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !920, file: !921, line: 78, baseType: !7, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !920, file: !921, line: 79, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !921, line: 49, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !921, line: 45, size: 832, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !942, file: !921, line: 46, baseType: !929, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !942, file: !921, line: 47, baseType: !919, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !942, file: !921, line: 48, baseType: !947, size: 704, offset: 128)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !948, line: 164, size: 704, elements: !949)
!948 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!949 = !{!950, !951, !961, !962, !963, !964, !965, !966, !970, !974, !975, !976, !977}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !947, file: !948, line: 166, baseType: !828, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !947, file: !948, line: 167, baseType: !952, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !948, line: 157, size: 192, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !953, file: !948, line: 159, baseType: !832, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !953, file: !948, line: 160, baseType: !952, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !953, file: !948, line: 161, baseType: !958, size: 32, offset: 128)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 32, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 4)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !947, file: !948, line: 168, baseType: !832, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !947, file: !948, line: 169, baseType: !832, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !947, file: !948, line: 170, baseType: !832, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !947, file: !948, line: 171, baseType: !828, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !947, file: !948, line: 172, baseType: !886, size: 32, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !947, file: !948, line: 176, baseType: !967, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!952, !827, !828}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !947, file: !948, line: 177, baseType: !971, size: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !827, !952}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !947, file: !948, line: 178, baseType: !827, size: 64, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !947, file: !948, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !947, file: !948, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !947, file: !948, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !883, file: !571, line: 177, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !863, line: 56, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !982)
!982 = !{!983, !1016, !1022, !1033, !1052, !1063, !1068, !1075, !1081, !1095, !1107, !1145, !1150, !1178, !1186, !1187, !1192, !1201, !1207, !1212, !1216, !1220, !1467, !1516, !1522, !1529, !1536, !1562, !1587, !1604, !1616, !1638, !1653, !1825}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !981, file: !334, line: 3372, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !984, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !984, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !984, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !984, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !984, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !984, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !984, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !984, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !984, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !984, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !984, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !984, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !984, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !984, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !984, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !984, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !984, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !984, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !984, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !984, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !984, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !984, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !984, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !984, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !984, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !984, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !984, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !984, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !984, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !984, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !334, line: 3373, baseType: !1017, size: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1017, file: !334, line: 403, baseType: !984, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1017, file: !334, line: 404, baseType: !979, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !334, line: 405, baseType: !979, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !981, file: !334, line: 3374, baseType: !1023, size: 320)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !334, line: 1385, baseType: !1017, size: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1023, file: !334, line: 1386, baseType: !1027, size: 128, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1028, line: 58, baseType: !1029)
!1028 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1028, line: 54, size: 128, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1029, file: !1028, line: 56, baseType: !836, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1029, file: !1028, line: 57, baseType: !828, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !981, file: !334, line: 3375, baseType: !1034, size: 256)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1034, file: !334, line: 1398, baseType: !1017, size: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1034, file: !334, line: 1399, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1040, line: 52, size: 256, elements: !1041)
!1040 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1039, file: !1040, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1039, file: !1040, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1039, file: !1040, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1039, file: !1040, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1039, file: !1040, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1039, file: !1040, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1039, file: !1040, line: 62, baseType: !1049, size: 192, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 192, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 3)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !981, file: !334, line: 3376, baseType: !1053, size: 256)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !334, line: 1409, baseType: !1017, size: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1053, file: !334, line: 1410, baseType: !1057, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1059, line: 27, size: 192, elements: !1060)
!1059 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !1059, line: 29, baseType: !1027, size: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1058, file: !1059, line: 30, baseType: !189, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !981, file: !334, line: 3377, baseType: !1064, size: 256)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !334, line: 1438, baseType: !1017, size: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1064, file: !334, line: 1439, baseType: !979, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !981, file: !334, line: 3378, baseType: !1069, size: 256)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !334, line: 1419, baseType: !1017, size: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1069, file: !334, line: 1420, baseType: !886, size: 32, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1069, file: !334, line: 1421, baseType: !1074, size: 8, offset: 224)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 8, elements: !900)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !981, file: !334, line: 3379, baseType: !1076, size: 320)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !334, line: 1429, baseType: !1017, size: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1076, file: !334, line: 1430, baseType: !979, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1076, file: !334, line: 1431, baseType: !979, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !981, file: !334, line: 3380, baseType: !1082, size: 320)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1082, file: !334, line: 1461, baseType: !1017, size: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1082, file: !334, line: 1462, baseType: !1086, size: 128, offset: 192)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1087, line: 31, size: 128, elements: !1088)
!1087 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1088 = !{!1089, !1093, !1094}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1086, file: !1087, line: 32, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1086, file: !1087, line: 33, baseType: !7, size: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1086, file: !1087, line: 34, baseType: !7, size: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !981, file: !334, line: 3381, baseType: !1096, size: 384)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1097)
!1097 = !{!1098, !1099, !1104, !1105, !1106}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !334, line: 2508, baseType: !1017, size: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1096, file: !334, line: 2509, baseType: !1100, size: 32, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1101, line: 58, baseType: !1102)
!1101 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1103, line: 44, baseType: !7)
!1103 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1096, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !334, line: 2511, baseType: !979, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1096, file: !334, line: 2512, baseType: !979, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !981, file: !334, line: 3382, baseType: !1108, size: 896)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !334, line: 2653, baseType: !1096, size: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !334, line: 2654, baseType: !979, size: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1108, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1108, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1108, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1108, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1108, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1108, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1108, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1108, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1108, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1108, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1108, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1108, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1108, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1108, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1108, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1108, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1108, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1108, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1108, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1108, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1108, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1108, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1108, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1108, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1108, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1108, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1108, file: !334, line: 2705, baseType: !979, size: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1108, file: !334, line: 2706, baseType: !979, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1108, file: !334, line: 2707, baseType: !979, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1108, file: !334, line: 2708, baseType: !979, size: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1108, file: !334, line: 2711, baseType: !1143, size: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !981, file: !334, line: 3383, baseType: !1146, size: 960)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1146, file: !334, line: 2757, baseType: !1108, size: 896)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1146, file: !334, line: 2758, baseType: !862, size: 64, offset: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !981, file: !334, line: 3384, baseType: !1151, size: 1472)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1152)
!1152 = !{!1153, !1174, !1175, !1176, !1177}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1151, file: !334, line: 3115, baseType: !1154, size: 1216)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !334, line: 2985, baseType: !1146, size: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1154, file: !334, line: 2986, baseType: !979, size: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1154, file: !334, line: 2987, baseType: !979, size: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1154, file: !334, line: 2988, baseType: !979, size: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1154, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1154, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1154, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1154, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1154, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1154, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1154, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1154, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1154, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1154, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1154, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1154, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1154, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1154, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1151, file: !334, line: 3117, baseType: !979, size: 64, offset: 1216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1151, file: !334, line: 3119, baseType: !979, size: 64, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1151, file: !334, line: 3121, baseType: !979, size: 64, offset: 1344)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1151, file: !334, line: 3123, baseType: !979, size: 64, offset: 1408)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !981, file: !334, line: 3385, baseType: !1179, size: 1088)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1179, file: !334, line: 2875, baseType: !1146, size: 960)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1179, file: !334, line: 2876, baseType: !862, size: 64, offset: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1179, file: !334, line: 2877, baseType: !1184, size: 64, offset: 1024)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !981, file: !334, line: 3386, baseType: !1154, size: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !981, file: !334, line: 3387, baseType: !1188, size: 1280)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1188, file: !334, line: 3094, baseType: !1154, size: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1188, file: !334, line: 3095, baseType: !1184, size: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !981, file: !334, line: 3388, baseType: !1193, size: 1216)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1193, file: !334, line: 2825, baseType: !1108, size: 896)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1193, file: !334, line: 2827, baseType: !979, size: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1193, file: !334, line: 2828, baseType: !979, size: 64, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1193, file: !334, line: 2829, baseType: !979, size: 64, offset: 1024)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1193, file: !334, line: 2830, baseType: !979, size: 64, offset: 1088)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1193, file: !334, line: 2831, baseType: !979, size: 64, offset: 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !981, file: !334, line: 3389, baseType: !1202, size: 1024)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1202, file: !334, line: 2851, baseType: !1146, size: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1202, file: !334, line: 2852, baseType: !886, size: 32, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1202, file: !334, line: 2853, baseType: !886, size: 32, offset: 992)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !981, file: !334, line: 3390, baseType: !1208, size: 1024)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !334, line: 2858, baseType: !1146, size: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1208, file: !334, line: 2859, baseType: !1184, size: 64, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !981, file: !334, line: 3391, baseType: !1213, size: 960)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1214)
!1214 = !{!1215}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1213, file: !334, line: 2863, baseType: !1146, size: 960)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !981, file: !334, line: 3392, baseType: !1217, size: 1472)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1217, file: !334, line: 3305, baseType: !1151, size: 1472)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !981, file: !334, line: 3393, baseType: !1221, size: 1792)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1222)
!1222 = !{!1223, !1224, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !334, line: 3249, baseType: !1151, size: 1472)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1221, file: !334, line: 3251, baseType: !1225, size: 64, offset: 1472)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1227, line: 463, size: 1152, elements: !1228)
!1227 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1228 = !{!1229, !1232, !1336, !1337, !1340, !1343, !1391, !1392, !1393, !1394, !1395, !1419, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1226, file: !1227, line: 464, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1227, line: 464, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1226, file: !1227, line: 467, baseType: !1233, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1235)
!1235 = !{!1236, !1311, !1312, !1325, !1326, !1327, !1328, !1329, !1330, !1332, !1334, !1335}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1234, file: !318, line: 377, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !863, line: 111, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1240)
!1240 = !{!1241, !1276, !1277, !1278, !1281, !1285, !1286, !1287, !1305, !1306, !1307, !1308, !1309, !1310}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1239, file: !318, line: 219, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1245)
!1245 = !{!1246}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1244, file: !318, line: 151, baseType: !1247, size: 128)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1249)
!1249 = !{!1250, !1251, !1252}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1248, file: !318, line: 150, baseType: !7, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1248, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1248, file: !318, line: 150, baseType: !1253, size: 64, offset: 64)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1254, size: 64, elements: !900)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !863, line: 108, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1268, !1269, !1270, !1271, !1272, !1273, !1274}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1256, file: !318, line: 124, baseType: !1238, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1256, file: !318, line: 125, baseType: !1238, size: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1256, file: !318, line: 131, baseType: !1261, size: 64, offset: 128)
!1261 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1262)
!1262 = !{!1263, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1261, file: !318, line: 129, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !863, line: 66, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !863, line: 65, flags: DIFlagFwdDecl)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1261, file: !318, line: 130, baseType: !862, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1256, file: !318, line: 134, baseType: !827, size: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1256, file: !318, line: 137, baseType: !979, size: 64, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1256, file: !318, line: 138, baseType: !1100, size: 32, offset: 320)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1256, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !318, line: 144, baseType: !886, size: 32, offset: 384)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1256, file: !318, line: 145, baseType: !886, size: 32, offset: 416)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1256, file: !318, line: 146, baseType: !1275, size: 64, offset: 448)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !828)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1239, file: !318, line: 220, baseType: !1242, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1239, file: !318, line: 223, baseType: !827, size: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1239, file: !318, line: 226, baseType: !1279, size: 64, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1239, file: !318, line: 229, baseType: !1282, size: 128, offset: 256)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1283, size: 128, elements: !935)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1239, file: !318, line: 232, baseType: !1238, size: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1239, file: !318, line: 233, baseType: !1238, size: 64, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1239, file: !318, line: 238, baseType: !1288, size: 64, offset: 512)
!1288 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1289)
!1289 = !{!1290, !1296}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1288, file: !318, line: 236, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1293)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1292, file: !318, line: 275, baseType: !1264, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1292, file: !318, line: 278, baseType: !1264, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1288, file: !318, line: 237, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303, !1304}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1298, file: !318, line: 261, baseType: !862, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1298, file: !318, line: 262, baseType: !862, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1298, file: !318, line: 266, baseType: !862, size: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1298, file: !318, line: 267, baseType: !862, size: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1298, file: !318, line: 270, baseType: !886, size: 32, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1239, file: !318, line: 241, baseType: !1275, size: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1239, file: !318, line: 244, baseType: !886, size: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1239, file: !318, line: 247, baseType: !886, size: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1239, file: !318, line: 250, baseType: !886, size: 32, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1239, file: !318, line: 253, baseType: !886, size: 32, offset: 736)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1239, file: !318, line: 256, baseType: !886, size: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1234, file: !318, line: 378, baseType: !1237, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1234, file: !318, line: 381, baseType: !1313, size: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1316)
!1316 = !{!1317}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1315, file: !318, line: 282, baseType: !1318, size: 128)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1320)
!1320 = !{!1321, !1322, !1323}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1319, file: !318, line: 281, baseType: !7, size: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1319, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1319, file: !318, line: 281, baseType: !1324, size: 64, offset: 64)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 64, elements: !900)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1234, file: !318, line: 384, baseType: !886, size: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1234, file: !318, line: 387, baseType: !886, size: 32, offset: 224)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1234, file: !318, line: 390, baseType: !886, size: 32, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1234, file: !318, line: 394, baseType: !1313, size: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1234, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1234, file: !318, line: 399, baseType: !1331, size: 64, offset: 416)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !935)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1234, file: !318, line: 402, baseType: !1333, size: 64, offset: 480)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !935)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1234, file: !318, line: 406, baseType: !886, size: 32, offset: 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1234, file: !318, line: 409, baseType: !886, size: 32, offset: 576)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1226, file: !1227, line: 470, baseType: !1265, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1226, file: !1227, line: 473, baseType: !1338, size: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1227, line: 166, flags: DIFlagFwdDecl)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1226, file: !1227, line: 476, baseType: !1341, size: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1227, line: 476, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1226, file: !1227, line: 479, baseType: !1344, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1345, line: 144, baseType: !1346)
!1345 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1345, line: 100, size: 896, elements: !1348)
!1348 = !{!1349, !1357, !1362, !1364, !1366, !1368, !1369, !1370, !1371, !1372, !1377, !1379, !1380, !1385, !1390}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1347, file: !1345, line: 102, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1345, line: 52, baseType: !1351)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!1354, !1355}
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1345, line: 47, baseType: !7)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1347, file: !1345, line: 105, baseType: !1358, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1345, line: 59, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!886, !1355, !1355}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1347, file: !1345, line: 108, baseType: !1363, size: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1345, line: 63, baseType: !829)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1347, file: !1345, line: 111, baseType: !1365, size: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1347, file: !1345, line: 114, baseType: !1367, size: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !838, line: 46, baseType: !836)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1347, file: !1345, line: 117, baseType: !1367, size: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1347, file: !1345, line: 120, baseType: !1367, size: 64, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1347, file: !1345, line: 124, baseType: !7, size: 32, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1347, file: !1345, line: 128, baseType: !7, size: 32, offset: 480)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1347, file: !1345, line: 131, baseType: !1373, size: 64, offset: 512)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1345, line: 75, baseType: !1374)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!827, !1367, !1367}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1347, file: !1345, line: 132, baseType: !1378, size: 64, offset: 576)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1345, line: 78, baseType: !829)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1347, file: !1345, line: 135, baseType: !827, size: 64, offset: 640)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1347, file: !1345, line: 136, baseType: !1381, size: 64, offset: 704)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1345, line: 82, baseType: !1382)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!827, !827, !1367, !1367}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1347, file: !1345, line: 137, baseType: !1386, size: 64, offset: 768)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1345, line: 83, baseType: !1387)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !827, !827}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1347, file: !1345, line: 141, baseType: !7, size: 32, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1226, file: !1227, line: 484, baseType: !979, size: 64, offset: 384)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1226, file: !1227, line: 488, baseType: !979, size: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1226, file: !1227, line: 493, baseType: !979, size: 64, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1226, file: !1227, line: 496, baseType: !979, size: 64, offset: 576)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1226, file: !1227, line: 501, baseType: !1396, size: 64, offset: 640)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1398)
!1398 = !{!1399, !1402, !1403, !1404, !1405, !1407, !1408, !1413, !1414, !1415, !1416, !1417, !1418}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1397, file: !329, line: 2356, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1397, file: !329, line: 2357, baseType: !889, size: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1397, file: !329, line: 2358, baseType: !886, size: 32, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1397, file: !329, line: 2359, baseType: !886, size: 32, offset: 160)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1397, file: !329, line: 2360, baseType: !1406, size: 128, offset: 192)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 128, elements: !959)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1397, file: !329, line: 2364, baseType: !886, size: 32, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1397, file: !329, line: 2367, baseType: !1409, size: 128, offset: 384)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1410)
!1410 = !{!1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1409, file: !329, line: 2351, baseType: !862, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1409, file: !329, line: 2352, baseType: !828, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1397, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1397, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1397, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1397, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1397, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1397, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1226, file: !1227, line: 504, baseType: !1420, size: 64, offset: 704)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1227, line: 504, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1226, file: !1227, line: 507, baseType: !1344, size: 64, offset: 768)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1226, file: !1227, line: 510, baseType: !886, size: 32, offset: 832)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1226, file: !1227, line: 513, baseType: !886, size: 32, offset: 864)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1226, file: !1227, line: 516, baseType: !1100, size: 32, offset: 896)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1226, file: !1227, line: 519, baseType: !1100, size: 32, offset: 928)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1226, file: !1227, line: 522, baseType: !7, size: 32, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1226, file: !1227, line: 523, baseType: !7, size: 32, offset: 992)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1226, file: !1227, line: 528, baseType: !889, size: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1226, file: !1227, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1226, file: !1227, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1226, file: !1227, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1226, file: !1227, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1226, file: !1227, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1226, file: !1227, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1226, file: !1227, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1226, file: !1227, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1226, file: !1227, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1226, file: !1227, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1226, file: !1227, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1226, file: !1227, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1226, file: !1227, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1226, file: !1227, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1226, file: !1227, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1226, file: !1227, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1221, file: !334, line: 3254, baseType: !979, size: 64, offset: 1536)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1221, file: !334, line: 3257, baseType: !979, size: 64, offset: 1600)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1221, file: !334, line: 3258, baseType: !979, size: 64, offset: 1664)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1221, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1221, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1221, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1221, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1221, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1221, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1221, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1221, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1221, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1221, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1221, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1221, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1221, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1221, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1221, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1221, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1221, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1221, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !334, line: 3394, baseType: !1468, size: 1344)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1495, !1496, !1497, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1468, file: !334, line: 2280, baseType: !1017, size: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1468, file: !334, line: 2281, baseType: !979, size: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1468, file: !334, line: 2282, baseType: !979, size: 64, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1468, file: !334, line: 2283, baseType: !979, size: 64, offset: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1468, file: !334, line: 2284, baseType: !979, size: 64, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1468, file: !334, line: 2285, baseType: !7, size: 32, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1468, file: !334, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1468, file: !334, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1468, file: !334, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1468, file: !334, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1468, file: !334, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1468, file: !334, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1468, file: !334, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1468, file: !334, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1468, file: !334, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1468, file: !334, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1468, file: !334, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1468, file: !334, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1468, file: !334, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1468, file: !334, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1468, file: !334, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1468, file: !334, line: 2305, baseType: !7, size: 32, offset: 512)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1468, file: !334, line: 2306, baseType: !1493, size: 32, offset: 544)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1494, line: 31, baseType: !886)
!1494 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1468, file: !334, line: 2307, baseType: !979, size: 64, offset: 576)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1468, file: !334, line: 2308, baseType: !979, size: 64, offset: 640)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1468, file: !334, line: 2314, baseType: !1498, size: 64, offset: 704)
!1498 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !334, line: 2309, size: 64, elements: !1499)
!1499 = !{!1500, !1501, !1502}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1498, file: !334, line: 2310, baseType: !886, size: 32)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1498, file: !334, line: 2311, baseType: !889, size: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1498, file: !334, line: 2312, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !334, line: 2277, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1468, file: !334, line: 2315, baseType: !979, size: 64, offset: 768)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1468, file: !334, line: 2316, baseType: !979, size: 64, offset: 832)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1468, file: !334, line: 2317, baseType: !979, size: 64, offset: 896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1468, file: !334, line: 2318, baseType: !979, size: 64, offset: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1468, file: !334, line: 2319, baseType: !979, size: 64, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1468, file: !334, line: 2320, baseType: !979, size: 64, offset: 1088)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1468, file: !334, line: 2321, baseType: !979, size: 64, offset: 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1468, file: !334, line: 2322, baseType: !979, size: 64, offset: 1216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1468, file: !334, line: 2324, baseType: !1514, size: 64, offset: 1280)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1515 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !334, line: 2324, flags: DIFlagFwdDecl)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !981, file: !334, line: 3395, baseType: !1517, size: 320)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !334, line: 1469, size: 320, elements: !1518)
!1518 = !{!1519, !1520, !1521}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1517, file: !334, line: 1470, baseType: !1017, size: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1517, file: !334, line: 1471, baseType: !979, size: 64, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1517, file: !334, line: 1472, baseType: !979, size: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !981, file: !334, line: 3396, baseType: !1523, size: 320)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !334, line: 1482, size: 320, elements: !1524)
!1524 = !{!1525, !1526, !1527}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1523, file: !334, line: 1483, baseType: !1017, size: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1523, file: !334, line: 1484, baseType: !886, size: 32, offset: 192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1523, file: !334, line: 1485, baseType: !1528, size: 64, offset: 256)
!1528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 64, elements: !900)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !981, file: !334, line: 3397, baseType: !1530, size: 384)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !334, line: 1829, size: 384, elements: !1531)
!1531 = !{!1532, !1533, !1534, !1535}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1530, file: !334, line: 1830, baseType: !1017, size: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1530, file: !334, line: 1831, baseType: !1100, size: 32, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1530, file: !334, line: 1832, baseType: !979, size: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1530, file: !334, line: 1835, baseType: !1528, size: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !981, file: !334, line: 3398, baseType: !1537, size: 704)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !334, line: 1898, size: 704, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1545, !1546, !1549}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1537, file: !334, line: 1899, baseType: !1017, size: 192)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1537, file: !334, line: 1902, baseType: !979, size: 64, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1537, file: !334, line: 1905, baseType: !1542, size: 64, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !863, line: 58, baseType: !1543)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64)
!1544 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !863, line: 57, flags: DIFlagFwdDecl)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1537, file: !334, line: 1908, baseType: !7, size: 32, offset: 320)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1537, file: !334, line: 1911, baseType: !1547, size: 64, offset: 384)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64)
!1548 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !334, line: 1876, flags: DIFlagFwdDecl)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1537, file: !334, line: 1914, baseType: !1550, size: 256, offset: 448)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1551)
!1551 = !{!1552, !1554, !1555, !1560}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1550, file: !334, line: 1884, baseType: !1553, size: 64)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1550, file: !334, line: 1885, baseType: !1553, size: 64, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1550, file: !334, line: 1891, baseType: !1556, size: 64, offset: 128)
!1556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1550, file: !334, line: 1891, size: 64, elements: !1557)
!1557 = !{!1558, !1559}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1556, file: !334, line: 1891, baseType: !1542, size: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1556, file: !334, line: 1891, baseType: !979, size: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1550, file: !334, line: 1892, baseType: !1561, size: 64, offset: 192)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !981, file: !334, line: 3399, baseType: !1563, size: 704)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !334, line: 2008, size: 704, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1569, !1570, !1582, !1583, !1584, !1585, !1586}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1563, file: !334, line: 2009, baseType: !1017, size: 192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1563, file: !334, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1563, file: !334, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1563, file: !334, line: 2014, baseType: !1100, size: 32, offset: 224)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1563, file: !334, line: 2016, baseType: !979, size: 64, offset: 256)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1563, file: !334, line: 2017, baseType: !1571, size: 64, offset: 320)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
