; ModuleID = 'sched-ebb.c'
source_filename = "sched-ebb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gcov_ctr_summary = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_pending_barrier_mode", file: !508, line: 424, baseType: !7, size: 32, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIEnumerator(name: "NOT_A_BARRIER", value: 0, isUnsigned: true)
!682 = !DIEnumerator(name: "MOVE_BARRIER", value: 1, isUnsigned: true)
!683 = !DIEnumerator(name: "TRUE_BARRIER", value: 2, isUnsigned: true)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !516, line: 836, baseType: !7, size: 32, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!686 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!687 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!688 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!689 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!690 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!691 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!692 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!693 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!694 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!695 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!696 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!697 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!698 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!699 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!700 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!701 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!702 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!703 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!704 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!705 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!706 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!707 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!708 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!709 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!710 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!711 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!712 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SCHED_FLAGS", file: !508, line: 1029, baseType: !7, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725}
!720 = !DIEnumerator(name: "USE_DEPS_LIST", value: 1, isUnsigned: true)
!721 = !DIEnumerator(name: "DO_SPECULATION", value: 2, isUnsigned: true)
!722 = !DIEnumerator(name: "SCHED_RGN", value: 4, isUnsigned: true)
!723 = !DIEnumerator(name: "SCHED_EBB", value: 8, isUnsigned: true)
!724 = !DIEnumerator(name: "NEW_BBS", value: 16, isUnsigned: true)
!725 = !DIEnumerator(name: "SEL_SCHED", value: 32, isUnsigned: true)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DEPS_ADJUST_RESULT", file: !508, line: 1016, baseType: !7, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIEnumerator(name: "DEP_NODEP", value: 0, isUnsigned: true)
!729 = !DIEnumerator(name: "DEP_PRESENT", value: 1, isUnsigned: true)
!730 = !DIEnumerator(name: "DEP_CHANGED", value: 2, isUnsigned: true)
!731 = !DIEnumerator(name: "DEP_CREATED", value: 3, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SPEC_TYPES_OFFSETS", file: !508, line: 958, baseType: !7, size: 32, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIEnumerator(name: "BEGIN_DATA_BITS_OFFSET", value: 0, isUnsigned: true)
!735 = !DIEnumerator(name: "BE_IN_DATA_BITS_OFFSET", value: 6, isUnsigned: true)
!736 = !DIEnumerator(name: "BEGIN_CONTROL_BITS_OFFSET", value: 12, isUnsigned: true)
!737 = !DIEnumerator(name: "BE_IN_CONTROL_BITS_OFFSET", value: 18, isUnsigned: true)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "INSN_TRAP_CLASS", file: !508, line: 1121, baseType: !7, size: 32, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIEnumerator(name: "TRAP_FREE", value: 0, isUnsigned: true)
!741 = !DIEnumerator(name: "IFREE", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "PFREE_CANDIDATE", value: 2, isUnsigned: true)
!743 = !DIEnumerator(name: "PRISKY_CANDIDATE", value: 3, isUnsigned: true)
!744 = !DIEnumerator(name: "IRISKY", value: 4, isUnsigned: true)
!745 = !DIEnumerator(name: "TRAP_RISKY", value: 5, isUnsigned: true)
!746 = !{!747, !515, !5, !748, !859, !1288, !1922}
!747 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !749, line: 50, baseType: !750)
!749 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !516, line: 240, size: 384, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !751, file: !516, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !751, file: !516, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !751, file: !516, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !751, file: !516, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !751, file: !516, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !751, file: !516, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !751, file: !516, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !751, file: !516, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !751, file: !516, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !751, file: !516, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !751, file: !516, line: 321, baseType: !764, size: 320, offset: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !516, line: 315, size: 320, elements: !765)
!765 = !{!766, !1857, !1859, !1920, !1921}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !764, file: !516, line: 316, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 64, elements: !786)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !516, line: 183, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !516, line: 166, size: 64, elements: !770)
!770 = !{!771, !772, !773, !777, !778, !788, !789, !801, !804, !868, !1835, !1836, !1847, !1854}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !769, file: !516, line: 168, baseType: !747, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !769, file: !516, line: 169, baseType: !7, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !769, file: !516, line: 170, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !769, file: !516, line: 171, baseType: !748, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !769, file: !516, line: 172, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !749, line: 53, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !516, line: 359, size: 128, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !781, file: !516, line: 360, baseType: !747, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !781, file: !516, line: 361, baseType: !785, size: 64, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 64, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 1)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !769, file: !516, line: 173, baseType: !5, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !769, file: !516, line: 174, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !516, line: 133, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 115, size: 32, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !791, file: !516, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !791, file: !516, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !791, file: !516, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !791, file: !516, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !791, file: !516, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !791, file: !516, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !791, file: !516, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !791, file: !516, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !769, file: !516, line: 175, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !516, line: 175, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !769, file: !516, line: 176, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !807, line: 75, size: 256, elements: !808)
!807 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!808 = !{!809, !824, !825, !826}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !806, file: !807, line: 76, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !807, line: 68, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !807, line: 63, size: 320, elements: !813)
!813 = !{!814, !816, !817, !818}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !807, line: 64, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !807, line: 65, baseType: !815, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !812, file: !807, line: 66, baseType: !7, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !812, file: !807, line: 67, baseType: !819, size: 128, offset: 192)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 128, elements: !822)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !807, line: 29, baseType: !821)
!821 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!822 = !{!823}
!823 = !DISubrange(count: 2)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !806, file: !807, line: 77, baseType: !810, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !806, file: !807, line: 78, baseType: !7, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !806, file: !807, line: 79, baseType: !827, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !807, line: 49, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !807, line: 45, size: 832, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !829, file: !807, line: 46, baseType: !815, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !829, file: !807, line: 47, baseType: !805, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !829, file: !807, line: 48, baseType: !834, size: 704, offset: 128)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !835, line: 164, size: 704, elements: !836)
!835 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!836 = !{!837, !839, !850, !851, !852, !853, !854, !855, !860, !864, !865, !866, !867}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !834, file: !835, line: 166, baseType: !838, size: 64)
!838 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !834, file: !835, line: 167, baseType: !840, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !835, line: 157, size: 192, elements: !842)
!842 = !{!843, !845, !846}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !841, file: !835, line: 159, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !841, file: !835, line: 160, baseType: !840, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !841, file: !835, line: 161, baseType: !847, size: 32, offset: 128)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 32, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 4)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !834, file: !835, line: 168, baseType: !844, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !834, file: !835, line: 169, baseType: !844, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !834, file: !835, line: 170, baseType: !844, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !834, file: !835, line: 171, baseType: !838, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !834, file: !835, line: 172, baseType: !747, size: 32, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !834, file: !835, line: 176, baseType: !856, size: 64, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!840, !859, !838}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !834, file: !835, line: 177, baseType: !861, size: 64, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !859, !840}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !834, file: !835, line: 178, baseType: !859, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !834, file: !835, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !834, file: !835, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !834, file: !835, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !769, file: !516, line: 177, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !749, line: 56, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !872)
!872 = !{!873, !906, !912, !923, !942, !953, !958, !965, !971, !985, !997, !1035, !1040, !1068, !1076, !1077, !1082, !1091, !1097, !1102, !1106, !1110, !1471, !1520, !1526, !1532, !1539, !1565, !1579, !1596, !1608, !1630, !1645, !1817}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !871, file: !158, line: 3372, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !874, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !874, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !874, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !874, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !874, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !874, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !874, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !874, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !874, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !874, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !874, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !874, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !874, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !874, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !874, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !874, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !874, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !874, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !874, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !874, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !874, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !874, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !874, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !874, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !874, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !874, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !874, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !874, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !874, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !874, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !158, line: 3373, baseType: !907, size: 192)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !907, file: !158, line: 403, baseType: !874, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !907, file: !158, line: 404, baseType: !869, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !907, file: !158, line: 405, baseType: !869, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !871, file: !158, line: 3374, baseType: !913, size: 320)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !913, file: !158, line: 1385, baseType: !907, size: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !913, file: !158, line: 1386, baseType: !917, size: 128, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !918, line: 58, baseType: !919)
!918 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 54, size: 128, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !919, file: !918, line: 56, baseType: !821, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !919, file: !918, line: 57, baseType: !838, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !871, file: !158, line: 3375, baseType: !924, size: 256)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !158, line: 1398, baseType: !907, size: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !924, file: !158, line: 1399, baseType: !928, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !930, line: 52, size: 256, elements: !931)
!930 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!931 = !{!932, !933, !934, !935, !936, !937, !938}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !929, file: !930, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !929, file: !930, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !929, file: !930, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !929, file: !930, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !929, file: !930, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !929, file: !930, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !929, file: !930, line: 62, baseType: !939, size: 192, offset: 64)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 192, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 3)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !871, file: !158, line: 3376, baseType: !943, size: 256)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !943, file: !158, line: 1409, baseType: !907, size: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !943, file: !158, line: 1410, baseType: !947, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !949, line: 27, size: 192, elements: !950)
!949 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !948, file: !949, line: 29, baseType: !917, size: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !948, file: !949, line: 30, baseType: !5, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !871, file: !158, line: 3377, baseType: !954, size: 256)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !158, line: 1438, baseType: !907, size: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !954, file: !158, line: 1439, baseType: !869, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !871, file: !158, line: 3378, baseType: !959, size: 256)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !158, line: 1419, baseType: !907, size: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !959, file: !158, line: 1420, baseType: !747, size: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !959, file: !158, line: 1421, baseType: !964, size: 8, offset: 224)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 8, elements: !786)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !871, file: !158, line: 3379, baseType: !966, size: 320)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !158, line: 1429, baseType: !907, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !966, file: !158, line: 1430, baseType: !869, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !966, file: !158, line: 1431, baseType: !869, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !871, file: !158, line: 3380, baseType: !972, size: 320)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !158, line: 1461, baseType: !907, size: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !158, line: 1462, baseType: !976, size: 128, offset: 192)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !977, line: 31, size: 128, elements: !978)
!977 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!978 = !{!979, !983, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !976, file: !977, line: 32, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !976, file: !977, line: 33, baseType: !7, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !976, file: !977, line: 34, baseType: !7, size: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !871, file: !158, line: 3381, baseType: !986, size: 384)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !987)
!987 = !{!988, !989, !994, !995, !996}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !986, file: !158, line: 2508, baseType: !907, size: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !986, file: !158, line: 2509, baseType: !990, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !991, line: 58, baseType: !992)
!991 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !993, line: 44, baseType: !7)
!993 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !986, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !158, line: 2511, baseType: !869, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !986, file: !158, line: 2512, baseType: !869, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !871, file: !158, line: 3382, baseType: !998, size: 896)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !158, line: 2653, baseType: !986, size: 384)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !998, file: !158, line: 2654, baseType: !869, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !998, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !998, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !998, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !998, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !998, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !998, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !998, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !998, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !998, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !998, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !998, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !998, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !998, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !998, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !998, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !998, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !998, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !998, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !998, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !998, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !998, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !998, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !998, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !998, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !998, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !998, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !998, file: !158, line: 2705, baseType: !869, size: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !998, file: !158, line: 2706, baseType: !869, size: 64, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !998, file: !158, line: 2707, baseType: !869, size: 64, offset: 704)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !998, file: !158, line: 2708, baseType: !869, size: 64, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !998, file: !158, line: 2711, baseType: !1033, size: 64, offset: 832)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !871, file: !158, line: 3383, baseType: !1036, size: 960)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1036, file: !158, line: 2757, baseType: !998, size: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1036, file: !158, line: 2758, baseType: !748, size: 64, offset: 896)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !871, file: !158, line: 3384, baseType: !1041, size: 1472)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1042)
!1042 = !{!1043, !1064, !1065, !1066, !1067}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !158, line: 3115, baseType: !1044, size: 1216)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !158, line: 2985, baseType: !1036, size: 960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1044, file: !158, line: 2986, baseType: !869, size: 64, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1044, file: !158, line: 2987, baseType: !869, size: 64, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1044, file: !158, line: 2988, baseType: !869, size: 64, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1044, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1044, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1044, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1044, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1044, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1044, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1044, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1044, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1044, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1044, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1044, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1044, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1044, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1044, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1041, file: !158, line: 3117, baseType: !869, size: 64, offset: 1216)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1041, file: !158, line: 3119, baseType: !869, size: 64, offset: 1280)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1041, file: !158, line: 3121, baseType: !869, size: 64, offset: 1344)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1041, file: !158, line: 3123, baseType: !869, size: 64, offset: 1408)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !871, file: !158, line: 3385, baseType: !1069, size: 1088)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !158, line: 2875, baseType: !1036, size: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1069, file: !158, line: 2876, baseType: !748, size: 64, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1069, file: !158, line: 2877, baseType: !1074, size: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !871, file: !158, line: 3386, baseType: !1044, size: 1216)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !871, file: !158, line: 3387, baseType: !1078, size: 1280)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !158, line: 3094, baseType: !1044, size: 1216)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1078, file: !158, line: 3095, baseType: !1074, size: 64, offset: 1216)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !871, file: !158, line: 3388, baseType: !1083, size: 1216)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !158, line: 2825, baseType: !998, size: 896)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1083, file: !158, line: 2827, baseType: !869, size: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1083, file: !158, line: 2828, baseType: !869, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1083, file: !158, line: 2829, baseType: !869, size: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1083, file: !158, line: 2830, baseType: !869, size: 64, offset: 1088)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1083, file: !158, line: 2831, baseType: !869, size: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !871, file: !158, line: 3389, baseType: !1092, size: 1024)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !158, line: 2851, baseType: !1036, size: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1092, file: !158, line: 2852, baseType: !747, size: 32, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1092, file: !158, line: 2853, baseType: !747, size: 32, offset: 992)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !871, file: !158, line: 3390, baseType: !1098, size: 1024)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1098, file: !158, line: 2858, baseType: !1036, size: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1098, file: !158, line: 2859, baseType: !1074, size: 64, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !871, file: !158, line: 3391, baseType: !1103, size: 960)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1104)
!1104 = !{!1105}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !158, line: 2863, baseType: !1036, size: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !871, file: !158, line: 3392, baseType: !1107, size: 1472)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1108)
!1108 = !{!1109}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1107, file: !158, line: 3305, baseType: !1041, size: 1472)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !871, file: !158, line: 3393, baseType: !1111, size: 1792)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1112)
!1112 = !{!1113, !1114, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !158, line: 3249, baseType: !1041, size: 1472)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1111, file: !158, line: 3251, baseType: !1115, size: 64, offset: 1472)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1117, line: 463, size: 1152, elements: !1118)
!1117 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1118 = !{!1119, !1283, !1387, !1388, !1391, !1394, !1395, !1396, !1397, !1398, !1399, !1423, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1116, file: !1117, line: 464, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1122)
!1122 = !{!1123, !1172, !1185, !1199, !1251, !1264}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1121, file: !135, line: 197, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1160, !1169, !1170, !1171}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1126, file: !135, line: 119, baseType: !1125, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1126, file: !135, line: 122, baseType: !1125, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1126, file: !135, line: 123, baseType: !1125, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1126, file: !135, line: 126, baseType: !747, size: 32, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1126, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1126, file: !135, line: 165, baseType: !1134, size: 192, offset: 256)
!1134 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1135)
!1135 = !{!1136, !1149, !1155}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1134, file: !135, line: 137, baseType: !1137, size: 128)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1138)
!1138 = !{!1139, !1148}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1137, file: !135, line: 135, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1141, file: !135, line: 96, baseType: !1140, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1141, file: !135, line: 97, baseType: !1140, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1141, file: !135, line: 101, baseType: !869, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1141, file: !135, line: 106, baseType: !869, size: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1141, file: !135, line: 111, baseType: !869, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1137, file: !135, line: 136, baseType: !1140, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1134, file: !135, line: 151, baseType: !1150, size: 192)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1150, file: !135, line: 141, baseType: !869, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1150, file: !135, line: 145, baseType: !869, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1150, file: !135, line: 150, baseType: !747, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1134, file: !135, line: 164, baseType: !1156, size: 128)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1156, file: !135, line: 161, baseType: !869, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1156, file: !135, line: 163, baseType: !990, size: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1126, file: !135, line: 168, baseType: !1161, size: 64, offset: 448)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1162, file: !135, line: 70, baseType: !1161, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1162, file: !135, line: 73, baseType: !1125, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1162, file: !135, line: 78, baseType: !869, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1162, file: !135, line: 85, baseType: !748, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1162, file: !135, line: 88, baseType: !747, size: 32, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1126, file: !135, line: 173, baseType: !748, size: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1126, file: !135, line: 173, baseType: !748, size: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1126, file: !135, line: 177, baseType: !982, size: 8, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1121, file: !135, line: 200, baseType: !1173, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1176)
!1176 = !{!1177}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1175, file: !135, line: 185, baseType: !1178, size: 128)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1179, file: !135, line: 184, baseType: !7, size: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1179, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1179, file: !135, line: 184, baseType: !1184, size: 64, offset: 64)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 64, elements: !786)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1121, file: !135, line: 203, baseType: !1186, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1189)
!1189 = !{!1190}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1188, file: !135, line: 189, baseType: !1191, size: 128)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1192, file: !135, line: 188, baseType: !7, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1192, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1192, file: !135, line: 188, baseType: !1197, size: 64, offset: 64)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 64, elements: !786)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1161)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1121, file: !135, line: 207, baseType: !1200, size: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1201, line: 144, baseType: !1202)
!1201 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1201, line: 100, size: 896, elements: !1204)
!1204 = !{!1205, !1213, !1218, !1223, !1225, !1228, !1229, !1230, !1231, !1232, !1237, !1239, !1240, !1245, !1250}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1203, file: !1201, line: 102, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1201, line: 52, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1201, line: 47, baseType: !7)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1203, file: !1201, line: 105, baseType: !1214, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1201, line: 59, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!747, !1211, !1211}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1203, file: !1201, line: 108, baseType: !1219, size: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1201, line: 63, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !859}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1203, file: !1201, line: 111, baseType: !1224, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !1201, line: 114, baseType: !1226, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1227, line: 46, baseType: !821)
!1227 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1203, file: !1201, line: 117, baseType: !1226, size: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1203, file: !1201, line: 120, baseType: !1226, size: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1203, file: !1201, line: 124, baseType: !7, size: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1203, file: !1201, line: 128, baseType: !7, size: 32, offset: 480)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1203, file: !1201, line: 131, baseType: !1233, size: 64, offset: 512)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1201, line: 75, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!859, !1226, !1226}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1203, file: !1201, line: 132, baseType: !1238, size: 64, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1201, line: 78, baseType: !1220)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1203, file: !1201, line: 135, baseType: !859, size: 64, offset: 640)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1203, file: !1201, line: 136, baseType: !1241, size: 64, offset: 704)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1201, line: 82, baseType: !1242)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!859, !859, !1226, !1226}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1203, file: !1201, line: 137, baseType: !1246, size: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1201, line: 83, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{null, !859, !859}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1203, file: !1201, line: 141, baseType: !7, size: 32, offset: 832)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1121, file: !135, line: 211, baseType: !1252, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1255)
!1255 = !{!1256}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1254, file: !158, line: 183, baseType: !1257, size: 128)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1258, file: !158, line: 182, baseType: !7, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1258, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1258, file: !158, line: 182, baseType: !1263, size: 64, offset: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 64, elements: !786)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1121, file: !135, line: 220, baseType: !1265, size: 64, offset: 320)
!1265 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1266)
!1266 = !{!1267, !1268}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1265, file: !135, line: 218, baseType: !1252, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1265, file: !135, line: 219, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1271, line: 29, baseType: !1272)
!1271 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1271, line: 29, size: 96, elements: !1273)
!1273 = !{!1274}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1272, file: !1271, line: 29, baseType: !1275, size: 96)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1271, line: 27, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1271, line: 27, size: 96, elements: !1277)
!1277 = !{!1278, !1279, !1280}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1276, file: !1271, line: 27, baseType: !7, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1276, file: !1271, line: 27, baseType: !7, size: 32, offset: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1276, file: !1271, line: 27, baseType: !1281, size: 8, offset: 64)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1282, size: 8, elements: !786)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1271, line: 26, baseType: !982)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1116, file: !1117, line: 467, baseType: !1284, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1286)
!1286 = !{!1287, !1362, !1363, !1376, !1377, !1378, !1379, !1380, !1381, !1383, !1385, !1386}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1285, file: !142, line: 377, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !749, line: 111, baseType: !1289)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1291)
!1291 = !{!1292, !1327, !1328, !1329, !1332, !1336, !1337, !1338, !1356, !1357, !1358, !1359, !1360, !1361}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1290, file: !142, line: 219, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1296)
!1296 = !{!1297}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1295, file: !142, line: 151, baseType: !1298, size: 128)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1300)
!1300 = !{!1301, !1302, !1303}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1299, file: !142, line: 150, baseType: !7, size: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1299, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1299, file: !142, line: 150, baseType: !1304, size: 64, offset: 64)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1305, size: 64, elements: !786)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !749, line: 108, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1319, !1320, !1321, !1322, !1323, !1324, !1325}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1307, file: !142, line: 124, baseType: !1289, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1307, file: !142, line: 125, baseType: !1289, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1307, file: !142, line: 131, baseType: !1312, size: 64, offset: 128)
!1312 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1313)
!1313 = !{!1314, !1318}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1312, file: !142, line: 129, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !749, line: 66, baseType: !1316)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !749, line: 65, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1312, file: !142, line: 130, baseType: !748, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1307, file: !142, line: 134, baseType: !859, size: 64, offset: 192)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1307, file: !142, line: 137, baseType: !869, size: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1307, file: !142, line: 138, baseType: !990, size: 32, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1307, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1307, file: !142, line: 144, baseType: !747, size: 32, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1307, file: !142, line: 145, baseType: !747, size: 32, offset: 416)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1307, file: !142, line: 146, baseType: !1326, size: 64, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !838)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1290, file: !142, line: 220, baseType: !1293, size: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1290, file: !142, line: 223, baseType: !859, size: 64, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1290, file: !142, line: 226, baseType: !1330, size: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1290, file: !142, line: 229, baseType: !1333, size: 128, offset: 256)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1334, size: 128, elements: !822)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1290, file: !142, line: 232, baseType: !1289, size: 64, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1290, file: !142, line: 233, baseType: !1289, size: 64, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1290, file: !142, line: 238, baseType: !1339, size: 64, offset: 512)
!1339 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1340)
!1340 = !{!1341, !1347}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1339, file: !142, line: 236, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1344)
!1344 = !{!1345, !1346}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1343, file: !142, line: 275, baseType: !1315, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1343, file: !142, line: 278, baseType: !1315, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1339, file: !142, line: 237, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1350)
!1350 = !{!1351, !1352, !1353, !1354, !1355}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1349, file: !142, line: 261, baseType: !748, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1349, file: !142, line: 262, baseType: !748, size: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1349, file: !142, line: 266, baseType: !748, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1349, file: !142, line: 267, baseType: !748, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1349, file: !142, line: 270, baseType: !747, size: 32, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1290, file: !142, line: 241, baseType: !1326, size: 64, offset: 576)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1290, file: !142, line: 244, baseType: !747, size: 32, offset: 640)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1290, file: !142, line: 247, baseType: !747, size: 32, offset: 672)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1290, file: !142, line: 250, baseType: !747, size: 32, offset: 704)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1290, file: !142, line: 253, baseType: !747, size: 32, offset: 736)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1290, file: !142, line: 256, baseType: !747, size: 32, offset: 768)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1285, file: !142, line: 378, baseType: !1288, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1285, file: !142, line: 381, baseType: !1364, size: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1367)
!1367 = !{!1368}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1366, file: !142, line: 282, baseType: !1369, size: 128)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1371)
!1371 = !{!1372, !1373, !1374}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1370, file: !142, line: 281, baseType: !7, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1370, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1370, file: !142, line: 281, baseType: !1375, size: 64, offset: 64)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1288, size: 64, elements: !786)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1285, file: !142, line: 384, baseType: !747, size: 32, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1285, file: !142, line: 387, baseType: !747, size: 32, offset: 224)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1285, file: !142, line: 390, baseType: !747, size: 32, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1285, file: !142, line: 394, baseType: !1364, size: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1285, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1285, file: !142, line: 399, baseType: !1382, size: 64, offset: 416)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !822)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1285, file: !142, line: 402, baseType: !1384, size: 64, offset: 480)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !822)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1285, file: !142, line: 406, baseType: !747, size: 32, offset: 544)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1285, file: !142, line: 409, baseType: !747, size: 32, offset: 576)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1116, file: !1117, line: 470, baseType: !1316, size: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1116, file: !1117, line: 473, baseType: !1389, size: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1117, line: 166, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1116, file: !1117, line: 476, baseType: !1392, size: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1117, line: 476, flags: DIFlagFwdDecl)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1116, file: !1117, line: 479, baseType: !1200, size: 64, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1116, file: !1117, line: 484, baseType: !869, size: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1116, file: !1117, line: 488, baseType: !869, size: 64, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1116, file: !1117, line: 493, baseType: !869, size: 64, offset: 512)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1116, file: !1117, line: 496, baseType: !869, size: 64, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1116, file: !1117, line: 501, baseType: !1400, size: 64, offset: 640)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1402)
!1402 = !{!1403, !1406, !1407, !1408, !1409, !1411, !1412, !1417, !1418, !1419, !1420, !1421, !1422}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1401, file: !153, line: 2356, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1401, file: !153, line: 2357, baseType: !774, size: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1401, file: !153, line: 2358, baseType: !747, size: 32, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1401, file: !153, line: 2359, baseType: !747, size: 32, offset: 160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1401, file: !153, line: 2360, baseType: !1410, size: 128, offset: 192)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 128, elements: !848)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1401, file: !153, line: 2364, baseType: !747, size: 32, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1401, file: !153, line: 2367, baseType: !1413, size: 128, offset: 384)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1414)
!1414 = !{!1415, !1416}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1413, file: !153, line: 2351, baseType: !748, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1413, file: !153, line: 2352, baseType: !838, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1401, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1401, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1401, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1401, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1401, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1401, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1116, file: !1117, line: 504, baseType: !1424, size: 64, offset: 704)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1117, line: 504, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1116, file: !1117, line: 507, baseType: !1200, size: 64, offset: 768)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1116, file: !1117, line: 510, baseType: !747, size: 32, offset: 832)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1116, file: !1117, line: 513, baseType: !747, size: 32, offset: 864)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1116, file: !1117, line: 516, baseType: !990, size: 32, offset: 896)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1116, file: !1117, line: 519, baseType: !990, size: 32, offset: 928)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1116, file: !1117, line: 522, baseType: !7, size: 32, offset: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1116, file: !1117, line: 523, baseType: !7, size: 32, offset: 992)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1116, file: !1117, line: 528, baseType: !774, size: 64, offset: 1024)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1116, file: !1117, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1116, file: !1117, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1116, file: !1117, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1116, file: !1117, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1116, file: !1117, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1116, file: !1117, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1116, file: !1117, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1116, file: !1117, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1116, file: !1117, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1116, file: !1117, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1116, file: !1117, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1116, file: !1117, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1116, file: !1117, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1116, file: !1117, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1116, file: !1117, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1116, file: !1117, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1111, file: !158, line: 3254, baseType: !869, size: 64, offset: 1536)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1111, file: !158, line: 3257, baseType: !869, size: 64, offset: 1600)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1111, file: !158, line: 3258, baseType: !869, size: 64, offset: 1664)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1111, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1111, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1111, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1111, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1111, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1111, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1111, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1111, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1111, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1111, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1111, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1111, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1111, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1111, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1111, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1111, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1111, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1111, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !871, file: !158, line: 3394, baseType: !1472, size: 1344)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1499, !1500, !1501, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1472, file: !158, line: 2280, baseType: !907, size: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1472, file: !158, line: 2281, baseType: !869, size: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1472, file: !158, line: 2282, baseType: !869, size: 64, offset: 256)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1472, file: !158, line: 2283, baseType: !869, size: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1472, file: !158, line: 2284, baseType: !869, size: 64, offset: 384)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1472, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1472, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1472, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1472, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1472, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1472, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1472, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1472, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1472, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1472, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1472, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1472, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
