; ModuleID = 'tree-switch-conversion.c'
source_filename = "tree-switch-conversion.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!721 = !DIEnumerator(name: "PARAM_SELSCHED_INSNS_TO_RENAME", value: 87, isUnsigned: true)
!722 = !DIEnumerator(name: "PARAM_SCHED_MEM_TRUE_DEP_COST", value: 88, isUnsigned: true)
!723 = !DIEnumerator(name: "PARAM_MAX_LAST_VALUE_RTL", value: 89, isUnsigned: true)
!724 = !DIEnumerator(name: "PARAM_INTEGER_SHARE_LIMIT", value: 90, isUnsigned: true)
!725 = !DIEnumerator(name: "PARAM_MIN_VIRTUAL_MAPPINGS", value: 91, isUnsigned: true)
!726 = !DIEnumerator(name: "PARAM_VIRTUAL_MAPPINGS_TO_SYMS_RATIO", value: 92, isUnsigned: true)
!727 = !DIEnumerator(name: "PARAM_SSP_BUFFER_SIZE", value: 93, isUnsigned: true)
!728 = !DIEnumerator(name: "PARAM_MAX_JUMP_THREAD_DUPLICATION_STMTS", value: 94, isUnsigned: true)
!729 = !DIEnumerator(name: "PARAM_MAX_FIELDS_FOR_FIELD_SENSITIVE", value: 95, isUnsigned: true)
!730 = !DIEnumerator(name: "PARAM_MAX_SCHED_READY_INSNS", value: 96, isUnsigned: true)
!731 = !DIEnumerator(name: "PARAM_PREFETCH_LATENCY", value: 97, isUnsigned: true)
!732 = !DIEnumerator(name: "PARAM_SIMULTANEOUS_PREFETCHES", value: 98, isUnsigned: true)
!733 = !DIEnumerator(name: "PARAM_L1_CACHE_SIZE", value: 99, isUnsigned: true)
!734 = !DIEnumerator(name: "PARAM_L1_CACHE_LINE_SIZE", value: 100, isUnsigned: true)
!735 = !DIEnumerator(name: "PARAM_L2_CACHE_SIZE", value: 101, isUnsigned: true)
!736 = !DIEnumerator(name: "PARAM_USE_CANONICAL_TYPES", value: 102, isUnsigned: true)
!737 = !DIEnumerator(name: "PARAM_MAX_PARTIAL_ANTIC_LENGTH", value: 103, isUnsigned: true)
!738 = !DIEnumerator(name: "PARAM_SCCVN_MAX_SCC_SIZE", value: 104, isUnsigned: true)
!739 = !DIEnumerator(name: "PARAM_IRA_MAX_LOOPS_NUM", value: 105, isUnsigned: true)
!740 = !DIEnumerator(name: "PARAM_IRA_MAX_CONFLICT_TABLE_SIZE", value: 106, isUnsigned: true)
!741 = !DIEnumerator(name: "PARAM_IRA_LOOP_RESERVED_REGS", value: 107, isUnsigned: true)
!742 = !DIEnumerator(name: "PARAM_SWITCH_CONVERSION_BRANCH_RATIO", value: 108, isUnsigned: true)
!743 = !DIEnumerator(name: "PARAM_LOOP_BLOCK_TILE_SIZE", value: 109, isUnsigned: true)
!744 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_NB_SCOP_PARAMS", value: 110, isUnsigned: true)
!745 = !DIEnumerator(name: "PARAM_GRAPHITE_MAX_BBS_PER_FUNCTION", value: 111, isUnsigned: true)
!746 = !DIEnumerator(name: "PARAM_LOOP_INVARIANT_MAX_BBS_IN_LOOP", value: 112, isUnsigned: true)
!747 = !DIEnumerator(name: "PARAM_SLP_MAX_INSNS_IN_BB", value: 113, isUnsigned: true)
!748 = !DIEnumerator(name: "PARAM_MIN_INSN_TO_PREFETCH_RATIO", value: 114, isUnsigned: true)
!749 = !DIEnumerator(name: "PARAM_PREFETCH_MIN_INSN_TO_MEM_RATIO", value: 115, isUnsigned: true)
!750 = !DIEnumerator(name: "PARAM_MAX_VARTRACK_SIZE", value: 116, isUnsigned: true)
!751 = !DIEnumerator(name: "PARAM_MIN_NONDEBUG_INSN_UID", value: 117, isUnsigned: true)
!752 = !DIEnumerator(name: "PARAM_IPA_SRA_PTR_GROWTH_FACTOR", value: 118, isUnsigned: true)
!753 = !DIEnumerator(name: "LAST_PARAM", value: 119, isUnsigned: true)
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gsi_iterator_update", file: !433, line: 4603, baseType: !7, size: 32, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIEnumerator(name: "GSI_NEW_STMT", value: 0, isUnsigned: true)
!757 = !DIEnumerator(name: "GSI_SAME_STMT", value: 1, isUnsigned: true)
!758 = !DIEnumerator(name: "GSI_CONTINUE_LINKING", value: 2, isUnsigned: true)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "operand_equal_flag", file: !206, line: 4853, baseType: !7, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIEnumerator(name: "OEP_ONLY_CONST", value: 1, isUnsigned: true)
!762 = !DIEnumerator(name: "OEP_PURE_SAME", value: 2, isUnsigned: true)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cdi_direction", file: !190, line: 912, baseType: !7, size: 32, elements: !764)
!764 = !{!765, !766}
!765 = !DIEnumerator(name: "CDI_DOMINATORS", value: 1, isUnsigned: true)
!766 = !DIEnumerator(name: "CDI_POST_DOMINATORS", value: 2, isUnsigned: true)
!767 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !190, line: 295, baseType: !7, size: 32, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!769 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!770 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!771 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!772 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!773 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!774 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!775 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!776 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!777 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!778 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!779 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!780 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!781 = !{!782, !1963, !854, !852, !1317, !1266, !907, !7, !934, !1965, !1546, !801}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !433, line: 737, size: 768, elements: !784)
!784 = !{!785, !1810, !1820, !1826, !1831, !1836, !1843, !1849, !1855, !1860, !1874, !1879, !1885, !1890, !1900, !1905, !1921, !1928, !1935, !1941, !1946, !1952, !1958}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !783, file: !433, line: 738, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !433, line: 271, size: 256, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !803, !804, !1809}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !786, file: !433, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !786, file: !433, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !786, file: !433, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !786, file: !433, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !786, file: !433, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !786, file: !433, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !786, file: !433, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !786, file: !433, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !786, file: !433, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !786, file: !433, line: 312, baseType: !7, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !786, file: !433, line: 316, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !800, line: 58, baseType: !801)
!800 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !802, line: 44, baseType: !7)
!802 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!803 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !786, file: !433, line: 319, baseType: !7, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !786, file: !433, line: 323, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !190, line: 217, size: 832, elements: !807)
!807 = !{!808, !1774, !1775, !1776, !1779, !1783, !1784, !1785, !1803, !1804, !1805, !1806, !1807, !1808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !806, file: !190, line: 219, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !190, line: 151, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !190, line: 151, size: 128, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !811, file: !190, line: 151, baseType: !814, size: 128)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !190, line: 150, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !190, line: 150, size: 128, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !815, file: !190, line: 150, baseType: !7, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !815, file: !190, line: 150, baseType: !7, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !815, file: !190, line: 150, baseType: !820, size: 64, offset: 64)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 64, elements: !938)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !822, line: 108, baseType: !823)
!822 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !190, line: 122, size: 512, elements: !825)
!825 = !{!826, !827, !828, !851, !853, !1768, !1769, !1770, !1771, !1772}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !824, file: !190, line: 124, baseType: !805, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !824, file: !190, line: 125, baseType: !805, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !824, file: !190, line: 131, baseType: !829, size: 64, offset: 128)
!829 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !190, line: 128, size: 64, elements: !830)
!830 = !{!831, !847}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !829, file: !190, line: 129, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !822, line: 66, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !433, line: 143, size: 192, elements: !835)
!835 = !{!836, !845, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !834, file: !433, line: 145, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !822, line: 69, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !433, line: 136, size: 192, elements: !840)
!840 = !{!841, !843, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !839, file: !433, line: 137, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !822, line: 58, baseType: !782)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !839, file: !433, line: 138, baseType: !838, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !839, file: !433, line: 139, baseType: !838, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !834, file: !433, line: 146, baseType: !837, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !834, file: !433, line: 152, baseType: !832, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !829, file: !190, line: 130, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !822, line: 50, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !822, line: 49, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !824, file: !190, line: 134, baseType: !852, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !824, file: !190, line: 137, baseType: !854, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !822, line: 56, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !206, line: 3371, size: 1792, elements: !857)
!857 = !{!858, !891, !897, !910, !917, !924, !929, !940, !946, !960, !968, !1006, !1011, !1039, !1056, !1057, !1062, !1071, !1077, !1082, !1086, !1090, !1417, !1466, !1472, !1478, !1485, !1498, !1512, !1529, !1541, !1563, !1578, !1750}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !856, file: !206, line: 3372, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !206, line: 360, size: 64, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !859, file: !206, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !859, file: !206, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !859, file: !206, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !859, file: !206, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !859, file: !206, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !859, file: !206, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !859, file: !206, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !859, file: !206, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !859, file: !206, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !859, file: !206, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !859, file: !206, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !859, file: !206, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !859, file: !206, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !859, file: !206, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !859, file: !206, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !859, file: !206, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !859, file: !206, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !859, file: !206, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !859, file: !206, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !859, file: !206, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !859, file: !206, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !859, file: !206, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !859, file: !206, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !859, file: !206, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !859, file: !206, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !859, file: !206, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !859, file: !206, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !859, file: !206, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !859, file: !206, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !859, file: !206, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !206, line: 3373, baseType: !892, size: 192)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !206, line: 402, size: 192, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !892, file: !206, line: 403, baseType: !859, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !892, file: !206, line: 404, baseType: !854, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !892, file: !206, line: 405, baseType: !854, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !856, file: !206, line: 3374, baseType: !898, size: 320)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !206, line: 1384, size: 320, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !206, line: 1385, baseType: !892, size: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !898, file: !206, line: 1386, baseType: !902, size: 128, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !903, line: 58, baseType: !904)
!903 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !903, line: 54, size: 128, elements: !905)
!905 = !{!906, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !904, file: !903, line: 56, baseType: !907, size: 64)
!907 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !904, file: !903, line: 57, baseType: !909, size: 64, offset: 64)
!909 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !856, file: !206, line: 3375, baseType: !911, size: 256)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !206, line: 1397, size: 256, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !206, line: 1398, baseType: !892, size: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !911, file: !206, line: 1399, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !206, line: 1392, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !856, file: !206, line: 3376, baseType: !918, size: 256)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !206, line: 1408, size: 256, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !206, line: 1409, baseType: !892, size: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !918, file: !206, line: 1410, baseType: !922, size: 64, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !206, line: 1403, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !856, file: !206, line: 3377, baseType: !925, size: 256)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !206, line: 1437, size: 256, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !206, line: 1438, baseType: !892, size: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !925, file: !206, line: 1439, baseType: !854, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !856, file: !206, line: 3378, baseType: !930, size: 256)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !206, line: 1418, size: 256, elements: !931)
!931 = !{!932, !933, !935}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !206, line: 1419, baseType: !892, size: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !930, file: !206, line: 1420, baseType: !934, size: 32, offset: 192)
!934 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !930, file: !206, line: 1421, baseType: !936, size: 8, offset: 224)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 8, elements: !938)
!937 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!938 = !{!939}
!939 = !DISubrange(count: 1)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !856, file: !206, line: 3379, baseType: !941, size: 320)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !206, line: 1428, size: 320, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !206, line: 1429, baseType: !892, size: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !941, file: !206, line: 1430, baseType: !854, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !941, file: !206, line: 1431, baseType: !854, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !856, file: !206, line: 3380, baseType: !947, size: 320)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !206, line: 1460, size: 320, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !206, line: 1461, baseType: !892, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !947, file: !206, line: 1462, baseType: !951, size: 128, offset: 192)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !952, line: 31, size: 128, elements: !953)
!952 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!953 = !{!954, !958, !959}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !951, file: !952, line: 32, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !951, file: !952, line: 33, baseType: !7, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !951, file: !952, line: 34, baseType: !7, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !856, file: !206, line: 3381, baseType: !961, size: 384)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !206, line: 2507, size: 384, elements: !962)
!962 = !{!963, !964, !965, !966, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !961, file: !206, line: 2508, baseType: !892, size: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !961, file: !206, line: 2509, baseType: !799, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !961, file: !206, line: 2510, baseType: !7, size: 32, offset: 224)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !961, file: !206, line: 2511, baseType: !854, size: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !961, file: !206, line: 2512, baseType: !854, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !856, file: !206, line: 3382, baseType: !969, size: 896)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !206, line: 2652, size: 896, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !206, line: 2653, baseType: !961, size: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !969, file: !206, line: 2654, baseType: !854, size: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !969, file: !206, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !969, file: !206, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !969, file: !206, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !969, file: !206, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !969, file: !206, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !969, file: !206, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !969, file: !206, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !969, file: !206, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !969, file: !206, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !969, file: !206, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !969, file: !206, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !969, file: !206, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !969, file: !206, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !969, file: !206, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !969, file: !206, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !969, file: !206, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !969, file: !206, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !969, file: !206, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !969, file: !206, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !969, file: !206, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !969, file: !206, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !969, file: !206, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !969, file: !206, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !969, file: !206, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !969, file: !206, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !969, file: !206, line: 2703, baseType: !7, size: 32, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !969, file: !206, line: 2705, baseType: !854, size: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !969, file: !206, line: 2706, baseType: !854, size: 64, offset: 640)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !969, file: !206, line: 2707, baseType: !854, size: 64, offset: 704)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !969, file: !206, line: 2708, baseType: !854, size: 64, offset: 768)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !969, file: !206, line: 2711, baseType: !1004, size: 64, offset: 832)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !206, line: 2711, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !856, file: !206, line: 3383, baseType: !1007, size: 960)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !206, line: 2756, size: 960, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !206, line: 2757, baseType: !969, size: 896)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1007, file: !206, line: 2758, baseType: !848, size: 64, offset: 896)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !856, file: !206, line: 3384, baseType: !1012, size: 1472)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !206, line: 3114, size: 1472, elements: !1013)
!1013 = !{!1014, !1035, !1036, !1037, !1038}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !206, line: 3115, baseType: !1015, size: 1216)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !206, line: 2984, size: 1216, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !206, line: 2985, baseType: !1007, size: 960)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1015, file: !206, line: 2986, baseType: !854, size: 64, offset: 960)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1015, file: !206, line: 2987, baseType: !854, size: 64, offset: 1024)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1015, file: !206, line: 2988, baseType: !854, size: 64, offset: 1088)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1015, file: !206, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1015, file: !206, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1015, file: !206, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1015, file: !206, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1015, file: !206, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1015, file: !206, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1015, file: !206, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1015, file: !206, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1015, file: !206, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1015, file: !206, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1015, file: !206, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1015, file: !206, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1015, file: !206, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1015, file: !206, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1012, file: !206, line: 3117, baseType: !854, size: 64, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1012, file: !206, line: 3119, baseType: !854, size: 64, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1012, file: !206, line: 3121, baseType: !854, size: 64, offset: 1344)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1012, file: !206, line: 3123, baseType: !854, size: 64, offset: 1408)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !856, file: !206, line: 3385, baseType: !1040, size: 1088)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !206, line: 2874, size: 1088, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1040, file: !206, line: 2875, baseType: !1007, size: 960)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1040, file: !206, line: 2876, baseType: !848, size: 64, offset: 960)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1040, file: !206, line: 2877, baseType: !1045, size: 64, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1047, line: 172, size: 128, elements: !1048)
!1047 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1046, file: !1047, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1046, file: !1047, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1046, file: !1047, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1046, file: !1047, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1046, file: !1047, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1046, file: !1047, line: 195, baseType: !7, size: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1046, file: !1047, line: 199, baseType: !854, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !856, file: !206, line: 3386, baseType: !1015, size: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !856, file: !206, line: 3387, baseType: !1058, size: 1280)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !206, line: 3093, size: 1280, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !206, line: 3094, baseType: !1015, size: 1216)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1058, file: !206, line: 3095, baseType: !1045, size: 64, offset: 1216)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !856, file: !206, line: 3388, baseType: !1063, size: 1216)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !206, line: 2824, size: 1216, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !206, line: 2825, baseType: !969, size: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1063, file: !206, line: 2827, baseType: !854, size: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1063, file: !206, line: 2828, baseType: !854, size: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1063, file: !206, line: 2829, baseType: !854, size: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1063, file: !206, line: 2830, baseType: !854, size: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1063, file: !206, line: 2831, baseType: !854, size: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !856, file: !206, line: 3389, baseType: !1072, size: 1024)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !206, line: 2850, size: 1024, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !206, line: 2851, baseType: !1007, size: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1072, file: !206, line: 2852, baseType: !934, size: 32, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1072, file: !206, line: 2853, baseType: !934, size: 32, offset: 992)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !856, file: !206, line: 3390, baseType: !1078, size: 1024)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !206, line: 2857, size: 1024, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !206, line: 2858, baseType: !1007, size: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1078, file: !206, line: 2859, baseType: !1045, size: 64, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !856, file: !206, line: 3391, baseType: !1083, size: 960)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !206, line: 2862, size: 960, elements: !1084)
!1084 = !{!1085}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !206, line: 2863, baseType: !1007, size: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !856, file: !206, line: 3392, baseType: !1087, size: 1472)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !206, line: 3304, size: 1472, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !206, line: 3305, baseType: !1012, size: 1472)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !856, file: !206, line: 3393, baseType: !1091, size: 1792)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !206, line: 3248, size: 1792, elements: !1092)
!1092 = !{!1093, !1094, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !206, line: 3249, baseType: !1012, size: 1472)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1091, file: !206, line: 3251, baseType: !1095, size: 64, offset: 1472)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1097, line: 463, size: 1152, elements: !1098)
!1097 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1098 = !{!1099, !1102, !1135, !1136, !1335, !1338, !1339, !1340, !1341, !1342, !1343, !1369, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1096, file: !1097, line: 464, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1097, line: 464, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1096, file: !1097, line: 467, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !190, line: 374, size: 640, elements: !1105)
!1105 = !{!1106, !1108, !1109, !1122, !1123, !1124, !1125, !1126, !1127, !1131, !1133, !1134}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1104, file: !190, line: 377, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !822, line: 111, baseType: !805)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1104, file: !190, line: 378, baseType: !1107, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1104, file: !190, line: 381, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !190, line: 282, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !190, line: 282, size: 128, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1112, file: !190, line: 282, baseType: !1115, size: 128)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !190, line: 281, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !190, line: 281, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1116, file: !190, line: 281, baseType: !7, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1116, file: !190, line: 281, baseType: !7, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1116, file: !190, line: 281, baseType: !1121, size: 64, offset: 64)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 64, elements: !938)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1104, file: !190, line: 384, baseType: !934, size: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1104, file: !190, line: 387, baseType: !934, size: 32, offset: 224)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1104, file: !190, line: 390, baseType: !934, size: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1104, file: !190, line: 394, baseType: !1110, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1104, file: !190, line: 396, baseType: !189, size: 32, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1104, file: !190, line: 399, baseType: !1128, size: 64, offset: 416)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 2)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1104, file: !190, line: 402, baseType: !1132, size: 64, offset: 480)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1129)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1104, file: !190, line: 406, baseType: !934, size: 32, offset: 544)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1104, file: !190, line: 409, baseType: !934, size: 32, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1096, file: !1097, line: 470, baseType: !833, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1096, file: !1097, line: 473, baseType: !1137, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1047, line: 39, size: 1152, elements: !1139)
!1139 = !{!1140, !1192, !1205, !1218, !1219, !1289, !1290, !1294, !1295, !1296, !1297, !1298}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1138, file: !1047, line: 41, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1142, line: 144, baseType: !1143)
!1142 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1142, line: 100, size: 896, elements: !1145)
!1145 = !{!1146, !1154, !1159, !1164, !1166, !1169, !1170, !1171, !1172, !1173, !1178, !1180, !1181, !1186, !1191}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1144, file: !1142, line: 102, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1142, line: 52, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1142, line: 47, baseType: !7)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1144, file: !1142, line: 105, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1142, line: 59, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!934, !1152, !1152}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1144, file: !1142, line: 108, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1142, line: 63, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !852}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1144, file: !1142, line: 111, baseType: !1165, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1142, line: 114, baseType: !1167, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1168, line: 46, baseType: !907)
!1168 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1144, file: !1142, line: 117, baseType: !1167, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1144, file: !1142, line: 120, baseType: !1167, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1144, file: !1142, line: 124, baseType: !7, size: 32, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1144, file: !1142, line: 128, baseType: !7, size: 32, offset: 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1144, file: !1142, line: 131, baseType: !1174, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1142, line: 75, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!852, !1167, !1167}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1144, file: !1142, line: 132, baseType: !1179, size: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1142, line: 78, baseType: !1161)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1144, file: !1142, line: 135, baseType: !852, size: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1144, file: !1142, line: 136, baseType: !1182, size: 64, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1142, line: 82, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!852, !852, !1167, !1167}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1144, file: !1142, line: 137, baseType: !1187, size: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1142, line: 83, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !852, !852}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1144, file: !1142, line: 141, baseType: !7, size: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1138, file: !1047, line: 48, baseType: !1193, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !433, line: 35, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !433, line: 35, size: 128, elements: !1196)
!1196 = !{!1197}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1195, file: !433, line: 35, baseType: !1198, size: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !433, line: 33, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !433, line: 33, size: 128, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1199, file: !433, line: 33, baseType: !7, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1199, file: !433, line: 33, baseType: !7, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1199, file: !433, line: 33, baseType: !1204, size: 64, offset: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 64, elements: !938)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1138, file: !1047, line: 51, baseType: !1206, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !206, line: 183, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !206, line: 183, size: 128, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1208, file: !206, line: 183, baseType: !1211, size: 128)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !206, line: 182, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !206, line: 182, size: 128, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1212, file: !206, line: 182, baseType: !7, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1212, file: !206, line: 182, baseType: !7, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1212, file: !206, line: 182, baseType: !1217, size: 64, offset: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 64, elements: !938)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1138, file: !1047, line: 54, baseType: !854, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1138, file: !1047, line: 57, baseType: !1220, size: 128, offset: 256)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1221, line: 31, size: 128, elements: !1222)
!1221 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1220, file: !1221, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1220, file: !1221, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1220, file: !1221, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1220, file: !1221, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1220, file: !1221, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1220, file: !1221, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1220, file: !1221, line: 56, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !822, line: 47, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1233, line: 75, size: 256, elements: !1234)
!1233 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1234 = !{!1235, !1247, !1248, !1249}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1232, file: !1233, line: 76, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1233, line: 68, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1233, line: 63, size: 320, elements: !1239)
!1239 = !{!1240, !1242, !1243, !1244}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1238, file: !1233, line: 64, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1238, file: !1233, line: 65, baseType: !1241, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1238, file: !1233, line: 66, baseType: !7, size: 32, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1238, file: !1233, line: 67, baseType: !1245, size: 128, offset: 192)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 128, elements: !1129)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1233, line: 29, baseType: !907)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1232, file: !1233, line: 77, baseType: !1236, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1232, file: !1233, line: 78, baseType: !7, size: 32, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1232, file: !1233, line: 79, baseType: !1250, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1233, line: 49, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1233, line: 45, size: 832, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1252, file: !1233, line: 46, baseType: !1241, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1252, file: !1233, line: 47, baseType: !1231, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1252, file: !1233, line: 48, baseType: !1257, size: 704, offset: 128)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1258, line: 164, size: 704, elements: !1259)
!1258 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1259 = !{!1260, !1261, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1285, !1286, !1287, !1288}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1257, file: !1258, line: 166, baseType: !909, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1257, file: !1258, line: 167, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1258, line: 157, size: 192, elements: !1264)
!1264 = !{!1265, !1267, !1268}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1263, file: !1258, line: 159, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1263, file: !1258, line: 160, baseType: !1262, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1263, file: !1258, line: 161, baseType: !1269, size: 32, offset: 128)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 32, elements: !1270)
!1270 = !{!1271}
!1271 = !DISubrange(count: 4)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1257, file: !1258, line: 168, baseType: !1266, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1257, file: !1258, line: 169, baseType: !1266, size: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1257, file: !1258, line: 170, baseType: !1266, size: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1257, file: !1258, line: 171, baseType: !909, size: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1257, file: !1258, line: 172, baseType: !934, size: 32, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1257, file: !1258, line: 176, baseType: !1278, size: 64, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!1262, !852, !909}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1257, file: !1258, line: 177, baseType: !1282, size: 64, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !852, !1262}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1257, file: !1258, line: 178, baseType: !852, size: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1257, file: !1258, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1257, file: !1258, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1257, file: !1258, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1138, file: !1047, line: 60, baseType: !1220, size: 128, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1138, file: !1047, line: 64, baseType: !1291, size: 64, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1293, line: 33, flags: DIFlagFwdDecl)
!1293 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1138, file: !1047, line: 67, baseType: !854, size: 64, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1138, file: !1047, line: 73, baseType: !1141, size: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1138, file: !1047, line: 77, baseType: !1230, size: 64, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1138, file: !1047, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1138, file: !1047, line: 82, baseType: !1299, size: 320, offset: 832)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1300, line: 62, size: 320, elements: !1301)
!1300 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1301 = !{!1302, !1308, !1309, !1310, !1311, !1318}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1299, file: !1300, line: 63, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1300, line: 56, size: 128, elements: !1305)
!1305 = !{!1306, !1307}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1304, file: !1300, line: 57, baseType: !1303, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1304, file: !1300, line: 58, baseType: !936, size: 8, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1299, file: !1300, line: 64, baseType: !7, size: 32, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1299, file: !1300, line: 66, baseType: !7, size: 32, offset: 96)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1299, file: !1300, line: 68, baseType: !957, size: 8, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1299, file: !1300, line: 70, baseType: !1312, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1300, line: 37, size: 128, elements: !1314)
!1314 = !{!1315, !1316}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1313, file: !1300, line: 39, baseType: !1312, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1313, file: !1300, line: 40, baseType: !1317, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1299, file: !1300, line: 71, baseType: !1319, size: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1300, line: 45, size: 320, elements: !1321)
!1321 = !{!1322, !1323}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1320, file: !1300, line: 47, baseType: !1319, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1320, file: !1300, line: 48, baseType: !1324, size: 256, offset: 64)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !206, line: 1883, size: 256, elements: !1325)
!1325 = !{!1326, !1328, !1329, !1334}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1324, file: !206, line: 1884, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1324, file: !206, line: 1885, baseType: !1327, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1324, file: !206, line: 1891, baseType: !1330, size: 64, offset: 128)
!1330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1324, file: !206, line: 1891, size: 64, elements: !1331)
!1331 = !{!1332, !1333}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1330, file: !206, line: 1891, baseType: !842, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1330, file: !206, line: 1891, baseType: !854, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1324, file: !206, line: 1892, baseType: !1317, size: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1096, file: !1097, line: 476, baseType: !1336, size: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1097, line: 476, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1096, file: !1097, line: 479, baseType: !1141, size: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1096, file: !1097, line: 484, baseType: !854, size: 64, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1096, file: !1097, line: 488, baseType: !854, size: 64, offset: 448)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1096, file: !1097, line: 493, baseType: !854, size: 64, offset: 512)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1096, file: !1097, line: 496, baseType: !854, size: 64, offset: 576)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1096, file: !1097, line: 501, baseType: !1344, size: 64, offset: 640)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !201, line: 2355, size: 576, elements: !1346)
!1346 = !{!1347, !1350, !1353, !1354, !1355, !1357, !1358, !1363, !1364, !1365, !1366, !1367, !1368}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1345, file: !201, line: 2356, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !201, line: 2356, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1345, file: !201, line: 2357, baseType: !1351, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1345, file: !201, line: 2358, baseType: !934, size: 32, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1345, file: !201, line: 2359, baseType: !934, size: 32, offset: 160)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1345, file: !201, line: 2360, baseType: !1356, size: 128, offset: 192)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 128, elements: !1270)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1345, file: !201, line: 2364, baseType: !934, size: 32, offset: 320)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1345, file: !201, line: 2367, baseType: !1359, size: 128, offset: 384)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !201, line: 2349, size: 128, elements: !1360)
!1360 = !{!1361, !1362}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1359, file: !201, line: 2351, baseType: !848, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1359, file: !201, line: 2352, baseType: !909, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1345, file: !201, line: 2371, baseType: !200, size: 32, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1345, file: !201, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1345, file: !201, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1345, file: !201, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1345, file: !201, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1345, file: !201, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1096, file: !1097, line: 504, baseType: !1370, size: 64, offset: 704)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1097, line: 504, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1096, file: !1097, line: 507, baseType: !1141, size: 64, offset: 768)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1096, file: !1097, line: 510, baseType: !934, size: 32, offset: 832)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1096, file: !1097, line: 513, baseType: !934, size: 32, offset: 864)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1096, file: !1097, line: 516, baseType: !799, size: 32, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1096, file: !1097, line: 519, baseType: !799, size: 32, offset: 928)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1096, file: !1097, line: 522, baseType: !7, size: 32, offset: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1096, file: !1097, line: 523, baseType: !7, size: 32, offset: 992)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1096, file: !1097, line: 528, baseType: !1351, size: 64, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1096, file: !1097, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1096, file: !1097, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1096, file: !1097, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1096, file: !1097, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1096, file: !1097, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1096, file: !1097, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1096, file: !1097, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1096, file: !1097, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1096, file: !1097, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1096, file: !1097, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1096, file: !1097, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1096, file: !1097, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1096, file: !1097, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1096, file: !1097, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1096, file: !1097, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1096, file: !1097, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1091, file: !206, line: 3254, baseType: !854, size: 64, offset: 1536)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1091, file: !206, line: 3257, baseType: !854, size: 64, offset: 1600)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1091, file: !206, line: 3258, baseType: !854, size: 64, offset: 1664)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1091, file: !206, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1091, file: !206, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1091, file: !206, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1091, file: !206, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1091, file: !206, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1091, file: !206, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1091, file: !206, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1091, file: !206, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1091, file: !206, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1091, file: !206, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1091, file: !206, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1091, file: !206, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1091, file: !206, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1091, file: !206, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1091, file: !206, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1091, file: !206, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1091, file: !206, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1091, file: !206, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !856, file: !206, line: 3394, baseType: !1418, size: 1344)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !206, line: 2279, size: 1344, elements: !1419)
!1419 = !{!1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1445, !1446, !1447, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1418, file: !206, line: 2280, baseType: !892, size: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1418, file: !206, line: 2281, baseType: !854, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1418, file: !206, line: 2282, baseType: !854, size: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1418, file: !206, line: 2283, baseType: !854, size: 64, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1418, file: !206, line: 2284, baseType: !854, size: 64, offset: 384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1418, file: !206, line: 2285, baseType: !7, size: 32, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1418, file: !206, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1418, file: !206, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1418, file: !206, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1418, file: !206, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1418, file: !206, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1418, file: !206, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1418, file: !206, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1418, file: !206, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1418, file: !206, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1418, file: !206, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1418, file: !206, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1418, file: !206, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1418, file: !206, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1418, file: !206, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1418, file: !206, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1418, file: !206, line: 2305, baseType: !7, size: 32, offset: 512)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1418, file: !206, line: 2306, baseType: !1443, size: 32, offset: 544)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1444, line: 31, baseType: !934)
!1444 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1418, file: !206, line: 2307, baseType: !854, size: 64, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1418, file: !206, line: 2308, baseType: !854, size: 64, offset: 640)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1418, file: !206, line: 2314, baseType: !1448, size: 64, offset: 704)
!1448 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !206, line: 2309, size: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1448, file: !206, line: 2310, baseType: !934, size: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1448, file: !206, line: 2311, baseType: !1351, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1448, file: !206, line: 2312, baseType: !1453, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !206, line: 2277, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1418, file: !206, line: 2315, baseType: !854, size: 64, offset: 768)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1418, file: !206, line: 2316, baseType: !854, size: 64, offset: 832)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1418, file: !206, line: 2317, baseType: !854, size: 64, offset: 896)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1418, file: !206, line: 2318, baseType: !854, size: 64, offset: 960)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1418, file: !206, line: 2319, baseType: !854, size: 64, offset: 1024)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1418, file: !206, line: 2320, baseType: !854, size: 64, offset: 1088)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1418, file: !206, line: 2321, baseType: !854, size: 64, offset: 1152)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1418, file: !206, line: 2322, baseType: !854, size: 64, offset: 1216)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1418, file: !206, line: 2324, baseType: !1464, size: 64, offset: 1280)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !206, line: 2324, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !856, file: !206, line: 3395, baseType: !1467, size: 320)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !206, line: 1469, size: 320, elements: !1468)
!1468 = !{!1469, !1470, !1471}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1467, file: !206, line: 1470, baseType: !892, size: 192)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1467, file: !206, line: 1471, baseType: !854, size: 64, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1467, file: !206, line: 1472, baseType: !854, size: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !856, file: !206, line: 3396, baseType: !1473, size: 320)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !206, line: 1482, size: 320, elements: !1474)
!1474 = !{!1475, !1476, !1477}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1473, file: !206, line: 1483, baseType: !892, size: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1473, file: !206, line: 1484, baseType: !934, size: 32, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1473, file: !206, line: 1485, baseType: !1217, size: 64, offset: 256)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !856, file: !206, line: 3397, baseType: !1479, size: 384)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !206, line: 1829, size: 384, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1484}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1479, file: !206, line: 1830, baseType: !892, size: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1479, file: !206, line: 1831, baseType: !799, size: 32, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1479, file: !206, line: 1832, baseType: !854, size: 64, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1479, file: !206, line: 1835, baseType: !1217, size: 64, offset: 320)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !856, file: !206, line: 3398, baseType: !1486, size: 704)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !206, line: 1898, size: 704, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1497}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1486, file: !206, line: 1899, baseType: !892, size: 192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1486, file: !206, line: 1902, baseType: !854, size: 64, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1486, file: !206, line: 1905, baseType: !842, size: 64, offset: 256)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1486, file: !206, line: 1908, baseType: !7, size: 32, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1486, file: !206, line: 1911, baseType: !1493, size: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !1047, line: 117, size: 128, elements: !1495)
!1495 = !{!1496}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1494, file: !1047, line: 120, baseType: !1220, size: 128)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1486, file: !206, line: 1914, baseType: !1324, size: 256, offset: 448)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !856, file: !206, line: 3399, baseType: !1499, size: 704)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !206, line: 2008, size: 704, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1499, file: !206, line: 2009, baseType: !892, size: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1499, file: !206, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1499, file: !206, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1499, file: !206, line: 2014, baseType: !799, size: 32, offset: 224)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1499, file: !206, line: 2016, baseType: !854, size: 64, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1499, file: !206, line: 2017, baseType: !1206, size: 64, offset: 320)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1499, file: !206, line: 2019, baseType: !854, size: 64, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1499, file: !206, line: 2020, baseType: !854, size: 64, offset: 448)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1499, file: !206, line: 2021, baseType: !854, size: 64, offset: 512)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1499, file: !206, line: 2022, baseType: !854, size: 64, offset: 576)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1499, file: !206, line: 2023, baseType: !854, size: 64, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !856, file: !206, line: 3400, baseType: !1513, size: 832)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !206, line: 2430, size: 832, elements: !1514)
!1514 = !{!1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
