; ModuleID = 'attribs.c'
source_filename = "attribs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }

!1359 = !DIEnumerator(name: "OPT_std_gnu90", value: 856, isUnsigned: true)
!1360 = !DIEnumerator(name: "OPT_std_gnu99", value: 857, isUnsigned: true)
!1361 = !DIEnumerator(name: "OPT_std_gnu9x", value: 858, isUnsigned: true)
!1362 = !DIEnumerator(name: "OPT_std_iso9899_1990", value: 859, isUnsigned: true)
!1363 = !DIEnumerator(name: "OPT_std_iso9899_199409", value: 860, isUnsigned: true)
!1364 = !DIEnumerator(name: "OPT_std_iso9899_1999", value: 861, isUnsigned: true)
!1365 = !DIEnumerator(name: "OPT_std_iso9899_199x", value: 862, isUnsigned: true)
!1366 = !DIEnumerator(name: "OPT_std_legacy", value: 863, isUnsigned: true)
!1367 = !DIEnumerator(name: "OPT_traditional_cpp", value: 864, isUnsigned: true)
!1368 = !DIEnumerator(name: "OPT_trigraphs", value: 865, isUnsigned: true)
!1369 = !DIEnumerator(name: "OPT_undef", value: 866, isUnsigned: true)
!1370 = !DIEnumerator(name: "OPT_v", value: 867, isUnsigned: true)
!1371 = !DIEnumerator(name: "OPT_version", value: 868, isUnsigned: true)
!1372 = !DIEnumerator(name: "OPT_w", value: 869, isUnsigned: true)
!1373 = !DIEnumerator(name: "N_OPTS", value: 870, isUnsigned: true)
!1374 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !135, line: 58, baseType: !7, size: 32, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1376 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!1377 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!1378 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!1379 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!1380 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!1381 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!1382 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!1383 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!1384 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!1385 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!1386 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!1387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "attribute_flags", file: !135, line: 4092, baseType: !7, size: 32, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393}
!1389 = !DIEnumerator(name: "ATTR_FLAG_DECL_NEXT", value: 1, isUnsigned: true)
!1390 = !DIEnumerator(name: "ATTR_FLAG_FUNCTION_NEXT", value: 2, isUnsigned: true)
!1391 = !DIEnumerator(name: "ATTR_FLAG_ARRAY_NEXT", value: 4, isUnsigned: true)
!1392 = !DIEnumerator(name: "ATTR_FLAG_TYPE_IN_PLACE", value: 8, isUnsigned: true)
!1393 = !DIEnumerator(name: "ATTR_FLAG_BUILT_IN", value: 16, isUnsigned: true)
!1394 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plugin_event", file: !1395, line: 33, baseType: !7, size: 32, elements: !1396)
!1395 = !DIFile(filename: "./gcc-plugin.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1396 = !{!1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!1397 = !DIEnumerator(name: "PLUGIN_PASS_MANAGER_SETUP", value: 0, isUnsigned: true)
!1398 = !DIEnumerator(name: "PLUGIN_FINISH_TYPE", value: 1, isUnsigned: true)
!1399 = !DIEnumerator(name: "PLUGIN_FINISH_UNIT", value: 2, isUnsigned: true)
!1400 = !DIEnumerator(name: "PLUGIN_PRE_GENERICIZE", value: 3, isUnsigned: true)
!1401 = !DIEnumerator(name: "PLUGIN_FINISH", value: 4, isUnsigned: true)
!1402 = !DIEnumerator(name: "PLUGIN_INFO", value: 5, isUnsigned: true)
!1403 = !DIEnumerator(name: "PLUGIN_GGC_START", value: 6, isUnsigned: true)
!1404 = !DIEnumerator(name: "PLUGIN_GGC_MARKING", value: 7, isUnsigned: true)
!1405 = !DIEnumerator(name: "PLUGIN_GGC_END", value: 8, isUnsigned: true)
!1406 = !DIEnumerator(name: "PLUGIN_REGISTER_GGC_ROOTS", value: 9, isUnsigned: true)
!1407 = !DIEnumerator(name: "PLUGIN_REGISTER_GGC_CACHES", value: 10, isUnsigned: true)
!1408 = !DIEnumerator(name: "PLUGIN_ATTRIBUTES", value: 11, isUnsigned: true)
!1409 = !DIEnumerator(name: "PLUGIN_START_UNIT", value: 12, isUnsigned: true)
!1410 = !DIEnumerator(name: "PLUGIN_PRAGMAS", value: 13, isUnsigned: true)
!1411 = !DIEnumerator(name: "PLUGIN_ALL_PASSES_START", value: 14, isUnsigned: true)
!1412 = !DIEnumerator(name: "PLUGIN_ALL_PASSES_END", value: 15, isUnsigned: true)
!1413 = !DIEnumerator(name: "PLUGIN_ALL_IPA_PASSES_START", value: 16, isUnsigned: true)
!1414 = !DIEnumerator(name: "PLUGIN_ALL_IPA_PASSES_END", value: 17, isUnsigned: true)
!1415 = !DIEnumerator(name: "PLUGIN_OVERRIDE_GATE", value: 18, isUnsigned: true)
!1416 = !DIEnumerator(name: "PLUGIN_PASS_EXECUTION", value: 19, isUnsigned: true)
!1417 = !DIEnumerator(name: "PLUGIN_EARLY_GIMPLE_PASSES_START", value: 20, isUnsigned: true)
!1418 = !DIEnumerator(name: "PLUGIN_EARLY_GIMPLE_PASSES_END", value: 21, isUnsigned: true)
!1419 = !DIEnumerator(name: "PLUGIN_NEW_PASS", value: 22, isUnsigned: true)
!1420 = !DIEnumerator(name: "PLUGIN_EVENT_FIRST_DYNAMIC", value: 23, isUnsigned: true)
!1421 = !{!1422, !1423, !2243, !1428, !1445, !167, !1433, !2245}
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_spec", file: !135, line: 4046, size: 256, elements: !1425)
!1425 = !{!1426, !1431, !1434, !1435, !1438, !1439, !1440}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1424, file: !135, line: 4050, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !1424, file: !135, line: 4052, baseType: !1432, size: 32, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !1424, file: !135, line: 4055, baseType: !1432, size: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "decl_required", scope: !1424, file: !135, line: 4063, baseType: !1436, size: 8, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1437)
!1437 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "type_required", scope: !1424, file: !135, line: 4066, baseType: !1436, size: 8, offset: 136)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "function_type_required", scope: !1424, file: !135, line: 4071, baseType: !1436, size: 8, offset: 144)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1424, file: !135, line: 4086, baseType: !1441, size: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1442)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!1445, !1958, !1445, !1445, !1433, !2242}
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1446, line: 56, baseType: !1447)
!1446 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1449)
!1449 = !{!1450, !1483, !1489, !1502, !1521, !1532, !1537, !1546, !1552, !1564, !1576, !1614, !1767, !1795, !1803, !1804, !1809, !1818, !1824, !1829, !1833, !1837, !1866, !1913, !1919, !1926, !1933, !1959, !1984, !2001, !2013, !2035, !2053, !2224}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1448, file: !135, line: 3372, baseType: !1451, size: 64)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1451, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1451, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1451, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1451, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1451, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1451, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1451, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1451, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1451, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1451, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1451, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1451, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1451, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1451, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1451, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1451, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1451, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1451, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1451, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1451, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1451, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1451, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1451, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1451, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1451, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1451, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1451, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1451, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1451, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1451, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !135, line: 3373, baseType: !1484, size: 192)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1485)
!1485 = !{!1486, !1487, !1488}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1484, file: !135, line: 403, baseType: !1451, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1484, file: !135, line: 404, baseType: !1445, size: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1484, file: !135, line: 405, baseType: !1445, size: 64, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1448, file: !135, line: 3374, baseType: !1490, size: 320)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1491)
!1491 = !{!1492, !1493}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1490, file: !135, line: 1385, baseType: !1484, size: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1490, file: !135, line: 1386, baseType: !1494, size: 128, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1495, line: 58, baseType: !1496)
!1495 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1495, line: 54, size: 128, elements: !1497)
!1497 = !{!1498, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1496, file: !1495, line: 56, baseType: !1499, size: 64)
!1499 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1496, file: !1495, line: 57, baseType: !1501, size: 64, offset: 64)
!1501 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1448, file: !135, line: 3375, baseType: !1503, size: 256)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1504)
!1504 = !{!1505, !1506}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1503, file: !135, line: 1398, baseType: !1484, size: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1503, file: !135, line: 1399, baseType: !1507, size: 64, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1509, line: 52, size: 256, elements: !1510)
!1509 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1510 = !{!1511, !1512, !1513, !1514, !1515, !1516, !1517}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1508, file: !1509, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1508, file: !1509, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1508, file: !1509, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1508, file: !1509, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1508, file: !1509, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1508, file: !1509, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1508, file: !1509, line: 62, baseType: !1518, size: 192, offset: 64)
!1518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1499, size: 192, elements: !1519)
!1519 = !{!1520}
!1520 = !DISubrange(count: 3)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1448, file: !135, line: 3376, baseType: !1522, size: 256)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1523)
!1523 = !{!1524, !1525}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1522, file: !135, line: 1409, baseType: !1484, size: 192)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1522, file: !135, line: 1410, baseType: !1526, size: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1528, line: 27, size: 192, elements: !1529)
!1528 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1529 = !{!1530, !1531}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1527, file: !1528, line: 29, baseType: !1494, size: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1527, file: !1528, line: 30, baseType: !5, size: 32, offset: 128)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1448, file: !135, line: 3377, baseType: !1533, size: 256)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1534)
!1534 = !{!1535, !1536}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1533, file: !135, line: 1438, baseType: !1484, size: 192)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1533, file: !135, line: 1439, baseType: !1445, size: 64, offset: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1448, file: !135, line: 3378, baseType: !1538, size: 256)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1539)
!1539 = !{!1540, !1541, !1542}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1538, file: !135, line: 1419, baseType: !1484, size: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1538, file: !135, line: 1420, baseType: !1433, size: 32, offset: 192)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1538, file: !135, line: 1421, baseType: !1543, size: 8, offset: 224)
!1543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 8, elements: !1544)
!1544 = !{!1545}
!1545 = !DISubrange(count: 1)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1448, file: !135, line: 3379, baseType: !1547, size: 320)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1548)
!1548 = !{!1549, !1550, !1551}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1547, file: !135, line: 1429, baseType: !1484, size: 192)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1547, file: !135, line: 1430, baseType: !1445, size: 64, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1547, file: !135, line: 1431, baseType: !1445, size: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1448, file: !135, line: 3380, baseType: !1553, size: 320)
!1553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1554)
!1554 = !{!1555, !1556}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1553, file: !135, line: 1461, baseType: !1484, size: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1553, file: !135, line: 1462, baseType: !1557, size: 128, offset: 192)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1558, line: 31, size: 128, elements: !1559)
!1558 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1559 = !{!1560, !1562, !1563}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1557, file: !1558, line: 32, baseType: !1561, size: 64)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1557, file: !1558, line: 33, baseType: !7, size: 32, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1557, file: !1558, line: 34, baseType: !7, size: 32, offset: 96)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1448, file: !135, line: 3381, baseType: !1565, size: 384)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1566)
!1566 = !{!1567, !1568, !1573, !1574, !1575}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1565, file: !135, line: 2508, baseType: !1484, size: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1565, file: !135, line: 2509, baseType: !1569, size: 32, offset: 192)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1570, line: 58, baseType: !1571)
!1570 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1572, line: 44, baseType: !7)
!1572 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1565, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1565, file: !135, line: 2511, baseType: !1445, size: 64, offset: 256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1565, file: !135, line: 2512, baseType: !1445, size: 64, offset: 320)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1448, file: !135, line: 3382, baseType: !1577, size: 896)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1578)
!1578 = !{!1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1577, file: !135, line: 2653, baseType: !1565, size: 384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1577, file: !135, line: 2654, baseType: !1445, size: 64, offset: 384)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1577, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1577, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1577, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1577, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1577, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1577, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1577, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1577, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1577, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1577, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1577, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1577, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1577, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1577, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1577, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1577, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1577, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1577, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1577, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1577, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1577, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1577, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1577, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1577, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1577, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1577, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1577, file: !135, line: 2705, baseType: !1445, size: 64, offset: 576)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1577, file: !135, line: 2706, baseType: !1445, size: 64, offset: 640)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1577, file: !135, line: 2707, baseType: !1445, size: 64, offset: 704)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1577, file: !135, line: 2708, baseType: !1445, size: 64, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1577, file: !135, line: 2711, baseType: !1612, size: 64, offset: 832)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64)
!1613 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1448, file: !135, line: 3383, baseType: !1615, size: 960)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1616)
!1616 = !{!1617, !1618}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1615, file: !135, line: 2757, baseType: !1577, size: 896)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1615, file: !135, line: 2758, baseType: !1619, size: 64, offset: 896)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1446, line: 50, baseType: !1620)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1622, line: 240, size: 384, elements: !1623)
!1622 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1621, file: !1622, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1621, file: !1622, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1621, file: !1622, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1621, file: !1622, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1621, file: !1622, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1621, file: !1622, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1621, file: !1622, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1621, file: !1622, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1621, file: !1622, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1621, file: !1622, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1621, file: !1622, line: 321, baseType: !1635, size: 320, offset: 64)
!1635 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1622, line: 315, size: 320, elements: !1636)
!1636 = !{!1637, !1700, !1702, !1765, !1766}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1635, file: !1622, line: 316, baseType: !1638, size: 64)
!1638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1639, size: 64, elements: !1544)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1622, line: 183, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1622, line: 166, size: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1654, !1655, !1667, !1670, !1673, !1674, !1677, !1690, !1697}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1640, file: !1622, line: 168, baseType: !1433, size: 32)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1640, file: !1622, line: 169, baseType: !7, size: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1640, file: !1622, line: 170, baseType: !1428, size: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1640, file: !1622, line: 171, baseType: !1619, size: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1640, file: !1622, line: 172, baseType: !1647, size: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1446, line: 53, baseType: !1648)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1622, line: 359, size: 128, elements: !1650)
!1650 = !{!1651, !1652}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1649, file: !1622, line: 360, baseType: !1433, size: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1649, file: !1622, line: 361, baseType: !1653, size: 64, offset: 64)
!1653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1619, size: 64, elements: !1544)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1640, file: !1622, line: 173, baseType: !5, size: 32)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1640, file: !1622, line: 174, baseType: !1656, size: 32)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1622, line: 133, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1622, line: 115, size: 32, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1657, file: !1622, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1657, file: !1622, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1657, file: !1622, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1657, file: !1622, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1657, file: !1622, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1657, file: !1622, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1657, file: !1622, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1657, file: !1622, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1640, file: !1622, line: 175, baseType: !1668, size: 64)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64)
!1669 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1622, line: 175, flags: DIFlagFwdDecl)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1640, file: !1622, line: 176, baseType: !1671, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1446, line: 46, flags: DIFlagFwdDecl)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1640, file: !1622, line: 177, baseType: !1445, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1640, file: !1622, line: 178, baseType: !1675, size: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64)
!1676 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !1446, line: 110, flags: DIFlagFwdDecl)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1640, file: !1622, line: 179, baseType: !1678, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1622, line: 150, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1622, line: 142, size: 320, elements: !1681)
!1681 = !{!1682, !1683, !1684, !1685, !1688, !1689}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1680, file: !1622, line: 144, baseType: !1445, size: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1680, file: !1622, line: 145, baseType: !1619, size: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1680, file: !1622, line: 146, baseType: !1619, size: 64, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1680, file: !1622, line: 147, baseType: !1686, size: 32, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1687, line: 31, baseType: !1433)
!1687 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1680, file: !1622, line: 148, baseType: !7, size: 32, offset: 224)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1680, file: !1622, line: 149, baseType: !1437, size: 8, offset: 256)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1640, file: !1622, line: 180, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1622, line: 162, baseType: !1693)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1622, line: 159, size: 128, elements: !1694)
!1694 = !{!1695, !1696}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1693, file: !1622, line: 160, baseType: !1445, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1693, file: !1622, line: 161, baseType: !1501, size: 64, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1640, file: !1622, line: 181, baseType: !1698, size: 64)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1622, line: 181, flags: DIFlagFwdDecl)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1635, file: !1622, line: 317, baseType: !1701, size: 64)
!1701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1501, size: 64, elements: !1544)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1635, file: !1622, line: 318, baseType: !1703, size: 320)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1622, line: 188, size: 320, elements: !1704)
!1704 = !{!1705, !1707, !1764}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1703, file: !1622, line: 190, baseType: !1706, size: 192)
!1706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1639, size: 192, elements: !1519)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1703, file: !1622, line: 193, baseType: !1708, size: 64, offset: 192)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1622, line: 206, size: 320, elements: !1710)
!1710 = !{!1711, !1749, !1750, !1751, !1763}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1709, file: !1622, line: 208, baseType: !1712, size: 64)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1446, line: 62, baseType: !1714)
!1714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1715, line: 538, size: 256, elements: !1716)
!1715 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1716 = !{!1717, !1721, !1727, !1740}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1714, file: !1715, line: 539, baseType: !1718, size: 32)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1715, line: 482, size: 32, elements: !1719)
!1719 = !{!1720}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1718, file: !1715, line: 484, baseType: !7, size: 32)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1714, file: !1715, line: 540, baseType: !1722, size: 192)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1715, line: 488, size: 192, elements: !1723)
!1723 = !{!1724, !1725, !1726}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1722, file: !1715, line: 489, baseType: !1718, size: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1722, file: !1715, line: 492, baseType: !1428, size: 64, offset: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1722, file: !1715, line: 496, baseType: !1445, size: 64, offset: 128)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1714, file: !1715, line: 541, baseType: !1728, size: 256)
!1728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1715, line: 504, size: 256, elements: !1729)
!1729 = !{!1730, !1731, !1738, !1739}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1728, file: !1715, line: 505, baseType: !1718, size: 32)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1728, file: !1715, line: 509, baseType: !1732, size: 64, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1715, line: 501, baseType: !1733)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64)
!1734 = !DISubroutineType(types: !1735)
!1735 = !{null, !1736}
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1728, file: !1715, line: 510, baseType: !1736, size: 64, offset: 128)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1728, file: !1715, line: 513, baseType: !1712, size: 64, offset: 192)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1714, file: !1715, line: 542, baseType: !1741, size: 128)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1715, line: 530, size: 128, elements: !1742)
!1742 = !{!1743, !1744}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1741, file: !1715, line: 531, baseType: !1718, size: 32)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1741, file: !1715, line: 534, baseType: !1745, size: 64, offset: 64)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1715, line: 525, baseType: !1746)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64)
!1747 = !DISubroutineType(types: !1748)
!1748 = !{!1437, !1445, !1428, !1499, !1499}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1709, file: !1622, line: 211, baseType: !7, size: 32, offset: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1709, file: !1622, line: 214, baseType: !1501, size: 64, offset: 128)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1709, file: !1622, line: 224, baseType: !1752, size: 64, offset: 192)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64)
!1753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1622, line: 202, baseType: !1754)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1622, line: 202, size: 128, elements: !1755)
!1755 = !{!1756}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1754, file: !1622, line: 202, baseType: !1757, size: 128)
!1757 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1622, line: 200, baseType: !1758)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1622, line: 200, size: 128, elements: !1759)
!1759 = !{!1760, !1761, !1762}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1758, file: !1622, line: 200, baseType: !7, size: 32)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1758, file: !1622, line: 200, baseType: !7, size: 32, offset: 32)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1758, file: !1622, line: 200, baseType: !1653, size: 64, offset: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1709, file: !1622, line: 234, baseType: !1752, size: 64, offset: 256)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1703, file: !1622, line: 197, baseType: !1501, size: 64, offset: 256)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1635, file: !1622, line: 319, baseType: !1508, size: 256)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1635, file: !1622, line: 320, baseType: !1527, size: 192)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1448, file: !135, line: 3384, baseType: !1768, size: 1472)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1769)
!1769 = !{!1770, !1791, !1792, !1793, !1794}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1768, file: !135, line: 3115, baseType: !1771, size: 1216)
!1771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1772)
!1772 = !{!1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790}
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1771, file: !135, line: 2985, baseType: !1615, size: 960)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1771, file: !135, line: 2986, baseType: !1445, size: 64, offset: 960)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1771, file: !135, line: 2987, baseType: !1445, size: 64, offset: 1024)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1771, file: !135, line: 2988, baseType: !1445, size: 64, offset: 1088)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1771, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1771, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1771, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1771, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1771, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1771, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1771, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1771, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1771, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1771, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1771, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1771, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1771, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1771, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1768, file: !135, line: 3117, baseType: !1445, size: 64, offset: 1216)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1768, file: !135, line: 3119, baseType: !1445, size: 64, offset: 1280)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1768, file: !135, line: 3121, baseType: !1445, size: 64, offset: 1344)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1768, file: !135, line: 3123, baseType: !1445, size: 64, offset: 1408)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1448, file: !135, line: 3385, baseType: !1796, size: 1088)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1797)
!1797 = !{!1798, !1799, !1800}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1796, file: !135, line: 2875, baseType: !1615, size: 960)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1796, file: !135, line: 2876, baseType: !1619, size: 64, offset: 960)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1796, file: !135, line: 2877, baseType: !1801, size: 64, offset: 1024)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64)
!1802 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1448, file: !135, line: 3386, baseType: !1771, size: 1216)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1448, file: !135, line: 3387, baseType: !1805, size: 1280)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1806)
!1806 = !{!1807, !1808}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1805, file: !135, line: 3094, baseType: !1771, size: 1216)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1805, file: !135, line: 3095, baseType: !1801, size: 64, offset: 1216)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1448, file: !135, line: 3388, baseType: !1810, size: 1216)
!1810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1811)
!1811 = !{!1812, !1813, !1814, !1815, !1816, !1817}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1810, file: !135, line: 2825, baseType: !1577, size: 896)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1810, file: !135, line: 2827, baseType: !1445, size: 64, offset: 896)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1810, file: !135, line: 2828, baseType: !1445, size: 64, offset: 960)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1810, file: !135, line: 2829, baseType: !1445, size: 64, offset: 1024)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1810, file: !135, line: 2830, baseType: !1445, size: 64, offset: 1088)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1810, file: !135, line: 2831, baseType: !1445, size: 64, offset: 1152)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1448, file: !135, line: 3389, baseType: !1819, size: 1024)
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1820)
!1820 = !{!1821, !1822, !1823}
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1819, file: !135, line: 2851, baseType: !1615, size: 960)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1819, file: !135, line: 2852, baseType: !1433, size: 32, offset: 960)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1819, file: !135, line: 2853, baseType: !1433, size: 32, offset: 992)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1448, file: !135, line: 3390, baseType: !1825, size: 1024)
!1825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1826)
!1826 = !{!1827, !1828}
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1825, file: !135, line: 2858, baseType: !1615, size: 960)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1825, file: !135, line: 2859, baseType: !1801, size: 64, offset: 960)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1448, file: !135, line: 3391, baseType: !1830, size: 960)
!1830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1831)
!1831 = !{!1832}
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1830, file: !135, line: 2863, baseType: !1615, size: 960)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1448, file: !135, line: 3392, baseType: !1834, size: 1472)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1835)
!1835 = !{!1836}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1834, file: !135, line: 3305, baseType: !1768, size: 1472)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1448, file: !135, line: 3393, baseType: !1838, size: 1792)
!1838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1839)
!1839 = !{!1840, !1841, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865}
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1838, file: !135, line: 3249, baseType: !1768, size: 1472)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1838, file: !135, line: 3251, baseType: !1842, size: 64, offset: 1472)
!1842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1843, size: 64)
!1843 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1844, line: 41, flags: DIFlagFwdDecl)
!1844 = !DIFile(filename: "./statistics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1838, file: !135, line: 3254, baseType: !1445, size: 64, offset: 1536)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1838, file: !135, line: 3257, baseType: !1445, size: 64, offset: 1600)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1838, file: !135, line: 3258, baseType: !1445, size: 64, offset: 1664)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1838, file: !135, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1838, file: !135, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1838, file: !135, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1838, file: !135, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1838, file: !135, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1838, file: !135, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1838, file: !135, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1838, file: !135, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1838, file: !135, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1838, file: !135, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1838, file: !135, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1838, file: !135, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1838, file: !135, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1838, file: !135, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1838, file: !135, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1838, file: !135, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1838, file: !135, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1838, file: !135, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !135, line: 3394, baseType: !1867, size: 1344)
!1867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !135, line: 2279, size: 1344, elements: !1868)
!1868 = !{!1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910}
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1867, file: !135, line: 2280, baseType: !1484, size: 192)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1867, file: !135, line: 2281, baseType: !1445, size: 64, offset: 192)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1867, file: !135, line: 2282, baseType: !1445, size: 64, offset: 256)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1867, file: !135, line: 2283, baseType: !1445, size: 64, offset: 320)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1867, file: !135, line: 2284, baseType: !1445, size: 64, offset: 384)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1867, file: !135, line: 2285, baseType: !7, size: 32, offset: 448)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1867, file: !135, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1867, file: !135, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1867, file: !135, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1867, file: !135, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1867, file: !135, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1867, file: !135, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1867, file: !135, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1867, file: !135, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1867, file: !135, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1867, file: !135, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1867, file: !135, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1867, file: !135, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1867, file: !135, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1867, file: !135, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1867, file: !135, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1867, file: !135, line: 2305, baseType: !7, size: 32, offset: 512)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1867, file: !135, line: 2306, baseType: !1686, size: 32, offset: 544)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1867, file: !135, line: 2307, baseType: !1445, size: 64, offset: 576)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1867, file: !135, line: 2308, baseType: !1445, size: 64, offset: 640)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1867, file: !135, line: 2314, baseType: !1895, size: 64, offset: 704)
!1895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !135, line: 2309, size: 64, elements: !1896)
!1896 = !{!1897, !1898, !1899}
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1895, file: !135, line: 2310, baseType: !1433, size: 32)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1895, file: !135, line: 2311, baseType: !1428, size: 64)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1895, file: !135, line: 2312, baseType: !1900, size: 64)
!1900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1901, size: 64)
!1901 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !135, line: 2277, flags: DIFlagFwdDecl)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1867, file: !135, line: 2315, baseType: !1445, size: 64, offset: 768)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1867, file: !135, line: 2316, baseType: !1445, size: 64, offset: 832)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1867, file: !135, line: 2317, baseType: !1445, size: 64, offset: 896)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1867, file: !135, line: 2318, baseType: !1445, size: 64, offset: 960)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1867, file: !135, line: 2319, baseType: !1445, size: 64, offset: 1024)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1867, file: !135, line: 2320, baseType: !1445, size: 64, offset: 1088)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1867, file: !135, line: 2321, baseType: !1445, size: 64, offset: 1152)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1867, file: !135, line: 2322, baseType: !1445, size: 64, offset: 1216)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1867, file: !135, line: 2324, baseType: !1911, size: 64, offset: 1280)
!1911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1912, size: 64)
!1912 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !135, line: 2324, flags: DIFlagFwdDecl)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1448, file: !135, line: 3395, baseType: !1914, size: 320)
!1914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !135, line: 1469, size: 320, elements: !1915)
!1915 = !{!1916, !1917, !1918}
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1914, file: !135, line: 1470, baseType: !1484, size: 192)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1914, file: !135, line: 1471, baseType: !1445, size: 64, offset: 192)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1914, file: !135, line: 1472, baseType: !1445, size: 64, offset: 256)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1448, file: !135, line: 3396, baseType: !1920, size: 320)
!1920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !135, line: 1482, size: 320, elements: !1921)
!1921 = !{!1922, !1923, !1924}
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1920, file: !135, line: 1483, baseType: !1484, size: 192)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1920, file: !135, line: 1484, baseType: !1433, size: 32, offset: 192)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1920, file: !135, line: 1485, baseType: !1925, size: 64, offset: 256)
!1925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1445, size: 64, elements: !1544)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1448, file: !135, line: 3397, baseType: !1927, size: 384)
!1927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !135, line: 1829, size: 384, elements: !1928)
!1928 = !{!1929, !1930, !1931, !1932}
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1927, file: !135, line: 1830, baseType: !1484, size: 192)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1927, file: !135, line: 1831, baseType: !1569, size: 32, offset: 192)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1927, file: !135, line: 1832, baseType: !1445, size: 64, offset: 256)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1927, file: !135, line: 1835, baseType: !1925, size: 64, offset: 320)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1448, file: !135, line: 3398, baseType: !1934, size: 704)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !135, line: 1898, size: 704, elements: !1935)
!1935 = !{!1936, !1937, !1938, !1942, !1943, !1946}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1934, file: !135, line: 1899, baseType: !1484, size: 192)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1934, file: !135, line: 1902, baseType: !1445, size: 64, offset: 192)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1934, file: !135, line: 1905, baseType: !1939, size: 64, offset: 256)
!1939 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1446, line: 58, baseType: !1940)
!1940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1941, size: 64)
!1941 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1446, line: 57, flags: DIFlagFwdDecl)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1934, file: !135, line: 1908, baseType: !7, size: 32, offset: 320)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1934, file: !135, line: 1911, baseType: !1944, size: 64, offset: 384)
!1944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1945, size: 64)
!1945 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !135, line: 1876, flags: DIFlagFwdDecl)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1934, file: !135, line: 1914, baseType: !1947, size: 256, offset: 448)
!1947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1948)
!1948 = !{!1949, !1951, !1952, !1957}
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1947, file: !135, line: 1884, baseType: !1950, size: 64)
!1950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1947, size: 64)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1947, file: !135, line: 1885, baseType: !1950, size: 64, offset: 64)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1947, file: !135, line: 1891, baseType: !1953, size: 64, offset: 128)
!1953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1947, file: !135, line: 1891, size: 64, elements: !1954)
!1954 = !{!1955, !1956}
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1953, file: !135, line: 1891, baseType: !1939, size: 64)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1953, file: !135, line: 1891, baseType: !1445, size: 64)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1947, file: !135, line: 1892, baseType: !1958, size: 64, offset: 192)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1448, file: !135, line: 3399, baseType: !1960, size: 704)
!1960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !135, line: 2008, size: 704, elements: !1961)
!1961 = !{!1962, !1963, !1964, !1965, !1966, !1967, !1979, !1980, !1981, !1982, !1983}
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1960, file: !135, line: 2009, baseType: !1484, size: 192)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1960, file: !135, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1960, file: !135, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1960, file: !135, line: 2014, baseType: !1569, size: 32, offset: 224)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1960, file: !135, line: 2016, baseType: !1445, size: 64, offset: 256)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1960, file: !135, line: 2017, baseType: !1968, size: 64, offset: 320)
!1968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1969, size: 64)
!1969 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1970)
!1970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1971)
!1971 = !{!1972}
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1970, file: !135, line: 183, baseType: !1973, size: 128)
!1973 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1974)
!1974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1975)
!1975 = !{!1976, !1977, !1978}
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1974, file: !135, line: 182, baseType: !7, size: 32)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1974, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1974, file: !135, line: 182, baseType: !1925, size: 64, offset: 64)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1960, file: !135, line: 2019, baseType: !1445, size: 64, offset: 384)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1960, file: !135, line: 2020, baseType: !1445, size: 64, offset: 448)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1960, file: !135, line: 2021, baseType: !1445, size: 64, offset: 512)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1960, file: !135, line: 2022, baseType: !1445, size: 64, offset: 576)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1960, file: !135, line: 2023, baseType: !1445, size: 64, offset: 640)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1448, file: !135, line: 3400, baseType: !1985, size: 832)
!1985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !135, line: 2430, size: 832, elements: !1986)
!1986 = !{!1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996}
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1985, file: !135, line: 2431, baseType: !1484, size: 192)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1985, file: !135, line: 2433, baseType: !1445, size: 64, offset: 192)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1985, file: !135, line: 2434, baseType: !1445, size: 64, offset: 256)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1985, file: !135, line: 2435, baseType: !1445, size: 64, offset: 320)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1985, file: !135, line: 2436, baseType: !1445, size: 64, offset: 384)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1985, file: !135, line: 2437, baseType: !1968, size: 64, offset: 448)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1985, file: !135, line: 2438, baseType: !1445, size: 64, offset: 512)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1985, file: !135, line: 2440, baseType: !1445, size: 64, offset: 576)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1985, file: !135, line: 2441, baseType: !1445, size: 64, offset: 640)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1985, file: !135, line: 2443, baseType: !1997, size: 128, offset: 704)
!1997 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !135, line: 182, baseType: !1998)
!1998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !135, line: 182, size: 128, elements: !1999)
!1999 = !{!2000}
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1998, file: !135, line: 182, baseType: !1973, size: 128)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !1448, file: !135, line: 3401, baseType: !2002, size: 320)
!2002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !135, line: 3327, size: 320, elements: !2003)
!2003 = !{!2004, !2005, !2012}
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2002, file: !135, line: 3329, baseType: !1484, size: 192)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !2002, file: !135, line: 3330, baseType: !2006, size: 64, offset: 192)
!2006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2007, size: 64)
!2007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !135, line: 3320, size: 192, elements: !2008)
!2008 = !{!2009, !2010, !2011}
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2007, file: !135, line: 3322, baseType: !2006, size: 64)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2007, file: !135, line: 3323, baseType: !2006, size: 64, offset: 64)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2007, file: !135, line: 3324, baseType: !1445, size: 64, offset: 128)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !2002, file: !135, line: 3331, baseType: !2006, size: 64, offset: 256)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !1448, file: !135, line: 3402, baseType: !2014, size: 256)
!2014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !135, line: 1540, size: 256, elements: !2015)
!2015 = !{!2016, !2017}
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2014, file: !135, line: 1541, baseType: !1484, size: 192)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !2014, file: !135, line: 1542, baseType: !2018, size: 64, offset: 192)
!2018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2019, size: 64)
!2019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !135, line: 1538, baseType: !2020)
!2020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !135, line: 1538, size: 192, elements: !2021)
!2021 = !{!2022}
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2020, file: !135, line: 1538, baseType: !2023, size: 192)
!2023 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !135, line: 1537, baseType: !2024)
!2024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !135, line: 1537, size: 192, elements: !2025)
!2025 = !{!2026, !2027, !2028}
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2024, file: !135, line: 1537, baseType: !7, size: 32)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2024, file: !135, line: 1537, baseType: !7, size: 32, offset: 32)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2024, file: !135, line: 1537, baseType: !2029, size: 128, offset: 64)
!2029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2030, size: 128, elements: !1544)
!2030 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !135, line: 1535, baseType: !2031)
!2031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !135, line: 1532, size: 128, elements: !2032)
!2032 = !{!2033, !2034}
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2031, file: !135, line: 1533, baseType: !1445, size: 64)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2031, file: !135, line: 1534, baseType: !1445, size: 64, offset: 64)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !1448, file: !135, line: 3403, baseType: !2036, size: 512)
!2036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !135, line: 1938, size: 512, elements: !2037)
!2037 = !{!2038, !2039, !2040, !2041, !2047, !2051, !2052}
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2036, file: !135, line: 1939, baseType: !1484, size: 192)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2036, file: !135, line: 1940, baseType: !1569, size: 32, offset: 192)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2036, file: !135, line: 1941, baseType: !134, size: 32, offset: 224)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2036, file: !135, line: 1946, baseType: !2042, size: 32, offset: 256)
!2042 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !135, line: 1942, size: 32, elements: !2043)
!2043 = !{!2044, !2045, !2046}
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !2042, file: !135, line: 1943, baseType: !153, size: 32)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !2042, file: !135, line: 1944, baseType: !160, size: 32)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !2042, file: !135, line: 1945, baseType: !167, size: 32)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !2036, file: !135, line: 1950, baseType: !2048, size: 64, offset: 320)
!2048 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1446, line: 66, baseType: !2049)
!2049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2050, size: 64)
!2050 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1446, line: 65, flags: DIFlagFwdDecl)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !2036, file: !135, line: 1951, baseType: !2048, size: 64, offset: 384)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !2036, file: !135, line: 1953, baseType: !1925, size: 64, offset: 448)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !1448, file: !135, line: 3404, baseType: !2054, size: 1664)
!2054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !135, line: 3337, size: 1664, elements: !2055)
!2055 = !{!2056, !2057}
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2054, file: !135, line: 3338, baseType: !1484, size: 192)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !2054, file: !135, line: 3341, baseType: !2058, size: 1472, offset: 192)
!2058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !501, line: 410, size: 1472, elements: !2059)
!2059 = !{!2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223}
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !2058, file: !501, line: 412, baseType: !1433, size: 32)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !2058, file: !501, line: 413, baseType: !1433, size: 32, offset: 32)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !2058, file: !501, line: 414, baseType: !1433, size: 32, offset: 64)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !2058, file: !501, line: 415, baseType: !1433, size: 32, offset: 96)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !2058, file: !501, line: 416, baseType: !1433, size: 32, offset: 128)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !2058, file: !501, line: 417, baseType: !1433, size: 32, offset: 160)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !2058, file: !501, line: 418, baseType: !1437, size: 8, offset: 192)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !2058, file: !501, line: 419, baseType: !1437, size: 8, offset: 200)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !2058, file: !501, line: 420, baseType: !2069, size: 8, offset: 208)
!2069 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !2058, file: !501, line: 421, baseType: !2069, size: 8, offset: 216)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !2058, file: !501, line: 422, baseType: !2069, size: 8, offset: 224)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !2058, file: !501, line: 423, baseType: !2069, size: 8, offset: 232)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !2058, file: !501, line: 424, baseType: !2069, size: 8, offset: 240)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !2058, file: !501, line: 425, baseType: !2069, size: 8, offset: 248)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !2058, file: !501, line: 426, baseType: !2069, size: 8, offset: 256)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !2058, file: !501, line: 427, baseType: !2069, size: 8, offset: 264)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !2058, file: !501, line: 428, baseType: !2069, size: 8, offset: 272)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !2058, file: !501, line: 429, baseType: !2069, size: 8, offset: 280)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !2058, file: !501, line: 430, baseType: !2069, size: 8, offset: 288)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !2058, file: !501, line: 431, baseType: !2069, size: 8, offset: 296)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !2058, file: !501, line: 432, baseType: !2069, size: 8, offset: 304)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !2058, file: !501, line: 433, baseType: !2069, size: 8, offset: 312)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !2058, file: !501, line: 434, baseType: !2069, size: 8, offset: 320)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !2058, file: !501, line: 435, baseType: !2069, size: 8, offset: 328)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !2058, file: !501, line: 436, baseType: !2069, size: 8, offset: 336)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !2058, file: !501, line: 437, baseType: !2069, size: 8, offset: 344)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !2058, file: !501, line: 438, baseType: !2069, size: 8, offset: 352)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !2058, file: !501, line: 439, baseType: !2069, size: 8, offset: 360)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !2058, file: !501, line: 440, baseType: !2069, size: 8, offset: 368)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !2058, file: !501, line: 441, baseType: !2069, size: 8, offset: 376)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !2058, file: !501, line: 442, baseType: !2069, size: 8, offset: 384)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !2058, file: !501, line: 443, baseType: !2069, size: 8, offset: 392)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !2058, file: !501, line: 444, baseType: !2069, size: 8, offset: 400)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !2058, file: !501, line: 445, baseType: !2069, size: 8, offset: 408)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !2058, file: !501, line: 446, baseType: !2069, size: 8, offset: 416)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !2058, file: !501, line: 447, baseType: !2069, size: 8, offset: 424)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !2058, file: !501, line: 448, baseType: !2069, size: 8, offset: 432)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !2058, file: !501, line: 449, baseType: !2069, size: 8, offset: 440)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !2058, file: !501, line: 450, baseType: !2069, size: 8, offset: 448)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !2058, file: !501, line: 451, baseType: !2069, size: 8, offset: 456)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !2058, file: !501, line: 452, baseType: !2069, size: 8, offset: 464)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !2058, file: !501, line: 453, baseType: !2069, size: 8, offset: 472)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !2058, file: !501, line: 454, baseType: !2069, size: 8, offset: 480)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !2058, file: !501, line: 455, baseType: !2069, size: 8, offset: 488)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !2058, file: !501, line: 456, baseType: !2069, size: 8, offset: 496)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !2058, file: !501, line: 457, baseType: !2069, size: 8, offset: 504)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !2058, file: !501, line: 458, baseType: !2069, size: 8, offset: 512)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !2058, file: !501, line: 459, baseType: !2069, size: 8, offset: 520)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !2058, file: !501, line: 460, baseType: !2069, size: 8, offset: 528)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !2058, file: !501, line: 461, baseType: !2069, size: 8, offset: 536)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !2058, file: !501, line: 462, baseType: !2069, size: 8, offset: 544)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !2058, file: !501, line: 463, baseType: !2069, size: 8, offset: 552)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !2058, file: !501, line: 464, baseType: !2069, size: 8, offset: 560)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !2058, file: !501, line: 465, baseType: !2069, size: 8, offset: 568)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !2058, file: !501, line: 466, baseType: !2069, size: 8, offset: 576)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !2058, file: !501, line: 467, baseType: !2069, size: 8, offset: 584)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !2058, file: !501, line: 468, baseType: !2069, size: 8, offset: 592)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !2058, file: !501, line: 469, baseType: !2069, size: 8, offset: 600)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !2058, file: !501, line: 470, baseType: !2069, size: 8, offset: 608)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !2058, file: !501, line: 471, baseType: !2069, size: 8, offset: 616)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !2058, file: !501, line: 472, baseType: !2069, size: 8, offset: 624)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !2058, file: !501, line: 473, baseType: !2069, size: 8, offset: 632)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !2058, file: !501, line: 474, baseType: !2069, size: 8, offset: 640)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !2058, file: !501, line: 475, baseType: !2069, size: 8, offset: 648)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !2058, file: !501, line: 476, baseType: !2069, size: 8, offset: 656)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !2058, file: !501, line: 477, baseType: !2069, size: 8, offset: 664)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !2058, file: !501, line: 478, baseType: !2069, size: 8, offset: 672)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !2058, file: !501, line: 479, baseType: !2069, size: 8, offset: 680)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !2058, file: !501, line: 480, baseType: !2069, size: 8, offset: 688)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !2058, file: !501, line: 481, baseType: !2069, size: 8, offset: 696)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !2058, file: !501, line: 482, baseType: !2069, size: 8, offset: 704)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !2058, file: !501, line: 483, baseType: !2069, size: 8, offset: 712)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !2058, file: !501, line: 484, baseType: !2069, size: 8, offset: 720)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !2058, file: !501, line: 485, baseType: !2069, size: 8, offset: 728)
