; ModuleID = 'genrtl.c'
source_filename = "genrtl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.rtvec_def = type { i32, [1 x %struct.rtx_def*] }
%struct.basic_block_def = type opaque
%union.tree_node = type opaque

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.rtx_def* @gen_rtx_fmt_0_stat(i32 %code, i32 %mode) #0 !dbg !430 {
entry:
  %code.addr = alloca i32, align 4
  %mode.addr = alloca i32, align 4
  %rt = alloca %struct.rtx_def*, align 8
  store i32 %code, i32* %code.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %code.addr, metadata !434, metadata !DIExpression()), !dbg !435
  store i32 %mode, i32* %mode.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %mode.addr, metadata !436, metadata !DIExpression()), !dbg !437
  call void @llvm.dbg.declare(metadata %struct.rtx_def** %rt, metadata !438, metadata !DIExpression()), !dbg !439
  %0 = load i32, i32* %code.addr, align 4, !dbg !440

!197 = !DIEnumerator(name: "IOR", value: 62, isUnsigned: true)
!198 = !DIEnumerator(name: "XOR", value: 63, isUnsigned: true)
!199 = !DIEnumerator(name: "NOT", value: 64, isUnsigned: true)
!200 = !DIEnumerator(name: "ASHIFT", value: 65, isUnsigned: true)
!201 = !DIEnumerator(name: "ROTATE", value: 66, isUnsigned: true)
!202 = !DIEnumerator(name: "ASHIFTRT", value: 67, isUnsigned: true)
!203 = !DIEnumerator(name: "LSHIFTRT", value: 68, isUnsigned: true)
!204 = !DIEnumerator(name: "ROTATERT", value: 69, isUnsigned: true)
!205 = !DIEnumerator(name: "SMIN", value: 70, isUnsigned: true)
!206 = !DIEnumerator(name: "SMAX", value: 71, isUnsigned: true)
!207 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!208 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!209 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!210 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!211 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!212 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!213 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!214 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!215 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!216 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!217 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!218 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!219 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!220 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!221 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!222 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!223 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!224 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!225 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!226 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!227 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!228 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!229 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!230 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!231 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!232 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!233 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!234 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!235 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!236 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!237 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!238 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!239 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!240 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!241 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!242 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!243 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!244 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!245 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!246 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!247 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!248 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!249 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!250 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!251 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!252 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!253 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!254 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!255 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!256 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!257 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!258 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!259 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!260 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!261 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!262 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!263 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!264 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!265 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!266 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!267 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!268 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!269 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!270 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!271 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!272 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!273 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!274 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !277, line: 50, baseType: !278)
!277 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !133, line: 240, size: 384, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !279, file: !133, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !279, file: !133, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !279, file: !133, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !279, file: !133, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !279, file: !133, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !279, file: !133, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !279, file: !133, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !279, file: !133, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !279, file: !133, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !279, file: !133, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !279, file: !133, line: 321, baseType: !292, size: 320, offset: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !133, line: 315, size: 320, elements: !293)
!293 = !{!294, !368, !370, !401, !414}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !292, file: !133, line: 316, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !315)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !133, line: 183, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !133, line: 166, size: 64, elements: !298)
!298 = !{!299, !301, !302, !306, !307, !317, !318, !330, !333, !336, !340, !343, !357, !365}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !297, file: !133, line: 168, baseType: !300, size: 32)
!300 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !297, file: !133, line: 169, baseType: !5, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !297, file: !133, line: 170, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !297, file: !133, line: 171, baseType: !276, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !297, file: !133, line: 172, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !277, line: 53, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !133, line: 359, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !310, file: !133, line: 360, baseType: !300, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !310, file: !133, line: 361, baseType: !314, size: 64, offset: 64)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !297, file: !133, line: 173, baseType: !3, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !297, file: !133, line: 174, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !133, line: 133, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 115, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !320, file: !133, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !320, file: !133, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !320, file: !133, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !320, file: !133, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !320, file: !133, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !320, file: !133, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !320, file: !133, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !320, file: !133, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !297, file: !133, line: 175, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !133, line: 175, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !297, file: !133, line: 176, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !277, line: 46, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !297, file: !133, line: 177, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !277, line: 56, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !277, line: 55, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !297, file: !133, line: 178, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !277, line: 110, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !297, file: !133, line: 179, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !133, line: 150, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !133, line: 142, size: 320, elements: !347)
!347 = !{!348, !349, !350, !351, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !346, file: !133, line: 144, baseType: !337, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !346, file: !133, line: 145, baseType: !276, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !133, line: 146, baseType: !276, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !346, file: !133, line: 147, baseType: !352, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !353, line: 31, baseType: !300)
!353 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!354 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !346, file: !133, line: 148, baseType: !5, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !346, file: !133, line: 149, baseType: !356, size: 8, offset: 256)
!356 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !297, file: !133, line: 180, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !133, line: 162, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !133, line: 159, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !360, file: !133, line: 160, baseType: !337, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !360, file: !133, line: 161, baseType: !364, size: 64, offset: 64)
!364 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !297, file: !133, line: 181, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !133, line: 181, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !292, file: !133, line: 317, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !315)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !292, file: !133, line: 318, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !133, line: 188, size: 320, elements: !372)
!372 = !{!373, !377, !400}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !371, file: !133, line: 190, baseType: !374, size: 192)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 192, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 3)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !371, file: !133, line: 193, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !133, line: 206, size: 320, elements: !380)
!380 = !{!381, !385, !386, !387, !399}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !379, file: !133, line: 208, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !277, line: 62, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !277, line: 61, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !379, file: !133, line: 211, baseType: !5, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !379, file: !133, line: 214, baseType: !364, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !379, file: !133, line: 224, baseType: !388, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !133, line: 202, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !133, line: 202, size: 128, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !390, file: !133, line: 202, baseType: !393, size: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !133, line: 200, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !133, line: 200, size: 128, elements: !395)
!395 = !{!396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !394, file: !133, line: 200, baseType: !5, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !394, file: !133, line: 200, baseType: !5, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !394, file: !133, line: 200, baseType: !314, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !379, file: !133, line: 234, baseType: !388, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !371, file: !133, line: 197, baseType: !364, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !292, file: !133, line: 319, baseType: !402, size: 256)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !403, line: 52, size: 256, elements: !404)
!403 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!404 = !{!405, !406, !407, !408, !409, !410, !411}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !402, file: !403, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !402, file: !403, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !402, file: !403, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !402, file: !403, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !402, file: !403, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !402, file: !403, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !402, file: !403, line: 62, baseType: !412, size: 192, offset: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 192, elements: !375)
!413 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !292, file: !133, line: 320, baseType: !415, size: 192)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !416, line: 27, size: 192, elements: !417)
!416 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!417 = !{!418, !425}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !416, line: 29, baseType: !419, size: 128)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !420, line: 58, baseType: !421)
!420 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 54, size: 128, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !421, file: !420, line: 56, baseType: !413, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !421, file: !420, line: 57, baseType: !364, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !415, file: !416, line: 30, baseType: !3, size: 32, offset: 128)
!426 = !{i32 7, !"Dwarf Version", i32 4}
!427 = !{i32 2, !"Debug Info Version", i32 3}
!428 = !{i32 1, !"wchar_size", i32 4}
!429 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!430 = distinct !DISubprogram(name: "gen_rtx_fmt_0_stat", scope: !1, file: !1, line: 12, type: !431, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!276, !132, !3}
!433 = !{}
!434 = !DILocalVariable(name: "code", arg: 1, scope: !430, file: !1, line: 12, type: !132)
!435 = !DILocation(line: 12, column: 30, scope: !430)
!436 = !DILocalVariable(name: "mode", arg: 2, scope: !430, file: !1, line: 12, type: !3)
!437 = !DILocation(line: 12, column: 54, scope: !430)
!438 = !DILocalVariable(name: "rt", scope: !430, file: !1, line: 14, type: !276)
!439 = !DILocation(line: 14, column: 7, scope: !430)
!440 = !DILocation(line: 15, column: 24, scope: !430)
!441 = !DILocation(line: 15, column: 8, scope: !430)
!442 = !DILocation(line: 15, column: 6, scope: !430)
!443 = !DILocation(line: 17, column: 3, scope: !430)
!444 = !DILocation(line: 18, column: 3, scope: !430)
!445 = !DILocation(line: 18, column: 17, scope: !430)
!446 = !DILocation(line: 20, column: 10, scope: !430)
!447 = !DILocation(line: 20, column: 3, scope: !430)
!448 = distinct !DISubprogram(name: "gen_rtx_fmt_ee_stat", scope: !1, file: !1, line: 24, type: !449, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !433)
!449 = !DISubroutineType(types: !450)
!450 = !{!276, !132, !3, !276, !276}
!451 = !DILocalVariable(name: "code", arg: 1, scope: !448, file: !1, line: 24, type: !132)
!452 = !DILocation(line: 24, column: 31, scope: !448)
!453 = !DILocalVariable(name: "mode", arg: 2, scope: !448, file: !1, line: 24, type: !3)
!454 = !DILocation(line: 24, column: 55, scope: !448)
!455 = !DILocalVariable(name: "arg0", arg: 3, scope: !448, file: !1, line: 25, type: !276)
!456 = !DILocation(line: 25, column: 6, scope: !448)
!457 = !DILocalVariable(name: "arg1", arg: 4, scope: !448, file: !1, line: 26, type: !276)
!458 = !DILocation(line: 26, column: 6, scope: !448)
!459 = !DILocalVariable(name: "rt", scope: !448, file: !1, line: 28, type: !276)
!460 = !DILocation(line: 28, column: 7, scope: !448)
!461 = !DILocation(line: 29, column: 24, scope: !448)
!462 = !DILocation(line: 29, column: 8, scope: !448)
!463 = !DILocation(line: 29, column: 6, scope: !448)
!464 = !DILocation(line: 31, column: 3, scope: !448)
!465 = !DILocation(line: 32, column: 18, scope: !448)
!466 = !DILocation(line: 32, column: 3, scope: !448)
!467 = !DILocation(line: 32, column: 16, scope: !448)
!468 = !DILocation(line: 33, column: 18, scope: !448)
!469 = !DILocation(line: 33, column: 3, scope: !448)
!470 = !DILocation(line: 33, column: 16, scope: !448)
!471 = !DILocation(line: 35, column: 10, scope: !448)
!472 = !DILocation(line: 35, column: 3, scope: !448)
!473 = distinct !DISubprogram(name: "gen_rtx_fmt_ue_stat", scope: !1, file: !1, line: 39, type: !449, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !433)
!474 = !DILocalVariable(name: "code", arg: 1, scope: !473, file: !1, line: 39, type: !132)
!475 = !DILocation(line: 39, column: 31, scope: !473)
!476 = !DILocalVariable(name: "mode", arg: 2, scope: !473, file: !1, line: 39, type: !3)
!477 = !DILocation(line: 39, column: 55, scope: !473)
!478 = !DILocalVariable(name: "arg0", arg: 3, scope: !473, file: !1, line: 40, type: !276)
!479 = !DILocation(line: 40, column: 6, scope: !473)
!480 = !DILocalVariable(name: "arg1", arg: 4, scope: !473, file: !1, line: 41, type: !276)
!481 = !DILocation(line: 41, column: 6, scope: !473)
!482 = !DILocalVariable(name: "rt", scope: !473, file: !1, line: 43, type: !276)
