; ModuleID = 'mode-switching.c'
source_filename = "mode-switching.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !561, line: 836, baseType: !7, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!705 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!718 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "attr_i387_cw", file: !738, line: 72, baseType: !7, size: 32, elements: !739)
!738 = !DIFile(filename: "./insn-attr.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIEnumerator(name: "I387_CW_TRUNC", value: 0, isUnsigned: true)
!741 = !DIEnumerator(name: "I387_CW_FLOOR", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "I387_CW_CEIL", value: 2, isUnsigned: true)
!743 = !DIEnumerator(name: "I387_CW_MASK_PM", value: 3, isUnsigned: true)
!744 = !DIEnumerator(name: "I387_CW_UNINITIALIZED", value: 4, isUnsigned: true)
!745 = !DIEnumerator(name: "I387_CW_ANY", value: 5, isUnsigned: true)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !561, line: 956, baseType: !7, size: 32, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!748 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!749 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!750 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!751 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!752 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!753 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!754 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!755 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!756 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!757 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!758 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!759 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!760 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!761 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!762 = !{!763, !1852, !884, !560, !703, !189, !7, !773, !767, !846, !771, !1855}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bb_info", file: !3, line: 81, size: 128, elements: !765)
!765 = !{!766, !1854}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "seginfo", scope: !764, file: !3, line: 83, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seginfo", file: !3, line: 72, size: 320, elements: !769)
!769 = !{!770, !772, !1849, !1850, !1851}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !3, line: 74, baseType: !771, size: 32)
!771 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "insn_ptr", scope: !768, file: !3, line: 75, baseType: !773, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !774, line: 50, baseType: !775)
!774 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !776, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !776, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !776, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !776, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !776, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !776, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !776, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !776, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !776, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !776, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !776, file: !561, line: 321, baseType: !789, size: 320, offset: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !790)
!790 = !{!791, !1784, !1786, !1847, !1848}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !789, file: !561, line: 316, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 64, elements: !811)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !795)
!795 = !{!796, !797, !798, !802, !803, !813, !814, !826, !829, !893, !1762, !1763, !1774, !1781}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !794, file: !561, line: 168, baseType: !771, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !794, file: !561, line: 169, baseType: !7, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !794, file: !561, line: 170, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !794, file: !561, line: 171, baseType: !773, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !794, file: !561, line: 172, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !774, line: 53, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !806, file: !561, line: 360, baseType: !771, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !806, file: !561, line: 361, baseType: !810, size: 64, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 64, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 1)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !794, file: !561, line: 173, baseType: !189, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !794, file: !561, line: 174, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !816, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !816, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !816, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !816, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !816, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !816, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !816, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !816, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !794, file: !561, line: 175, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !794, file: !561, line: 176, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !832, line: 75, size: 256, elements: !833)
!832 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!833 = !{!834, !849, !850, !851}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !831, file: !832, line: 76, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !832, line: 68, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !832, line: 63, size: 320, elements: !838)
!838 = !{!839, !841, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !832, line: 64, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !837, file: !832, line: 65, baseType: !840, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !832, line: 66, baseType: !7, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !837, file: !832, line: 67, baseType: !844, size: 128, offset: 192)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 128, elements: !847)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !832, line: 29, baseType: !846)
!846 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!847 = !{!848}
!848 = !DISubrange(count: 2)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !831, file: !832, line: 77, baseType: !835, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !831, file: !832, line: 78, baseType: !7, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !831, file: !832, line: 79, baseType: !852, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !832, line: 49, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !832, line: 45, size: 832, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !854, file: !832, line: 46, baseType: !840, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !854, file: !832, line: 47, baseType: !830, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !854, file: !832, line: 48, baseType: !859, size: 704, offset: 128)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !860, line: 164, size: 704, elements: !861)
!860 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!861 = !{!862, !864, !875, !876, !877, !878, !879, !880, !885, !889, !890, !891, !892}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !859, file: !860, line: 166, baseType: !863, size: 64)
!863 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !859, file: !860, line: 167, baseType: !865, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !860, line: 157, size: 192, elements: !867)
!867 = !{!868, !870, !871}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !866, file: !860, line: 159, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !866, file: !860, line: 160, baseType: !865, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !866, file: !860, line: 161, baseType: !872, size: 32, offset: 128)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 32, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 4)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !859, file: !860, line: 168, baseType: !869, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !859, file: !860, line: 169, baseType: !869, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !859, file: !860, line: 170, baseType: !869, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !859, file: !860, line: 171, baseType: !863, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !859, file: !860, line: 172, baseType: !771, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !859, file: !860, line: 176, baseType: !881, size: 64, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!865, !884, !863}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !859, file: !860, line: 177, baseType: !886, size: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !884, !865}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !859, file: !860, line: 178, baseType: !884, size: 64, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !859, file: !860, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !859, file: !860, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !859, file: !860, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !794, file: !561, line: 177, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !774, line: 56, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !897)
!897 = !{!898, !931, !937, !948, !967, !978, !983, !990, !996, !1010, !1022, !1060, !1065, !1093, !1101, !1102, !1107, !1116, !1122, !1127, !1131, !1135, !1386, !1435, !1441, !1448, !1455, !1481, !1506, !1523, !1535, !1557, !1572, !1744}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !896, file: !334, line: 3372, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !899, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !899, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !899, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !899, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !899, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !899, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !899, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !899, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !899, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !899, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !899, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !899, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !899, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !899, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !899, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !899, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !899, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !899, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !899, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !899, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !899, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !899, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !899, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !899, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !899, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !899, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !899, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !899, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !899, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !899, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !334, line: 3373, baseType: !932, size: 192)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !932, file: !334, line: 403, baseType: !899, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !932, file: !334, line: 404, baseType: !894, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !932, file: !334, line: 405, baseType: !894, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !896, file: !334, line: 3374, baseType: !938, size: 320)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !334, line: 1385, baseType: !932, size: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !938, file: !334, line: 1386, baseType: !942, size: 128, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !943, line: 58, baseType: !944)
!943 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !943, line: 54, size: 128, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !944, file: !943, line: 56, baseType: !846, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !944, file: !943, line: 57, baseType: !863, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !896, file: !334, line: 3375, baseType: !949, size: 256)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !949, file: !334, line: 1398, baseType: !932, size: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !949, file: !334, line: 1399, baseType: !953, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !955, line: 52, size: 256, elements: !956)
!955 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!956 = !{!957, !958, !959, !960, !961, !962, !963}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !954, file: !955, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !954, file: !955, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !954, file: !955, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !954, file: !955, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !954, file: !955, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !954, file: !955, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !954, file: !955, line: 62, baseType: !964, size: 192, offset: 64)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 192, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 3)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !896, file: !334, line: 3376, baseType: !968, size: 256)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !968, file: !334, line: 1409, baseType: !932, size: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !968, file: !334, line: 1410, baseType: !972, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !974, line: 27, size: 192, elements: !975)
!974 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !973, file: !974, line: 29, baseType: !942, size: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !973, file: !974, line: 30, baseType: !189, size: 32, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !896, file: !334, line: 3377, baseType: !979, size: 256)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !979, file: !334, line: 1438, baseType: !932, size: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !979, file: !334, line: 1439, baseType: !894, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !896, file: !334, line: 3378, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !334, line: 1419, baseType: !932, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !984, file: !334, line: 1420, baseType: !771, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !984, file: !334, line: 1421, baseType: !989, size: 8, offset: 224)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 8, elements: !811)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !896, file: !334, line: 3379, baseType: !991, size: 320)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !992)
!992 = !{!993, !994, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !991, file: !334, line: 1429, baseType: !932, size: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !991, file: !334, line: 1430, baseType: !894, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !991, file: !334, line: 1431, baseType: !894, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !896, file: !334, line: 3380, baseType: !997, size: 320)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !334, line: 1461, baseType: !932, size: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !997, file: !334, line: 1462, baseType: !1001, size: 128, offset: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1002, line: 31, size: 128, elements: !1003)
!1002 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1003 = !{!1004, !1008, !1009}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1001, file: !1002, line: 32, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1001, file: !1002, line: 33, baseType: !7, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1001, file: !1002, line: 34, baseType: !7, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !896, file: !334, line: 3381, baseType: !1011, size: 384)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1012)
!1012 = !{!1013, !1014, !1019, !1020, !1021}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !334, line: 2508, baseType: !932, size: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1011, file: !334, line: 2509, baseType: !1015, size: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1016, line: 58, baseType: !1017)
!1016 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1018, line: 44, baseType: !7)
!1018 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1011, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1011, file: !334, line: 2511, baseType: !894, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1011, file: !334, line: 2512, baseType: !894, size: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !896, file: !334, line: 3382, baseType: !1023, size: 896)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !334, line: 2653, baseType: !1011, size: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1023, file: !334, line: 2654, baseType: !894, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1023, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1023, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1023, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1023, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1023, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1023, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1023, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1023, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1023, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1023, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1023, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1023, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1023, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1023, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1023, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1023, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1023, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1023, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1023, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1023, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1023, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1023, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1023, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1023, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1023, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1023, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1023, file: !334, line: 2705, baseType: !894, size: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1023, file: !334, line: 2706, baseType: !894, size: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1023, file: !334, line: 2707, baseType: !894, size: 64, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1023, file: !334, line: 2708, baseType: !894, size: 64, offset: 768)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1023, file: !334, line: 2711, baseType: !1058, size: 64, offset: 832)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !896, file: !334, line: 3383, baseType: !1061, size: 960)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1061, file: !334, line: 2757, baseType: !1023, size: 896)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1061, file: !334, line: 2758, baseType: !773, size: 64, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !896, file: !334, line: 3384, baseType: !1066, size: 1472)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1067)
!1067 = !{!1068, !1089, !1090, !1091, !1092}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !334, line: 3115, baseType: !1069, size: 1216)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !334, line: 2985, baseType: !1061, size: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1069, file: !334, line: 2986, baseType: !894, size: 64, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1069, file: !334, line: 2987, baseType: !894, size: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1069, file: !334, line: 2988, baseType: !894, size: 64, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1069, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1069, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1069, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1069, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1069, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1069, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1069, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1069, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1069, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1069, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1069, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1069, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1069, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1069, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1066, file: !334, line: 3117, baseType: !894, size: 64, offset: 1216)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1066, file: !334, line: 3119, baseType: !894, size: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1066, file: !334, line: 3121, baseType: !894, size: 64, offset: 1344)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1066, file: !334, line: 3123, baseType: !894, size: 64, offset: 1408)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !896, file: !334, line: 3385, baseType: !1094, size: 1088)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1094, file: !334, line: 2875, baseType: !1061, size: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1094, file: !334, line: 2876, baseType: !773, size: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1094, file: !334, line: 2877, baseType: !1099, size: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !896, file: !334, line: 3386, baseType: !1069, size: 1216)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !896, file: !334, line: 3387, baseType: !1103, size: 1280)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !334, line: 3094, baseType: !1069, size: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1103, file: !334, line: 3095, baseType: !1099, size: 64, offset: 1216)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !896, file: !334, line: 3388, baseType: !1108, size: 1216)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !334, line: 2825, baseType: !1023, size: 896)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1108, file: !334, line: 2827, baseType: !894, size: 64, offset: 896)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1108, file: !334, line: 2828, baseType: !894, size: 64, offset: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1108, file: !334, line: 2829, baseType: !894, size: 64, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1108, file: !334, line: 2830, baseType: !894, size: 64, offset: 1088)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1108, file: !334, line: 2831, baseType: !894, size: 64, offset: 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !896, file: !334, line: 3389, baseType: !1117, size: 1024)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !334, line: 2851, baseType: !1061, size: 960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1117, file: !334, line: 2852, baseType: !771, size: 32, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1117, file: !334, line: 2853, baseType: !771, size: 32, offset: 992)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !896, file: !334, line: 3390, baseType: !1123, size: 1024)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !334, line: 2858, baseType: !1061, size: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1123, file: !334, line: 2859, baseType: !1099, size: 64, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !896, file: !334, line: 3391, baseType: !1128, size: 960)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1129)
!1129 = !{!1130}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1128, file: !334, line: 2863, baseType: !1061, size: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !896, file: !334, line: 3392, baseType: !1132, size: 1472)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1133)
!1133 = !{!1134}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !334, line: 3305, baseType: !1066, size: 1472)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !896, file: !334, line: 3393, baseType: !1136, size: 1792)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1137)
!1137 = !{!1138, !1139, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !334, line: 3249, baseType: !1066, size: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1136, file: !334, line: 3251, baseType: !1140, size: 64, offset: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1142, line: 463, size: 1152, elements: !1143)
!1142 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1143 = !{!1144, !1147, !1251, !1252, !1255, !1258, !1310, !1311, !1312, !1313, !1314, !1338, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1141, file: !1142, line: 464, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1142, line: 464, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1141, file: !1142, line: 467, baseType: !1148, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1150)
!1150 = !{!1151, !1226, !1227, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1249, !1250}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1149, file: !318, line: 377, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !774, line: 111, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1155)
!1155 = !{!1156, !1191, !1192, !1193, !1196, !1200, !1201, !1202, !1220, !1221, !1222, !1223, !1224, !1225}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1154, file: !318, line: 219, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1160)
!1160 = !{!1161}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1159, file: !318, line: 151, baseType: !1162, size: 128)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1163, file: !318, line: 150, baseType: !7, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1163, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1163, file: !318, line: 150, baseType: !1168, size: 64, offset: 64)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1169, size: 64, elements: !811)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !774, line: 108, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1171, file: !318, line: 124, baseType: !1153, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1171, file: !318, line: 125, baseType: !1153, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1171, file: !318, line: 131, baseType: !1176, size: 64, offset: 128)
!1176 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1177)
!1177 = !{!1178, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1176, file: !318, line: 129, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !774, line: 66, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !774, line: 65, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1176, file: !318, line: 130, baseType: !773, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1171, file: !318, line: 134, baseType: !884, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1171, file: !318, line: 137, baseType: !894, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1171, file: !318, line: 138, baseType: !1015, size: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1171, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !318, line: 144, baseType: !771, size: 32, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1171, file: !318, line: 145, baseType: !771, size: 32, offset: 416)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1171, file: !318, line: 146, baseType: !1190, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !863)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1154, file: !318, line: 220, baseType: !1157, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1154, file: !318, line: 223, baseType: !884, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1154, file: !318, line: 226, baseType: !1194, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1154, file: !318, line: 229, baseType: !1197, size: 128, offset: 256)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 128, elements: !847)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1154, file: !318, line: 232, baseType: !1153, size: 64, offset: 384)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1154, file: !318, line: 233, baseType: !1153, size: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1154, file: !318, line: 238, baseType: !1203, size: 64, offset: 512)
!1203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1204)
!1204 = !{!1205, !1211}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1203, file: !318, line: 236, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1208)
!1208 = !{!1209, !1210}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1207, file: !318, line: 275, baseType: !1179, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1207, file: !318, line: 278, baseType: !1179, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1203, file: !318, line: 237, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1213, file: !318, line: 261, baseType: !773, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1213, file: !318, line: 262, baseType: !773, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1213, file: !318, line: 266, baseType: !773, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1213, file: !318, line: 267, baseType: !773, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1213, file: !318, line: 270, baseType: !771, size: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1154, file: !318, line: 241, baseType: !1190, size: 64, offset: 576)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1154, file: !318, line: 244, baseType: !771, size: 32, offset: 640)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1154, file: !318, line: 247, baseType: !771, size: 32, offset: 672)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1154, file: !318, line: 250, baseType: !771, size: 32, offset: 704)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1154, file: !318, line: 253, baseType: !771, size: 32, offset: 736)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !318, line: 256, baseType: !771, size: 32, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1149, file: !318, line: 378, baseType: !1152, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1149, file: !318, line: 381, baseType: !1228, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1231)
!1231 = !{!1232}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1230, file: !318, line: 282, baseType: !1233, size: 128)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1235)
!1235 = !{!1236, !1237, !1238}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1234, file: !318, line: 281, baseType: !7, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1234, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1234, file: !318, line: 281, baseType: !1239, size: 64, offset: 64)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 64, elements: !811)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1149, file: !318, line: 384, baseType: !771, size: 32, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1149, file: !318, line: 387, baseType: !771, size: 32, offset: 224)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1149, file: !318, line: 390, baseType: !771, size: 32, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1149, file: !318, line: 394, baseType: !1228, size: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1149, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1149, file: !318, line: 399, baseType: !1246, size: 64, offset: 416)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !847)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1149, file: !318, line: 402, baseType: !1248, size: 64, offset: 480)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !847)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1149, file: !318, line: 406, baseType: !771, size: 32, offset: 544)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1149, file: !318, line: 409, baseType: !771, size: 32, offset: 576)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1141, file: !1142, line: 470, baseType: !1180, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1141, file: !1142, line: 473, baseType: !1253, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1142, line: 166, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1141, file: !1142, line: 476, baseType: !1256, size: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1142, line: 476, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1141, file: !1142, line: 479, baseType: !1259, size: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1260, line: 144, baseType: !1261)
!1260 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1260, line: 100, size: 896, elements: !1263)
!1263 = !{!1264, !1272, !1277, !1282, !1284, !1287, !1288, !1289, !1290, !1291, !1296, !1298, !1299, !1304, !1309}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1262, file: !1260, line: 102, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1260, line: 52, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1260, line: 47, baseType: !7)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1262, file: !1260, line: 105, baseType: !1273, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1260, line: 59, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!771, !1270, !1270}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1262, file: !1260, line: 108, baseType: !1278, size: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1260, line: 63, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !884}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1262, file: !1260, line: 111, baseType: !1283, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1262, file: !1260, line: 114, baseType: !1285, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1286, line: 46, baseType: !846)
!1286 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1262, file: !1260, line: 117, baseType: !1285, size: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1262, file: !1260, line: 120, baseType: !1285, size: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1262, file: !1260, line: 124, baseType: !7, size: 32, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1262, file: !1260, line: 128, baseType: !7, size: 32, offset: 480)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1262, file: !1260, line: 131, baseType: !1292, size: 64, offset: 512)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1260, line: 75, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!884, !1285, !1285}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1262, file: !1260, line: 132, baseType: !1297, size: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1260, line: 78, baseType: !1279)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1262, file: !1260, line: 135, baseType: !884, size: 64, offset: 640)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1262, file: !1260, line: 136, baseType: !1300, size: 64, offset: 704)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1260, line: 82, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!884, !884, !1285, !1285}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1262, file: !1260, line: 137, baseType: !1305, size: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1260, line: 83, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !884, !884}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1262, file: !1260, line: 141, baseType: !7, size: 32, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1141, file: !1142, line: 484, baseType: !894, size: 64, offset: 384)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1141, file: !1142, line: 488, baseType: !894, size: 64, offset: 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1141, file: !1142, line: 493, baseType: !894, size: 64, offset: 512)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1141, file: !1142, line: 496, baseType: !894, size: 64, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1141, file: !1142, line: 501, baseType: !1315, size: 64, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1317)
!1317 = !{!1318, !1321, !1322, !1323, !1324, !1326, !1327, !1332, !1333, !1334, !1335, !1336, !1337}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1316, file: !329, line: 2356, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1316, file: !329, line: 2357, baseType: !799, size: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1316, file: !329, line: 2358, baseType: !771, size: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1316, file: !329, line: 2359, baseType: !771, size: 32, offset: 160)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1316, file: !329, line: 2360, baseType: !1325, size: 128, offset: 192)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !873)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1316, file: !329, line: 2364, baseType: !771, size: 32, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1316, file: !329, line: 2367, baseType: !1328, size: 128, offset: 384)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1328, file: !329, line: 2351, baseType: !773, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1328, file: !329, line: 2352, baseType: !863, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1316, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1316, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1316, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1316, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1316, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1316, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1141, file: !1142, line: 504, baseType: !1339, size: 64, offset: 704)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1142, line: 504, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1141, file: !1142, line: 507, baseType: !1259, size: 64, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1141, file: !1142, line: 510, baseType: !771, size: 32, offset: 832)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1141, file: !1142, line: 513, baseType: !771, size: 32, offset: 864)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1141, file: !1142, line: 516, baseType: !1015, size: 32, offset: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1141, file: !1142, line: 519, baseType: !1015, size: 32, offset: 928)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1141, file: !1142, line: 522, baseType: !7, size: 32, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1141, file: !1142, line: 523, baseType: !7, size: 32, offset: 992)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1141, file: !1142, line: 528, baseType: !799, size: 64, offset: 1024)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1141, file: !1142, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1141, file: !1142, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1141, file: !1142, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1141, file: !1142, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1141, file: !1142, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1141, file: !1142, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1141, file: !1142, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1141, file: !1142, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1141, file: !1142, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1141, file: !1142, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1141, file: !1142, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1141, file: !1142, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1141, file: !1142, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1141, file: !1142, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1141, file: !1142, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1141, file: !1142, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1136, file: !334, line: 3254, baseType: !894, size: 64, offset: 1536)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1136, file: !334, line: 3257, baseType: !894, size: 64, offset: 1600)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1136, file: !334, line: 3258, baseType: !894, size: 64, offset: 1664)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1136, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1136, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1136, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1136, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1136, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1136, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1136, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1136, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1136, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1136, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1136, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1136, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1136, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1136, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1136, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1136, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1136, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1136, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !896, file: !334, line: 3394, baseType: !1387, size: 1344)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1414, !1415, !1416, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !334, line: 2280, baseType: !932, size: 192)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1387, file: !334, line: 2281, baseType: !894, size: 64, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1387, file: !334, line: 2282, baseType: !894, size: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1387, file: !334, line: 2283, baseType: !894, size: 64, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1387, file: !334, line: 2284, baseType: !894, size: 64, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1387, file: !334, line: 2285, baseType: !7, size: 32, offset: 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1387, file: !334, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1387, file: !334, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1387, file: !334, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1387, file: !334, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1387, file: !334, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1387, file: !334, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1387, file: !334, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1387, file: !334, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1387, file: !334, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1387, file: !334, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1387, file: !334, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1387, file: !334, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1387, file: !334, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1387, file: !334, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1387, file: !334, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1387, file: !334, line: 2305, baseType: !7, size: 32, offset: 512)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1387, file: !334, line: 2306, baseType: !1412, size: 32, offset: 544)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1413, line: 31, baseType: !771)
!1413 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1387, file: !334, line: 2307, baseType: !894, size: 64, offset: 576)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1387, file: !334, line: 2308, baseType: !894, size: 64, offset: 640)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1387, file: !334, line: 2314, baseType: !1417, size: 64, offset: 704)
!1417 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !334, line: 2309, size: 64, elements: !1418)
!1418 = !{!1419, !1420, !1421}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1417, file: !334, line: 2310, baseType: !771, size: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1417, file: !334, line: 2311, baseType: !799, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1417, file: !334, line: 2312, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64)
!1423 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !334, line: 2277, flags: DIFlagFwdDecl)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1387, file: !334, line: 2315, baseType: !894, size: 64, offset: 768)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1387, file: !334, line: 2316, baseType: !894, size: 64, offset: 832)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1387, file: !334, line: 2317, baseType: !894, size: 64, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1387, file: !334, line: 2318, baseType: !894, size: 64, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1387, file: !334, line: 2319, baseType: !894, size: 64, offset: 1024)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1387, file: !334, line: 2320, baseType: !894, size: 64, offset: 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1387, file: !334, line: 2321, baseType: !894, size: 64, offset: 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1387, file: !334, line: 2322, baseType: !894, size: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1387, file: !334, line: 2324, baseType: !1433, size: 64, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !334, line: 2324, flags: DIFlagFwdDecl)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !896, file: !334, line: 3395, baseType: !1436, size: 320)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !334, line: 1469, size: 320, elements: !1437)
!1437 = !{!1438, !1439, !1440}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1436, file: !334, line: 1470, baseType: !932, size: 192)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1436, file: !334, line: 1471, baseType: !894, size: 64, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1436, file: !334, line: 1472, baseType: !894, size: 64, offset: 256)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !896, file: !334, line: 3396, baseType: !1442, size: 320)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !334, line: 1482, size: 320, elements: !1443)
!1443 = !{!1444, !1445, !1446}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1442, file: !334, line: 1483, baseType: !932, size: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1442, file: !334, line: 1484, baseType: !771, size: 32, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1442, file: !334, line: 1485, baseType: !1447, size: 64, offset: 256)
!1447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 64, elements: !811)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !896, file: !334, line: 3397, baseType: !1449, size: 384)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !334, line: 1829, size: 384, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1449, file: !334, line: 1830, baseType: !932, size: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1449, file: !334, line: 1831, baseType: !1015, size: 32, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1449, file: !334, line: 1832, baseType: !894, size: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1449, file: !334, line: 1835, baseType: !1447, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !896, file: !334, line: 3398, baseType: !1456, size: 704)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !334, line: 1898, size: 704, elements: !1457)
!1457 = !{!1458, !1459, !1460, !1464, !1465, !1468}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1456, file: !334, line: 1899, baseType: !932, size: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1456, file: !334, line: 1902, baseType: !894, size: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1456, file: !334, line: 1905, baseType: !1461, size: 64, offset: 256)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !774, line: 58, baseType: !1462)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !774, line: 57, flags: DIFlagFwdDecl)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1456, file: !334, line: 1908, baseType: !7, size: 32, offset: 320)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1456, file: !334, line: 1911, baseType: !1466, size: 64, offset: 384)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !334, line: 1876, flags: DIFlagFwdDecl)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1456, file: !334, line: 1914, baseType: !1469, size: 256, offset: 448)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1470)
!1470 = !{!1471, !1473, !1474, !1479}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1469, file: !334, line: 1884, baseType: !1472, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1469, file: !334, line: 1885, baseType: !1472, size: 64, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1469, file: !334, line: 1891, baseType: !1475, size: 64, offset: 128)
!1475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1469, file: !334, line: 1891, size: 64, elements: !1476)
!1476 = !{!1477, !1478}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1475, file: !334, line: 1891, baseType: !1461, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1475, file: !334, line: 1891, baseType: !894, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1469, file: !334, line: 1892, baseType: !1480, size: 64, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !896, file: !334, line: 3399, baseType: !1482, size: 704)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !334, line: 2008, size: 704, elements: !1483)
!1483 = !{!1484, !1485, !1486, !1487, !1488, !1489, !1501, !1502, !1503, !1504, !1505}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1482, file: !334, line: 2009, baseType: !932, size: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1482, file: !334, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1482, file: !334, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1482, file: !334, line: 2014, baseType: !1015, size: 32, offset: 224)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1482, file: !334, line: 2016, baseType: !894, size: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1482, file: !334, line: 2017, baseType: !1490, size: 64, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1493)
!1493 = !{!1494}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1492, file: !334, line: 183, baseType: !1495, size: 128)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1497)
!1497 = !{!1498, !1499, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1496, file: !334, line: 182, baseType: !7, size: 32)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1496, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
