; ModuleID = 'cpp_directives-only.c'
source_filename = "cpp_directives-only.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }

!12 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !4, line: 158, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!19 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !4, line: 265, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !4, line: 262, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 57, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "./include/safe-ctype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!43 = !DIEnumerator(name: "_sch_isblank", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "_sch_iscntrl", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "_sch_isdigit", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "_sch_islower", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "_sch_isprint", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "_sch_ispunct", value: 32, isUnsigned: true)
!49 = !DIEnumerator(name: "_sch_isspace", value: 64, isUnsigned: true)
!50 = !DIEnumerator(name: "_sch_isupper", value: 128, isUnsigned: true)
!51 = !DIEnumerator(name: "_sch_isxdigit", value: 256, isUnsigned: true)
!52 = !DIEnumerator(name: "_sch_isidst", value: 512, isUnsigned: true)
!53 = !DIEnumerator(name: "_sch_isvsp", value: 1024, isUnsigned: true)
!54 = !DIEnumerator(name: "_sch_isnvsp", value: 2048, isUnsigned: true)
!55 = !DIEnumerator(name: "_sch_isalpha", value: 136, isUnsigned: true)
!56 = !DIEnumerator(name: "_sch_isalnum", value: 140, isUnsigned: true)
!57 = !DIEnumerator(name: "_sch_isidnum", value: 516, isUnsigned: true)
!58 = !DIEnumerator(name: "_sch_isgraph", value: 172, isUnsigned: true)
!59 = !DIEnumerator(name: "_sch_iscppsp", value: 3072, isUnsigned: true)
!60 = !DIEnumerator(name: "_sch_isbasic", value: 3088, isUnsigned: true)
!61 = !{!62}
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !{i32 7, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!67 = distinct !DISubprogram(name: "_cpp_preprocess_dir_only", scope: !1, file: !1, line: 39, type: !68, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !659)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !645}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !4, line: 31, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !73, line: 322, size: 10432, elements: !74)
!73 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !{!75, !161, !162, !179, !211, !212, !223, !224, !225, !334, !336, !340, !341, !342, !343, !344, !345, !346, !347, !348, !351, !352, !355, !356, !389, !390, !391, !394, !395, !396, !397, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !423, !424, !425, !428, !510, !536, !539, !540, !603, !610, !611, !618, !619, !620, !621, !624, !625, !638}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !72, file: !73, line: 325, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !4, line: 32, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !73, line: 249, size: 1536, elements: !79)
!79 = !{!80, !84, !85, !86, !87, !88, !95, !96, !97, !98, !100, !103, !104, !107, !108, !109, !110, !111, !112, !143}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !78, file: !73, line: 251, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !78, file: !73, line: 252, baseType: !81, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !78, file: !73, line: 253, baseType: !81, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !78, file: !73, line: 255, baseType: !81, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !78, file: !73, line: 256, baseType: !81, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !78, file: !73, line: 258, baseType: !89, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !73, line: 235, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !73, line: 236, size: 128, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !91, file: !73, line: 239, baseType: !81, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !73, line: 245, baseType: !5, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !78, file: !73, line: 259, baseType: !5, size: 32, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !78, file: !73, line: 260, baseType: !5, size: 32, offset: 416)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !78, file: !73, line: 261, baseType: !5, size: 32, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !73, line: 263, baseType: !99, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !78, file: !73, line: 267, baseType: !101, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !4, line: 42, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !78, file: !73, line: 271, baseType: !81, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !78, file: !73, line: 275, baseType: !105, size: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !73, line: 275, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !78, file: !73, line: 278, baseType: !83, size: 8, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !78, file: !73, line: 284, baseType: !5, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !78, file: !73, line: 289, baseType: !5, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !78, file: !73, line: 294, baseType: !5, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !78, file: !73, line: 298, baseType: !83, size: 8, offset: 784)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !78, file: !73, line: 302, baseType: !113, size: 512, offset: 832)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !4, line: 523, size: 512, elements: !114)
!114 = !{!115, !117, !120, !121, !122, !123, !124, !128, !134, !140}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !4, line: 526, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !4, line: 529, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !4, line: 530, baseType: !5, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !113, file: !4, line: 534, baseType: !83, size: 8, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !113, file: !4, line: 537, baseType: !83, size: 8, offset: 168)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !113, file: !4, line: 541, baseType: !118, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !113, file: !4, line: 545, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !113, file: !4, line: 551, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!118, !126, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !4, line: 39, baseType: !113)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !113, file: !4, line: 555, baseType: !135, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !136, line: 47, baseType: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !138, line: 148, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!139 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !113, file: !4, line: 556, baseType: !141, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !136, line: 59, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !138, line: 145, baseType: !139)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !78, file: !73, line: 306, baseType: !144, size: 192, offset: 1344)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !73, line: 47, size: 192, elements: !145)
!145 = !{!146, !158, !159}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !144, file: !73, line: 49, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !73, line: 45, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!83, !151, !81, !154, !156}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !152, line: 29, baseType: !153)
!152 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !155, line: 46, baseType: !139)
!155 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !73, line: 43, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !144, file: !73, line: 50, baseType: !151, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !144, file: !73, line: 51, baseType: !160, size: 32, offset: 128)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !72, file: !73, line: 328, baseType: !76, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !72, file: !73, line: 331, baseType: !163, size: 160, offset: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !73, line: 177, size: 160, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !163, file: !73, line: 180, baseType: !83, size: 8)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !163, file: !73, line: 185, baseType: !83, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !163, file: !73, line: 188, baseType: !83, size: 8, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !163, file: !73, line: 191, baseType: !83, size: 8, offset: 24)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !163, file: !73, line: 194, baseType: !83, size: 8, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !163, file: !73, line: 198, baseType: !83, size: 8, offset: 40)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !163, file: !73, line: 201, baseType: !83, size: 8, offset: 48)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !163, file: !73, line: 204, baseType: !83, size: 8, offset: 56)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !163, file: !73, line: 207, baseType: !83, size: 8, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !163, file: !73, line: 210, baseType: !83, size: 8, offset: 72)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !163, file: !73, line: 214, baseType: !83, size: 8, offset: 80)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !163, file: !73, line: 217, baseType: !5, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !163, file: !73, line: 220, baseType: !83, size: 8, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !163, file: !73, line: 223, baseType: !83, size: 8, offset: 136)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !72, file: !73, line: 334, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !182, line: 74, size: 448, elements: !183)
!182 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !{!184, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !181, file: !182, line: 75, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !182, line: 61, size: 192, elements: !187)
!187 = !{!188, !189, !191, !193, !194, !195, !196}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !186, file: !182, line: 62, baseType: !126, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !186, file: !182, line: 63, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !182, line: 39, baseType: !5)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !186, file: !182, line: 64, baseType: !192, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !182, line: 44, baseType: !5)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !186, file: !182, line: 65, baseType: !160, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !186, file: !182, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !186, file: !182, line: 68, baseType: !83, size: 8, offset: 168)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !186, file: !182, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !181, file: !182, line: 76, baseType: !5, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !181, file: !182, line: 77, baseType: !5, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !181, file: !182, line: 79, baseType: !5, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !181, file: !182, line: 84, baseType: !160, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !181, file: !182, line: 87, baseType: !5, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !181, file: !182, line: 90, baseType: !83, size: 8, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !181, file: !182, line: 93, baseType: !192, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !181, file: !182, line: 96, baseType: !192, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !181, file: !182, line: 100, baseType: !5, size: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !181, file: !182, line: 104, baseType: !207, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !182, line: 47, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!153, !153, !154}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !72, file: !73, line: 337, baseType: !192, size: 32, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !72, file: !73, line: 340, baseType: !213, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !73, line: 99, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !73, line: 100, size: 256, elements: !216)
!216 = !{!217, !219, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !73, line: 102, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !215, file: !73, line: 103, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !215, file: !73, line: 103, baseType: !220, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !215, file: !73, line: 103, baseType: !220, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !72, file: !73, line: 341, baseType: !213, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !72, file: !73, line: 342, baseType: !213, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !72, file: !73, line: 345, baseType: !226, size: 448, offset: 640)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !73, line: 142, size: 448, elements: !227)
!227 = !{!228, !231, !232, !331, !332, !333}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !73, line: 145, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !73, line: 141, baseType: !226)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !226, file: !73, line: 145, baseType: !229, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !226, file: !73, line: 164, baseType: !233, size: 128, offset: 128)
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !226, file: !73, line: 147, size: 128, elements: !234)
!234 = !{!235, !326}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !233, file: !73, line: 156, baseType: !236, size: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !73, line: 152, size: 128, elements: !237)
!237 = !{!238, !325}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !236, file: !73, line: 154, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !73, line: 121, size: 64, elements: !240)
!240 = !{!241, !323}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !239, file: !73, line: 123, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !4, line: 34, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !4, line: 212, size: 192, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !245, file: !4, line: 213, baseType: !192, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !4, line: 214, baseType: !5, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !245, file: !4, line: 215, baseType: !62, size: 16, offset: 48)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !245, file: !4, line: 237, baseType: !251, size: 128, offset: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !4, line: 217, size: 128, elements: !252)
!252 = !{!253, !311, !312, !317, !321, !322}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !251, file: !4, line: 220, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !4, line: 201, size: 64, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !254, file: !4, line: 207, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !4, line: 36, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !4, line: 644, size: 256, elements: !260)
!260 = !{!261, !268, !269, !270, !271, !272, !273}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !259, file: !4, line: 645, baseType: !262, size: 128)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !263, line: 31, size: 128, elements: !264)
!263 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !262, file: !263, line: 32, baseType: !81, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !263, line: 33, baseType: !5, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !262, file: !263, line: 34, baseType: !5, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !259, file: !4, line: 646, baseType: !5, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !259, file: !4, line: 647, baseType: !5, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !259, file: !4, line: 650, baseType: !83, size: 8, offset: 136)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !4, line: 651, baseType: !5, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !259, file: !4, line: 652, baseType: !5, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !259, file: !4, line: 654, baseType: !274, size: 64, offset: 192)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !4, line: 633, size: 64, elements: !275)
!275 = !{!276, !299, !309, !310}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !274, file: !4, line: 635, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !4, line: 37, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !280, line: 36, size: 256, elements: !281)
!280 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !284, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !279, file: !280, line: 42, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !279, file: !280, line: 51, baseType: !285, size: 64, offset: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !280, line: 47, size: 64, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !285, file: !280, line: 49, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !285, file: !280, line: 50, baseType: !81, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !279, file: !280, line: 54, baseType: !192, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !279, file: !280, line: 57, baseType: !5, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !279, file: !280, line: 60, baseType: !62, size: 16, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !279, file: !280, line: 63, baseType: !5, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !279, file: !280, line: 66, baseType: !5, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !279, file: !280, line: 69, baseType: !5, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !279, file: !280, line: 72, baseType: !5, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !279, file: !280, line: 75, baseType: !5, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !279, file: !280, line: 80, baseType: !5, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !274, file: !4, line: 637, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !280, line: 28, size: 320, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !280, line: 29, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !301, file: !280, line: 30, baseType: !5, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !301, file: !280, line: 31, baseType: !306, size: 192, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 1)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !274, file: !4, line: 639, baseType: !3, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !274, file: !4, line: 641, baseType: !62, size: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !251, file: !4, line: 223, baseType: !288, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !251, file: !4, line: 226, baseType: !313, size: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !4, line: 162, size: 128, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !313, file: !4, line: 163, baseType: !5, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !313, file: !4, line: 164, baseType: !81, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !251, file: !4, line: 229, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !4, line: 195, size: 32, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !318, file: !4, line: 197, baseType: !5, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !251, file: !4, line: 233, baseType: !5, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !251, file: !4, line: 236, baseType: !5, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !239, file: !73, line: 124, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !236, file: !73, line: 155, baseType: !239, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !233, file: !73, line: 163, baseType: !327, size: 128)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !233, file: !73, line: 159, size: 128, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !327, file: !73, line: 161, baseType: !81, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !327, file: !73, line: 162, baseType: !81, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !226, file: !73, line: 168, baseType: !213, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !226, file: !73, line: 171, baseType: !257, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !226, file: !73, line: 174, baseType: !83, size: 8, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !72, file: !73, line: 346, baseType: !335, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !72, file: !73, line: 349, baseType: !337, size: 64, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !73, line: 40, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !72, file: !73, line: 352, baseType: !244, size: 192, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !72, file: !73, line: 356, baseType: !192, size: 32, offset: 1408)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !72, file: !73, line: 360, baseType: !83, size: 8, offset: 1440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !72, file: !73, line: 363, baseType: !116, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !72, file: !73, line: 364, baseType: !116, size: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !72, file: !73, line: 365, baseType: !113, size: 512, offset: 1600)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !72, file: !73, line: 368, baseType: !101, size: 64, offset: 2112)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !72, file: !73, line: 370, baseType: !101, size: 64, offset: 2176)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !72, file: !73, line: 373, baseType: !349, size: 64, offset: 2240)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !73, line: 373, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !72, file: !73, line: 374, baseType: !349, size: 64, offset: 2304)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !72, file: !73, line: 375, baseType: !353, size: 64, offset: 2368)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !73, line: 375, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !72, file: !73, line: 378, baseType: !349, size: 64, offset: 2432)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !72, file: !73, line: 379, baseType: !357, size: 704, offset: 2496)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !358, line: 164, size: 704, elements: !359)
!358 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !{!360, !362, !372, !373, !374, !375, !376, !377, !381, !385, !386, !387, !388}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !357, file: !358, line: 166, baseType: !361, size: 64)
!361 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !357, file: !358, line: 167, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !358, line: 157, size: 192, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !364, file: !358, line: 159, baseType: !118, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !364, file: !358, line: 160, baseType: !363, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !364, file: !358, line: 161, baseType: !369, size: 32, offset: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !357, file: !358, line: 168, baseType: !118, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !357, file: !358, line: 169, baseType: !118, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !357, file: !358, line: 170, baseType: !118, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !357, file: !358, line: 171, baseType: !361, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !357, file: !358, line: 172, baseType: !160, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !357, file: !358, line: 176, baseType: !378, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!363, !153, !361}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !357, file: !358, line: 177, baseType: !382, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !153, !363}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !357, file: !358, line: 178, baseType: !153, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !357, file: !358, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !357, file: !358, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !357, file: !358, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !72, file: !73, line: 383, baseType: !83, size: 8, offset: 3200)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !72, file: !73, line: 387, baseType: !83, size: 8, offset: 3208)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !72, file: !73, line: 390, baseType: !392, size: 64, offset: 3264)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !72, file: !73, line: 391, baseType: !392, size: 64, offset: 3328)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !72, file: !73, line: 392, baseType: !83, size: 8, offset: 3392)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !72, file: !73, line: 395, baseType: !288, size: 64, offset: 3456)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !72, file: !73, line: 396, baseType: !398, size: 256, offset: 3520)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !73, line: 128, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !73, line: 129, size: 256, elements: !400)
!400 = !{!401, !403, !404, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !73, line: 131, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !73, line: 131, baseType: !402, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !399, file: !73, line: 132, baseType: !288, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !399, file: !73, line: 132, baseType: !288, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !72, file: !73, line: 396, baseType: !402, size: 64, offset: 3776)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !72, file: !73, line: 397, baseType: !5, size: 32, offset: 3840)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !72, file: !73, line: 400, baseType: !5, size: 32, offset: 3872)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !72, file: !73, line: 403, baseType: !220, size: 64, offset: 3904)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !72, file: !73, line: 404, baseType: !5, size: 32, offset: 3968)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !72, file: !73, line: 408, baseType: !144, size: 192, offset: 4032)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !72, file: !73, line: 412, baseType: !144, size: 192, offset: 4224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !72, file: !73, line: 416, baseType: !144, size: 192, offset: 4416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !72, file: !73, line: 420, baseType: !144, size: 192, offset: 4608)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !72, file: !73, line: 424, baseType: !144, size: 192, offset: 4800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !72, file: !73, line: 427, baseType: !81, size: 64, offset: 4992)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !72, file: !73, line: 428, baseType: !81, size: 64, offset: 5056)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !72, file: !73, line: 431, baseType: !244, size: 192, offset: 5120)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !72, file: !73, line: 432, baseType: !244, size: 192, offset: 5312)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !72, file: !73, line: 435, baseType: !421, size: 64, offset: 5504)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !4, line: 685, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !72, file: !73, line: 439, baseType: !357, size: 704, offset: 5568)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !72, file: !73, line: 443, baseType: !357, size: 704, offset: 6272)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !72, file: !73, line: 447, baseType: !426, size: 64, offset: 6976)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !73, line: 447, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !72, file: !73, line: 450, baseType: !429, size: 1088, offset: 7040)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !4, line: 472, size: 1088, elements: !430)
!430 = !{!431, !435, !441, !445, !449, !453, !454, !461, !465, !469, !473, !479, !483, !500, !501, !502, !506}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !429, file: !4, line: 475, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !70, !242, !160}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !429, file: !4, line: 481, baseType: !436, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !70, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !429, file: !4, line: 483, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !70, !126}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !429, file: !4, line: 484, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !70, !5, !81, !126, !160, !324}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !429, file: !4, line: 486, baseType: !450, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !70, !5, !257}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !429, file: !4, line: 487, baseType: !450, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !429, file: !4, line: 488, baseType: !455, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !70, !5, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !4, line: 35, baseType: !313)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !429, file: !4, line: 489, baseType: !462, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !70, !5}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !429, file: !4, line: 490, baseType: !466, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!160, !70, !126, !160}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !429, file: !4, line: 491, baseType: !470, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !70, !126, !160, !126}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !429, file: !4, line: 492, baseType: !474, size: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !4, line: 469, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!126, !70, !126, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !429, file: !4, line: 496, baseType: !480, size: 64, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!257, !70, !242}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !429, file: !4, line: 500, baseType: !484, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!83, !70, !160, !192, !5, !126, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !489, line: 52, baseType: !490)
!489 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !491, line: 32, baseType: !492)
!491 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 192, elements: !307)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !494, file: !1, baseType: !5, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !494, file: !1, baseType: !5, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !494, file: !1, baseType: !153, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !494, file: !1, baseType: !153, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !429, file: !4, line: 506, baseType: !450, size: 64, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !429, file: !4, line: 507, baseType: !450, size: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !429, file: !4, line: 510, baseType: !503, size: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !70}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !429, file: !4, line: 513, baseType: !507, size: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !70, !192, !257}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !72, file: !73, line: 453, baseType: !511, size: 64, offset: 8128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !263, line: 46, size: 1152, elements: !513)
!513 = !{!514, !515, !519, !525, !529, !530, !531, !533, !534, !535}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !512, file: !263, line: 49, baseType: !357, size: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !512, file: !263, line: 51, baseType: !516, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !263, line: 41, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !512, file: !263, line: 53, baseType: !520, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!517, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !263, line: 40, baseType: !512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !512, file: !263, line: 56, baseType: !526, size: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!153, !154}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !512, file: !263, line: 58, baseType: !5, size: 32, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !512, file: !263, line: 59, baseType: !5, size: 32, offset: 928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !512, file: !263, line: 62, baseType: !532, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !512, file: !263, line: 65, baseType: !5, size: 32, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !512, file: !263, line: 66, baseType: !5, size: 32, offset: 1056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !512, file: !263, line: 69, baseType: !83, size: 8, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !72, file: !73, line: 456, baseType: !537, size: 64, offset: 8192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !73, line: 42, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !72, file: !73, line: 456, baseType: !537, size: 64, offset: 8256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !72, file: !73, line: 459, baseType: !541, size: 1024, offset: 8320)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !4, line: 279, size: 1024, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !541, file: !4, line: 282, baseType: !5, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !541, file: !4, line: 285, baseType: !17, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !541, file: !4, line: 288, baseType: !83, size: 8, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !541, file: !4, line: 291, baseType: !83, size: 8, offset: 72)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !541, file: !4, line: 296, baseType: !83, size: 8, offset: 80)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !541, file: !4, line: 299, baseType: !83, size: 8, offset: 88)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !541, file: !4, line: 303, baseType: !83, size: 8, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !541, file: !4, line: 306, baseType: !83, size: 8, offset: 104)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !541, file: !4, line: 309, baseType: !83, size: 8, offset: 112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !541, file: !4, line: 312, baseType: !83, size: 8, offset: 120)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !541, file: !4, line: 315, baseType: !83, size: 8, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !541, file: !4, line: 318, baseType: !83, size: 8, offset: 136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !541, file: !4, line: 321, baseType: !83, size: 8, offset: 144)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !541, file: !4, line: 324, baseType: !83, size: 8, offset: 152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !541, file: !4, line: 328, baseType: !83, size: 8, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !541, file: !4, line: 331, baseType: !83, size: 8, offset: 168)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !541, file: !4, line: 334, baseType: !83, size: 8, offset: 176)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !541, file: !4, line: 338, baseType: !83, size: 8, offset: 184)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !541, file: !4, line: 341, baseType: !83, size: 8, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !541, file: !4, line: 344, baseType: !83, size: 8, offset: 200)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !541, file: !4, line: 348, baseType: !83, size: 8, offset: 208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !541, file: !4, line: 352, baseType: !83, size: 8, offset: 216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !541, file: !4, line: 356, baseType: !83, size: 8, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !541, file: !4, line: 360, baseType: !83, size: 8, offset: 232)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !541, file: !4, line: 363, baseType: !83, size: 8, offset: 240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !541, file: !4, line: 366, baseType: !83, size: 8, offset: 248)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !541, file: !4, line: 370, baseType: !83, size: 8, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !541, file: !4, line: 373, baseType: !83, size: 8, offset: 264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !541, file: !4, line: 376, baseType: !83, size: 8, offset: 272)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !541, file: !4, line: 379, baseType: !83, size: 8, offset: 280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !541, file: !4, line: 382, baseType: !83, size: 8, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !541, file: !4, line: 385, baseType: !83, size: 8, offset: 296)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !541, file: !4, line: 389, baseType: !83, size: 8, offset: 304)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !541, file: !4, line: 392, baseType: !83, size: 8, offset: 312)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !541, file: !4, line: 395, baseType: !83, size: 8, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !541, file: !4, line: 398, baseType: !83, size: 8, offset: 328)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !541, file: !4, line: 401, baseType: !83, size: 8, offset: 336)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !541, file: !4, line: 404, baseType: !126, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !541, file: !4, line: 407, baseType: !126, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !541, file: !4, line: 410, baseType: !126, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !541, file: !4, line: 414, baseType: !29, size: 32, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !541, file: !4, line: 417, baseType: !83, size: 8, offset: 608)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !541, file: !4, line: 420, baseType: !83, size: 8, offset: 616)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !541, file: !4, line: 441, baseType: !587, size: 64, offset: 640)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !4, line: 423, size: 64, elements: !588)
!588 = !{!589, !590, !591, !592, !593}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !587, file: !4, line: 426, baseType: !35, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !587, file: !4, line: 429, baseType: !83, size: 8, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !587, file: !4, line: 433, baseType: !83, size: 8, offset: 40)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !587, file: !4, line: 436, baseType: !83, size: 8, offset: 48)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !587, file: !4, line: 440, baseType: !83, size: 8, offset: 56)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !541, file: !4, line: 447, baseType: !154, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !541, file: !4, line: 447, baseType: !154, size: 64, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !541, file: !4, line: 447, baseType: !154, size: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !541, file: !4, line: 447, baseType: !154, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !541, file: !4, line: 450, baseType: !83, size: 8, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !541, file: !4, line: 450, baseType: !83, size: 8, offset: 968)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !541, file: !4, line: 454, baseType: !83, size: 8, offset: 976)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !541, file: !4, line: 457, baseType: !83, size: 8, offset: 984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !541, file: !4, line: 460, baseType: !83, size: 8, offset: 992)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !72, file: !73, line: 463, baseType: !604, size: 256, offset: 9344)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !73, line: 227, size: 256, elements: !605)
!605 = !{!606, !607, !608, !609}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !604, file: !73, line: 229, baseType: !257, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !604, file: !73, line: 230, baseType: !257, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !604, file: !73, line: 231, baseType: !257, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !604, file: !73, line: 232, baseType: !257, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !72, file: !73, line: 466, baseType: !83, size: 8, offset: 9600)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !72, file: !73, line: 475, baseType: !612, size: 256, offset: 9664)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !73, line: 469, size: 256, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !612, file: !73, line: 471, baseType: !220, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !612, file: !73, line: 472, baseType: !220, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !612, file: !73, line: 473, baseType: !220, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !612, file: !73, line: 474, baseType: !192, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !72, file: !73, line: 478, baseType: !81, size: 64, offset: 9920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !72, file: !73, line: 478, baseType: !81, size: 64, offset: 9984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !72, file: !73, line: 478, baseType: !81, size: 64, offset: 10048)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !72, file: !73, line: 482, baseType: !622, size: 64, offset: 10112)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !73, line: 482, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !72, file: !73, line: 485, baseType: !5, size: 32, offset: 10176)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !72, file: !73, line: 488, baseType: !626, size: 128, offset: 10240)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !4, line: 901, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 891, size: 128, elements: !628)
!628 = !{!629, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !627, file: !4, line: 894, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !4, line: 887, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 880, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !632, file: !4, line: 883, baseType: !118, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !632, file: !4, line: 886, baseType: !192, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !627, file: !4, line: 897, baseType: !160, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !627, file: !4, line: 900, baseType: !160, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !72, file: !73, line: 491, baseType: !639, size: 64, offset: 10368)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !73, line: 310, size: 192, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !73, line: 312, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !73, line: 314, baseType: !118, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !640, file: !73, line: 316, baseType: !277, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_dir_only_callbacks", file: !73, line: 612, size: 128, elements: !648)
!648 = !{!649, !655}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "print_lines", scope: !647, file: !73, line: 615, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !160, !653, !154}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_print_line", scope: !647, file: !73, line: 616, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !192}
!659 = !{}
!660 = !DILocalVariable(name: "pfile", arg: 1, scope: !67, file: !1, line: 39, type: !70)
!661 = !DILocation(line: 39, column: 39, scope: !67)
!662 = !DILocalVariable(name: "cb", arg: 2, scope: !67, file: !1, line: 40, type: !645)
!663 = !DILocation(line: 40, column: 44, scope: !67)
!664 = !DILocalVariable(name: "buffer", scope: !67, file: !1, line: 42, type: !99)
!665 = !DILocation(line: 42, column: 22, scope: !67)
!666 = !DILocalVariable(name: "cur", scope: !67, file: !1, line: 43, type: !81)
!667 = !DILocation(line: 43, column: 24, scope: !67)
!668 = !DILocalVariable(name: "base", scope: !67, file: !1, line: 43, type: !81)
!669 = !DILocation(line: 43, column: 30, scope: !67)
!670 = !DILocalVariable(name: "next_line", scope: !67, file: !1, line: 43, type: !81)
!671 = !DILocation(line: 43, column: 37, scope: !67)
!672 = !DILocalVariable(name: "rlimit", scope: !67, file: !1, line: 43, type: !81)
!673 = !DILocation(line: 43, column: 49, scope: !67)
!674 = !DILocalVariable(name: "c", scope: !67, file: !1, line: 44, type: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "cppchar_t", file: !4, line: 258, baseType: !5)
!676 = !DILocation(line: 44, column: 13, scope: !67)
!677 = !DILocalVariable(name: "last_c", scope: !67, file: !1, line: 44, type: !675)
!678 = !DILocation(line: 44, column: 16, scope: !67)
!679 = !DILocalVariable(name: "flags", scope: !67, file: !1, line: 45, type: !5)
!680 = !DILocation(line: 45, column: 12, scope: !67)
!681 = !DILocalVariable(name: "lines", scope: !67, file: !1, line: 46, type: !190)
!682 = !DILocation(line: 46, column: 16, scope: !67)
!683 = !DILocalVariable(name: "col", scope: !67, file: !1, line: 47, type: !160)
!684 = !DILocation(line: 47, column: 7, scope: !67)
!685 = !DILocalVariable(name: "loc", scope: !67, file: !1, line: 48, type: !192)
!686 = !DILocation(line: 48, column: 19, scope: !67)
!687 = !DILocation(line: 48, column: 3, scope: !67)
!688 = !DILabel(scope: !67, name: "restart", file: !1, line: 50)
!689 = !DILocation(line: 50, column: 2, scope: !67)
!690 = !DILocation(line: 52, column: 12, scope: !67)
!691 = !DILocation(line: 52, column: 19, scope: !67)
!692 = !DILocation(line: 52, column: 10, scope: !67)
!693 = !DILocation(line: 53, column: 22, scope: !67)
!694 = !DILocation(line: 53, column: 30, scope: !67)
!695 = !DILocation(line: 53, column: 41, scope: !67)
!696 = !DILocation(line: 53, column: 3, scope: !67)
!697 = !DILocation(line: 53, column: 11, scope: !67)
!698 = !DILocation(line: 53, column: 20, scope: !67)
!699 = !DILocation(line: 54, column: 37, scope: !67)
!700 = !DILocation(line: 54, column: 45, scope: !67)
!701 = !DILocation(line: 54, column: 17, scope: !67)
!702 = !DILocation(line: 54, column: 25, scope: !67)
!703 = !DILocation(line: 54, column: 35, scope: !67)
!704 = !DILocation(line: 54, column: 3, scope: !67)
!705 = !DILocation(line: 54, column: 11, scope: !67)
!706 = !DILocation(line: 54, column: 15, scope: !67)
!707 = !DILocation(line: 55, column: 3, scope: !67)
!708 = !DILocation(line: 55, column: 11, scope: !67)
!709 = !DILocation(line: 55, column: 21, scope: !67)
!710 = !DILocation(line: 58, column: 9, scope: !67)
!711 = !DILocation(line: 58, column: 16, scope: !67)
!712 = !DILocation(line: 58, column: 28, scope: !67)
!713 = !DILocation(line: 58, column: 7, scope: !67)
!714 = !DILocation(line: 61, column: 28, scope: !67)
!715 = !DILocation(line: 61, column: 36, scope: !67)
!716 = !DILocation(line: 61, column: 26, scope: !67)
!717 = !DILocation(line: 61, column: 19, scope: !67)
!718 = !DILocation(line: 61, column: 13, scope: !67)
!719 = !DILocation(line: 62, column: 12, scope: !67)
!720 = !DILocation(line: 62, column: 20, scope: !67)
!721 = !DILocation(line: 62, column: 10, scope: !67)
