; ModuleID = 'tree-ssa-loop-ch.c'
source_filename = "tree-ssa-loop-ch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!631 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!632 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!633 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!634 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "li_flags", file: !561, line: 498, baseType: !7, size: 32, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIEnumerator(name: "LI_INCLUDE_ROOT", value: 1, isUnsigned: true)
!638 = !DIEnumerator(name: "LI_FROM_INNERMOST", value: 2, isUnsigned: true)
!639 = !DIEnumerator(name: "LI_ONLY_INNERMOST", value: 4, isUnsigned: true)
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !318, line: 295, baseType: !7, size: 32, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!642 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!643 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!644 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!645 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!646 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!647 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!648 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!649 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!650 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!651 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!652 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!653 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !584, line: 80, baseType: !7, size: 32, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!659 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !584, line: 727, baseType: !7, size: 32, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!662 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!663 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!664 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!665 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!666 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!667 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!668 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!669 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!670 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!671 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!672 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!673 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!674 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!675 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!676 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!677 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!678 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!679 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!680 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!681 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!682 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!683 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!684 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!685 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!686 = !{!687, !847, !1030, !2080, !1410, !7, !366, !654, !727, !2093, !751, !1374, !1015}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !689, line: 111, baseType: !690)
!689 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !692)
!692 = !{!693, !2047, !2048, !2049, !2050, !2054, !2055, !2056, !2074, !2075, !2076, !2077, !2078, !2079}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !691, file: !318, line: 219, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !318, line: 151, baseType: !699, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !700, file: !318, line: 150, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !700, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !700, file: !318, line: 150, baseType: !705, size: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !851)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !689, line: 108, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !709)
!709 = !{!710, !711, !712, !2039, !2040, !2041, !2042, !2043, !2044, !2045}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !708, file: !318, line: 124, baseType: !690, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !708, file: !318, line: 125, baseType: !690, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !708, file: !318, line: 131, baseType: !713, size: 64, offset: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !714)
!714 = !{!715, !2038}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !713, file: !318, line: 129, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !689, line: 66, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !584, line: 143, size: 192, elements: !719)
!719 = !{!720, !2036, !2037}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !718, file: !584, line: 145, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !689, line: 69, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !584, line: 136, size: 192, elements: !724)
!724 = !{!725, !2034, !2035}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !723, file: !584, line: 137, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !689, line: 58, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !584, line: 737, size: 768, elements: !729)
!729 = !{!730, !1881, !1891, !1897, !1902, !1907, !1914, !1920, !1926, !1931, !1945, !1950, !1956, !1961, !1971, !1976, !1992, !1999, !2006, !2012, !2017, !2023, !2029}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !728, file: !584, line: 738, baseType: !731, size: 256)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !584, line: 271, size: 256, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !748, !749, !750}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !731, file: !584, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !731, file: !584, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !731, file: !584, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !731, file: !584, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !731, file: !584, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !731, file: !584, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !731, file: !584, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !731, file: !584, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !731, file: !584, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !731, file: !584, line: 312, baseType: !7, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !731, file: !584, line: 316, baseType: !744, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !745, line: 58, baseType: !746)
!745 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !747, line: 44, baseType: !7)
!747 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!748 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !731, file: !584, line: 319, baseType: !7, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !731, file: !584, line: 323, baseType: !690, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !731, file: !584, line: 327, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !689, line: 56, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !754)
!754 = !{!755, !788, !794, !807, !826, !837, !842, !853, !859, !873, !881, !919, !1131, !1159, !1176, !1177, !1182, !1191, !1197, !1202, !1206, !1210, !1532, !1579, !1585, !1591, !1598, !1611, !1625, !1642, !1654, !1676, !1691, !1863}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !334, line: 3372, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !756, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !756, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !756, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !756, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !756, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !756, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !756, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !756, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !756, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !756, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !756, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !756, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !756, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !756, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !756, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !756, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !756, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !756, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !756, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !756, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !756, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !756, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !756, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !756, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !756, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !756, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !756, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !756, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !756, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !756, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !334, line: 3373, baseType: !789, size: 192)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !789, file: !334, line: 403, baseType: !756, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !789, file: !334, line: 404, baseType: !751, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !789, file: !334, line: 405, baseType: !751, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !753, file: !334, line: 3374, baseType: !795, size: 320)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !334, line: 1385, baseType: !789, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !795, file: !334, line: 1386, baseType: !799, size: 128, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !800, line: 58, baseType: !801)
!800 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 54, size: 128, elements: !802)
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !801, file: !800, line: 56, baseType: !804, size: 64)
!804 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !801, file: !800, line: 57, baseType: !806, size: 64, offset: 64)
!806 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !753, file: !334, line: 3375, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !334, line: 1398, baseType: !789, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !808, file: !334, line: 1399, baseType: !812, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !814, line: 52, size: 256, elements: !815)
!814 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!815 = !{!816, !817, !818, !819, !820, !821, !822}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !813, file: !814, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !813, file: !814, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !813, file: !814, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !813, file: !814, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !813, file: !814, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !813, file: !814, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !813, file: !814, line: 62, baseType: !823, size: 192, offset: 64)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 192, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 3)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !753, file: !334, line: 3376, baseType: !827, size: 256)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !334, line: 1409, baseType: !789, size: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !827, file: !334, line: 1410, baseType: !831, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !833, line: 27, size: 192, elements: !834)
!833 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !832, file: !833, line: 29, baseType: !799, size: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !832, file: !833, line: 30, baseType: !189, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !753, file: !334, line: 3377, baseType: !838, size: 256)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !334, line: 1438, baseType: !789, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !838, file: !334, line: 1439, baseType: !751, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !753, file: !334, line: 3378, baseType: !843, size: 256)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !844)
!844 = !{!845, !846, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !334, line: 1419, baseType: !789, size: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !843, file: !334, line: 1420, baseType: !847, size: 32, offset: 192)
!847 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !843, file: !334, line: 1421, baseType: !849, size: 8, offset: 224)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 8, elements: !851)
!850 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!851 = !{!852}
!852 = !DISubrange(count: 1)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !753, file: !334, line: 3379, baseType: !854, size: 320)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !334, line: 1429, baseType: !789, size: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !854, file: !334, line: 1430, baseType: !751, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !854, file: !334, line: 1431, baseType: !751, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !753, file: !334, line: 3380, baseType: !860, size: 320)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !334, line: 1461, baseType: !789, size: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !860, file: !334, line: 1462, baseType: !864, size: 128, offset: 192)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !865, line: 31, size: 128, elements: !866)
!865 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!866 = !{!867, !871, !872}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !864, file: !865, line: 32, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !864, file: !865, line: 33, baseType: !7, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !864, file: !865, line: 34, baseType: !7, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !753, file: !334, line: 3381, baseType: !874, size: 384)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !875)
!875 = !{!876, !877, !878, !879, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !334, line: 2508, baseType: !789, size: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !874, file: !334, line: 2509, baseType: !744, size: 32, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !874, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !334, line: 2511, baseType: !751, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !874, file: !334, line: 2512, baseType: !751, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !753, file: !334, line: 3382, baseType: !882, size: 896)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !334, line: 2653, baseType: !874, size: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !334, line: 2654, baseType: !751, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !882, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !882, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !882, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !882, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !882, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !882, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !882, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !882, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !882, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !882, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !882, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !882, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !882, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !882, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !882, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !882, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !882, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !882, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !882, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !882, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !882, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !882, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !882, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !882, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !882, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !882, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !882, file: !334, line: 2705, baseType: !751, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !882, file: !334, line: 2706, baseType: !751, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !882, file: !334, line: 2707, baseType: !751, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !882, file: !334, line: 2708, baseType: !751, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !882, file: !334, line: 2711, baseType: !917, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !753, file: !334, line: 3383, baseType: !920, size: 960)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !334, line: 2757, baseType: !882, size: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !920, file: !334, line: 2758, baseType: !924, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !689, line: 50, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !927, line: 240, size: 384, elements: !928)
!927 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !926, file: !927, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !926, file: !927, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !926, file: !927, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !926, file: !927, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !926, file: !927, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !926, file: !927, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !926, file: !927, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !926, file: !927, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !926, file: !927, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !926, file: !927, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !926, file: !927, line: 321, baseType: !940, size: 320, offset: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !927, line: 315, size: 320, elements: !941)
!941 = !{!942, !1064, !1066, !1129, !1130}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !940, file: !927, line: 316, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 64, elements: !851)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !927, line: 183, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !927, line: 166, size: 64, elements: !946)
!946 = !{!947, !948, !949, !952, !953, !961, !962, !974, !977, !1039, !1040, !1041, !1054, !1061}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !945, file: !927, line: 168, baseType: !847, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !945, file: !927, line: 169, baseType: !7, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !945, file: !927, line: 170, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !945, file: !927, line: 171, baseType: !924, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !945, file: !927, line: 172, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !689, line: 53, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !927, line: 359, size: 128, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !956, file: !927, line: 360, baseType: !847, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !956, file: !927, line: 361, baseType: !960, size: 64, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 64, elements: !851)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !945, file: !927, line: 173, baseType: !189, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !945, file: !927, line: 174, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !927, line: 133, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !927, line: 115, size: 32, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !964, file: !927, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !964, file: !927, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !964, file: !927, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !964, file: !927, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !964, file: !927, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !964, file: !927, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !964, file: !927, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !964, file: !927, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !945, file: !927, line: 175, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !927, line: 175, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !945, file: !927, line: 176, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !980, line: 75, size: 256, elements: !981)
!980 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!981 = !{!982, !996, !997, !998}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !979, file: !980, line: 76, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !980, line: 68, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !980, line: 63, size: 320, elements: !986)
!986 = !{!987, !989, !990, !991}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !980, line: 64, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !980, line: 65, baseType: !988, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !985, file: !980, line: 66, baseType: !7, size: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !985, file: !980, line: 67, baseType: !992, size: 128, offset: 192)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 128, elements: !994)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !980, line: 29, baseType: !804)
!994 = !{!995}
!995 = !DISubrange(count: 2)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !979, file: !980, line: 77, baseType: !983, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !979, file: !980, line: 78, baseType: !7, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !979, file: !980, line: 79, baseType: !999, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !980, line: 49, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !980, line: 45, size: 832, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1001, file: !980, line: 46, baseType: !988, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1001, file: !980, line: 47, baseType: !978, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1001, file: !980, line: 48, baseType: !1006, size: 704, offset: 128)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1007, line: 164, size: 704, elements: !1008)
!1007 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1008 = !{!1009, !1010, !1021, !1022, !1023, !1024, !1025, !1026, !1031, !1035, !1036, !1037, !1038}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1006, file: !1007, line: 166, baseType: !806, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1006, file: !1007, line: 167, baseType: !1011, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1007, line: 157, size: 192, elements: !1013)
!1013 = !{!1014, !1016, !1017}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1012, file: !1007, line: 159, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1012, file: !1007, line: 160, baseType: !1011, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1012, file: !1007, line: 161, baseType: !1018, size: 32, offset: 128)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 32, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 4)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1006, file: !1007, line: 168, baseType: !1015, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1006, file: !1007, line: 169, baseType: !1015, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1006, file: !1007, line: 170, baseType: !1015, size: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1006, file: !1007, line: 171, baseType: !806, size: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1006, file: !1007, line: 172, baseType: !847, size: 32, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1006, file: !1007, line: 176, baseType: !1027, size: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1011, !1030, !806}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1006, file: !1007, line: 177, baseType: !1032, size: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !1030, !1011}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1006, file: !1007, line: 178, baseType: !1030, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1006, file: !1007, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1006, file: !1007, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1006, file: !1007, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !945, file: !927, line: 177, baseType: !751, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !945, file: !927, line: 178, baseType: !690, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !945, file: !927, line: 179, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !927, line: 150, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !927, line: 142, size: 320, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1052, !1053}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1044, file: !927, line: 144, baseType: !751, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1044, file: !927, line: 145, baseType: !924, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1044, file: !927, line: 146, baseType: !924, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1044, file: !927, line: 147, baseType: !1050, size: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1051, line: 31, baseType: !847)
!1051 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1044, file: !927, line: 148, baseType: !7, size: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1044, file: !927, line: 149, baseType: !870, size: 8, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !945, file: !927, line: 180, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !927, line: 162, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !927, line: 159, size: 128, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1057, file: !927, line: 160, baseType: !751, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1057, file: !927, line: 161, baseType: !806, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !945, file: !927, line: 181, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !927, line: 181, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !940, file: !927, line: 317, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 64, elements: !851)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !940, file: !927, line: 318, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !927, line: 188, size: 320, elements: !1068)
!1068 = !{!1069, !1071, !1128}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1067, file: !927, line: 190, baseType: !1070, size: 192)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 192, elements: !824)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1067, file: !927, line: 193, baseType: !1072, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !927, line: 206, size: 320, elements: !1074)
!1074 = !{!1075, !1113, !1114, !1115, !1127}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1073, file: !927, line: 208, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !689, line: 62, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1079, line: 538, size: 256, elements: !1080)
!1079 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1080 = !{!1081, !1085, !1091, !1104}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !1079, line: 539, baseType: !1082, size: 32)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1079, line: 482, size: 32, elements: !1083)
!1083 = !{!1084}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !1079, line: 484, baseType: !7, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1078, file: !1079, line: 540, baseType: !1086, size: 192)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1079, line: 488, size: 192, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !1079, line: 489, baseType: !1082, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1086, file: !1079, line: 492, baseType: !950, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1086, file: !1079, line: 496, baseType: !751, size: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1078, file: !1079, line: 541, baseType: !1092, size: 256)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1079, line: 504, size: 256, elements: !1093)
!1093 = !{!1094, !1095, !1102, !1103}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !1079, line: 505, baseType: !1082, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1092, file: !1079, line: 509, baseType: !1096, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1079, line: 501, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{null, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !1079, line: 510, baseType: !1100, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !1079, line: 513, baseType: !1076, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1078, file: !1079, line: 542, baseType: !1105, size: 128)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1079, line: 530, size: 128, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !1079, line: 531, baseType: !1082, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1105, file: !1079, line: 534, baseType: !1109, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1079, line: 525, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!870, !751, !950, !804, !804}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1073, file: !927, line: 211, baseType: !7, size: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1073, file: !927, line: 214, baseType: !806, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1073, file: !927, line: 224, baseType: !1116, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !927, line: 202, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !927, line: 202, size: 128, elements: !1119)
!1119 = !{!1120}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1118, file: !927, line: 202, baseType: !1121, size: 128)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !927, line: 200, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !927, line: 200, size: 128, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1122, file: !927, line: 200, baseType: !7, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1122, file: !927, line: 200, baseType: !7, size: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1122, file: !927, line: 200, baseType: !960, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1073, file: !927, line: 234, baseType: !1116, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1067, file: !927, line: 197, baseType: !806, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !940, file: !927, line: 319, baseType: !813, size: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !940, file: !927, line: 320, baseType: !832, size: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !753, file: !334, line: 3384, baseType: !1132, size: 1472)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1133)
!1133 = !{!1134, !1155, !1156, !1157, !1158}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !334, line: 3115, baseType: !1135, size: 1216)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !334, line: 2985, baseType: !920, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1135, file: !334, line: 2986, baseType: !751, size: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1135, file: !334, line: 2987, baseType: !751, size: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1135, file: !334, line: 2988, baseType: !751, size: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1135, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1135, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1135, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1135, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1135, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1135, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1135, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1135, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1135, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1135, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1135, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1135, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1135, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1135, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1132, file: !334, line: 3117, baseType: !751, size: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1132, file: !334, line: 3119, baseType: !751, size: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1132, file: !334, line: 3121, baseType: !751, size: 64, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1132, file: !334, line: 3123, baseType: !751, size: 64, offset: 1408)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !753, file: !334, line: 3385, baseType: !1160, size: 1088)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !334, line: 2875, baseType: !920, size: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1160, file: !334, line: 2876, baseType: !924, size: 64, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1160, file: !334, line: 2877, baseType: !1165, size: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1167, line: 172, size: 128, elements: !1168)
!1167 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1166, file: !1167, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1166, file: !1167, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1166, file: !1167, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1166, file: !1167, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1166, file: !1167, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1166, file: !1167, line: 195, baseType: !7, size: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1166, file: !1167, line: 199, baseType: !751, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !753, file: !334, line: 3386, baseType: !1135, size: 1216)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !753, file: !334, line: 3387, baseType: !1178, size: 1280)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1179)
!1179 = !{!1180, !1181}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1178, file: !334, line: 3094, baseType: !1135, size: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1178, file: !334, line: 3095, baseType: !1165, size: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !753, file: !334, line: 3388, baseType: !1183, size: 1216)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1183, file: !334, line: 2825, baseType: !882, size: 896)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1183, file: !334, line: 2827, baseType: !751, size: 64, offset: 896)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1183, file: !334, line: 2828, baseType: !751, size: 64, offset: 960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1183, file: !334, line: 2829, baseType: !751, size: 64, offset: 1024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1183, file: !334, line: 2830, baseType: !751, size: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1183, file: !334, line: 2831, baseType: !751, size: 64, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !753, file: !334, line: 3389, baseType: !1192, size: 1024)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !334, line: 2851, baseType: !920, size: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1192, file: !334, line: 2852, baseType: !847, size: 32, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1192, file: !334, line: 2853, baseType: !847, size: 32, offset: 992)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !753, file: !334, line: 3390, baseType: !1198, size: 1024)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !334, line: 2858, baseType: !920, size: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1198, file: !334, line: 2859, baseType: !1165, size: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !753, file: !334, line: 3391, baseType: !1203, size: 960)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1204)
!1204 = !{!1205}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1203, file: !334, line: 2863, baseType: !920, size: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !753, file: !334, line: 3392, baseType: !1207, size: 1472)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1207, file: !334, line: 3305, baseType: !1132, size: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !753, file: !334, line: 3393, baseType: !1211, size: 1792)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1212)
!1212 = !{!1213, !1214, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1211, file: !334, line: 3249, baseType: !1132, size: 1472)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1211, file: !334, line: 3251, baseType: !1215, size: 64, offset: 1472)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1217, line: 463, size: 1152, elements: !1218)
!1217 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1218 = !{!1219, !1222, !1252, !1253, !1392, !1455, !1456, !1457, !1458, !1459, !1460, !1484, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1216, file: !1217, line: 464, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1217, line: 464, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1216, file: !1217, line: 467, baseType: !1223, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1250, !1251}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1224, file: !318, line: 377, baseType: !688, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1224, file: !318, line: 378, baseType: !688, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1224, file: !318, line: 381, baseType: !1229, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1232)
!1232 = !{!1233}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1231, file: !318, line: 282, baseType: !1234, size: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !318, line: 281, baseType: !7, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1235, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1235, file: !318, line: 281, baseType: !1240, size: 64, offset: 64)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !851)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1224, file: !318, line: 384, baseType: !847, size: 32, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1224, file: !318, line: 387, baseType: !847, size: 32, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1224, file: !318, line: 390, baseType: !847, size: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1224, file: !318, line: 394, baseType: !1229, size: 64, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1224, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1224, file: !318, line: 399, baseType: !1247, size: 64, offset: 416)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !994)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1224, file: !318, line: 402, baseType: !1249, size: 64, offset: 480)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !994)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1224, file: !318, line: 406, baseType: !847, size: 32, offset: 544)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1224, file: !318, line: 409, baseType: !847, size: 32, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1216, file: !1217, line: 470, baseType: !717, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1216, file: !1217, line: 473, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1167, line: 39, size: 1152, elements: !1256)
!1256 = !{!1257, !1307, !1320, !1333, !1334, !1346, !1347, !1351, !1352, !1353, !1354, !1355}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1255, file: !1167, line: 41, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1259, line: 144, baseType: !1260)
!1259 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1259, line: 100, size: 896, elements: !1262)
!1262 = !{!1263, !1269, !1274, !1279, !1281, !1284, !1285, !1286, !1287, !1288, !1293, !1295, !1296, !1301, !1306}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1261, file: !1259, line: 102, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1259, line: 52, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!1268, !1100}
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1259, line: 47, baseType: !7)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1261, file: !1259, line: 105, baseType: !1270, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1259, line: 59, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!847, !1100, !1100}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1261, file: !1259, line: 108, baseType: !1275, size: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1259, line: 63, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1030}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1261, file: !1259, line: 111, baseType: !1280, size: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1261, file: !1259, line: 114, baseType: !1282, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1283, line: 46, baseType: !804)
!1283 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1261, file: !1259, line: 117, baseType: !1282, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1261, file: !1259, line: 120, baseType: !1282, size: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1261, file: !1259, line: 124, baseType: !7, size: 32, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1261, file: !1259, line: 128, baseType: !7, size: 32, offset: 480)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1261, file: !1259, line: 131, baseType: !1289, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1259, line: 75, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1030, !1282, !1282}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1261, file: !1259, line: 132, baseType: !1294, size: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1259, line: 78, baseType: !1276)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1261, file: !1259, line: 135, baseType: !1030, size: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1261, file: !1259, line: 136, baseType: !1297, size: 64, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1259, line: 82, baseType: !1298)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!1030, !1030, !1282, !1282}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1261, file: !1259, line: 137, baseType: !1302, size: 64, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1259, line: 83, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !1030, !1030}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1261, file: !1259, line: 141, baseType: !7, size: 32, offset: 832)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1255, file: !1167, line: 48, baseType: !1308, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !584, line: 35, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !584, line: 35, size: 128, elements: !1311)
!1311 = !{!1312}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1310, file: !584, line: 35, baseType: !1313, size: 128)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !584, line: 33, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !584, line: 33, size: 128, elements: !1315)
!1315 = !{!1316, !1317, !1318}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1314, file: !584, line: 33, baseType: !7, size: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1314, file: !584, line: 33, baseType: !7, size: 32, offset: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1314, file: !584, line: 33, baseType: !1319, size: 64, offset: 64)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 64, elements: !851)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1255, file: !1167, line: 51, baseType: !1321, size: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1324)
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1323, file: !334, line: 183, baseType: !1326, size: 128)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1328)
!1328 = !{!1329, !1330, !1331}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1327, file: !334, line: 182, baseType: !7, size: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1327, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1327, file: !334, line: 182, baseType: !1332, size: 64, offset: 64)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 64, elements: !851)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1255, file: !1167, line: 54, baseType: !751, size: 64, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1255, file: !1167, line: 57, baseType: !1335, size: 128, offset: 256)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1336, line: 31, size: 128, elements: !1337)
!1336 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1335, file: !1336, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1335, file: !1336, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1335, file: !1336, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1335, file: !1336, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1335, file: !1336, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1335, file: !1336, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1335, file: !1336, line: 56, baseType: !1345, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !689, line: 47, baseType: !978)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1255, file: !1167, line: 60, baseType: !1335, size: 128, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1255, file: !1167, line: 64, baseType: !1348, size: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1350, line: 33, flags: DIFlagFwdDecl)
!1350 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1255, file: !1167, line: 67, baseType: !751, size: 64, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1255, file: !1167, line: 73, baseType: !1258, size: 64, offset: 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1255, file: !1167, line: 77, baseType: !1345, size: 64, offset: 704)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1255, file: !1167, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1255, file: !1167, line: 82, baseType: !1356, size: 320, offset: 832)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1357, line: 62, size: 320, elements: !1358)
!1357 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1358 = !{!1359, !1365, !1366, !1367, !1368, !1375}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1356, file: !1357, line: 63, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1357, line: 56, size: 128, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1361, file: !1357, line: 57, baseType: !1360, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1361, file: !1357, line: 58, baseType: !849, size: 8, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1356, file: !1357, line: 64, baseType: !7, size: 32, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1356, file: !1357, line: 66, baseType: !7, size: 32, offset: 96)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1356, file: !1357, line: 68, baseType: !870, size: 8, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1356, file: !1357, line: 70, baseType: !1369, size: 64, offset: 192)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1357, line: 37, size: 128, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1370, file: !1357, line: 39, baseType: !1369, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1370, file: !1357, line: 40, baseType: !1374, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1356, file: !1357, line: 71, baseType: !1376, size: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1357, line: 45, size: 320, elements: !1378)
!1378 = !{!1379, !1380}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1377, file: !1357, line: 47, baseType: !1376, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1377, file: !1357, line: 48, baseType: !1381, size: 256, offset: 64)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1382)
!1382 = !{!1383, !1385, !1386, !1391}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1381, file: !334, line: 1884, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1381, file: !334, line: 1885, baseType: !1384, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1381, file: !334, line: 1891, baseType: !1387, size: 64, offset: 128)
!1387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1381, file: !334, line: 1891, size: 64, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1387, file: !334, line: 1891, baseType: !726, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1387, file: !334, line: 1891, baseType: !751, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1381, file: !334, line: 1892, baseType: !1374, size: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1216, file: !1217, line: 476, baseType: !1393, size: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !561, line: 187, size: 256, elements: !1395)
!1395 = !{!1396, !1397, !1453, !1454}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1394, file: !561, line: 189, baseType: !847, size: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1394, file: !561, line: 192, baseType: !1398, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !561, line: 87, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !561, line: 87, size: 128, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1400, file: !561, line: 87, baseType: !1403, size: 128)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !561, line: 85, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !561, line: 85, size: 128, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1404, file: !561, line: 85, baseType: !7, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1404, file: !561, line: 85, baseType: !7, size: 32, offset: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1404, file: !561, line: 85, baseType: !1409, size: 64, offset: 64)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 64, elements: !851)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !561, line: 84, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !561, line: 100, size: 1216, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1417, !1418, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1443, !1451, !1452}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1412, file: !561, line: 102, baseType: !847, size: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1412, file: !561, line: 105, baseType: !7, size: 32, offset: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1412, file: !561, line: 108, baseType: !690, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1412, file: !561, line: 111, baseType: !690, size: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1412, file: !561, line: 114, baseType: !1419, size: 64, offset: 192)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !561, line: 41, size: 64, elements: !1420)
!1420 = !{!1421, !1422}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1419, file: !561, line: 42, baseType: !560, size: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1419, file: !561, line: 43, baseType: !7, size: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1412, file: !561, line: 117, baseType: !7, size: 32, offset: 256)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1412, file: !561, line: 120, baseType: !7, size: 32, offset: 288)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1412, file: !561, line: 123, baseType: !1398, size: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1412, file: !561, line: 126, baseType: !1411, size: 64, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1412, file: !561, line: 129, baseType: !1411, size: 64, offset: 448)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1412, file: !561, line: 132, baseType: !1030, size: 64, offset: 512)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1412, file: !561, line: 139, baseType: !751, size: 64, offset: 576)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1412, file: !561, line: 143, baseType: !799, size: 128, offset: 640)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1412, file: !561, line: 146, baseType: !799, size: 128, offset: 768)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1412, file: !561, line: 148, baseType: !870, size: 8, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1412, file: !561, line: 149, baseType: !870, size: 8, offset: 904)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1412, file: !561, line: 153, baseType: !569, size: 32, offset: 928)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1412, file: !561, line: 156, baseType: !1436, size: 64, offset: 960)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !561, line: 48, size: 320, elements: !1438)
!1438 = !{!1439, !1440, !1441, !1442}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1437, file: !561, line: 50, baseType: !726, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1437, file: !561, line: 59, baseType: !799, size: 128, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1437, file: !561, line: 64, baseType: !870, size: 8, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1437, file: !561, line: 67, baseType: !1436, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1412, file: !561, line: 159, baseType: !1444, size: 64, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !561, line: 72, size: 256, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1445, file: !561, line: 74, baseType: !707, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1445, file: !561, line: 77, baseType: !1444, size: 64, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1445, file: !561, line: 78, baseType: !1444, size: 64, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1445, file: !561, line: 81, baseType: !1444, size: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1412, file: !561, line: 162, baseType: !870, size: 8, offset: 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1412, file: !561, line: 166, baseType: !751, size: 64, offset: 1152)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1394, file: !561, line: 197, baseType: !1258, size: 64, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1394, file: !561, line: 200, baseType: !1411, size: 64, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1216, file: !1217, line: 479, baseType: !1258, size: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1216, file: !1217, line: 484, baseType: !751, size: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1216, file: !1217, line: 488, baseType: !751, size: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1216, file: !1217, line: 493, baseType: !751, size: 64, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1216, file: !1217, line: 496, baseType: !751, size: 64, offset: 576)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1216, file: !1217, line: 501, baseType: !1461, size: 64, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1463)
!1463 = !{!1464, !1467, !1468, !1469, !1470, !1472, !1473, !1478, !1479, !1480, !1481, !1482, !1483}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1462, file: !329, line: 2356, baseType: !1465, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1462, file: !329, line: 2357, baseType: !950, size: 64, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1462, file: !329, line: 2358, baseType: !847, size: 32, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1462, file: !329, line: 2359, baseType: !847, size: 32, offset: 160)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1462, file: !329, line: 2360, baseType: !1471, size: 128, offset: 192)
