; ModuleID = 'dfp.c'
source_filename = "dfp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.real_format = type { {}*, void (%struct.real_format*, %struct.real_value*, i64*)*, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.real_value = type { i32, [3 x i64] }
%struct.decNumber = type { i32, i32, i8, [12 x i16] }
%struct.decContext = type { i32, i32, i32, i32, i32, i32, i8 }
%struct.decimal128 = type { [16 x i8] }
%struct.decimal32 = type { [4 x i8] }
%struct.decimal64 = type { [8 x i8] }

@decimal_quad_format = external dso_local constant %struct.real_format, align 8
@decimal_single_format = external dso_local constant %struct.real_format, align 8
@decimal_double_format = external dso_local constant %struct.real_format, align 8
@.str = private unnamed_addr constant [6 x i8] c"dfp.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"?\00", align 1
@real_format_for_mode = external dso_local global [7 x %struct.real_format*], align 16
@mode_class = external dso_local constant [87 x i8], align 16
@.str.2 = private unnamed_addr constant [12 x i8] c"9.999999E96\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"9.999999999999999E384\00", align 1
@.str.4 = private unnamed_addr constant [41 x i8] c"9.999999999999999999999999999999999E6144\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Infinity\00", align 1

!319 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!320 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!321 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!322 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!323 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!324 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!325 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!326 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!327 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!328 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!329 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!330 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!331 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!332 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!333 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!334 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!335 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!336 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!337 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!340 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!341 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!342 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!343 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!344 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!345 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!346 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!347 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!348 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!349 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!350 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!351 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!352 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!353 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!354 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!361 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!362 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!363 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!364 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!365 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!366 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!367 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!368 = !{!369, !384, !151, !5}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal128", file: !372, line: 64, baseType: !373)
!372 = !DIFile(filename: "./decimal128.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 62, size: 128, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !373, file: !372, line: 63, baseType: !376, size: 128)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 128, elements: !382)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !378, line: 24, baseType: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !380, line: 38, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!382 = !{!383}
!383 = !DISubrange(count: 16)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!385 = !{i32 7, !"Dwarf Version", i32 4}
!386 = !{i32 2, !"Debug Info Version", i32 3}
!387 = !{i32 1, !"wchar_size", i32 4}
!388 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!389 = distinct !DISubprogram(name: "decimal_real_from_string", scope: !1, file: !1, line: 76, type: !390, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392, !406}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !17, line: 52, size: 256, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !393, file: !17, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !393, file: !17, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !393, file: !17, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !393, file: !17, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !393, file: !17, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !393, file: !17, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !393, file: !17, line: 62, baseType: !402, size: 192, offset: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 192, elements: !404)
!403 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!404 = !{!405}
!405 = !DISubrange(count: 3)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!409 = !{}
!410 = !DILocalVariable(name: "r", arg: 1, scope: !389, file: !1, line: 76, type: !392)
!411 = !DILocation(line: 76, column: 44, scope: !389)
!412 = !DILocalVariable(name: "s", arg: 2, scope: !389, file: !1, line: 76, type: !406)
!413 = !DILocation(line: 76, column: 59, scope: !389)
!414 = !DILocalVariable(name: "dn", scope: !389, file: !1, line: 78, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "decNumber", file: !416, line: 84, baseType: !417)
!416 = !DIFile(filename: "./decNumber.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 77, size: 288, elements: !418)
!418 = !{!419, !424, !425, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !417, file: !416, line: 78, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !421, line: 26, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !380, line: 41, baseType: !423)
!423 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !417, file: !416, line: 79, baseType: !420, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !417, file: !416, line: 81, baseType: !377, size: 8, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lsu", scope: !417, file: !416, line: 83, baseType: !427, size: 192, offset: 80)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 192, elements: !431)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !378, line: 25, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !380, line: 40, baseType: !430)
!430 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!431 = !{!432}
!432 = !DISubrange(count: 12)
!433 = !DILocation(line: 78, column: 13, scope: !389)
!434 = !DILocalVariable(name: "set", scope: !389, file: !1, line: 79, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "decContext", file: !4, line: 93, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 82, size: 224, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !445, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !436, file: !4, line: 83, baseType: !420, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !436, file: !4, line: 84, baseType: !420, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !436, file: !4, line: 85, baseType: !420, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !436, file: !4, line: 86, baseType: !3, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !436, file: !4, line: 87, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !378, line: 26, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !380, line: 42, baseType: !5)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !436, file: !4, line: 88, baseType: !443, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !436, file: !4, line: 89, baseType: !377, size: 8, offset: 192)
!447 = !DILocation(line: 79, column: 14, scope: !389)
!448 = !DILocation(line: 80, column: 3, scope: !389)
!449 = !DILocation(line: 81, column: 7, scope: !389)
!450 = !DILocation(line: 81, column: 13, scope: !389)
!451 = !DILocation(line: 83, column: 29, scope: !389)
!452 = !DILocation(line: 83, column: 3, scope: !389)
!453 = !DILocation(line: 88, column: 27, scope: !389)
!454 = !DILocation(line: 88, column: 3, scope: !389)
!455 = !DILocation(line: 89, column: 1, scope: !389)
!456 = distinct !DISubprogram(name: "decimal_from_decnumber", scope: !1, file: !1, line: 49, type: !457, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !409)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !392, !459, !460}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!461 = !DILocalVariable(name: "r", arg: 1, scope: !456, file: !1, line: 49, type: !392)
!462 = !DILocation(line: 49, column: 42, scope: !456)
!463 = !DILocalVariable(name: "dn", arg: 2, scope: !456, file: !1, line: 49, type: !459)
!464 = !DILocation(line: 49, column: 56, scope: !456)
!465 = !DILocalVariable(name: "context", arg: 3, scope: !456, file: !1, line: 49, type: !460)
!466 = !DILocation(line: 49, column: 72, scope: !456)
!467 = !DILocation(line: 51, column: 11, scope: !456)
!468 = !DILocation(line: 51, column: 3, scope: !456)
!469 = !DILocation(line: 53, column: 3, scope: !456)
!470 = !DILocation(line: 53, column: 6, scope: !456)
!471 = !DILocation(line: 53, column: 9, scope: !456)
!472 = !DILocation(line: 54, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !456, file: !1, line: 54, column: 7)
!474 = !DILocation(line: 54, column: 7, scope: !456)
!475 = !DILocation(line: 55, column: 5, scope: !473)
!476 = !DILocation(line: 55, column: 8, scope: !473)
!477 = !DILocation(line: 55, column: 11, scope: !473)
!478 = !DILocation(line: 56, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !456, file: !1, line: 56, column: 7)
!480 = !DILocation(line: 56, column: 7, scope: !456)
!481 = !DILocation(line: 57, column: 5, scope: !479)
!482 = !DILocation(line: 57, column: 8, scope: !479)
!483 = !DILocation(line: 57, column: 11, scope: !479)
!484 = !DILocation(line: 58, column: 7, scope: !485)
!485 = distinct !DILexicalBlock(scope: !456, file: !1, line: 58, column: 7)
!486 = !DILocation(line: 58, column: 16, scope: !485)
!487 = !DILocation(line: 58, column: 23, scope: !485)
!488 = !DILocation(line: 58, column: 7, scope: !456)
!489 = !DILocation(line: 59, column: 5, scope: !485)
!490 = !DILocation(line: 59, column: 8, scope: !485)
!491 = !DILocation(line: 59, column: 11, scope: !485)
!492 = !DILocation(line: 60, column: 7, scope: !493)
!493 = distinct !DILexicalBlock(scope: !456, file: !1, line: 60, column: 7)
!494 = !DILocation(line: 60, column: 7, scope: !456)
!495 = !DILocation(line: 61, column: 5, scope: !493)
!496 = !DILocation(line: 61, column: 8, scope: !493)
!497 = !DILocation(line: 61, column: 13, scope: !493)
!498 = !DILocation(line: 62, column: 3, scope: !456)
!499 = !DILocation(line: 62, column: 6, scope: !456)
!500 = !DILocation(line: 62, column: 14, scope: !456)
!501 = !DILocation(line: 64, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !456, file: !1, line: 64, column: 7)
!503 = !DILocation(line: 64, column: 10, scope: !502)
!504 = !DILocation(line: 64, column: 13, scope: !502)
!505 = !DILocation(line: 64, column: 7, scope: !456)
!506 = !DILocation(line: 65, column: 5, scope: !502)
!507 = !DILocation(line: 67, column: 22, scope: !456)
!508 = !DILocation(line: 67, column: 3, scope: !456)
!509 = !DILocation(line: 68, column: 3, scope: !456)
!510 = !DILocation(line: 68, column: 12, scope: !456)
!511 = !DILocation(line: 68, column: 18, scope: !456)
!512 = !DILocation(line: 70, column: 40, scope: !456)
!513 = !DILocation(line: 70, column: 43, scope: !456)
!514 = !DILocation(line: 70, column: 25, scope: !456)
!515 = !DILocation(line: 70, column: 48, scope: !456)
!516 = !DILocation(line: 70, column: 52, scope: !456)
!517 = !DILocation(line: 70, column: 3, scope: !456)
!518 = !DILocation(line: 71, column: 1, scope: !456)
!519 = distinct !DISubprogram(name: "encode_decimal32", scope: !1, file: !1, line: 130, type: !520, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522, !550, !551}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_format", file: !17, line: 124, size: 448, elements: !525)
!525 = !{!526, !528, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !524, file: !17, line: 127, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !524, file: !17, line: 129, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !522, !392, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !524, file: !17, line: 133, baseType: !423, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !524, file: !17, line: 136, baseType: !423, size: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pnan", scope: !524, file: !17, line: 139, baseType: !423, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !524, file: !17, line: 142, baseType: !423, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !524, file: !17, line: 145, baseType: !423, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_ro", scope: !524, file: !17, line: 149, baseType: !423, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "signbit_rw", scope: !524, file: !17, line: 153, baseType: !423, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "round_towards_zero", scope: !524, file: !17, line: 156, baseType: !381, size: 8, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "has_sign_dependent_rounding", scope: !524, file: !17, line: 157, baseType: !381, size: 8, offset: 360)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "has_nans", scope: !524, file: !17, line: 160, baseType: !381, size: 8, offset: 368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "has_inf", scope: !524, file: !17, line: 161, baseType: !381, size: 8, offset: 376)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "has_denorm", scope: !524, file: !17, line: 162, baseType: !381, size: 8, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "has_signed_zero", scope: !524, file: !17, line: 163, baseType: !381, size: 8, offset: 392)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "qnan_msb_set", scope: !524, file: !17, line: 164, baseType: !381, size: 8, offset: 400)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_nan_lsbs_set", scope: !524, file: !17, line: 165, baseType: !381, size: 8, offset: 408)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!553 = !DILocalVariable(name: "fmt", arg: 1, scope: !519, file: !1, line: 130, type: !522)
!554 = !DILocation(line: 130, column: 45, scope: !519)
!555 = !DILocalVariable(name: "buf", arg: 2, scope: !519, file: !1, line: 131, type: !550)
!556 = !DILocation(line: 131, column: 11, scope: !519)
!557 = !DILocalVariable(name: "r", arg: 3, scope: !519, file: !1, line: 131, type: !551)
!558 = !DILocation(line: 131, column: 39, scope: !519)
!559 = !DILocalVariable(name: "dn", scope: !519, file: !1, line: 133, type: !415)
!560 = !DILocation(line: 133, column: 13, scope: !519)
!561 = !DILocalVariable(name: "d32", scope: !519, file: !1, line: 134, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal32", file: !563, line: 64, baseType: !564)
!563 = !DIFile(filename: "./decimal32.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 62, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !564, file: !563, line: 63, baseType: !567, size: 32)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 32, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 4)
!570 = !DILocation(line: 134, column: 13, scope: !519)
!571 = !DILocalVariable(name: "set", scope: !519, file: !1, line: 135, type: !435)
!572 = !DILocation(line: 135, column: 14, scope: !519)
!573 = !DILocalVariable(name: "image", scope: !519, file: !1, line: 136, type: !420)
!574 = !DILocation(line: 136, column: 11, scope: !519)
!575 = !DILocation(line: 138, column: 3, scope: !519)
!576 = !DILocation(line: 139, column: 7, scope: !519)
!577 = !DILocation(line: 139, column: 13, scope: !519)
!578 = !DILocation(line: 141, column: 25, scope: !519)
!579 = !DILocation(line: 141, column: 3, scope: !519)
!580 = !DILocation(line: 142, column: 3, scope: !519)
!581 = !DILocation(line: 144, column: 3, scope: !519)
!582 = !DILocation(line: 144, column: 23, scope: !519)
!583 = !DILocation(line: 145, column: 12, scope: !519)
!584 = !DILocation(line: 145, column: 3, scope: !519)
!585 = !DILocation(line: 145, column: 10, scope: !519)
!586 = !DILocation(line: 146, column: 1, scope: !519)
!587 = distinct !DISubprogram(name: "decimal_to_decnumber", scope: !1, file: !1, line: 94, type: !588, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !409)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !551, !459}
!590 = !DILocalVariable(name: "r", arg: 1, scope: !587, file: !1, line: 94, type: !551)
!591 = !DILocation(line: 94, column: 46, scope: !587)
!592 = !DILocalVariable(name: "dn", arg: 2, scope: !587, file: !1, line: 94, type: !459)
!593 = !DILocation(line: 94, column: 60, scope: !587)
!594 = !DILocalVariable(name: "set", scope: !587, file: !1, line: 96, type: !435)
!595 = !DILocation(line: 96, column: 14, scope: !587)
!596 = !DILocation(line: 97, column: 3, scope: !587)
!597 = !DILocation(line: 98, column: 7, scope: !587)
!598 = !DILocation(line: 98, column: 13, scope: !587)
!599 = !DILocation(line: 100, column: 11, scope: !587)
!600 = !DILocation(line: 100, column: 14, scope: !587)
!601 = !DILocation(line: 100, column: 3, scope: !587)
!602 = !DILocation(line: 103, column: 22, scope: !603)
!603 = distinct !DILexicalBlock(scope: !587, file: !1, line: 101, column: 5)
!604 = !DILocation(line: 103, column: 7, scope: !603)
!605 = !DILocation(line: 104, column: 7, scope: !603)
!606 = !DILocation(line: 106, column: 28, scope: !603)
!607 = !DILocation(line: 106, column: 7, scope: !603)
