; ModuleID = 'gimple-iterator.c'
source_filename = "gimple-iterator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!284 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!287 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!288 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!289 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!290 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !248, line: 727, baseType: !5, size: 32, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!293 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!297 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!298 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!299 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!300 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!301 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!302 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!303 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!304 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!305 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!306 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!307 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!308 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!309 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!310 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!311 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!312 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!313 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!314 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!315 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!316 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !318, line: 119, baseType: !5, size: 32, elements: !319)
!318 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!319 = !{!320, !321, !322, !323}
!320 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!321 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!322 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!323 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !4, line: 295, baseType: !5, size: 32, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!326 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!329 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!330 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!331 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!332 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!333 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!334 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!335 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!336 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!337 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!338 = !{!339, !340, !512, !409, !346, !1519, !871, !821, !1521}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !248, line: 136, size: 192, elements: !342)
!342 = !{!343, !1517, !1518}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !341, file: !248, line: 137, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !345, line: 58, baseType: !346)
!345 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !248, line: 737, size: 768, elements: !348)
!348 = !{!349, !1364, !1374, !1380, !1385, !1390, !1397, !1403, !1409, !1414, !1428, !1433, !1439, !1444, !1454, !1459, !1475, !1482, !1489, !1495, !1500, !1506, !1512}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !347, file: !248, line: 738, baseType: !350, size: 256)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !248, line: 271, size: 256, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !367, !368, !1363}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !350, file: !248, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !350, file: !248, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !350, file: !248, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !350, file: !248, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !350, file: !248, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !350, file: !248, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !350, file: !248, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !350, file: !248, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !350, file: !248, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !350, file: !248, line: 312, baseType: !5, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !350, file: !248, line: 316, baseType: !363, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !364, line: 58, baseType: !365)
!364 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !366, line: 44, baseType: !5)
!366 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !350, file: !248, line: 319, baseType: !5, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !350, file: !248, line: 323, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !371)
!371 = !{!372, !1328, !1329, !1330, !1333, !1337, !1338, !1339, !1357, !1358, !1359, !1360, !1361, !1362}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !370, file: !4, line: 219, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !376)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !375, file: !4, line: 151, baseType: !378, size: 128)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !379, file: !4, line: 150, baseType: !5, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !379, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !379, file: !4, line: 150, baseType: !384, size: 64, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !493)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !345, line: 108, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !388)
!388 = !{!389, !390, !391, !407, !408, !1322, !1323, !1324, !1325, !1326}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !387, file: !4, line: 124, baseType: !369, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !387, file: !4, line: 125, baseType: !369, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !387, file: !4, line: 131, baseType: !392, size: 64, offset: 128)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !393)
!393 = !{!394, !403}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !392, file: !4, line: 129, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !345, line: 66, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !248, line: 143, size: 192, elements: !398)
!398 = !{!399, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !397, file: !248, line: 145, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !345, line: 69, baseType: !340)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !397, file: !248, line: 146, baseType: !400, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !397, file: !248, line: 152, baseType: !395, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !392, file: !4, line: 130, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !345, line: 50, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !345, line: 49, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !387, file: !4, line: 134, baseType: !339, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !387, file: !4, line: 137, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !345, line: 56, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !412)
!412 = !{!413, !446, !452, !465, !472, !479, !484, !495, !501, !515, !523, !561, !566, !594, !611, !612, !617, !626, !632, !637, !641, !645, !971, !1020, !1026, !1032, !1039, !1052, !1066, !1083, !1095, !1117, !1132, !1304}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !21, line: 3372, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !414, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !414, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !414, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !414, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !414, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !414, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !414, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !414, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !414, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !414, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !414, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !414, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !414, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !414, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !414, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !414, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !414, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !414, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !414, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !414, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !414, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !414, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !414, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !414, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !414, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !414, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !414, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !414, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !414, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !414, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !411, file: !21, line: 3373, baseType: !447, size: 192)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !447, file: !21, line: 403, baseType: !414, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !447, file: !21, line: 404, baseType: !409, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !21, line: 405, baseType: !409, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !411, file: !21, line: 3374, baseType: !453, size: 320)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !453, file: !21, line: 1385, baseType: !447, size: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !453, file: !21, line: 1386, baseType: !457, size: 128, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !458, line: 58, baseType: !459)
!458 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 54, size: 128, elements: !460)
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !459, file: !458, line: 56, baseType: !462, size: 64)
!462 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !459, file: !458, line: 57, baseType: !464, size: 64, offset: 64)
!464 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !411, file: !21, line: 3375, baseType: !466, size: 256)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !466, file: !21, line: 1398, baseType: !447, size: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !466, file: !21, line: 1399, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !411, file: !21, line: 3376, baseType: !473, size: 256)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !473, file: !21, line: 1409, baseType: !447, size: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !473, file: !21, line: 1410, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !411, file: !21, line: 3377, baseType: !480, size: 256)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !480, file: !21, line: 1438, baseType: !447, size: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !480, file: !21, line: 1439, baseType: !409, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !411, file: !21, line: 3378, baseType: !485, size: 256)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !486)
!486 = !{!487, !488, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !485, file: !21, line: 1419, baseType: !447, size: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !485, file: !21, line: 1420, baseType: !489, size: 32, offset: 192)
!489 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !485, file: !21, line: 1421, baseType: !491, size: 8, offset: 224)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 8, elements: !493)
!492 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!493 = !{!494}
!494 = !DISubrange(count: 1)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !411, file: !21, line: 3379, baseType: !496, size: 320)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !21, line: 1429, baseType: !447, size: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !496, file: !21, line: 1430, baseType: !409, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !496, file: !21, line: 1431, baseType: !409, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !411, file: !21, line: 3380, baseType: !502, size: 320)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !21, line: 1461, baseType: !447, size: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !502, file: !21, line: 1462, baseType: !506, size: 128, offset: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !507, line: 31, size: 128, elements: !508)
!507 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!508 = !{!509, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !506, file: !507, line: 32, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !506, file: !507, line: 33, baseType: !5, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !506, file: !507, line: 34, baseType: !5, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !411, file: !21, line: 3381, baseType: !516, size: 384)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !517)
!517 = !{!518, !519, !520, !521, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !21, line: 2508, baseType: !447, size: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !516, file: !21, line: 2509, baseType: !363, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !516, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !516, file: !21, line: 2511, baseType: !409, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !516, file: !21, line: 2512, baseType: !409, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !411, file: !21, line: 3382, baseType: !524, size: 896)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !524, file: !21, line: 2653, baseType: !516, size: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !524, file: !21, line: 2654, baseType: !409, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !524, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !524, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !524, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !524, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !524, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !524, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !524, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !524, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !524, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !524, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !524, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !524, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !524, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !524, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !524, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !524, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !524, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !524, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !524, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !524, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !524, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !524, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !524, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !524, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !524, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !524, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !524, file: !21, line: 2705, baseType: !409, size: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !524, file: !21, line: 2706, baseType: !409, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !524, file: !21, line: 2707, baseType: !409, size: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !524, file: !21, line: 2708, baseType: !409, size: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !524, file: !21, line: 2711, baseType: !559, size: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !411, file: !21, line: 3383, baseType: !562, size: 960)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !562, file: !21, line: 2757, baseType: !524, size: 896)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !562, file: !21, line: 2758, baseType: !404, size: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !411, file: !21, line: 3384, baseType: !567, size: 1472)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !568)
!568 = !{!569, !590, !591, !592, !593}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !567, file: !21, line: 3115, baseType: !570, size: 1216)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !570, file: !21, line: 2985, baseType: !562, size: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !570, file: !21, line: 2986, baseType: !409, size: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !570, file: !21, line: 2987, baseType: !409, size: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !570, file: !21, line: 2988, baseType: !409, size: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !570, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !570, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !570, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !570, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !570, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !570, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !570, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !570, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !570, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !570, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !570, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !570, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !570, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !570, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !567, file: !21, line: 3117, baseType: !409, size: 64, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !567, file: !21, line: 3119, baseType: !409, size: 64, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !567, file: !21, line: 3121, baseType: !409, size: 64, offset: 1344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !567, file: !21, line: 3123, baseType: !409, size: 64, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !411, file: !21, line: 3385, baseType: !595, size: 1088)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !595, file: !21, line: 2875, baseType: !562, size: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !595, file: !21, line: 2876, baseType: !404, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !595, file: !21, line: 2877, baseType: !600, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !602, line: 172, size: 128, elements: !603)
!602 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!603 = !{!604, !605, !606, !607, !608, !609, !610}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !601, file: !602, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !601, file: !602, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !601, file: !602, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !601, file: !602, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !601, file: !602, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !601, file: !602, line: 195, baseType: !5, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !601, file: !602, line: 199, baseType: !409, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !411, file: !21, line: 3386, baseType: !570, size: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !411, file: !21, line: 3387, baseType: !613, size: 1280)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !21, line: 3094, baseType: !570, size: 1216)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !613, file: !21, line: 3095, baseType: !600, size: 64, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !411, file: !21, line: 3388, baseType: !618, size: 1216)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !21, line: 2825, baseType: !524, size: 896)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !618, file: !21, line: 2827, baseType: !409, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !618, file: !21, line: 2828, baseType: !409, size: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !618, file: !21, line: 2829, baseType: !409, size: 64, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !618, file: !21, line: 2830, baseType: !409, size: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !618, file: !21, line: 2831, baseType: !409, size: 64, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !411, file: !21, line: 3389, baseType: !627, size: 1024)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !21, line: 2851, baseType: !562, size: 960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !627, file: !21, line: 2852, baseType: !489, size: 32, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !627, file: !21, line: 2853, baseType: !489, size: 32, offset: 992)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !411, file: !21, line: 3390, baseType: !633, size: 1024)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !21, line: 2858, baseType: !562, size: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !633, file: !21, line: 2859, baseType: !600, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !411, file: !21, line: 3391, baseType: !638, size: 960)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !638, file: !21, line: 2863, baseType: !562, size: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !411, file: !21, line: 3392, baseType: !642, size: 1472)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !642, file: !21, line: 3305, baseType: !567, size: 1472)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !411, file: !21, line: 3393, baseType: !646, size: 1792)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !647)
!647 = !{!648, !649, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !21, line: 3249, baseType: !567, size: 1472)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !646, file: !21, line: 3251, baseType: !650, size: 64, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !652, line: 463, size: 1152, elements: !653)
!652 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!653 = !{!654, !657, !690, !691, !889, !892, !893, !894, !895, !896, !897, !923, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !651, file: !652, line: 464, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !652, line: 464, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !651, file: !652, line: 467, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !660)
!660 = !{!661, !663, !664, !677, !678, !679, !680, !681, !682, !686, !688, !689}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !659, file: !4, line: 377, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !345, line: 111, baseType: !369)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !659, file: !4, line: 378, baseType: !662, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !659, file: !4, line: 381, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !667, file: !4, line: 282, baseType: !670, size: 128)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !671, file: !4, line: 281, baseType: !5, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !671, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !671, file: !4, line: 281, baseType: !676, size: 64, offset: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 64, elements: !493)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !659, file: !4, line: 384, baseType: !489, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !659, file: !4, line: 387, baseType: !489, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !659, file: !4, line: 390, baseType: !489, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !659, file: !4, line: 394, baseType: !665, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !659, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !659, file: !4, line: 399, baseType: !683, size: 64, offset: 416)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 2)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !659, file: !4, line: 402, baseType: !687, size: 64, offset: 480)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !684)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !659, file: !4, line: 406, baseType: !489, size: 32, offset: 544)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !659, file: !4, line: 409, baseType: !489, size: 32, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !651, file: !652, line: 470, baseType: !396, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !651, file: !652, line: 473, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !602, line: 39, size: 1152, elements: !694)
!694 = !{!695, !747, !760, !773, !774, !844, !845, !849, !850, !851, !852, !853}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !693, file: !602, line: 41, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !697, line: 144, baseType: !698)
!697 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !697, line: 100, size: 896, elements: !700)
!700 = !{!701, !709, !714, !719, !721, !724, !725, !726, !727, !728, !733, !735, !736, !741, !746}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !699, file: !697, line: 102, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !697, line: 52, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !697, line: 47, baseType: !5)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !699, file: !697, line: 105, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !697, line: 59, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!489, !707, !707}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !699, file: !697, line: 108, baseType: !715, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !697, line: 63, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !339}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !699, file: !697, line: 111, baseType: !720, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !699, file: !697, line: 114, baseType: !722, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !723, line: 46, baseType: !462)
!723 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!724 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !699, file: !697, line: 117, baseType: !722, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !699, file: !697, line: 120, baseType: !722, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !699, file: !697, line: 124, baseType: !5, size: 32, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !699, file: !697, line: 128, baseType: !5, size: 32, offset: 480)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !699, file: !697, line: 131, baseType: !729, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !697, line: 75, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!339, !722, !722}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !699, file: !697, line: 132, baseType: !734, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !697, line: 78, baseType: !716)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !699, file: !697, line: 135, baseType: !339, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !699, file: !697, line: 136, baseType: !737, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !697, line: 82, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!339, !339, !722, !722}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !699, file: !697, line: 137, baseType: !742, size: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !697, line: 83, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !339, !339}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !699, file: !697, line: 141, baseType: !5, size: 32, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !693, file: !602, line: 48, baseType: !748, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !248, line: 35, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !248, line: 35, size: 128, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !248, line: 35, baseType: !753, size: 128)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !248, line: 33, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !248, line: 33, size: 128, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !754, file: !248, line: 33, baseType: !5, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !754, file: !248, line: 33, baseType: !5, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !754, file: !248, line: 33, baseType: !759, size: 64, offset: 64)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !493)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !693, file: !602, line: 51, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !21, line: 183, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !21, line: 183, size: 128, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !763, file: !21, line: 183, baseType: !766, size: 128)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !21, line: 182, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !21, line: 182, size: 128, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !767, file: !21, line: 182, baseType: !5, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !767, file: !21, line: 182, baseType: !5, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !767, file: !21, line: 182, baseType: !772, size: 64, offset: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !493)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !693, file: !602, line: 54, baseType: !409, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !693, file: !602, line: 57, baseType: !775, size: 128, offset: 256)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !776, line: 31, size: 128, elements: !777)
!776 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !779, !780, !781, !782, !783, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !775, file: !776, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !775, file: !776, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !775, file: !776, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !775, file: !776, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !775, file: !776, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !775, file: !776, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !775, file: !776, line: 56, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !345, line: 47, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !788, line: 75, size: 256, elements: !789)
!788 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!789 = !{!790, !802, !803, !804}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !787, file: !788, line: 76, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !788, line: 68, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !788, line: 63, size: 320, elements: !794)
!794 = !{!795, !797, !798, !799}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !788, line: 64, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !793, file: !788, line: 65, baseType: !796, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !793, file: !788, line: 66, baseType: !5, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !793, file: !788, line: 67, baseType: !800, size: 128, offset: 192)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 128, elements: !684)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !788, line: 29, baseType: !462)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !787, file: !788, line: 77, baseType: !791, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !787, file: !788, line: 78, baseType: !5, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !787, file: !788, line: 79, baseType: !805, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !788, line: 49, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !788, line: 45, size: 832, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !807, file: !788, line: 46, baseType: !796, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !807, file: !788, line: 47, baseType: !786, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !807, file: !788, line: 48, baseType: !812, size: 704, offset: 128)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !813, line: 164, size: 704, elements: !814)
!813 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!814 = !{!815, !816, !827, !828, !829, !830, !831, !832, !836, !840, !841, !842, !843}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !812, file: !813, line: 166, baseType: !464, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !812, file: !813, line: 167, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !813, line: 157, size: 192, elements: !819)
!819 = !{!820, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !818, file: !813, line: 159, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !818, file: !813, line: 160, baseType: !817, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !818, file: !813, line: 161, baseType: !824, size: 32, offset: 128)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 32, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 4)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !812, file: !813, line: 168, baseType: !821, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !812, file: !813, line: 169, baseType: !821, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !812, file: !813, line: 170, baseType: !821, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !812, file: !813, line: 171, baseType: !464, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !812, file: !813, line: 172, baseType: !489, size: 32, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !812, file: !813, line: 176, baseType: !833, size: 64, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!817, !339, !464}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !812, file: !813, line: 177, baseType: !837, size: 64, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !339, !817}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !812, file: !813, line: 178, baseType: !339, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !812, file: !813, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !812, file: !813, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !812, file: !813, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !693, file: !602, line: 60, baseType: !775, size: 128, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !693, file: !602, line: 64, baseType: !846, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !848, line: 33, flags: DIFlagFwdDecl)
!848 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !693, file: !602, line: 67, baseType: !409, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !693, file: !602, line: 73, baseType: !696, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !693, file: !602, line: 77, baseType: !785, size: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !693, file: !602, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !693, file: !602, line: 82, baseType: !854, size: 320, offset: 832)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !318, line: 62, size: 320, elements: !855)
!855 = !{!856, !862, !863, !864, !865, !872}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !854, file: !318, line: 63, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !318, line: 56, size: 128, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !318, line: 57, baseType: !857, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !858, file: !318, line: 58, baseType: !491, size: 8, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !854, file: !318, line: 64, baseType: !5, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !854, file: !318, line: 66, baseType: !5, size: 32, offset: 96)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !854, file: !318, line: 68, baseType: !512, size: 8, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !854, file: !318, line: 70, baseType: !866, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !318, line: 37, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !318, line: 39, baseType: !866, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !867, file: !318, line: 40, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !854, file: !318, line: 71, baseType: !873, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !318, line: 45, size: 320, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !318, line: 47, baseType: !873, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !874, file: !318, line: 48, baseType: !878, size: 256, offset: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !21, line: 1883, size: 256, elements: !879)
!879 = !{!880, !882, !883, !888}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !878, file: !21, line: 1884, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !878, file: !21, line: 1885, baseType: !881, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !878, file: !21, line: 1891, baseType: !884, size: 64, offset: 128)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !878, file: !21, line: 1891, size: 64, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !884, file: !21, line: 1891, baseType: !344, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !884, file: !21, line: 1891, baseType: !409, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !878, file: !21, line: 1892, baseType: !871, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !651, file: !652, line: 476, baseType: !890, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !652, line: 476, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !651, file: !652, line: 479, baseType: !696, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !651, file: !652, line: 484, baseType: !409, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !651, file: !652, line: 488, baseType: !409, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !651, file: !652, line: 493, baseType: !409, size: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !651, file: !652, line: 496, baseType: !409, size: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !651, file: !652, line: 501, baseType: !898, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !900)
!900 = !{!901, !904, !907, !908, !909, !911, !912, !917, !918, !919, !920, !921, !922}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !899, file: !16, line: 2356, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !16, line: 2356, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !899, file: !16, line: 2357, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !899, file: !16, line: 2358, baseType: !489, size: 32, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !899, file: !16, line: 2359, baseType: !489, size: 32, offset: 160)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !899, file: !16, line: 2360, baseType: !910, size: 128, offset: 192)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !825)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !899, file: !16, line: 2364, baseType: !489, size: 32, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !899, file: !16, line: 2367, baseType: !913, size: 128, offset: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !16, line: 2349, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !913, file: !16, line: 2351, baseType: !404, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !913, file: !16, line: 2352, baseType: !464, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !899, file: !16, line: 2371, baseType: !15, size: 32, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !899, file: !16, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !899, file: !16, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !899, file: !16, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !899, file: !16, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !899, file: !16, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !651, file: !652, line: 504, baseType: !924, size: 64, offset: 704)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !652, line: 504, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !651, file: !652, line: 507, baseType: !696, size: 64, offset: 768)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !651, file: !652, line: 510, baseType: !489, size: 32, offset: 832)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !651, file: !652, line: 513, baseType: !489, size: 32, offset: 864)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !651, file: !652, line: 516, baseType: !363, size: 32, offset: 896)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !651, file: !652, line: 519, baseType: !363, size: 32, offset: 928)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !651, file: !652, line: 522, baseType: !5, size: 32, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !651, file: !652, line: 523, baseType: !5, size: 32, offset: 992)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !651, file: !652, line: 528, baseType: !905, size: 64, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !651, file: !652, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !651, file: !652, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !651, file: !652, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !651, file: !652, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !651, file: !652, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !651, file: !652, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !651, file: !652, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !651, file: !652, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !651, file: !652, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !651, file: !652, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !651, file: !652, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !651, file: !652, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !651, file: !652, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !651, file: !652, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !651, file: !652, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !651, file: !652, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !646, file: !21, line: 3254, baseType: !409, size: 64, offset: 1536)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !646, file: !21, line: 3257, baseType: !409, size: 64, offset: 1600)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !646, file: !21, line: 3258, baseType: !409, size: 64, offset: 1664)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !646, file: !21, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !646, file: !21, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !646, file: !21, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !646, file: !21, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !646, file: !21, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !646, file: !21, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !646, file: !21, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !646, file: !21, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !646, file: !21, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !646, file: !21, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !646, file: !21, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !646, file: !21, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !646, file: !21, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !646, file: !21, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !646, file: !21, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !646, file: !21, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !646, file: !21, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !646, file: !21, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !21, line: 3394, baseType: !972, size: 1344)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !21, line: 2279, size: 1344, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !999, !1000, !1001, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !21, line: 2280, baseType: !447, size: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !972, file: !21, line: 2281, baseType: !409, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !972, file: !21, line: 2282, baseType: !409, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !972, file: !21, line: 2283, baseType: !409, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !972, file: !21, line: 2284, baseType: !409, size: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !972, file: !21, line: 2285, baseType: !5, size: 32, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !972, file: !21, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !972, file: !21, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !972, file: !21, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !972, file: !21, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !972, file: !21, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !972, file: !21, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !972, file: !21, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !972, file: !21, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !972, file: !21, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !972, file: !21, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !972, file: !21, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !972, file: !21, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !972, file: !21, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !972, file: !21, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !972, file: !21, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !972, file: !21, line: 2305, baseType: !5, size: 32, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !972, file: !21, line: 2306, baseType: !997, size: 32, offset: 544)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !998, line: 31, baseType: !489)
!998 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !972, file: !21, line: 2307, baseType: !409, size: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !972, file: !21, line: 2308, baseType: !409, size: 64, offset: 640)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !972, file: !21, line: 2314, baseType: !1002, size: 64, offset: 704)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !21, line: 2309, size: 64, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1002, file: !21, line: 2310, baseType: !489, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1002, file: !21, line: 2311, baseType: !905, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1002, file: !21, line: 2312, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !21, line: 2277, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !21, line: 2315, baseType: !409, size: 64, offset: 768)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !972, file: !21, line: 2316, baseType: !409, size: 64, offset: 832)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !972, file: !21, line: 2317, baseType: !409, size: 64, offset: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !972, file: !21, line: 2318, baseType: !409, size: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !972, file: !21, line: 2319, baseType: !409, size: 64, offset: 1024)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !972, file: !21, line: 2320, baseType: !409, size: 64, offset: 1088)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !972, file: !21, line: 2321, baseType: !409, size: 64, offset: 1152)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !972, file: !21, line: 2322, baseType: !409, size: 64, offset: 1216)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !972, file: !21, line: 2324, baseType: !1018, size: 64, offset: 1280)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !21, line: 2324, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !411, file: !21, line: 3395, baseType: !1021, size: 320)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !21, line: 1469, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !21, line: 1470, baseType: !447, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1021, file: !21, line: 1471, baseType: !409, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1021, file: !21, line: 1472, baseType: !409, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !411, file: !21, line: 3396, baseType: !1027, size: 320)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !21, line: 1482, size: 320, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1027, file: !21, line: 1483, baseType: !447, size: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1027, file: !21, line: 1484, baseType: !489, size: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1027, file: !21, line: 1485, baseType: !772, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !411, file: !21, line: 3397, baseType: !1033, size: 384)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !21, line: 1829, size: 384, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1033, file: !21, line: 1830, baseType: !447, size: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1033, file: !21, line: 1831, baseType: !363, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1033, file: !21, line: 1832, baseType: !409, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1033, file: !21, line: 1835, baseType: !772, size: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !411, file: !21, line: 3398, baseType: !1040, size: 704)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !21, line: 1898, size: 704, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1051}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1040, file: !21, line: 1899, baseType: !447, size: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1040, file: !21, line: 1902, baseType: !409, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1040, file: !21, line: 1905, baseType: !344, size: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1040, file: !21, line: 1908, baseType: !5, size: 32, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1040, file: !21, line: 1911, baseType: !1047, size: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !602, line: 117, size: 128, elements: !1049)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1048, file: !602, line: 120, baseType: !775, size: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1040, file: !21, line: 1914, baseType: !878, size: 256, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !411, file: !21, line: 3399, baseType: !1053, size: 704)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !21, line: 2008, size: 704, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !21, line: 2009, baseType: !447, size: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1053, file: !21, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1053, file: !21, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1053, file: !21, line: 2014, baseType: !363, size: 32, offset: 224)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1053, file: !21, line: 2016, baseType: !409, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1053, file: !21, line: 2017, baseType: !761, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1053, file: !21, line: 2019, baseType: !409, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1053, file: !21, line: 2020, baseType: !409, size: 64, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1053, file: !21, line: 2021, baseType: !409, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1053, file: !21, line: 2022, baseType: !409, size: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1053, file: !21, line: 2023, baseType: !409, size: 64, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !411, file: !21, line: 3400, baseType: !1067, size: 832)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !21, line: 2430, size: 832, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !21, line: 2431, baseType: !447, size: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1067, file: !21, line: 2433, baseType: !409, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1067, file: !21, line: 2434, baseType: !409, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1067, file: !21, line: 2435, baseType: !409, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1067, file: !21, line: 2436, baseType: !409, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1067, file: !21, line: 2437, baseType: !761, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1067, file: !21, line: 2438, baseType: !409, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1067, file: !21, line: 2440, baseType: !409, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1067, file: !21, line: 2441, baseType: !409, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1067, file: !21, line: 2443, baseType: !1079, size: 128, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !21, line: 182, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !21, line: 182, size: 128, elements: !1081)
!1081 = !{!1082}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1080, file: !21, line: 182, baseType: !766, size: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !411, file: !21, line: 3401, baseType: !1084, size: 320)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !21, line: 3327, size: 320, elements: !1085)
!1085 = !{!1086, !1087, !1094}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !21, line: 3329, baseType: !447, size: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1084, file: !21, line: 3330, baseType: !1088, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !21, line: 3320, size: 192, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1089, file: !21, line: 3322, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1089, file: !21, line: 3323, baseType: !1088, size: 64, offset: 64)
