; ModuleID = 'stack-ptr-mod.c'
source_filename = "stack-ptr-mod.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!661 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!662 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!663 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!664 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!665 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!666 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!667 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!668 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!669 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!670 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!671 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!672 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!673 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!674 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!675 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!676 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!677 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!678 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!679 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!680 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!681 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!682 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!683 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!684 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!685 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!686 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!687 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!688 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!689 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_rtl_index", file: !561, line: 1994, baseType: !7, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!705 = !DIEnumerator(name: "GR_PC", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "GR_CC0", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "GR_STACK_POINTER", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "GR_FRAME_POINTER", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "GR_HARD_FRAME_POINTER", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "GR_ARG_POINTER", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "GR_VIRTUAL_INCOMING_ARGS", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "GR_VIRTUAL_STACK_ARGS", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "GR_VIRTUAL_STACK_DYNAMIC", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "GR_VIRTUAL_OUTGOING_ARGS", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "GR_VIRTUAL_CFA", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "GR_MAX", value: 11, isUnsigned: true)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtx_class", file: !561, line: 60, baseType: !7, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!719 = !DIEnumerator(name: "RTX_COMPARE", value: 0, isUnsigned: true)
!720 = !DIEnumerator(name: "RTX_COMM_COMPARE", value: 1, isUnsigned: true)
!721 = !DIEnumerator(name: "RTX_BIN_ARITH", value: 2, isUnsigned: true)
!722 = !DIEnumerator(name: "RTX_COMM_ARITH", value: 3, isUnsigned: true)
!723 = !DIEnumerator(name: "RTX_UNARY", value: 4, isUnsigned: true)
!724 = !DIEnumerator(name: "RTX_EXTRA", value: 5, isUnsigned: true)
!725 = !DIEnumerator(name: "RTX_MATCH", value: 6, isUnsigned: true)
!726 = !DIEnumerator(name: "RTX_INSN", value: 7, isUnsigned: true)
!727 = !DIEnumerator(name: "RTX_OBJ", value: 8, isUnsigned: true)
!728 = !DIEnumerator(name: "RTX_CONST_OBJ", value: 9, isUnsigned: true)
!729 = !DIEnumerator(name: "RTX_TERNARY", value: 10, isUnsigned: true)
!730 = !DIEnumerator(name: "RTX_BITFIELD_OPS", value: 11, isUnsigned: true)
!731 = !DIEnumerator(name: "RTX_AUTOINC", value: 12, isUnsigned: true)
!732 = !{!560, !733, !734}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!734 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!735 = !{!0}
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_opt_pass", file: !6, line: 162, size: 640, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !736, file: !6, line: 164, baseType: !739, size: 640)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !6, line: 114, size: 640, elements: !740)
!740 = !{!741, !742, !746, !751, !755, !757, !758, !759, !761, !762, !763, !764, !765}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !6, line: 117, baseType: !5, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !739, file: !6, line: 121, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !739, file: !6, line: 125, baseType: !747, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!750}
!750 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !739, file: !6, line: 130, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!7}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !739, file: !6, line: 133, baseType: !756, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !739, file: !6, line: 136, baseType: !756, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !739, file: !6, line: 139, baseType: !734, size: 32, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !739, file: !6, line: 143, baseType: !760, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !14, line: 80, baseType: !13)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !739, file: !6, line: 146, baseType: !7, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !739, file: !6, line: 147, baseType: !7, size: 32, offset: 480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !739, file: !6, line: 148, baseType: !7, size: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !739, file: !6, line: 151, baseType: !7, size: 32, offset: 544)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !739, file: !6, line: 152, baseType: !7, size: 32, offset: 576)
!766 = !{i32 7, !"Dwarf Version", i32 4}
!767 = !{i32 2, !"Debug Info Version", i32 3}
!768 = !{i32 1, !"wchar_size", i32 4}
!769 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!770 = distinct !DISubprogram(name: "rest_of_handle_stack_ptr_mod", scope: !3, file: !3, line: 88, type: !753, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !771)
!771 = !{}
!772 = !DILocation(line: 90, column: 3, scope: !770)
!773 = !DILocation(line: 91, column: 3, scope: !770)
!774 = distinct !DISubprogram(name: "notice_stack_pointer_modification", scope: !3, file: !3, line: 53, type: !775, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !771)
!775 = !DISubroutineType(types: !776)
!776 = !{null}
!777 = !DILocalVariable(name: "bb", scope: !774, file: !3, line: 55, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !779, line: 111, baseType: !780)
!779 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !782)
!782 = !{!783, !1814, !1815, !1816, !1819, !1823, !1824, !1825, !1843, !1844, !1845, !1846, !1847, !1848}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !781, file: !318, line: 219, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !786, file: !318, line: 151, baseType: !789, size: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !790, file: !318, line: 150, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !790, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !790, file: !318, line: 150, baseType: !795, size: 64, offset: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 64, elements: !844)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !779, line: 108, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !799)
!799 = !{!800, !801, !802, !1806, !1807, !1808, !1809, !1810, !1811, !1812}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !798, file: !318, line: 124, baseType: !780, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !798, file: !318, line: 125, baseType: !780, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !798, file: !318, line: 131, baseType: !803, size: 64, offset: 128)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !804)
!804 = !{!805, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !803, file: !318, line: 129, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !779, line: 66, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !779, line: 65, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !803, file: !318, line: 130, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !779, line: 50, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !812, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !812, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !812, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !812, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !812, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !812, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !812, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !812, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !812, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !812, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !812, file: !561, line: 321, baseType: !825, size: 320, offset: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !826)
!826 = !{!827, !1741, !1743, !1804, !1805}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !825, file: !561, line: 316, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 64, elements: !844)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !846, !847, !859, !862, !925, !1719, !1720, !1731, !1738}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !830, file: !561, line: 168, baseType: !734, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !830, file: !561, line: 169, baseType: !7, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !830, file: !561, line: 170, baseType: !743, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !830, file: !561, line: 171, baseType: !810, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !830, file: !561, line: 172, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !779, line: 53, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !839, file: !561, line: 360, baseType: !734, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !839, file: !561, line: 361, baseType: !843, size: 64, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 64, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 1)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !830, file: !561, line: 173, baseType: !189, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !830, file: !561, line: 174, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !849, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !849, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !849, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !849, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !849, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !849, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !849, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !849, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !830, file: !561, line: 175, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !830, file: !561, line: 176, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !865, line: 75, size: 256, elements: !866)
!865 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!866 = !{!867, !882, !883, !884}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !864, file: !865, line: 76, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !865, line: 68, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !865, line: 63, size: 320, elements: !871)
!871 = !{!872, !874, !875, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !865, line: 64, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !865, line: 65, baseType: !873, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !870, file: !865, line: 66, baseType: !7, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !870, file: !865, line: 67, baseType: !877, size: 128, offset: 192)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 128, elements: !880)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !865, line: 29, baseType: !879)
!879 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!880 = !{!881}
!881 = !DISubrange(count: 2)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !864, file: !865, line: 77, baseType: !868, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !864, file: !865, line: 78, baseType: !7, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !864, file: !865, line: 79, baseType: !885, size: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !865, line: 49, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !865, line: 45, size: 832, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !887, file: !865, line: 46, baseType: !873, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !887, file: !865, line: 47, baseType: !863, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !887, file: !865, line: 48, baseType: !892, size: 704, offset: 128)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !893, line: 164, size: 704, elements: !894)
!893 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!894 = !{!895, !897, !908, !909, !910, !911, !912, !913, !917, !921, !922, !923, !924}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !892, file: !893, line: 166, baseType: !896, size: 64)
!896 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !892, file: !893, line: 167, baseType: !898, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !893, line: 157, size: 192, elements: !900)
!900 = !{!901, !903, !904}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !899, file: !893, line: 159, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !899, file: !893, line: 160, baseType: !898, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !899, file: !893, line: 161, baseType: !905, size: 32, offset: 128)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 32, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 4)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !892, file: !893, line: 168, baseType: !902, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !892, file: !893, line: 169, baseType: !902, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !892, file: !893, line: 170, baseType: !902, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !892, file: !893, line: 171, baseType: !896, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !892, file: !893, line: 172, baseType: !734, size: 32, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !892, file: !893, line: 176, baseType: !914, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!898, !733, !896}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !892, file: !893, line: 177, baseType: !918, size: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !733, !898}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !892, file: !893, line: 178, baseType: !733, size: 64, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !892, file: !893, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !892, file: !893, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !892, file: !893, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !830, file: !561, line: 177, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !779, line: 56, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !929)
!929 = !{!930, !963, !969, !980, !999, !1010, !1015, !1022, !1028, !1041, !1053, !1091, !1096, !1124, !1132, !1133, !1138, !1147, !1153, !1158, !1162, !1166, !1343, !1392, !1398, !1405, !1412, !1438, !1463, !1480, !1492, !1514, !1529, !1701}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !928, file: !334, line: 3372, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !931, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !931, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !931, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !931, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !931, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !931, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !931, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !931, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !931, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !931, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !931, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !931, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !931, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !931, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !931, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !931, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !931, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !931, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !931, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !931, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !931, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !931, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !931, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !931, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !931, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !931, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !931, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !931, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !931, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !931, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !334, line: 3373, baseType: !964, size: 192)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !964, file: !334, line: 403, baseType: !931, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !964, file: !334, line: 404, baseType: !926, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !964, file: !334, line: 405, baseType: !926, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !928, file: !334, line: 3374, baseType: !970, size: 320)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !334, line: 1385, baseType: !964, size: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !970, file: !334, line: 1386, baseType: !974, size: 128, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !975, line: 58, baseType: !976)
!975 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !975, line: 54, size: 128, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !976, file: !975, line: 56, baseType: !879, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !976, file: !975, line: 57, baseType: !896, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !928, file: !334, line: 3375, baseType: !981, size: 256)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !334, line: 1398, baseType: !964, size: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !981, file: !334, line: 1399, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !987, line: 52, size: 256, elements: !988)
!987 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!988 = !{!989, !990, !991, !992, !993, !994, !995}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !986, file: !987, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !986, file: !987, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !986, file: !987, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !986, file: !987, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !986, file: !987, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !986, file: !987, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !986, file: !987, line: 62, baseType: !996, size: 192, offset: 64)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 192, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 3)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !928, file: !334, line: 3376, baseType: !1000, size: 256)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !334, line: 1409, baseType: !964, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1000, file: !334, line: 1410, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1006, line: 27, size: 192, elements: !1007)
!1006 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1005, file: !1006, line: 29, baseType: !974, size: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1005, file: !1006, line: 30, baseType: !189, size: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !928, file: !334, line: 3377, baseType: !1011, size: 256)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !334, line: 1438, baseType: !964, size: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1011, file: !334, line: 1439, baseType: !926, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !928, file: !334, line: 3378, baseType: !1016, size: 256)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1016, file: !334, line: 1419, baseType: !964, size: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1016, file: !334, line: 1420, baseType: !734, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1016, file: !334, line: 1421, baseType: !1021, size: 8, offset: 224)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 8, elements: !844)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !928, file: !334, line: 3379, baseType: !1023, size: 320)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !334, line: 1429, baseType: !964, size: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1023, file: !334, line: 1430, baseType: !926, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1023, file: !334, line: 1431, baseType: !926, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !928, file: !334, line: 3380, baseType: !1029, size: 320)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1029, file: !334, line: 1461, baseType: !964, size: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1029, file: !334, line: 1462, baseType: !1033, size: 128, offset: 192)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1034, line: 31, size: 128, elements: !1035)
!1034 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1035 = !{!1036, !1039, !1040}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1033, file: !1034, line: 32, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1033, file: !1034, line: 33, baseType: !7, size: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1033, file: !1034, line: 34, baseType: !7, size: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !928, file: !334, line: 3381, baseType: !1042, size: 384)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1043)
!1043 = !{!1044, !1045, !1050, !1051, !1052}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !334, line: 2508, baseType: !964, size: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1042, file: !334, line: 2509, baseType: !1046, size: 32, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1047, line: 58, baseType: !1048)
!1047 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1049, line: 44, baseType: !7)
!1049 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1042, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !334, line: 2511, baseType: !926, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1042, file: !334, line: 2512, baseType: !926, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !928, file: !334, line: 3382, baseType: !1054, size: 896)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1054, file: !334, line: 2653, baseType: !1042, size: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !334, line: 2654, baseType: !926, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1054, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1054, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1054, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1054, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1054, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1054, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1054, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1054, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1054, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1054, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1054, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1054, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1054, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1054, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1054, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1054, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1054, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1054, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1054, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1054, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1054, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1054, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1054, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1054, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1054, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1054, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1054, file: !334, line: 2705, baseType: !926, size: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1054, file: !334, line: 2706, baseType: !926, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1054, file: !334, line: 2707, baseType: !926, size: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1054, file: !334, line: 2708, baseType: !926, size: 64, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1054, file: !334, line: 2711, baseType: !1089, size: 64, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !928, file: !334, line: 3383, baseType: !1092, size: 960)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !334, line: 2757, baseType: !1054, size: 896)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1092, file: !334, line: 2758, baseType: !810, size: 64, offset: 896)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !928, file: !334, line: 3384, baseType: !1097, size: 1472)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1098)
!1098 = !{!1099, !1120, !1121, !1122, !1123}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !334, line: 3115, baseType: !1100, size: 1216)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !334, line: 2985, baseType: !1092, size: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1100, file: !334, line: 2986, baseType: !926, size: 64, offset: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1100, file: !334, line: 2987, baseType: !926, size: 64, offset: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1100, file: !334, line: 2988, baseType: !926, size: 64, offset: 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1100, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1100, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1100, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1100, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1100, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1100, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1100, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1100, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1100, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1100, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1100, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1100, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1100, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1100, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1097, file: !334, line: 3117, baseType: !926, size: 64, offset: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1097, file: !334, line: 3119, baseType: !926, size: 64, offset: 1280)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1097, file: !334, line: 3121, baseType: !926, size: 64, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1097, file: !334, line: 3123, baseType: !926, size: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !928, file: !334, line: 3385, baseType: !1125, size: 1088)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !334, line: 2875, baseType: !1092, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1125, file: !334, line: 2876, baseType: !810, size: 64, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1125, file: !334, line: 2877, baseType: !1130, size: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !928, file: !334, line: 3386, baseType: !1100, size: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !928, file: !334, line: 3387, baseType: !1134, size: 1280)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !334, line: 3094, baseType: !1100, size: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1134, file: !334, line: 3095, baseType: !1130, size: 64, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !928, file: !334, line: 3388, baseType: !1139, size: 1216)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !334, line: 2825, baseType: !1054, size: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1139, file: !334, line: 2827, baseType: !926, size: 64, offset: 896)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1139, file: !334, line: 2828, baseType: !926, size: 64, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1139, file: !334, line: 2829, baseType: !926, size: 64, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1139, file: !334, line: 2830, baseType: !926, size: 64, offset: 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1139, file: !334, line: 2831, baseType: !926, size: 64, offset: 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !928, file: !334, line: 3389, baseType: !1148, size: 1024)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1148, file: !334, line: 2851, baseType: !1092, size: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1148, file: !334, line: 2852, baseType: !734, size: 32, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1148, file: !334, line: 2853, baseType: !734, size: 32, offset: 992)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !928, file: !334, line: 3390, baseType: !1154, size: 1024)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !334, line: 2858, baseType: !1092, size: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1154, file: !334, line: 2859, baseType: !1130, size: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !928, file: !334, line: 3391, baseType: !1159, size: 960)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1160)
!1160 = !{!1161}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !334, line: 2863, baseType: !1092, size: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !928, file: !334, line: 3392, baseType: !1163, size: 1472)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1163, file: !334, line: 3305, baseType: !1097, size: 1472)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !928, file: !334, line: 3393, baseType: !1167, size: 1792)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1168)
!1168 = !{!1169, !1170, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !334, line: 3249, baseType: !1097, size: 1472)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1167, file: !334, line: 3251, baseType: !1171, size: 64, offset: 1472)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1173, line: 463, size: 1152, elements: !1174)
!1173 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1174 = !{!1175, !1178, !1208, !1209, !1212, !1215, !1267, !1268, !1269, !1270, !1271, !1295, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1172, file: !1173, line: 464, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1173, line: 464, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1172, file: !1173, line: 467, baseType: !1179, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1206, !1207}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1180, file: !318, line: 377, baseType: !778, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1180, file: !318, line: 378, baseType: !778, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1180, file: !318, line: 381, baseType: !1185, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1188)
!1188 = !{!1189}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1187, file: !318, line: 282, baseType: !1190, size: 128)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1191, file: !318, line: 281, baseType: !7, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1191, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1191, file: !318, line: 281, baseType: !1196, size: 64, offset: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 64, elements: !844)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1180, file: !318, line: 384, baseType: !734, size: 32, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1180, file: !318, line: 387, baseType: !734, size: 32, offset: 224)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1180, file: !318, line: 390, baseType: !734, size: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1180, file: !318, line: 394, baseType: !1185, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1180, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1180, file: !318, line: 399, baseType: !1203, size: 64, offset: 416)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !880)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1180, file: !318, line: 402, baseType: !1205, size: 64, offset: 480)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !880)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1180, file: !318, line: 406, baseType: !734, size: 32, offset: 544)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1180, file: !318, line: 409, baseType: !734, size: 32, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1172, file: !1173, line: 470, baseType: !807, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1172, file: !1173, line: 473, baseType: !1210, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1173, line: 166, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1172, file: !1173, line: 476, baseType: !1213, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1173, line: 476, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1172, file: !1173, line: 479, baseType: !1216, size: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1217, line: 144, baseType: !1218)
!1217 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1217, line: 100, size: 896, elements: !1220)
!1220 = !{!1221, !1229, !1234, !1239, !1241, !1244, !1245, !1246, !1247, !1248, !1253, !1255, !1256, !1261, !1266}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1219, file: !1217, line: 102, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1217, line: 52, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1217, line: 47, baseType: !7)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1219, file: !1217, line: 105, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1217, line: 59, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!734, !1227, !1227}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1219, file: !1217, line: 108, baseType: !1235, size: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1217, line: 63, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !733}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1219, file: !1217, line: 111, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1219, file: !1217, line: 114, baseType: !1242, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1243, line: 46, baseType: !879)
!1243 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1219, file: !1217, line: 117, baseType: !1242, size: 64, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1219, file: !1217, line: 120, baseType: !1242, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1219, file: !1217, line: 124, baseType: !7, size: 32, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1219, file: !1217, line: 128, baseType: !7, size: 32, offset: 480)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1219, file: !1217, line: 131, baseType: !1249, size: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1217, line: 75, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!733, !1242, !1242}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1219, file: !1217, line: 132, baseType: !1254, size: 64, offset: 576)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1217, line: 78, baseType: !1236)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1219, file: !1217, line: 135, baseType: !733, size: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1219, file: !1217, line: 136, baseType: !1257, size: 64, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1217, line: 82, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!733, !733, !1242, !1242}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1219, file: !1217, line: 137, baseType: !1262, size: 64, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1217, line: 83, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !733, !733}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1219, file: !1217, line: 141, baseType: !7, size: 32, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1172, file: !1173, line: 484, baseType: !926, size: 64, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1172, file: !1173, line: 488, baseType: !926, size: 64, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1172, file: !1173, line: 493, baseType: !926, size: 64, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1172, file: !1173, line: 496, baseType: !926, size: 64, offset: 576)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1172, file: !1173, line: 501, baseType: !1272, size: 64, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1274)
!1274 = !{!1275, !1278, !1279, !1280, !1281, !1283, !1284, !1289, !1290, !1291, !1292, !1293, !1294}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1273, file: !329, line: 2356, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1273, file: !329, line: 2357, baseType: !743, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1273, file: !329, line: 2358, baseType: !734, size: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1273, file: !329, line: 2359, baseType: !734, size: 32, offset: 160)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1273, file: !329, line: 2360, baseType: !1282, size: 128, offset: 192)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 128, elements: !906)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1273, file: !329, line: 2364, baseType: !734, size: 32, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1273, file: !329, line: 2367, baseType: !1285, size: 128, offset: 384)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1286)
!1286 = !{!1287, !1288}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1285, file: !329, line: 2351, baseType: !810, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1285, file: !329, line: 2352, baseType: !896, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1273, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1273, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1273, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1273, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1273, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1273, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1172, file: !1173, line: 504, baseType: !1296, size: 64, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1173, line: 504, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1172, file: !1173, line: 507, baseType: !1216, size: 64, offset: 768)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1172, file: !1173, line: 510, baseType: !734, size: 32, offset: 832)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1172, file: !1173, line: 513, baseType: !734, size: 32, offset: 864)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1172, file: !1173, line: 516, baseType: !1046, size: 32, offset: 896)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1172, file: !1173, line: 519, baseType: !1046, size: 32, offset: 928)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1172, file: !1173, line: 522, baseType: !7, size: 32, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1172, file: !1173, line: 523, baseType: !7, size: 32, offset: 992)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1172, file: !1173, line: 528, baseType: !743, size: 64, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1172, file: !1173, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1172, file: !1173, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1172, file: !1173, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1172, file: !1173, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1172, file: !1173, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1172, file: !1173, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1172, file: !1173, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1172, file: !1173, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1172, file: !1173, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1172, file: !1173, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1172, file: !1173, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1172, file: !1173, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1172, file: !1173, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1172, file: !1173, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1172, file: !1173, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1172, file: !1173, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1167, file: !334, line: 3254, baseType: !926, size: 64, offset: 1536)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1167, file: !334, line: 3257, baseType: !926, size: 64, offset: 1600)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1167, file: !334, line: 3258, baseType: !926, size: 64, offset: 1664)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1167, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1167, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1167, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1167, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1167, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1167, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1167, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1167, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1167, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1167, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1167, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1167, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1167, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1167, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1167, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1167, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1167, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1167, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !334, line: 3394, baseType: !1344, size: 1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1371, !1372, !1373, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1344, file: !334, line: 2280, baseType: !964, size: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1344, file: !334, line: 2281, baseType: !926, size: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1344, file: !334, line: 2282, baseType: !926, size: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1344, file: !334, line: 2283, baseType: !926, size: 64, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1344, file: !334, line: 2284, baseType: !926, size: 64, offset: 384)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1344, file: !334, line: 2285, baseType: !7, size: 32, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1344, file: !334, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1344, file: !334, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1344, file: !334, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1344, file: !334, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1344, file: !334, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1344, file: !334, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1344, file: !334, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1344, file: !334, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1344, file: !334, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1344, file: !334, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1344, file: !334, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1344, file: !334, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1344, file: !334, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1344, file: !334, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1344, file: !334, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1344, file: !334, line: 2305, baseType: !7, size: 32, offset: 512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1344, file: !334, line: 2306, baseType: !1369, size: 32, offset: 544)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1370, line: 31, baseType: !734)
!1370 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1344, file: !334, line: 2307, baseType: !926, size: 64, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1344, file: !334, line: 2308, baseType: !926, size: 64, offset: 640)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1344, file: !334, line: 2314, baseType: !1374, size: 64, offset: 704)
!1374 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !334, line: 2309, size: 64, elements: !1375)
!1375 = !{!1376, !1377, !1378}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1374, file: !334, line: 2310, baseType: !734, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1374, file: !334, line: 2311, baseType: !743, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1374, file: !334, line: 2312, baseType: !1379, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !334, line: 2277, flags: DIFlagFwdDecl)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1344, file: !334, line: 2315, baseType: !926, size: 64, offset: 768)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1344, file: !334, line: 2316, baseType: !926, size: 64, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1344, file: !334, line: 2317, baseType: !926, size: 64, offset: 896)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1344, file: !334, line: 2318, baseType: !926, size: 64, offset: 960)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1344, file: !334, line: 2319, baseType: !926, size: 64, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1344, file: !334, line: 2320, baseType: !926, size: 64, offset: 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1344, file: !334, line: 2321, baseType: !926, size: 64, offset: 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1344, file: !334, line: 2322, baseType: !926, size: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1344, file: !334, line: 2324, baseType: !1390, size: 64, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !334, line: 2324, flags: DIFlagFwdDecl)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !928, file: !334, line: 3395, baseType: !1393, size: 320)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !334, line: 1469, size: 320, elements: !1394)
!1394 = !{!1395, !1396, !1397}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1393, file: !334, line: 1470, baseType: !964, size: 192)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1393, file: !334, line: 1471, baseType: !926, size: 64, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1393, file: !334, line: 1472, baseType: !926, size: 64, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !928, file: !334, line: 3396, baseType: !1399, size: 320)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !334, line: 1482, size: 320, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1399, file: !334, line: 1483, baseType: !964, size: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1399, file: !334, line: 1484, baseType: !734, size: 32, offset: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1399, file: !334, line: 1485, baseType: !1404, size: 64, offset: 256)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 64, elements: !844)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !928, file: !334, line: 3397, baseType: !1406, size: 384)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !334, line: 1829, size: 384, elements: !1407)
!1407 = !{!1408, !1409, !1410, !1411}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1406, file: !334, line: 1830, baseType: !964, size: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1406, file: !334, line: 1831, baseType: !1046, size: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1406, file: !334, line: 1832, baseType: !926, size: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1406, file: !334, line: 1835, baseType: !1404, size: 64, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !928, file: !334, line: 3398, baseType: !1413, size: 704)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !334, line: 1898, size: 704, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1421, !1422, !1425}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1413, file: !334, line: 1899, baseType: !964, size: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1413, file: !334, line: 1902, baseType: !926, size: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1413, file: !334, line: 1905, baseType: !1418, size: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !779, line: 58, baseType: !1419)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !779, line: 57, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1413, file: !334, line: 1908, baseType: !7, size: 32, offset: 320)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1413, file: !334, line: 1911, baseType: !1423, size: 64, offset: 384)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !334, line: 1876, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1413, file: !334, line: 1914, baseType: !1426, size: 256, offset: 448)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1427)
!1427 = !{!1428, !1430, !1431, !1436}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1426, file: !334, line: 1884, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1426, file: !334, line: 1885, baseType: !1429, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1426, file: !334, line: 1891, baseType: !1432, size: 64, offset: 128)
!1432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1426, file: !334, line: 1891, size: 64, elements: !1433)
!1433 = !{!1434, !1435}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1432, file: !334, line: 1891, baseType: !1418, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1432, file: !334, line: 1891, baseType: !926, size: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1426, file: !334, line: 1892, baseType: !1437, size: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !928, file: !334, line: 3399, baseType: !1439, size: 704)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !334, line: 2008, size: 704, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1458, !1459, !1460, !1461, !1462}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !334, line: 2009, baseType: !964, size: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1439, file: !334, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1439, file: !334, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1439, file: !334, line: 2014, baseType: !1046, size: 32, offset: 224)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1439, file: !334, line: 2016, baseType: !926, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1439, file: !334, line: 2017, baseType: !1447, size: 64, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1450)
!1450 = !{!1451}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1449, file: !334, line: 183, baseType: !1452, size: 128)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1454)
!1454 = !{!1455, !1456, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1453, file: !334, line: 182, baseType: !7, size: 32)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1453, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1453, file: !334, line: 182, baseType: !1404, size: 64, offset: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1439, file: !334, line: 2019, baseType: !926, size: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1439, file: !334, line: 2020, baseType: !926, size: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1439, file: !334, line: 2021, baseType: !926, size: 64, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1439, file: !334, line: 2022, baseType: !926, size: 64, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1439, file: !334, line: 2023, baseType: !926, size: 64, offset: 640)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !928, file: !334, line: 3400, baseType: !1464, size: 832)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !334, line: 2430, size: 832, elements: !1465)
!1465 = !{!1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1464, file: !334, line: 2431, baseType: !964, size: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1464, file: !334, line: 2433, baseType: !926, size: 64, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1464, file: !334, line: 2434, baseType: !926, size: 64, offset: 256)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1464, file: !334, line: 2435, baseType: !926, size: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1464, file: !334, line: 2436, baseType: !926, size: 64, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1464, file: !334, line: 2437, baseType: !1447, size: 64, offset: 448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1464, file: !334, line: 2438, baseType: !926, size: 64, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1464, file: !334, line: 2440, baseType: !926, size: 64, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1464, file: !334, line: 2441, baseType: !926, size: 64, offset: 640)
