; ModuleID = 'regmove.c'
source_filename = "regmove.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.gimple_seq_d = type opaque
%union.tree_node = type { %struct.tree_function_decl }

!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!712 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!718 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "match_use", file: !3, line: 54, baseType: !7, size: 32, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIEnumerator(name: "READ", value: 0, isUnsigned: true)
!747 = !DIEnumerator(name: "WRITE", value: 1, isUnsigned: true)
!748 = !DIEnumerator(name: "READWRITE", value: 2, isUnsigned: true)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !336, line: 1188, baseType: !7, size: 32, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!751 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!752 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!753 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!754 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!755 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!756 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!757 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!758 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!759 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!760 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!761 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!762 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!763 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!764 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!765 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!766 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!767 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!768 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!769 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!770 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!771 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!772 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!773 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!774 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!775 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!776 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!777 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!778 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!779 = !{!780, !567, !782, !1956, !189, !1957, !893}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !783, line: 50, baseType: !784)
!783 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !785, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !785, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !785, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !785, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !785, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !785, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !785, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !785, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !785, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !785, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !785, file: !568, line: 321, baseType: !798, size: 320, offset: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !799)
!799 = !{!800, !1891, !1893, !1954, !1955}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !798, file: !568, line: 316, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 64, elements: !820)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !804)
!804 = !{!805, !806, !807, !811, !812, !822, !823, !835, !838, !902, !1869, !1870, !1881, !1888}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !803, file: !568, line: 168, baseType: !781, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !803, file: !568, line: 169, baseType: !7, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !803, file: !568, line: 170, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !803, file: !568, line: 171, baseType: !782, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !803, file: !568, line: 172, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !783, line: 53, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !815, file: !568, line: 360, baseType: !781, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !815, file: !568, line: 361, baseType: !819, size: 64, offset: 64)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 64, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 1)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !803, file: !568, line: 173, baseType: !189, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !803, file: !568, line: 174, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !825, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !825, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !825, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !825, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !825, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !825, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !825, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !825, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !803, file: !568, line: 175, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !568, line: 175, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !803, file: !568, line: 176, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !841, line: 75, size: 256, elements: !842)
!841 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!842 = !{!843, !858, !859, !860}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !840, file: !841, line: 76, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !841, line: 68, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !841, line: 63, size: 320, elements: !847)
!847 = !{!848, !850, !851, !852}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !841, line: 64, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !846, file: !841, line: 65, baseType: !849, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !846, file: !841, line: 66, baseType: !7, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !846, file: !841, line: 67, baseType: !853, size: 128, offset: 192)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 128, elements: !856)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !841, line: 29, baseType: !855)
!855 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!856 = !{!857}
!857 = !DISubrange(count: 2)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !840, file: !841, line: 77, baseType: !844, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !840, file: !841, line: 78, baseType: !7, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !840, file: !841, line: 79, baseType: !861, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !841, line: 49, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !841, line: 45, size: 832, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !863, file: !841, line: 46, baseType: !849, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !863, file: !841, line: 47, baseType: !839, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !863, file: !841, line: 48, baseType: !868, size: 704, offset: 128)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !869, line: 164, size: 704, elements: !870)
!869 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!870 = !{!871, !873, !884, !885, !886, !887, !888, !889, !894, !898, !899, !900, !901}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !868, file: !869, line: 166, baseType: !872, size: 64)
!872 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !868, file: !869, line: 167, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !869, line: 157, size: 192, elements: !876)
!876 = !{!877, !879, !880}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !875, file: !869, line: 159, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !875, file: !869, line: 160, baseType: !874, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !875, file: !869, line: 161, baseType: !881, size: 32, offset: 128)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 32, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 4)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !868, file: !869, line: 168, baseType: !878, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !868, file: !869, line: 169, baseType: !878, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !868, file: !869, line: 170, baseType: !878, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !868, file: !869, line: 171, baseType: !872, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !868, file: !869, line: 172, baseType: !781, size: 32, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !868, file: !869, line: 176, baseType: !890, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!874, !893, !872}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !868, file: !869, line: 177, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !893, !874}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !868, file: !869, line: 178, baseType: !893, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !868, file: !869, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !868, file: !869, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !868, file: !869, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !803, file: !568, line: 177, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !783, line: 56, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !906)
!906 = !{!907, !940, !946, !957, !976, !987, !992, !999, !1005, !1019, !1031, !1069, !1074, !1102, !1110, !1111, !1116, !1125, !1131, !1136, !1140, !1144, !1505, !1554, !1560, !1566, !1573, !1599, !1613, !1630, !1642, !1664, !1679, !1851}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !341, line: 3372, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !908, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !908, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !908, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !908, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !908, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !908, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !908, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !908, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !908, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !908, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !908, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !908, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !908, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !908, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !908, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !908, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !908, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !908, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !908, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !908, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !908, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !908, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !908, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !908, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !908, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !908, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !908, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !908, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !908, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !908, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !905, file: !341, line: 3373, baseType: !941, size: 192)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !941, file: !341, line: 403, baseType: !908, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !941, file: !341, line: 404, baseType: !903, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !341, line: 405, baseType: !903, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !905, file: !341, line: 3374, baseType: !947, size: 320)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !341, line: 1385, baseType: !941, size: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !947, file: !341, line: 1386, baseType: !951, size: 128, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !952, line: 58, baseType: !953)
!952 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !952, line: 54, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !953, file: !952, line: 56, baseType: !855, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !953, file: !952, line: 57, baseType: !872, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !905, file: !341, line: 3375, baseType: !958, size: 256)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !341, line: 1398, baseType: !941, size: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !958, file: !341, line: 1399, baseType: !962, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !964, line: 52, size: 256, elements: !965)
!964 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!965 = !{!966, !967, !968, !969, !970, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !963, file: !964, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !963, file: !964, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !963, file: !964, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !963, file: !964, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !963, file: !964, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !963, file: !964, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !963, file: !964, line: 62, baseType: !973, size: 192, offset: 64)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 192, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 3)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !905, file: !341, line: 3376, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !341, line: 1409, baseType: !941, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !977, file: !341, line: 1410, baseType: !981, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !983, line: 27, size: 192, elements: !984)
!983 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !982, file: !983, line: 29, baseType: !951, size: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !982, file: !983, line: 30, baseType: !189, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !905, file: !341, line: 3377, baseType: !988, size: 256)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !341, line: 1438, baseType: !941, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !988, file: !341, line: 1439, baseType: !903, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !905, file: !341, line: 3378, baseType: !993, size: 256)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !341, line: 1419, baseType: !941, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !993, file: !341, line: 1420, baseType: !781, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !341, line: 1421, baseType: !998, size: 8, offset: 224)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 8, elements: !820)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !905, file: !341, line: 3379, baseType: !1000, size: 320)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !341, line: 1429, baseType: !941, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1000, file: !341, line: 1430, baseType: !903, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1000, file: !341, line: 1431, baseType: !903, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !905, file: !341, line: 3380, baseType: !1006, size: 320)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1006, file: !341, line: 1461, baseType: !941, size: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1006, file: !341, line: 1462, baseType: !1010, size: 128, offset: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1011, line: 31, size: 128, elements: !1012)
!1011 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1012 = !{!1013, !1017, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1010, file: !1011, line: 32, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1010, file: !1011, line: 33, baseType: !7, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1010, file: !1011, line: 34, baseType: !7, size: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !905, file: !341, line: 3381, baseType: !1020, size: 384)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !1021)
!1021 = !{!1022, !1023, !1028, !1029, !1030}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !341, line: 2508, baseType: !941, size: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1020, file: !341, line: 2509, baseType: !1024, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1025, line: 58, baseType: !1026)
!1025 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1027, line: 44, baseType: !7)
!1027 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1020, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !341, line: 2511, baseType: !903, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1020, file: !341, line: 2512, baseType: !903, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !905, file: !341, line: 3382, baseType: !1032, size: 896)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1032, file: !341, line: 2653, baseType: !1020, size: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1032, file: !341, line: 2654, baseType: !903, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1032, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1032, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1032, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1032, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1032, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1032, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1032, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1032, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1032, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1032, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1032, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1032, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1032, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1032, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1032, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1032, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1032, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1032, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1032, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1032, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1032, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1032, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1032, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1032, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1032, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1032, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1032, file: !341, line: 2705, baseType: !903, size: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1032, file: !341, line: 2706, baseType: !903, size: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1032, file: !341, line: 2707, baseType: !903, size: 64, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1032, file: !341, line: 2708, baseType: !903, size: 64, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1032, file: !341, line: 2711, baseType: !1067, size: 64, offset: 832)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !905, file: !341, line: 3383, baseType: !1070, size: 960)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !341, line: 2757, baseType: !1032, size: 896)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1070, file: !341, line: 2758, baseType: !782, size: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !905, file: !341, line: 3384, baseType: !1075, size: 1472)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1076)
!1076 = !{!1077, !1098, !1099, !1100, !1101}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1075, file: !341, line: 3115, baseType: !1078, size: 1216)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !341, line: 2985, baseType: !1070, size: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1078, file: !341, line: 2986, baseType: !903, size: 64, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1078, file: !341, line: 2987, baseType: !903, size: 64, offset: 1024)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1078, file: !341, line: 2988, baseType: !903, size: 64, offset: 1088)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1078, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1078, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1078, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1078, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1078, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1078, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1078, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1078, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1078, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1078, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1078, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1078, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1078, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1078, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1075, file: !341, line: 3117, baseType: !903, size: 64, offset: 1216)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1075, file: !341, line: 3119, baseType: !903, size: 64, offset: 1280)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1075, file: !341, line: 3121, baseType: !903, size: 64, offset: 1344)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1075, file: !341, line: 3123, baseType: !903, size: 64, offset: 1408)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !905, file: !341, line: 3385, baseType: !1103, size: 1088)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !341, line: 2875, baseType: !1070, size: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1103, file: !341, line: 2876, baseType: !782, size: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1103, file: !341, line: 2877, baseType: !1108, size: 64, offset: 1024)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !905, file: !341, line: 3386, baseType: !1078, size: 1216)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !905, file: !341, line: 3387, baseType: !1112, size: 1280)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !341, line: 3094, baseType: !1078, size: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1112, file: !341, line: 3095, baseType: !1108, size: 64, offset: 1216)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !905, file: !341, line: 3388, baseType: !1117, size: 1216)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !341, line: 2825, baseType: !1032, size: 896)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1117, file: !341, line: 2827, baseType: !903, size: 64, offset: 896)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1117, file: !341, line: 2828, baseType: !903, size: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1117, file: !341, line: 2829, baseType: !903, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1117, file: !341, line: 2830, baseType: !903, size: 64, offset: 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1117, file: !341, line: 2831, baseType: !903, size: 64, offset: 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !905, file: !341, line: 3389, baseType: !1126, size: 1024)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !341, line: 2851, baseType: !1070, size: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1126, file: !341, line: 2852, baseType: !781, size: 32, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1126, file: !341, line: 2853, baseType: !781, size: 32, offset: 992)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !905, file: !341, line: 3390, baseType: !1132, size: 1024)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !341, line: 2858, baseType: !1070, size: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1132, file: !341, line: 2859, baseType: !1108, size: 64, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !905, file: !341, line: 3391, baseType: !1137, size: 960)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1138)
!1138 = !{!1139}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !341, line: 2863, baseType: !1070, size: 960)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !905, file: !341, line: 3392, baseType: !1141, size: 1472)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !341, line: 3305, baseType: !1075, size: 1472)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !905, file: !341, line: 3393, baseType: !1145, size: 1792)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1146)
!1146 = !{!1147, !1148, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !341, line: 3249, baseType: !1075, size: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1145, file: !341, line: 3251, baseType: !1149, size: 64, offset: 1472)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1151, line: 463, size: 1152, elements: !1152)
!1151 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1152 = !{!1153, !1317, !1421, !1422, !1425, !1428, !1429, !1430, !1431, !1432, !1433, !1457, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1150, file: !1151, line: 464, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1156)
!1156 = !{!1157, !1206, !1219, !1233, !1285, !1298}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1155, file: !318, line: 197, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1194, !1203, !1204, !1205}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1160, file: !318, line: 119, baseType: !1159, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1160, file: !318, line: 122, baseType: !1159, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1160, file: !318, line: 123, baseType: !1159, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1160, file: !318, line: 126, baseType: !781, size: 32, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1160, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1160, file: !318, line: 165, baseType: !1168, size: 192, offset: 256)
!1168 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1169)
!1169 = !{!1170, !1183, !1189}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1168, file: !318, line: 137, baseType: !1171, size: 128)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1172)
!1172 = !{!1173, !1182}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1171, file: !318, line: 135, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1175, file: !318, line: 96, baseType: !1174, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1175, file: !318, line: 97, baseType: !1174, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1175, file: !318, line: 101, baseType: !903, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1175, file: !318, line: 106, baseType: !903, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1175, file: !318, line: 111, baseType: !903, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1171, file: !318, line: 136, baseType: !1174, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1168, file: !318, line: 151, baseType: !1184, size: 192)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1185)
!1185 = !{!1186, !1187, !1188}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1184, file: !318, line: 141, baseType: !903, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1184, file: !318, line: 145, baseType: !903, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1184, file: !318, line: 150, baseType: !781, size: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1168, file: !318, line: 164, baseType: !1190, size: 128)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1190, file: !318, line: 161, baseType: !903, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1190, file: !318, line: 163, baseType: !1024, size: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1160, file: !318, line: 168, baseType: !1195, size: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1196, file: !318, line: 70, baseType: !1195, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1196, file: !318, line: 73, baseType: !1159, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1196, file: !318, line: 78, baseType: !903, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1196, file: !318, line: 85, baseType: !782, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1196, file: !318, line: 88, baseType: !781, size: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1160, file: !318, line: 173, baseType: !782, size: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1160, file: !318, line: 173, baseType: !782, size: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1160, file: !318, line: 177, baseType: !1016, size: 8, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1155, file: !318, line: 200, baseType: !1207, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1210)
!1210 = !{!1211}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1209, file: !318, line: 185, baseType: !1212, size: 128)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1214)
!1214 = !{!1215, !1216, !1217}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1213, file: !318, line: 184, baseType: !7, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1213, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1213, file: !318, line: 184, baseType: !1218, size: 64, offset: 64)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 64, elements: !820)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1155, file: !318, line: 203, baseType: !1220, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1223)
!1223 = !{!1224}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1222, file: !318, line: 189, baseType: !1225, size: 128)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1226, file: !318, line: 188, baseType: !7, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1226, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1226, file: !318, line: 188, baseType: !1231, size: 64, offset: 64)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1232, size: 64, elements: !820)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1195)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1155, file: !318, line: 207, baseType: !1234, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1235, line: 144, baseType: !1236)
!1235 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1235, line: 100, size: 896, elements: !1238)
!1238 = !{!1239, !1247, !1252, !1257, !1259, !1262, !1263, !1264, !1265, !1266, !1271, !1273, !1274, !1279, !1284}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1237, file: !1235, line: 102, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1235, line: 52, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1235, line: 47, baseType: !7)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1237, file: !1235, line: 105, baseType: !1248, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1235, line: 59, baseType: !1249)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!781, !1245, !1245}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1237, file: !1235, line: 108, baseType: !1253, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1235, line: 63, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !893}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1237, file: !1235, line: 111, baseType: !1258, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !1235, line: 114, baseType: !1260, size: 64, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1261, line: 46, baseType: !855)
!1261 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1237, file: !1235, line: 117, baseType: !1260, size: 64, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1237, file: !1235, line: 120, baseType: !1260, size: 64, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1237, file: !1235, line: 124, baseType: !7, size: 32, offset: 448)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1237, file: !1235, line: 128, baseType: !7, size: 32, offset: 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1237, file: !1235, line: 131, baseType: !1267, size: 64, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1235, line: 75, baseType: !1268)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!893, !1260, !1260}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1237, file: !1235, line: 132, baseType: !1272, size: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1235, line: 78, baseType: !1254)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1237, file: !1235, line: 135, baseType: !893, size: 64, offset: 640)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1237, file: !1235, line: 136, baseType: !1275, size: 64, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1235, line: 82, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!893, !893, !1260, !1260}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1237, file: !1235, line: 137, baseType: !1280, size: 64, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1235, line: 83, baseType: !1281)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !893, !893}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1237, file: !1235, line: 141, baseType: !7, size: 32, offset: 832)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1155, file: !318, line: 211, baseType: !1286, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1289)
!1289 = !{!1290}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1288, file: !341, line: 183, baseType: !1291, size: 128)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1293)
!1293 = !{!1294, !1295, !1296}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1292, file: !341, line: 182, baseType: !7, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1292, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1292, file: !341, line: 182, baseType: !1297, size: 64, offset: 64)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !820)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1155, file: !318, line: 220, baseType: !1299, size: 64, offset: 320)
!1299 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1300)
!1300 = !{!1301, !1302}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1299, file: !318, line: 218, baseType: !1286, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1299, file: !318, line: 219, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1305, line: 29, baseType: !1306)
!1305 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1305, line: 29, size: 96, elements: !1307)
!1307 = !{!1308}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1306, file: !1305, line: 29, baseType: !1309, size: 96)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1305, line: 27, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1305, line: 27, size: 96, elements: !1311)
!1311 = !{!1312, !1313, !1314}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1310, file: !1305, line: 27, baseType: !7, size: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1310, file: !1305, line: 27, baseType: !7, size: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1310, file: !1305, line: 27, baseType: !1315, size: 8, offset: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1316, size: 8, elements: !820)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1305, line: 26, baseType: !1016)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1150, file: !1151, line: 467, baseType: !1318, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1320)
!1320 = !{!1321, !1396, !1397, !1410, !1411, !1412, !1413, !1414, !1415, !1417, !1419, !1420}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1319, file: !325, line: 377, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !783, line: 111, baseType: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1325)
!1325 = !{!1326, !1361, !1362, !1363, !1366, !1370, !1371, !1372, !1390, !1391, !1392, !1393, !1394, !1395}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1324, file: !325, line: 219, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1330)
!1330 = !{!1331}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1329, file: !325, line: 151, baseType: !1332, size: 128)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1333, file: !325, line: 150, baseType: !7, size: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1333, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1333, file: !325, line: 150, baseType: !1338, size: 64, offset: 64)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 64, elements: !820)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !783, line: 108, baseType: !1340)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1353, !1354, !1355, !1356, !1357, !1358, !1359}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1341, file: !325, line: 124, baseType: !1323, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1341, file: !325, line: 125, baseType: !1323, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1341, file: !325, line: 131, baseType: !1346, size: 64, offset: 128)
!1346 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1347)
!1347 = !{!1348, !1352}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1346, file: !325, line: 129, baseType: !1349, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !783, line: 66, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !783, line: 65, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1346, file: !325, line: 130, baseType: !782, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1341, file: !325, line: 134, baseType: !893, size: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1341, file: !325, line: 137, baseType: !903, size: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1341, file: !325, line: 138, baseType: !1024, size: 32, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1341, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1341, file: !325, line: 144, baseType: !781, size: 32, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1341, file: !325, line: 145, baseType: !781, size: 32, offset: 416)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1341, file: !325, line: 146, baseType: !1360, size: 64, offset: 448)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !872)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1324, file: !325, line: 220, baseType: !1327, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1324, file: !325, line: 223, baseType: !893, size: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1324, file: !325, line: 226, baseType: !1364, size: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1324, file: !325, line: 229, baseType: !1367, size: 128, offset: 256)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1368, size: 128, elements: !856)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1324, file: !325, line: 232, baseType: !1323, size: 64, offset: 384)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1324, file: !325, line: 233, baseType: !1323, size: 64, offset: 448)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1324, file: !325, line: 238, baseType: !1373, size: 64, offset: 512)
!1373 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1374)
!1374 = !{!1375, !1381}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1373, file: !325, line: 236, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1378)
!1378 = !{!1379, !1380}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1377, file: !325, line: 275, baseType: !1349, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1377, file: !325, line: 278, baseType: !1349, size: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1373, file: !325, line: 237, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388, !1389}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1383, file: !325, line: 261, baseType: !782, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1383, file: !325, line: 262, baseType: !782, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1383, file: !325, line: 266, baseType: !782, size: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1383, file: !325, line: 267, baseType: !782, size: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1383, file: !325, line: 270, baseType: !781, size: 32, offset: 256)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1324, file: !325, line: 241, baseType: !1360, size: 64, offset: 576)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1324, file: !325, line: 244, baseType: !781, size: 32, offset: 640)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1324, file: !325, line: 247, baseType: !781, size: 32, offset: 672)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1324, file: !325, line: 250, baseType: !781, size: 32, offset: 704)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1324, file: !325, line: 253, baseType: !781, size: 32, offset: 736)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1324, file: !325, line: 256, baseType: !781, size: 32, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1319, file: !325, line: 378, baseType: !1322, size: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1319, file: !325, line: 381, baseType: !1398, size: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1400, file: !325, line: 282, baseType: !1403, size: 128)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1404, file: !325, line: 281, baseType: !7, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1404, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1404, file: !325, line: 281, baseType: !1409, size: 64, offset: 64)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 64, elements: !820)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1319, file: !325, line: 384, baseType: !781, size: 32, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1319, file: !325, line: 387, baseType: !781, size: 32, offset: 224)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1319, file: !325, line: 390, baseType: !781, size: 32, offset: 256)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1319, file: !325, line: 394, baseType: !1398, size: 64, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1319, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1319, file: !325, line: 399, baseType: !1416, size: 64, offset: 416)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !856)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1319, file: !325, line: 402, baseType: !1418, size: 64, offset: 480)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !856)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1319, file: !325, line: 406, baseType: !781, size: 32, offset: 544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1319, file: !325, line: 409, baseType: !781, size: 32, offset: 576)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1150, file: !1151, line: 470, baseType: !1350, size: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1150, file: !1151, line: 473, baseType: !1423, size: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1151, line: 166, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1150, file: !1151, line: 476, baseType: !1426, size: 64, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1151, line: 476, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1150, file: !1151, line: 479, baseType: !1234, size: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1150, file: !1151, line: 484, baseType: !903, size: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1150, file: !1151, line: 488, baseType: !903, size: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1150, file: !1151, line: 493, baseType: !903, size: 64, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1150, file: !1151, line: 496, baseType: !903, size: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1150, file: !1151, line: 501, baseType: !1434, size: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1436)
!1436 = !{!1437, !1440, !1441, !1442, !1443, !1445, !1446, !1451, !1452, !1453, !1454, !1455, !1456}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1435, file: !336, line: 2356, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1435, file: !336, line: 2357, baseType: !808, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1435, file: !336, line: 2358, baseType: !781, size: 32, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1435, file: !336, line: 2359, baseType: !781, size: 32, offset: 160)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1435, file: !336, line: 2360, baseType: !1444, size: 128, offset: 192)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 128, elements: !882)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1435, file: !336, line: 2364, baseType: !781, size: 32, offset: 320)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1435, file: !336, line: 2367, baseType: !1447, size: 128, offset: 384)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1448)
!1448 = !{!1449, !1450}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1447, file: !336, line: 2351, baseType: !782, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1447, file: !336, line: 2352, baseType: !872, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1435, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1435, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1435, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1435, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1435, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1435, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1150, file: !1151, line: 504, baseType: !1458, size: 64, offset: 704)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1151, line: 504, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1150, file: !1151, line: 507, baseType: !1234, size: 64, offset: 768)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1150, file: !1151, line: 510, baseType: !781, size: 32, offset: 832)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1150, file: !1151, line: 513, baseType: !781, size: 32, offset: 864)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1150, file: !1151, line: 516, baseType: !1024, size: 32, offset: 896)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1150, file: !1151, line: 519, baseType: !1024, size: 32, offset: 928)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1150, file: !1151, line: 522, baseType: !7, size: 32, offset: 960)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1150, file: !1151, line: 523, baseType: !7, size: 32, offset: 992)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1150, file: !1151, line: 528, baseType: !808, size: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1150, file: !1151, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1150, file: !1151, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1150, file: !1151, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1150, file: !1151, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1150, file: !1151, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1150, file: !1151, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1150, file: !1151, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1150, file: !1151, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1150, file: !1151, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1150, file: !1151, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1150, file: !1151, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1150, file: !1151, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1150, file: !1151, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1150, file: !1151, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1150, file: !1151, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1150, file: !1151, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1145, file: !341, line: 3254, baseType: !903, size: 64, offset: 1536)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1145, file: !341, line: 3257, baseType: !903, size: 64, offset: 1600)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1145, file: !341, line: 3258, baseType: !903, size: 64, offset: 1664)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1145, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1145, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1145, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1145, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1145, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1145, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1145, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1145, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1145, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1145, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1145, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1145, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1145, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1145, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1145, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1145, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1145, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1145, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !341, line: 3394, baseType: !1506, size: 1344)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1533, !1534, !1535, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1506, file: !341, line: 2280, baseType: !941, size: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1506, file: !341, line: 2281, baseType: !903, size: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1506, file: !341, line: 2282, baseType: !903, size: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1506, file: !341, line: 2283, baseType: !903, size: 64, offset: 320)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1506, file: !341, line: 2284, baseType: !903, size: 64, offset: 384)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1506, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1506, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1506, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1506, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1506, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1506, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1506, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1506, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1506, file: !341, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1506, file: !341, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1506, file: !341, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1506, file: !341, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
