; ModuleID = 'c-errors.c'
source_filename = "c-errors.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.diagnostic_context = type { %struct.pretty_print_info*, [12 x i32], i8, i8, [870 x i32], i8, i8, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (i8*, [1 x %struct.__va_list_tag]*)*, %union.tree_node*, %struct.line_map*, i32, i8 }
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque

!207 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!208 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!209 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!210 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!224 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!225 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!226 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!227 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!228 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!229 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 29, baseType: !5, size: 32, elements: !233)
!232 = !DIFile(filename: "./diagnostic.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!234 = !DIEnumerator(name: "DK_UNSPECIFIED", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "DK_IGNORED", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "DK_FATAL", value: 2, isUnsigned: true)
!237 = !DIEnumerator(name: "DK_ICE", value: 3, isUnsigned: true)
!238 = !DIEnumerator(name: "DK_ERROR", value: 4, isUnsigned: true)
!239 = !DIEnumerator(name: "DK_SORRY", value: 5, isUnsigned: true)
!240 = !DIEnumerator(name: "DK_WARNING", value: 6, isUnsigned: true)
!241 = !DIEnumerator(name: "DK_ANACHRONISM", value: 7, isUnsigned: true)
!242 = !DIEnumerator(name: "DK_NOTE", value: 8, isUnsigned: true)
!243 = !DIEnumerator(name: "DK_DEBUG", value: 9, isUnsigned: true)
!244 = !DIEnumerator(name: "DK_PEDWARN", value: 10, isUnsigned: true)
!245 = !DIEnumerator(name: "DK_PERMERROR", value: 11, isUnsigned: true)
!246 = !DIEnumerator(name: "DK_LAST_DIAGNOSTIC_KIND", value: 12, isUnsigned: true)
!247 = !{i32 7, !"Dwarf Version", i32 4}
!248 = !{i32 2, !"Debug Info Version", i32 3}
!249 = !{i32 1, !"wchar_size", i32 4}
!250 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!251 = distinct !DISubprogram(name: "pedwarn_c99", scope: !1, file: !1, line: 34, type: !252, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !262)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !254, !258, !259, null}
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !255, line: 58, baseType: !256)
!255 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !257, line: 44, baseType: !5)
!257 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!262 = !{}
!263 = !DILocalVariable(name: "location", arg: 1, scope: !251, file: !1, line: 34, type: !254)
!264 = !DILocation(line: 34, column: 25, scope: !251)
!265 = !DILocalVariable(name: "opt", arg: 2, scope: !251, file: !1, line: 34, type: !258)
!266 = !DILocation(line: 34, column: 39, scope: !251)
!267 = !DILocalVariable(name: "gmsgid", arg: 3, scope: !251, file: !1, line: 34, type: !259)
!268 = !DILocation(line: 34, column: 56, scope: !251)
!269 = !DILocalVariable(name: "diagnostic", scope: !251, file: !1, line: 36, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_info", file: !232, line: 52, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "diagnostic_info", file: !232, line: 40, size: 512, elements: !272)
!272 = !{!273, !935, !936, !937, !938, !940}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !271, file: !232, line: 42, baseType: !274, size: 320)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "text_info", file: !275, line: 39, baseType: !276)
!275 = !DIFile(filename: "./pretty-print.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 32, size: 320, elements: !277)
!277 = !{!278, !279, !296, !297, !299}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "format_spec", scope: !276, file: !275, line: 34, baseType: !259, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "args_ptr", scope: !276, file: !275, line: 35, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !282, line: 52, baseType: !283)
!282 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !284, line: 32, baseType: !285)
!284 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 36, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, elements: !294)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 36, size: 192, elements: !288)
!288 = !{!289, !290, !291, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !287, file: !1, line: 36, baseType: !5, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !287, file: !1, line: 36, baseType: !5, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !287, file: !1, line: 36, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !287, file: !1, line: 36, baseType: !292, size: 64, offset: 128)
!294 = !{!295}
!295 = !DISubrange(count: 1)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !276, file: !275, line: 36, baseType: !258, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !276, file: !275, line: 37, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !276, file: !275, line: 38, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !302, line: 56, baseType: !303)
!302 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !305)
!305 = !{!306, !339, !345, !358, !365, !372, !377, !384, !390, !404, !412, !450, !458, !486, !494, !495, !500, !509, !515, !520, !524, !528, !557, !606, !612, !619, !626, !651, !676, !693, !705, !727, !745, !917}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !304, file: !4, line: 3372, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !307, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !307, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !307, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !307, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !307, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !307, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !307, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !307, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !307, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !307, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !307, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !307, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !307, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !307, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !307, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !307, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !307, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !307, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !307, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !307, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !307, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !307, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !307, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !307, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !307, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !307, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !307, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !307, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !307, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !307, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !304, file: !4, line: 3373, baseType: !340, size: 192)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !341)
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !340, file: !4, line: 403, baseType: !307, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !340, file: !4, line: 404, baseType: !301, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !4, line: 405, baseType: !301, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !304, file: !4, line: 3374, baseType: !346, size: 320)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !346, file: !4, line: 1385, baseType: !340, size: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !346, file: !4, line: 1386, baseType: !350, size: 128, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !351, line: 58, baseType: !352)
!351 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 54, size: 128, elements: !353)
!353 = !{!354, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !352, file: !351, line: 56, baseType: !355, size: 64)
!355 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !352, file: !351, line: 57, baseType: !357, size: 64, offset: 64)
!357 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !304, file: !4, line: 3375, baseType: !359, size: 256)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !359, file: !4, line: 1398, baseType: !340, size: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !359, file: !4, line: 1399, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !304, file: !4, line: 3376, baseType: !366, size: 256)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !366, file: !4, line: 1409, baseType: !340, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !366, file: !4, line: 1410, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !304, file: !4, line: 3377, baseType: !373, size: 256)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !373, file: !4, line: 1438, baseType: !340, size: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !373, file: !4, line: 1439, baseType: !301, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !304, file: !4, line: 3378, baseType: !378, size: 256)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !378, file: !4, line: 1419, baseType: !340, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !378, file: !4, line: 1420, baseType: !258, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !378, file: !4, line: 1421, baseType: !383, size: 8, offset: 224)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 8, elements: !294)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !304, file: !4, line: 3379, baseType: !385, size: 320)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !385, file: !4, line: 1429, baseType: !340, size: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !385, file: !4, line: 1430, baseType: !301, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !385, file: !4, line: 1431, baseType: !301, size: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !304, file: !4, line: 3380, baseType: !391, size: 320)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !391, file: !4, line: 1461, baseType: !340, size: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !4, line: 1462, baseType: !395, size: 128, offset: 192)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !396, line: 31, size: 128, elements: !397)
!396 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!397 = !{!398, !402, !403}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !395, file: !396, line: 32, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !395, file: !396, line: 33, baseType: !5, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !395, file: !396, line: 34, baseType: !5, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !304, file: !4, line: 3381, baseType: !405, size: 384)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !406)
!406 = !{!407, !408, !409, !410, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !405, file: !4, line: 2508, baseType: !340, size: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !405, file: !4, line: 2509, baseType: !254, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !405, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !4, line: 2511, baseType: !301, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !405, file: !4, line: 2512, baseType: !301, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !304, file: !4, line: 3382, baseType: !413, size: 896)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !413, file: !4, line: 2653, baseType: !405, size: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !413, file: !4, line: 2654, baseType: !301, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !413, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !413, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !413, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !413, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !413, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !413, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !413, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !413, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !413, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !413, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !413, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !413, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !413, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !413, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !413, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !413, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !413, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !413, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !413, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !413, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !413, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !413, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !413, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !413, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !413, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !413, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !413, file: !4, line: 2705, baseType: !301, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !413, file: !4, line: 2706, baseType: !301, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !413, file: !4, line: 2707, baseType: !301, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !413, file: !4, line: 2708, baseType: !301, size: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !413, file: !4, line: 2711, baseType: !448, size: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !304, file: !4, line: 3383, baseType: !451, size: 960)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !451, file: !4, line: 2757, baseType: !413, size: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !451, file: !4, line: 2758, baseType: !455, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !302, line: 50, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !302, line: 49, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !304, file: !4, line: 3384, baseType: !459, size: 1472)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !460)
!460 = !{!461, !482, !483, !484, !485}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !4, line: 3115, baseType: !462, size: 1216)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !462, file: !4, line: 2985, baseType: !451, size: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !462, file: !4, line: 2986, baseType: !301, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !462, file: !4, line: 2987, baseType: !301, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !462, file: !4, line: 2988, baseType: !301, size: 64, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !462, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !462, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !462, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !462, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !462, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !462, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !462, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !462, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !462, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !462, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !462, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !462, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !462, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !462, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !459, file: !4, line: 3117, baseType: !301, size: 64, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !459, file: !4, line: 3119, baseType: !301, size: 64, offset: 1280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !459, file: !4, line: 3121, baseType: !301, size: 64, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !459, file: !4, line: 3123, baseType: !301, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !304, file: !4, line: 3385, baseType: !487, size: 1088)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !487, file: !4, line: 2875, baseType: !451, size: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !487, file: !4, line: 2876, baseType: !455, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !487, file: !4, line: 2877, baseType: !492, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !304, file: !4, line: 3386, baseType: !462, size: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !304, file: !4, line: 3387, baseType: !496, size: 1280)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !4, line: 3094, baseType: !462, size: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !496, file: !4, line: 3095, baseType: !492, size: 64, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !304, file: !4, line: 3388, baseType: !501, size: 1216)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !501, file: !4, line: 2825, baseType: !413, size: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !501, file: !4, line: 2827, baseType: !301, size: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !501, file: !4, line: 2828, baseType: !301, size: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !501, file: !4, line: 2829, baseType: !301, size: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !501, file: !4, line: 2830, baseType: !301, size: 64, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !501, file: !4, line: 2831, baseType: !301, size: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !304, file: !4, line: 3389, baseType: !510, size: 1024)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !510, file: !4, line: 2851, baseType: !451, size: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !510, file: !4, line: 2852, baseType: !258, size: 32, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !510, file: !4, line: 2853, baseType: !258, size: 32, offset: 992)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !304, file: !4, line: 3390, baseType: !516, size: 1024)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !4, line: 2858, baseType: !451, size: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !516, file: !4, line: 2859, baseType: !492, size: 64, offset: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !304, file: !4, line: 3391, baseType: !521, size: 960)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !521, file: !4, line: 2863, baseType: !451, size: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !304, file: !4, line: 3392, baseType: !525, size: 1472)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !526)
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !525, file: !4, line: 3305, baseType: !459, size: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !304, file: !4, line: 3393, baseType: !529, size: 1792)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !530)
!530 = !{!531, !532, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !529, file: !4, line: 3249, baseType: !459, size: 1472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !529, file: !4, line: 3251, baseType: !533, size: 64, offset: 1472)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !535, line: 41, flags: DIFlagFwdDecl)
!535 = !DIFile(filename: "./statistics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !529, file: !4, line: 3254, baseType: !301, size: 64, offset: 1536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !529, file: !4, line: 3257, baseType: !301, size: 64, offset: 1600)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !529, file: !4, line: 3258, baseType: !301, size: 64, offset: 1664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !529, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !529, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !529, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !529, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !529, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !529, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !529, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !529, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !529, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !529, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !529, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !529, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !529, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !529, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !529, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !529, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !529, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !529, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !4, line: 3394, baseType: !558, size: 1344)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !585, !586, !587, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !4, line: 2280, baseType: !340, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !558, file: !4, line: 2281, baseType: !301, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !558, file: !4, line: 2282, baseType: !301, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !558, file: !4, line: 2283, baseType: !301, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !558, file: !4, line: 2284, baseType: !301, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !558, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !558, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !558, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !558, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !558, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !558, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !558, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !558, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !558, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !558, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !558, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !558, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !558, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !558, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !558, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !558, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !558, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !558, file: !4, line: 2306, baseType: !583, size: 32, offset: 544)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !584, line: 31, baseType: !258)
!584 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !558, file: !4, line: 2307, baseType: !301, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !558, file: !4, line: 2308, baseType: !301, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !558, file: !4, line: 2314, baseType: !588, size: 64, offset: 704)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !588, file: !4, line: 2310, baseType: !258, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !588, file: !4, line: 2311, baseType: !259, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !588, file: !4, line: 2312, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !4, line: 2315, baseType: !301, size: 64, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !558, file: !4, line: 2316, baseType: !301, size: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !558, file: !4, line: 2317, baseType: !301, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !558, file: !4, line: 2318, baseType: !301, size: 64, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !558, file: !4, line: 2319, baseType: !301, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !558, file: !4, line: 2320, baseType: !301, size: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !558, file: !4, line: 2321, baseType: !301, size: 64, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !558, file: !4, line: 2322, baseType: !301, size: 64, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !558, file: !4, line: 2324, baseType: !604, size: 64, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !304, file: !4, line: 3395, baseType: !607, size: 320)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !607, file: !4, line: 1470, baseType: !340, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !607, file: !4, line: 1471, baseType: !301, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !607, file: !4, line: 1472, baseType: !301, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !304, file: !4, line: 3396, baseType: !613, size: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !4, line: 1483, baseType: !340, size: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !613, file: !4, line: 1484, baseType: !258, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !613, file: !4, line: 1485, baseType: !618, size: 64, offset: 256)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 64, elements: !294)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !304, file: !4, line: 3397, baseType: !620, size: 384)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !620, file: !4, line: 1830, baseType: !340, size: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !620, file: !4, line: 1831, baseType: !254, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !620, file: !4, line: 1832, baseType: !301, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !620, file: !4, line: 1835, baseType: !618, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !304, file: !4, line: 3398, baseType: !627, size: 704)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !628)
!628 = !{!629, !630, !631, !635, !636, !639}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !4, line: 1899, baseType: !340, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !627, file: !4, line: 1902, baseType: !301, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !627, file: !4, line: 1905, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !302, line: 58, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !302, line: 57, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !627, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !627, file: !4, line: 1911, baseType: !637, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !627, file: !4, line: 1914, baseType: !640, size: 256, offset: 448)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !641)
!641 = !{!642, !644, !645, !650}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !4, line: 1884, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !4, line: 1885, baseType: !643, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !640, file: !4, line: 1891, baseType: !646, size: 64, offset: 128)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !4, line: 1891, size: 64, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !646, file: !4, line: 1891, baseType: !632, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !646, file: !4, line: 1891, baseType: !301, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !640, file: !4, line: 1892, baseType: !300, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !304, file: !4, line: 3399, baseType: !652, size: 704)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !671, !672, !673, !674, !675}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !652, file: !4, line: 2009, baseType: !340, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !652, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !652, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !652, file: !4, line: 2014, baseType: !254, size: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !652, file: !4, line: 2016, baseType: !301, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !652, file: !4, line: 2017, baseType: !660, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !662, file: !4, line: 183, baseType: !665, size: 128)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !666, file: !4, line: 182, baseType: !5, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !666, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !666, file: !4, line: 182, baseType: !618, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !652, file: !4, line: 2019, baseType: !301, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !652, file: !4, line: 2020, baseType: !301, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !652, file: !4, line: 2021, baseType: !301, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !652, file: !4, line: 2022, baseType: !301, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !652, file: !4, line: 2023, baseType: !301, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !304, file: !4, line: 3400, baseType: !677, size: 832)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !4, line: 2430, size: 832, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !4, line: 2431, baseType: !340, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !677, file: !4, line: 2433, baseType: !301, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !677, file: !4, line: 2434, baseType: !301, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !677, file: !4, line: 2435, baseType: !301, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !677, file: !4, line: 2436, baseType: !301, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !677, file: !4, line: 2437, baseType: !660, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !677, file: !4, line: 2438, baseType: !301, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !677, file: !4, line: 2440, baseType: !301, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !677, file: !4, line: 2441, baseType: !301, size: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !677, file: !4, line: 2443, baseType: !689, size: 128, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !4, line: 182, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !4, line: 182, size: 128, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !690, file: !4, line: 182, baseType: !665, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !304, file: !4, line: 3401, baseType: !694, size: 320)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !4, line: 3327, size: 320, elements: !695)
!695 = !{!696, !697, !704}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !694, file: !4, line: 3329, baseType: !340, size: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !694, file: !4, line: 3330, baseType: !698, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !4, line: 3320, size: 192, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !699, file: !4, line: 3322, baseType: !698, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !4, line: 3323, baseType: !698, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !699, file: !4, line: 3324, baseType: !301, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !694, file: !4, line: 3331, baseType: !698, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !304, file: !4, line: 3402, baseType: !706, size: 256)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !4, line: 1540, size: 256, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !4, line: 1541, baseType: !340, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !706, file: !4, line: 1542, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !4, line: 1538, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !4, line: 1538, size: 192, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !4, line: 1538, baseType: !715, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !4, line: 1537, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !4, line: 1537, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !716, file: !4, line: 1537, baseType: !5, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !716, file: !4, line: 1537, baseType: !5, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !716, file: !4, line: 1537, baseType: !721, size: 128, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 128, elements: !294)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !4, line: 1535, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !4, line: 1532, size: 128, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !723, file: !4, line: 1533, baseType: !301, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !723, file: !4, line: 1534, baseType: !301, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !304, file: !4, line: 3403, baseType: !728, size: 512)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !4, line: 1938, size: 512, elements: !729)
!729 = !{!730, !731, !732, !733, !739, !743, !744}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !4, line: 1939, baseType: !340, size: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !728, file: !4, line: 1940, baseType: !254, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !728, file: !4, line: 1941, baseType: !3, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !728, file: !4, line: 1946, baseType: !734, size: 32, offset: 256)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !4, line: 1942, size: 32, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !734, file: !4, line: 1943, baseType: !23, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !734, file: !4, line: 1944, baseType: !30, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !734, file: !4, line: 1945, baseType: !37, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !728, file: !4, line: 1950, baseType: !740, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !302, line: 66, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !302, line: 65, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !728, file: !4, line: 1951, baseType: !740, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !728, file: !4, line: 1953, baseType: !618, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !304, file: !4, line: 3404, baseType: !746, size: 1664)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !4, line: 3337, size: 1664, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !4, line: 3338, baseType: !340, size: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !746, file: !4, line: 3341, baseType: !750, size: 1472, offset: 192)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !751, line: 410, size: 1472, elements: !752)
!751 = !DIFile(filename: "./options.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !750, file: !751, line: 412, baseType: !258, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !750, file: !751, line: 413, baseType: !258, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !750, file: !751, line: 414, baseType: !258, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !750, file: !751, line: 415, baseType: !258, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !750, file: !751, line: 416, baseType: !258, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !750, file: !751, line: 417, baseType: !258, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !750, file: !751, line: 418, baseType: !401, size: 8, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !750, file: !751, line: 419, baseType: !401, size: 8, offset: 200)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !750, file: !751, line: 420, baseType: !762, size: 8, offset: 208)
!762 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !750, file: !751, line: 421, baseType: !762, size: 8, offset: 216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !750, file: !751, line: 422, baseType: !762, size: 8, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !750, file: !751, line: 423, baseType: !762, size: 8, offset: 232)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !750, file: !751, line: 424, baseType: !762, size: 8, offset: 240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !750, file: !751, line: 425, baseType: !762, size: 8, offset: 248)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !750, file: !751, line: 426, baseType: !762, size: 8, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !750, file: !751, line: 427, baseType: !762, size: 8, offset: 264)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !750, file: !751, line: 428, baseType: !762, size: 8, offset: 272)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !750, file: !751, line: 429, baseType: !762, size: 8, offset: 280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !750, file: !751, line: 430, baseType: !762, size: 8, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !750, file: !751, line: 431, baseType: !762, size: 8, offset: 296)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !750, file: !751, line: 432, baseType: !762, size: 8, offset: 304)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !750, file: !751, line: 433, baseType: !762, size: 8, offset: 312)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !750, file: !751, line: 434, baseType: !762, size: 8, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !750, file: !751, line: 435, baseType: !762, size: 8, offset: 328)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !750, file: !751, line: 436, baseType: !762, size: 8, offset: 336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !750, file: !751, line: 437, baseType: !762, size: 8, offset: 344)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !750, file: !751, line: 438, baseType: !762, size: 8, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !750, file: !751, line: 439, baseType: !762, size: 8, offset: 360)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !750, file: !751, line: 440, baseType: !762, size: 8, offset: 368)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !750, file: !751, line: 441, baseType: !762, size: 8, offset: 376)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !750, file: !751, line: 442, baseType: !762, size: 8, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !750, file: !751, line: 443, baseType: !762, size: 8, offset: 392)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !750, file: !751, line: 444, baseType: !762, size: 8, offset: 400)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !750, file: !751, line: 445, baseType: !762, size: 8, offset: 408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !750, file: !751, line: 446, baseType: !762, size: 8, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !750, file: !751, line: 447, baseType: !762, size: 8, offset: 424)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !750, file: !751, line: 448, baseType: !762, size: 8, offset: 432)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !750, file: !751, line: 449, baseType: !762, size: 8, offset: 440)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !750, file: !751, line: 450, baseType: !762, size: 8, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !750, file: !751, line: 451, baseType: !762, size: 8, offset: 456)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !750, file: !751, line: 452, baseType: !762, size: 8, offset: 464)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !750, file: !751, line: 453, baseType: !762, size: 8, offset: 472)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !750, file: !751, line: 454, baseType: !762, size: 8, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !750, file: !751, line: 455, baseType: !762, size: 8, offset: 488)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !750, file: !751, line: 456, baseType: !762, size: 8, offset: 496)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !750, file: !751, line: 457, baseType: !762, size: 8, offset: 504)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !750, file: !751, line: 458, baseType: !762, size: 8, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !750, file: !751, line: 459, baseType: !762, size: 8, offset: 520)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !750, file: !751, line: 460, baseType: !762, size: 8, offset: 528)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !750, file: !751, line: 461, baseType: !762, size: 8, offset: 536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !750, file: !751, line: 462, baseType: !762, size: 8, offset: 544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !750, file: !751, line: 463, baseType: !762, size: 8, offset: 552)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !750, file: !751, line: 464, baseType: !762, size: 8, offset: 560)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !750, file: !751, line: 465, baseType: !762, size: 8, offset: 568)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !750, file: !751, line: 466, baseType: !762, size: 8, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !750, file: !751, line: 467, baseType: !762, size: 8, offset: 584)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !750, file: !751, line: 468, baseType: !762, size: 8, offset: 592)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !750, file: !751, line: 469, baseType: !762, size: 8, offset: 600)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !750, file: !751, line: 470, baseType: !762, size: 8, offset: 608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !750, file: !751, line: 471, baseType: !762, size: 8, offset: 616)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !750, file: !751, line: 472, baseType: !762, size: 8, offset: 624)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !750, file: !751, line: 473, baseType: !762, size: 8, offset: 632)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !750, file: !751, line: 474, baseType: !762, size: 8, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !750, file: !751, line: 475, baseType: !762, size: 8, offset: 648)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !750, file: !751, line: 476, baseType: !762, size: 8, offset: 656)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !750, file: !751, line: 477, baseType: !762, size: 8, offset: 664)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !750, file: !751, line: 478, baseType: !762, size: 8, offset: 672)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !750, file: !751, line: 479, baseType: !762, size: 8, offset: 680)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !750, file: !751, line: 480, baseType: !762, size: 8, offset: 688)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !750, file: !751, line: 481, baseType: !762, size: 8, offset: 696)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !750, file: !751, line: 482, baseType: !762, size: 8, offset: 704)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !750, file: !751, line: 483, baseType: !762, size: 8, offset: 712)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !750, file: !751, line: 484, baseType: !762, size: 8, offset: 720)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !750, file: !751, line: 485, baseType: !762, size: 8, offset: 728)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !750, file: !751, line: 486, baseType: !762, size: 8, offset: 736)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !750, file: !751, line: 487, baseType: !762, size: 8, offset: 744)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !750, file: !751, line: 488, baseType: !762, size: 8, offset: 752)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !750, file: !751, line: 489, baseType: !762, size: 8, offset: 760)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !750, file: !751, line: 490, baseType: !762, size: 8, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !750, file: !751, line: 491, baseType: !762, size: 8, offset: 776)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !750, file: !751, line: 492, baseType: !762, size: 8, offset: 784)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !750, file: !751, line: 493, baseType: !762, size: 8, offset: 792)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !750, file: !751, line: 494, baseType: !762, size: 8, offset: 800)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !750, file: !751, line: 495, baseType: !762, size: 8, offset: 808)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !750, file: !751, line: 496, baseType: !762, size: 8, offset: 816)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !750, file: !751, line: 497, baseType: !762, size: 8, offset: 824)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !750, file: !751, line: 498, baseType: !762, size: 8, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !750, file: !751, line: 499, baseType: !762, size: 8, offset: 840)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !750, file: !751, line: 500, baseType: !762, size: 8, offset: 848)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !750, file: !751, line: 501, baseType: !762, size: 8, offset: 856)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !750, file: !751, line: 502, baseType: !762, size: 8, offset: 864)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !750, file: !751, line: 503, baseType: !762, size: 8, offset: 872)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !750, file: !751, line: 504, baseType: !762, size: 8, offset: 880)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !750, file: !751, line: 505, baseType: !762, size: 8, offset: 888)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !750, file: !751, line: 506, baseType: !762, size: 8, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !750, file: !751, line: 507, baseType: !762, size: 8, offset: 904)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !750, file: !751, line: 508, baseType: !762, size: 8, offset: 912)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !750, file: !751, line: 509, baseType: !762, size: 8, offset: 920)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !750, file: !751, line: 510, baseType: !762, size: 8, offset: 928)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !750, file: !751, line: 511, baseType: !762, size: 8, offset: 936)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !750, file: !751, line: 512, baseType: !762, size: 8, offset: 944)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !750, file: !751, line: 513, baseType: !762, size: 8, offset: 952)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !750, file: !751, line: 514, baseType: !762, size: 8, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !750, file: !751, line: 515, baseType: !762, size: 8, offset: 968)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !750, file: !751, line: 516, baseType: !762, size: 8, offset: 976)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !750, file: !751, line: 517, baseType: !762, size: 8, offset: 984)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !750, file: !751, line: 518, baseType: !762, size: 8, offset: 992)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !750, file: !751, line: 519, baseType: !762, size: 8, offset: 1000)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !750, file: !751, line: 520, baseType: !762, size: 8, offset: 1008)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !750, file: !751, line: 521, baseType: !762, size: 8, offset: 1016)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !750, file: !751, line: 522, baseType: !762, size: 8, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !750, file: !751, line: 523, baseType: !762, size: 8, offset: 1032)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !750, file: !751, line: 524, baseType: !762, size: 8, offset: 1040)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !750, file: !751, line: 525, baseType: !762, size: 8, offset: 1048)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !750, file: !751, line: 526, baseType: !762, size: 8, offset: 1056)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !750, file: !751, line: 527, baseType: !762, size: 8, offset: 1064)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !750, file: !751, line: 528, baseType: !762, size: 8, offset: 1072)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !750, file: !751, line: 529, baseType: !762, size: 8, offset: 1080)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !750, file: !751, line: 530, baseType: !762, size: 8, offset: 1088)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !750, file: !751, line: 531, baseType: !762, size: 8, offset: 1096)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !750, file: !751, line: 532, baseType: !762, size: 8, offset: 1104)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !750, file: !751, line: 533, baseType: !762, size: 8, offset: 1112)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !750, file: !751, line: 534, baseType: !762, size: 8, offset: 1120)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !750, file: !751, line: 535, baseType: !762, size: 8, offset: 1128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !750, file: !751, line: 536, baseType: !762, size: 8, offset: 1136)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !750, file: !751, line: 537, baseType: !762, size: 8, offset: 1144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !750, file: !751, line: 538, baseType: !762, size: 8, offset: 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !750, file: !751, line: 539, baseType: !762, size: 8, offset: 1160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !750, file: !751, line: 540, baseType: !762, size: 8, offset: 1168)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !750, file: !751, line: 541, baseType: !762, size: 8, offset: 1176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !750, file: !751, line: 542, baseType: !762, size: 8, offset: 1184)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !750, file: !751, line: 543, baseType: !762, size: 8, offset: 1192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !750, file: !751, line: 544, baseType: !762, size: 8, offset: 1200)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !750, file: !751, line: 545, baseType: !762, size: 8, offset: 1208)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !750, file: !751, line: 546, baseType: !762, size: 8, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !750, file: !751, line: 547, baseType: !762, size: 8, offset: 1224)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !750, file: !751, line: 548, baseType: !762, size: 8, offset: 1232)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !750, file: !751, line: 549, baseType: !762, size: 8, offset: 1240)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !750, file: !751, line: 550, baseType: !762, size: 8, offset: 1248)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !750, file: !751, line: 551, baseType: !762, size: 8, offset: 1256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !750, file: !751, line: 552, baseType: !762, size: 8, offset: 1264)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !750, file: !751, line: 553, baseType: !762, size: 8, offset: 1272)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !750, file: !751, line: 554, baseType: !762, size: 8, offset: 1280)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !750, file: !751, line: 555, baseType: !762, size: 8, offset: 1288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !750, file: !751, line: 556, baseType: !762, size: 8, offset: 1296)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !750, file: !751, line: 557, baseType: !762, size: 8, offset: 1304)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !750, file: !751, line: 558, baseType: !762, size: 8, offset: 1312)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !750, file: !751, line: 559, baseType: !762, size: 8, offset: 1320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !750, file: !751, line: 560, baseType: !762, size: 8, offset: 1328)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !750, file: !751, line: 561, baseType: !762, size: 8, offset: 1336)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !750, file: !751, line: 562, baseType: !762, size: 8, offset: 1344)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !750, file: !751, line: 563, baseType: !762, size: 8, offset: 1352)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !750, file: !751, line: 564, baseType: !762, size: 8, offset: 1360)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !750, file: !751, line: 565, baseType: !762, size: 8, offset: 1368)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !750, file: !751, line: 566, baseType: !762, size: 8, offset: 1376)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !750, file: !751, line: 567, baseType: !762, size: 8, offset: 1384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !750, file: !751, line: 568, baseType: !762, size: 8, offset: 1392)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !750, file: !751, line: 569, baseType: !762, size: 8, offset: 1400)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !750, file: !751, line: 570, baseType: !762, size: 8, offset: 1408)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !750, file: !751, line: 571, baseType: !762, size: 8, offset: 1416)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !750, file: !751, line: 572, baseType: !762, size: 8, offset: 1424)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !750, file: !751, line: 573, baseType: !762, size: 8, offset: 1432)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !750, file: !751, line: 574, baseType: !762, size: 8, offset: 1440)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !304, file: !4, line: 3405, baseType: !918, size: 384)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !4, line: 3352, size: 384, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !4, line: 3353, baseType: !340, size: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !918, file: !4, line: 3356, baseType: !922, size: 192, offset: 192)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !751, line: 578, size: 192, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !922, file: !751, line: 580, baseType: !258, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !922, file: !751, line: 581, baseType: !258, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !922, file: !751, line: 582, baseType: !258, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !922, file: !751, line: 583, baseType: !258, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !922, file: !751, line: 584, baseType: !401, size: 8, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !922, file: !751, line: 585, baseType: !401, size: 8, offset: 136)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !922, file: !751, line: 586, baseType: !401, size: 8, offset: 144)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !922, file: !751, line: 587, baseType: !401, size: 8, offset: 152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !922, file: !751, line: 588, baseType: !401, size: 8, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !922, file: !751, line: 589, baseType: !401, size: 8, offset: 168)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !922, file: !751, line: 590, baseType: !401, size: 8, offset: 176)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !271, file: !232, line: 43, baseType: !254, size: 32, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "override_column", scope: !271, file: !232, line: 44, baseType: !5, size: 32, offset: 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !271, file: !232, line: 47, baseType: !301, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !271, file: !232, line: 49, baseType: !939, size: 32, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_t", file: !232, line: 35, baseType: !231)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "option_index", scope: !271, file: !232, line: 51, baseType: !258, size: 32, offset: 480)
!941 = !DILocation(line: 36, column: 19, scope: !251)
!942 = !DILocalVariable(name: "ap", scope: !251, file: !1, line: 37, type: !281)
!943 = !DILocation(line: 37, column: 11, scope: !251)
!944 = !DILocation(line: 39, column: 3, scope: !251)
!945 = !DILocation(line: 40, column: 37, scope: !251)
!946 = !DILocation(line: 40, column: 50, scope: !251)
!947 = !DILocation(line: 41, column: 10, scope: !251)
!948 = !DILocation(line: 40, column: 3, scope: !251)
!949 = !DILocation(line: 42, column: 29, scope: !251)
!950 = !DILocation(line: 42, column: 14, scope: !251)
!951 = !DILocation(line: 42, column: 27, scope: !251)
!952 = !DILocation(line: 43, column: 3, scope: !251)
!953 = !DILocation(line: 44, column: 3, scope: !251)
!954 = !DILocation(line: 45, column: 1, scope: !251)
!955 = distinct !DISubprogram(name: "pedwarn_c90", scope: !1, file: !1, line: 53, type: !252, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !262)
!956 = !DILocalVariable(name: "location", arg: 1, scope: !955, file: !1, line: 53, type: !254)
!957 = !DILocation(line: 53, column: 25, scope: !955)
!958 = !DILocalVariable(name: "opt", arg: 2, scope: !955, file: !1, line: 53, type: !258)
!959 = !DILocation(line: 53, column: 39, scope: !955)
!960 = !DILocalVariable(name: "gmsgid", arg: 3, scope: !955, file: !1, line: 53, type: !259)
!961 = !DILocation(line: 53, column: 56, scope: !955)
!962 = !DILocalVariable(name: "diagnostic", scope: !955, file: !1, line: 55, type: !270)
!963 = !DILocation(line: 55, column: 19, scope: !955)
!964 = !DILocalVariable(name: "ap", scope: !955, file: !1, line: 56, type: !281)
!965 = !DILocation(line: 56, column: 11, scope: !955)
!966 = !DILocation(line: 58, column: 3, scope: !955)
!967 = !DILocation(line: 59, column: 37, scope: !955)
!968 = !DILocation(line: 59, column: 50, scope: !955)
!969 = !DILocation(line: 60, column: 10, scope: !955)
!970 = !DILocation(line: 59, column: 3, scope: !955)
!971 = !DILocation(line: 61, column: 29, scope: !955)
!972 = !DILocation(line: 61, column: 14, scope: !955)
!973 = !DILocation(line: 61, column: 27, scope: !955)
!974 = !DILocation(line: 62, column: 3, scope: !955)
!975 = !DILocation(line: 63, column: 3, scope: !955)
!976 = !DILocation(line: 64, column: 1, scope: !955)
