; ModuleID = 'tree-ssa-loop-unswitch.c'
source_filename = "tree-ssa-loop-unswitch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!660 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!661 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!662 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!663 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!664 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!665 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!666 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!667 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!668 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!669 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!670 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!671 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!672 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!673 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!674 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!675 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!676 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!677 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!678 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!679 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!680 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!681 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!682 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!683 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!684 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!685 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!686 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!687 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!688 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!689 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!690 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!691 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!692 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!693 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!694 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!695 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !658, line: 727, baseType: !5, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!698 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!699 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!700 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!701 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!702 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!703 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!704 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!705 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!706 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!707 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!708 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!709 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!710 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!711 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!712 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!713 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!714 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!715 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!716 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!717 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!718 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!719 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!720 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!721 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!722 = !{!723, !724, !740, !737, !809, !5, !181, !785, !2127, !1428, !1070}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !726, line: 32, baseType: !727)
!726 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !726, line: 32, size: 96, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !727, file: !726, line: 32, baseType: !730, size: 96)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !726, line: 31, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !726, line: 31, size: 96, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !731, file: !726, line: 31, baseType: !5, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !731, file: !726, line: 31, baseType: !5, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !731, file: !726, line: 31, baseType: !736, size: 32, offset: 64)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 32, elements: !738)
!737 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!738 = !{!739}
!739 = !DISubrange(count: 1)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !743)
!743 = !{!744, !745, !746, !2091, !2092, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2117, !2125, !2126}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !742, file: !376, line: 102, baseType: !737, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !742, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !742, file: !376, line: 108, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !749)
!749 = !{!750, !2058, !2059, !2060, !2061, !2065, !2066, !2067, !2085, !2086, !2087, !2088, !2089, !2090}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !748, file: !133, line: 219, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !133, line: 151, baseType: !756, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !757, file: !133, line: 150, baseType: !5, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !757, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !757, file: !133, line: 150, baseType: !762, size: 64, offset: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 64, elements: !738)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !764, line: 108, baseType: !765)
!764 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !767)
!767 = !{!768, !769, !770, !2050, !2051, !2052, !2053, !2054, !2055, !2056}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !766, file: !133, line: 124, baseType: !747, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !766, file: !133, line: 125, baseType: !747, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !766, file: !133, line: 131, baseType: !771, size: 64, offset: 128)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !772)
!772 = !{!773, !2049}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !771, file: !133, line: 129, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !764, line: 66, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !658, line: 143, size: 192, elements: !777)
!777 = !{!778, !2047, !2048}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !776, file: !658, line: 145, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !764, line: 69, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !658, line: 136, size: 192, elements: !782)
!782 = !{!783, !2045, !2046}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !781, file: !658, line: 137, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !764, line: 58, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !658, line: 737, size: 768, elements: !787)
!787 = !{!788, !1892, !1902, !1908, !1913, !1918, !1925, !1931, !1937, !1942, !1956, !1961, !1967, !1972, !1982, !1987, !2003, !2010, !2017, !2023, !2028, !2034, !2040}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !786, file: !658, line: 738, baseType: !789, size: 256)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !658, line: 271, size: 256, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !806, !807, !808}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !789, file: !658, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !789, file: !658, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !789, file: !658, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !789, file: !658, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !789, file: !658, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !789, file: !658, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !789, file: !658, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !789, file: !658, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !789, file: !658, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !789, file: !658, line: 312, baseType: !5, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !789, file: !658, line: 316, baseType: !802, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !803, line: 58, baseType: !804)
!803 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !805, line: 44, baseType: !5)
!805 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!806 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !789, file: !658, line: 319, baseType: !5, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !789, file: !658, line: 323, baseType: !747, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !789, file: !658, line: 327, baseType: !809, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !764, line: 56, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !812)
!812 = !{!813, !846, !852, !865, !884, !895, !900, !908, !914, !928, !936, !974, !1185, !1213, !1230, !1231, !1236, !1245, !1251, !1256, !1260, !1264, !1543, !1590, !1596, !1602, !1609, !1622, !1636, !1653, !1665, !1687, !1702, !1874}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !811, file: !149, line: 3372, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !814, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !814, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !814, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !814, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !814, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !814, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !814, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !814, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !814, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !814, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !814, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !814, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !814, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !814, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !814, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !814, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !814, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !814, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !814, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !814, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !814, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !814, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !814, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !814, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !814, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !814, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !814, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !814, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !814, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !814, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !149, line: 3373, baseType: !847, size: 192)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !847, file: !149, line: 403, baseType: !814, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !847, file: !149, line: 404, baseType: !809, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !847, file: !149, line: 405, baseType: !809, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !811, file: !149, line: 3374, baseType: !853, size: 320)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !149, line: 1385, baseType: !847, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !853, file: !149, line: 1386, baseType: !857, size: 128, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !858, line: 58, baseType: !859)
!858 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !858, line: 54, size: 128, elements: !860)
!860 = !{!861, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !859, file: !858, line: 56, baseType: !862, size: 64)
!862 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !859, file: !858, line: 57, baseType: !864, size: 64, offset: 64)
!864 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !811, file: !149, line: 3375, baseType: !866, size: 256)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !866, file: !149, line: 1398, baseType: !847, size: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !866, file: !149, line: 1399, baseType: !870, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !872, line: 52, size: 256, elements: !873)
!872 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !871, file: !872, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !871, file: !872, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !871, file: !872, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !871, file: !872, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !871, file: !872, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !871, file: !872, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !871, file: !872, line: 62, baseType: !881, size: 192, offset: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 192, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 3)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !811, file: !149, line: 3376, baseType: !885, size: 256)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !885, file: !149, line: 1409, baseType: !847, size: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !885, file: !149, line: 1410, baseType: !889, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !891, line: 27, size: 192, elements: !892)
!891 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !890, file: !891, line: 29, baseType: !857, size: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !890, file: !891, line: 30, baseType: !3, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !811, file: !149, line: 3377, baseType: !896, size: 256)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !149, line: 1438, baseType: !847, size: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !896, file: !149, line: 1439, baseType: !809, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !811, file: !149, line: 3378, baseType: !901, size: 256)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !149, line: 1419, baseType: !847, size: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !901, file: !149, line: 1420, baseType: !737, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !901, file: !149, line: 1421, baseType: !906, size: 8, offset: 224)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 8, elements: !738)
!907 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !811, file: !149, line: 3379, baseType: !909, size: 320)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !149, line: 1429, baseType: !847, size: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !909, file: !149, line: 1430, baseType: !809, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !909, file: !149, line: 1431, baseType: !809, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !811, file: !149, line: 3380, baseType: !915, size: 320)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !915, file: !149, line: 1461, baseType: !847, size: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !915, file: !149, line: 1462, baseType: !919, size: 128, offset: 192)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !920, line: 31, size: 128, elements: !921)
!920 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !{!922, !926, !927}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !919, file: !920, line: 32, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !919, file: !920, line: 33, baseType: !5, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !919, file: !920, line: 34, baseType: !5, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !811, file: !149, line: 3381, baseType: !929, size: 384)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !930)
!930 = !{!931, !932, !933, !934, !935}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !149, line: 2508, baseType: !847, size: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !929, file: !149, line: 2509, baseType: !802, size: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !929, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !929, file: !149, line: 2511, baseType: !809, size: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !929, file: !149, line: 2512, baseType: !809, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !811, file: !149, line: 3382, baseType: !937, size: 896)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !938)
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !149, line: 2653, baseType: !929, size: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !937, file: !149, line: 2654, baseType: !809, size: 64, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !937, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !937, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !937, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !937, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !937, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !937, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !937, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !937, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !937, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !937, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !937, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !937, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !937, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !937, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !937, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !937, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !937, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !937, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !937, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !937, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !937, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !937, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !937, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !937, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !937, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !937, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !937, file: !149, line: 2705, baseType: !809, size: 64, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !937, file: !149, line: 2706, baseType: !809, size: 64, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !937, file: !149, line: 2707, baseType: !809, size: 64, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !937, file: !149, line: 2708, baseType: !809, size: 64, offset: 768)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !937, file: !149, line: 2711, baseType: !972, size: 64, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !811, file: !149, line: 3383, baseType: !975, size: 960)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !149, line: 2757, baseType: !937, size: 896)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !975, file: !149, line: 2758, baseType: !979, size: 64, offset: 896)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !764, line: 50, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !982, line: 240, size: 384, elements: !983)
!982 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !981, file: !982, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !981, file: !982, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !981, file: !982, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !981, file: !982, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !981, file: !982, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !981, file: !982, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !981, file: !982, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !981, file: !982, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !981, file: !982, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !981, file: !982, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !981, file: !982, line: 321, baseType: !995, size: 320, offset: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !982, line: 315, size: 320, elements: !996)
!996 = !{!997, !1118, !1120, !1183, !1184}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !995, file: !982, line: 316, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 64, elements: !738)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !982, line: 183, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !982, line: 166, size: 64, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1007, !1008, !1016, !1017, !1029, !1032, !1093, !1094, !1095, !1108, !1115}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1000, file: !982, line: 168, baseType: !737, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1000, file: !982, line: 169, baseType: !5, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1000, file: !982, line: 170, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1000, file: !982, line: 171, baseType: !979, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1000, file: !982, line: 172, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !764, line: 53, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !982, line: 359, size: 128, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1011, file: !982, line: 360, baseType: !737, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1011, file: !982, line: 361, baseType: !1015, size: 64, offset: 64)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 64, elements: !738)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1000, file: !982, line: 173, baseType: !3, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1000, file: !982, line: 174, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !982, line: 133, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !982, line: 115, size: 32, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1019, file: !982, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1019, file: !982, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1019, file: !982, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1019, file: !982, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1019, file: !982, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1019, file: !982, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1019, file: !982, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1019, file: !982, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1000, file: !982, line: 175, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !982, line: 175, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1000, file: !982, line: 176, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1035, line: 75, size: 256, elements: !1036)
!1035 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1036 = !{!1037, !1051, !1052, !1053}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1034, file: !1035, line: 76, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1035, line: 68, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1035, line: 63, size: 320, elements: !1041)
!1041 = !{!1042, !1044, !1045, !1046}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1035, line: 64, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1040, file: !1035, line: 65, baseType: !1043, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1040, file: !1035, line: 66, baseType: !5, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1040, file: !1035, line: 67, baseType: !1047, size: 128, offset: 192)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 128, elements: !1049)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1035, line: 29, baseType: !862)
!1049 = !{!1050}
!1050 = !DISubrange(count: 2)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1034, file: !1035, line: 77, baseType: !1038, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1034, file: !1035, line: 78, baseType: !5, size: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1034, file: !1035, line: 79, baseType: !1054, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1035, line: 49, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1035, line: 45, size: 832, elements: !1057)
!1057 = !{!1058, !1059, !1060}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1056, file: !1035, line: 46, baseType: !1043, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1056, file: !1035, line: 47, baseType: !1033, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1056, file: !1035, line: 48, baseType: !1061, size: 704, offset: 128)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1062, line: 164, size: 704, elements: !1063)
!1062 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1063 = !{!1064, !1065, !1076, !1077, !1078, !1079, !1080, !1081, !1085, !1089, !1090, !1091, !1092}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1061, file: !1062, line: 166, baseType: !864, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1061, file: !1062, line: 167, baseType: !1066, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1062, line: 157, size: 192, elements: !1068)
!1068 = !{!1069, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1067, file: !1062, line: 159, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1067, file: !1062, line: 160, baseType: !1066, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1067, file: !1062, line: 161, baseType: !1073, size: 32, offset: 128)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 32, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 4)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1061, file: !1062, line: 168, baseType: !1070, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1061, file: !1062, line: 169, baseType: !1070, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1061, file: !1062, line: 170, baseType: !1070, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1061, file: !1062, line: 171, baseType: !864, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1061, file: !1062, line: 172, baseType: !737, size: 32, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1061, file: !1062, line: 176, baseType: !1082, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1066, !723, !864}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1061, file: !1062, line: 177, baseType: !1086, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !723, !1066}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1061, file: !1062, line: 178, baseType: !723, size: 64, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1061, file: !1062, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1061, file: !1062, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1061, file: !1062, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1000, file: !982, line: 177, baseType: !809, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1000, file: !982, line: 178, baseType: !747, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1000, file: !982, line: 179, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !982, line: 150, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !982, line: 142, size: 320, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1106, !1107}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1098, file: !982, line: 144, baseType: !809, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1098, file: !982, line: 145, baseType: !979, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !982, line: 146, baseType: !979, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1098, file: !982, line: 147, baseType: !1104, size: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1105, line: 31, baseType: !737)
!1105 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1098, file: !982, line: 148, baseType: !5, size: 32, offset: 224)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1098, file: !982, line: 149, baseType: !925, size: 8, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1000, file: !982, line: 180, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !982, line: 162, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !982, line: 159, size: 128, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1111, file: !982, line: 160, baseType: !809, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1111, file: !982, line: 161, baseType: !864, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1000, file: !982, line: 181, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !982, line: 181, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !995, file: !982, line: 317, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 64, elements: !738)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !995, file: !982, line: 318, baseType: !1121, size: 320)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !982, line: 188, size: 320, elements: !1122)
!1122 = !{!1123, !1125, !1182}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1121, file: !982, line: 190, baseType: !1124, size: 192)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 192, elements: !882)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1121, file: !982, line: 193, baseType: !1126, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !982, line: 206, size: 320, elements: !1128)
!1128 = !{!1129, !1167, !1168, !1169, !1181}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1127, file: !982, line: 208, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !764, line: 62, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1133, line: 538, size: 256, elements: !1134)
!1133 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1134 = !{!1135, !1139, !1145, !1158}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !1133, line: 539, baseType: !1136, size: 32)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1133, line: 482, size: 32, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1136, file: !1133, line: 484, baseType: !5, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1132, file: !1133, line: 540, baseType: !1140, size: 192)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1133, line: 488, size: 192, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !1133, line: 489, baseType: !1136, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !1133, line: 492, baseType: !1005, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1140, file: !1133, line: 496, baseType: !809, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1132, file: !1133, line: 541, baseType: !1146, size: 256)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1133, line: 504, size: 256, elements: !1147)
!1147 = !{!1148, !1149, !1156, !1157}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1146, file: !1133, line: 505, baseType: !1136, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1146, file: !1133, line: 509, baseType: !1150, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1133, line: 501, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !1154}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !1133, line: 510, baseType: !1154, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !1133, line: 513, baseType: !1130, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1132, file: !1133, line: 542, baseType: !1159, size: 128)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1133, line: 530, size: 128, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !1133, line: 531, baseType: !1136, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1159, file: !1133, line: 534, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1133, line: 525, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!925, !809, !1005, !862, !862}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1127, file: !982, line: 211, baseType: !5, size: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !982, line: 214, baseType: !864, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1127, file: !982, line: 224, baseType: !1170, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !982, line: 202, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !982, line: 202, size: 128, elements: !1173)
!1173 = !{!1174}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1172, file: !982, line: 202, baseType: !1175, size: 128)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !982, line: 200, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !982, line: 200, size: 128, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1176, file: !982, line: 200, baseType: !5, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1176, file: !982, line: 200, baseType: !5, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1176, file: !982, line: 200, baseType: !1015, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1127, file: !982, line: 234, baseType: !1170, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1121, file: !982, line: 197, baseType: !864, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !995, file: !982, line: 319, baseType: !871, size: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !995, file: !982, line: 320, baseType: !890, size: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !811, file: !149, line: 3384, baseType: !1186, size: 1472)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !1187)
!1187 = !{!1188, !1209, !1210, !1211, !1212}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1186, file: !149, line: 3115, baseType: !1189, size: 1216)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1189, file: !149, line: 2985, baseType: !975, size: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1189, file: !149, line: 2986, baseType: !809, size: 64, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1189, file: !149, line: 2987, baseType: !809, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1189, file: !149, line: 2988, baseType: !809, size: 64, offset: 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1189, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1189, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1189, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1189, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1189, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1189, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1189, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1189, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1189, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1189, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1189, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1189, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1189, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1189, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1186, file: !149, line: 3117, baseType: !809, size: 64, offset: 1216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1186, file: !149, line: 3119, baseType: !809, size: 64, offset: 1280)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1186, file: !149, line: 3121, baseType: !809, size: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1186, file: !149, line: 3123, baseType: !809, size: 64, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !811, file: !149, line: 3385, baseType: !1214, size: 1088)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !149, line: 2875, baseType: !975, size: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1214, file: !149, line: 2876, baseType: !979, size: 64, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1214, file: !149, line: 2877, baseType: !1219, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1221, line: 172, size: 128, elements: !1222)
!1221 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1220, file: !1221, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1220, file: !1221, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1220, file: !1221, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1220, file: !1221, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1220, file: !1221, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1220, file: !1221, line: 195, baseType: !5, size: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1220, file: !1221, line: 199, baseType: !809, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !811, file: !149, line: 3386, baseType: !1189, size: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !811, file: !149, line: 3387, baseType: !1232, size: 1280)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !149, line: 3094, baseType: !1189, size: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1232, file: !149, line: 3095, baseType: !1219, size: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !811, file: !149, line: 3388, baseType: !1237, size: 1216)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !149, line: 2825, baseType: !937, size: 896)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1237, file: !149, line: 2827, baseType: !809, size: 64, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1237, file: !149, line: 2828, baseType: !809, size: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1237, file: !149, line: 2829, baseType: !809, size: 64, offset: 1024)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1237, file: !149, line: 2830, baseType: !809, size: 64, offset: 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1237, file: !149, line: 2831, baseType: !809, size: 64, offset: 1152)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !811, file: !149, line: 3389, baseType: !1246, size: 1024)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !1247)
!1247 = !{!1248, !1249, !1250}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1246, file: !149, line: 2851, baseType: !975, size: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1246, file: !149, line: 2852, baseType: !737, size: 32, offset: 960)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1246, file: !149, line: 2853, baseType: !737, size: 32, offset: 992)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !811, file: !149, line: 3390, baseType: !1252, size: 1024)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !149, line: 2858, baseType: !975, size: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1252, file: !149, line: 2859, baseType: !1219, size: 64, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !811, file: !149, line: 3391, baseType: !1257, size: 960)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !1258)
!1258 = !{!1259}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1257, file: !149, line: 2863, baseType: !975, size: 960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !811, file: !149, line: 3392, baseType: !1261, size: 1472)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !1262)
!1262 = !{!1263}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1261, file: !149, line: 3305, baseType: !1186, size: 1472)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !811, file: !149, line: 3393, baseType: !1265, size: 1792)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !1266)
!1266 = !{!1267, !1268, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1265, file: !149, line: 3249, baseType: !1186, size: 1472)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1265, file: !149, line: 3251, baseType: !1269, size: 64, offset: 1472)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1271, line: 463, size: 1152, elements: !1272)
!1271 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1272 = !{!1273, !1276, !1307, !1308, !1446, !1466, !1467, !1468, !1469, !1470, !1471, !1495, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1270, file: !1271, line: 464, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1271, line: 464, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1270, file: !1271, line: 467, baseType: !1277, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !1279)
!1279 = !{!1280, !1282, !1283, !1296, !1297, !1298, !1299, !1300, !1301, !1303, !1305, !1306}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1278, file: !133, line: 377, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !764, line: 111, baseType: !747)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1278, file: !133, line: 378, baseType: !1281, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1278, file: !133, line: 381, baseType: !1284, size: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1287)
!1287 = !{!1288}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1286, file: !133, line: 282, baseType: !1289, size: 128)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1290, file: !133, line: 281, baseType: !5, size: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1290, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1290, file: !133, line: 281, baseType: !1295, size: 64, offset: 64)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 64, elements: !738)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1278, file: !133, line: 384, baseType: !737, size: 32, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1278, file: !133, line: 387, baseType: !737, size: 32, offset: 224)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1278, file: !133, line: 390, baseType: !737, size: 32, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1278, file: !133, line: 394, baseType: !1284, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1278, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1278, file: !133, line: 399, baseType: !1302, size: 64, offset: 416)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !1049)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1278, file: !133, line: 402, baseType: !1304, size: 64, offset: 480)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1049)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1278, file: !133, line: 406, baseType: !737, size: 32, offset: 544)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1278, file: !133, line: 409, baseType: !737, size: 32, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1270, file: !1271, line: 470, baseType: !775, size: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1270, file: !1271, line: 473, baseType: !1309, size: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1221, line: 39, size: 1152, elements: !1311)
!1311 = !{!1312, !1362, !1375, !1388, !1389, !1401, !1402, !1406, !1407, !1408, !1409, !1410}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1310, file: !1221, line: 41, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1314, line: 144, baseType: !1315)
!1314 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1314, line: 100, size: 896, elements: !1317)
!1317 = !{!1318, !1324, !1329, !1334, !1336, !1339, !1340, !1341, !1342, !1343, !1348, !1350, !1351, !1356, !1361}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1316, file: !1314, line: 102, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1314, line: 52, baseType: !1320)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!1323, !1154}
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1314, line: 47, baseType: !5)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1316, file: !1314, line: 105, baseType: !1325, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1314, line: 59, baseType: !1326)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!737, !1154, !1154}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1316, file: !1314, line: 108, baseType: !1330, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1314, line: 63, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{null, !723}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1316, file: !1314, line: 111, baseType: !1335, size: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1316, file: !1314, line: 114, baseType: !1337, size: 64, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1338, line: 46, baseType: !862)
!1338 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1316, file: !1314, line: 117, baseType: !1337, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1316, file: !1314, line: 120, baseType: !1337, size: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1316, file: !1314, line: 124, baseType: !5, size: 32, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1316, file: !1314, line: 128, baseType: !5, size: 32, offset: 480)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1316, file: !1314, line: 131, baseType: !1344, size: 64, offset: 512)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1314, line: 75, baseType: !1345)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!723, !1337, !1337}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1316, file: !1314, line: 132, baseType: !1349, size: 64, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1314, line: 78, baseType: !1331)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1316, file: !1314, line: 135, baseType: !723, size: 64, offset: 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1316, file: !1314, line: 136, baseType: !1352, size: 64, offset: 704)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1314, line: 82, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!723, !723, !1337, !1337}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1316, file: !1314, line: 137, baseType: !1357, size: 64, offset: 768)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1314, line: 83, baseType: !1358)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{null, !723, !723}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1316, file: !1314, line: 141, baseType: !5, size: 32, offset: 832)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1310, file: !1221, line: 48, baseType: !1363, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !658, line: 35, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !658, line: 35, size: 128, elements: !1366)
!1366 = !{!1367}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1365, file: !658, line: 35, baseType: !1368, size: 128)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !658, line: 33, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !658, line: 33, size: 128, elements: !1370)
!1370 = !{!1371, !1372, !1373}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1369, file: !658, line: 33, baseType: !5, size: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1369, file: !658, line: 33, baseType: !5, size: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1369, file: !658, line: 33, baseType: !1374, size: 64, offset: 64)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 64, elements: !738)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1310, file: !1221, line: 51, baseType: !1376, size: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1379)
!1379 = !{!1380}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1378, file: !149, line: 183, baseType: !1381, size: 128)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1383)
!1383 = !{!1384, !1385, !1386}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1382, file: !149, line: 182, baseType: !5, size: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1382, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1382, file: !149, line: 182, baseType: !1387, size: 64, offset: 64)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 64, elements: !738)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1310, file: !1221, line: 54, baseType: !809, size: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1310, file: !1221, line: 57, baseType: !1390, size: 128, offset: 256)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1391, line: 31, size: 128, elements: !1392)
!1391 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1392 = !{!1393, !1394, !1395, !1396, !1397, !1398, !1399}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1390, file: !1391, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1390, file: !1391, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1390, file: !1391, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1390, file: !1391, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1390, file: !1391, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1390, file: !1391, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1390, file: !1391, line: 56, baseType: !1400, size: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !764, line: 47, baseType: !1033)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1310, file: !1221, line: 60, baseType: !1390, size: 128, offset: 384)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1310, file: !1221, line: 64, baseType: !1403, size: 64, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1405, line: 33, flags: DIFlagFwdDecl)
!1405 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1310, file: !1221, line: 67, baseType: !809, size: 64, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1310, file: !1221, line: 73, baseType: !1313, size: 64, offset: 640)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1310, file: !1221, line: 77, baseType: !1400, size: 64, offset: 704)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1310, file: !1221, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1310, file: !1221, line: 82, baseType: !1411, size: 320, offset: 832)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !651, line: 62, size: 320, elements: !1412)
!1412 = !{!1413, !1419, !1420, !1421, !1422, !1429}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1411, file: !651, line: 63, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !651, line: 56, size: 128, elements: !1416)
!1416 = !{!1417, !1418}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1415, file: !651, line: 57, baseType: !1414, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1415, file: !651, line: 58, baseType: !906, size: 8, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1411, file: !651, line: 64, baseType: !5, size: 32, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1411, file: !651, line: 66, baseType: !5, size: 32, offset: 96)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1411, file: !651, line: 68, baseType: !925, size: 8, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1411, file: !651, line: 70, baseType: !1423, size: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !651, line: 37, size: 128, elements: !1425)
!1425 = !{!1426, !1427}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1424, file: !651, line: 39, baseType: !1423, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1424, file: !651, line: 40, baseType: !1428, size: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1411, file: !651, line: 71, baseType: !1430, size: 64, offset: 256)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !651, line: 45, size: 320, elements: !1432)
!1432 = !{!1433, !1434}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1431, file: !651, line: 47, baseType: !1430, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1431, file: !651, line: 48, baseType: !1435, size: 256, offset: 64)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1436)
!1436 = !{!1437, !1439, !1440, !1445}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1435, file: !149, line: 1884, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1435, file: !149, line: 1885, baseType: !1438, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1435, file: !149, line: 1891, baseType: !1441, size: 64, offset: 128)
!1441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1435, file: !149, line: 1891, size: 64, elements: !1442)
!1442 = !{!1443, !1444}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1441, file: !149, line: 1891, baseType: !784, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1441, file: !149, line: 1891, baseType: !809, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1435, file: !149, line: 1892, baseType: !1428, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1270, file: !1271, line: 476, baseType: !1447, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1449)
!1449 = !{!1450, !1451, !1464, !1465}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1448, file: !376, line: 189, baseType: !737, size: 32)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1448, file: !376, line: 192, baseType: !1452, size: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1455)
!1455 = !{!1456}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1454, file: !376, line: 87, baseType: !1457, size: 128)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1459)
!1459 = !{!1460, !1461, !1462}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1458, file: !376, line: 85, baseType: !5, size: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1458, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1458, file: !376, line: 85, baseType: !1463, size: 64, offset: 64)
!1463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 64, elements: !738)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1448, file: !376, line: 197, baseType: !1313, size: 64, offset: 128)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1448, file: !376, line: 200, baseType: !741, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1270, file: !1271, line: 479, baseType: !1313, size: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1270, file: !1271, line: 484, baseType: !809, size: 64, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1270, file: !1271, line: 488, baseType: !809, size: 64, offset: 448)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1270, file: !1271, line: 493, baseType: !809, size: 64, offset: 512)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1270, file: !1271, line: 496, baseType: !809, size: 64, offset: 576)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1270, file: !1271, line: 501, baseType: !1472, size: 64, offset: 640)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1474)
!1474 = !{!1475, !1478, !1479, !1480, !1481, !1483, !1484, !1489, !1490, !1491, !1492, !1493, !1494}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1473, file: !144, line: 2356, baseType: !1476, size: 64)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1473, file: !144, line: 2357, baseType: !1005, size: 64, offset: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1473, file: !144, line: 2358, baseType: !737, size: 32, offset: 128)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1473, file: !144, line: 2359, baseType: !737, size: 32, offset: 160)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1473, file: !144, line: 2360, baseType: !1482, size: 128, offset: 192)
!1482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 128, elements: !1074)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1473, file: !144, line: 2364, baseType: !737, size: 32, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1473, file: !144, line: 2367, baseType: !1485, size: 128, offset: 384)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1486)
!1486 = !{!1487, !1488}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1485, file: !144, line: 2351, baseType: !979, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1485, file: !144, line: 2352, baseType: !864, size: 64, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1473, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1473, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1473, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1473, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1473, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1473, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1270, file: !1271, line: 504, baseType: !1496, size: 64, offset: 704)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1271, line: 504, flags: DIFlagFwdDecl)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1270, file: !1271, line: 507, baseType: !1313, size: 64, offset: 768)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1270, file: !1271, line: 510, baseType: !737, size: 32, offset: 832)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1270, file: !1271, line: 513, baseType: !737, size: 32, offset: 864)
