; ModuleID = 'combine-stack-adj.c'
source_filename = "combine-stack-adj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }

!689 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!690 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!691 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!692 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!696 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!697 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!698 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!700 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!701 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!704 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!705 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!707 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!708 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!709 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_rtl_index", file: !568, line: 1994, baseType: !7, size: 32, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!712 = !DIEnumerator(name: "GR_PC", value: 0, isUnsigned: true)
!713 = !DIEnumerator(name: "GR_CC0", value: 1, isUnsigned: true)
!714 = !DIEnumerator(name: "GR_STACK_POINTER", value: 2, isUnsigned: true)
!715 = !DIEnumerator(name: "GR_FRAME_POINTER", value: 3, isUnsigned: true)
!716 = !DIEnumerator(name: "GR_HARD_FRAME_POINTER", value: 4, isUnsigned: true)
!717 = !DIEnumerator(name: "GR_ARG_POINTER", value: 5, isUnsigned: true)
!718 = !DIEnumerator(name: "GR_VIRTUAL_INCOMING_ARGS", value: 6, isUnsigned: true)
!719 = !DIEnumerator(name: "GR_VIRTUAL_STACK_ARGS", value: 7, isUnsigned: true)
!720 = !DIEnumerator(name: "GR_VIRTUAL_STACK_DYNAMIC", value: 8, isUnsigned: true)
!721 = !DIEnumerator(name: "GR_VIRTUAL_OUTGOING_ARGS", value: 9, isUnsigned: true)
!722 = !DIEnumerator(name: "GR_VIRTUAL_CFA", value: 10, isUnsigned: true)
!723 = !DIEnumerator(name: "GR_MAX", value: 11, isUnsigned: true)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !568, line: 836, baseType: !7, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!726 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!758 = !{!759, !567, !850, !1934, !189, !1935, !1940}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !760, line: 50, baseType: !761)
!760 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !762, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !762, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !762, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !762, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !762, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !762, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !762, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !762, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !762, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !762, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !762, file: !568, line: 321, baseType: !775, size: 320, offset: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !776)
!776 = !{!777, !1869, !1871, !1932, !1933}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !775, file: !568, line: 316, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 64, elements: !798)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !781)
!781 = !{!782, !784, !785, !789, !790, !800, !801, !813, !816, !880, !1847, !1848, !1859, !1866}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !780, file: !568, line: 168, baseType: !783, size: 32)
!783 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !780, file: !568, line: 169, baseType: !7, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !780, file: !568, line: 170, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !780, file: !568, line: 171, baseType: !759, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !780, file: !568, line: 172, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !760, line: 53, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !793, file: !568, line: 360, baseType: !783, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !793, file: !568, line: 361, baseType: !797, size: 64, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 64, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 1)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !780, file: !568, line: 173, baseType: !189, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !780, file: !568, line: 174, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !803, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !803, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !803, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !803, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !803, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !803, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !803, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !803, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !780, file: !568, line: 175, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !568, line: 175, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !780, file: !568, line: 176, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !819, line: 75, size: 256, elements: !820)
!819 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!820 = !{!821, !836, !837, !838}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !818, file: !819, line: 76, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !819, line: 68, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !819, line: 63, size: 320, elements: !825)
!825 = !{!826, !828, !829, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !819, line: 64, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !824, file: !819, line: 65, baseType: !827, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !824, file: !819, line: 66, baseType: !7, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !824, file: !819, line: 67, baseType: !831, size: 128, offset: 192)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 128, elements: !834)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !819, line: 29, baseType: !833)
!833 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!834 = !{!835}
!835 = !DISubrange(count: 2)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !818, file: !819, line: 77, baseType: !822, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !818, file: !819, line: 78, baseType: !7, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !818, file: !819, line: 79, baseType: !839, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !819, line: 49, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !819, line: 45, size: 832, elements: !842)
!842 = !{!843, !844, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !841, file: !819, line: 46, baseType: !827, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !841, file: !819, line: 47, baseType: !817, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !841, file: !819, line: 48, baseType: !846, size: 704, offset: 128)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !847, line: 164, size: 704, elements: !848)
!847 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!848 = !{!849, !851, !862, !863, !864, !865, !866, !867, !872, !876, !877, !878, !879}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !846, file: !847, line: 166, baseType: !850, size: 64)
!850 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !846, file: !847, line: 167, baseType: !852, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !847, line: 157, size: 192, elements: !854)
!854 = !{!855, !857, !858}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !853, file: !847, line: 159, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !853, file: !847, line: 160, baseType: !852, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !853, file: !847, line: 161, baseType: !859, size: 32, offset: 128)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 32, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 4)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !846, file: !847, line: 168, baseType: !856, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !846, file: !847, line: 169, baseType: !856, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !846, file: !847, line: 170, baseType: !856, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !846, file: !847, line: 171, baseType: !850, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !846, file: !847, line: 172, baseType: !783, size: 32, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !846, file: !847, line: 176, baseType: !868, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!852, !871, !850}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !846, file: !847, line: 177, baseType: !873, size: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !871, !852}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !846, file: !847, line: 178, baseType: !871, size: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !846, file: !847, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !846, file: !847, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !846, file: !847, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !780, file: !568, line: 177, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !760, line: 56, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !884)
!884 = !{!885, !918, !924, !935, !954, !965, !970, !977, !983, !997, !1009, !1047, !1052, !1080, !1088, !1089, !1094, !1103, !1109, !1114, !1118, !1122, !1483, !1532, !1538, !1544, !1551, !1577, !1591, !1608, !1620, !1642, !1657, !1829}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !883, file: !341, line: 3372, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !886, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !886, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !886, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !886, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !886, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !886, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !886, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !886, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !886, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !886, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !886, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !886, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !886, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !886, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !886, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !886, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !886, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !886, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !886, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !886, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !886, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !886, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !886, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !886, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !886, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !886, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !886, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !886, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !886, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !886, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !341, line: 3373, baseType: !919, size: 192)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !919, file: !341, line: 403, baseType: !886, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !919, file: !341, line: 404, baseType: !881, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !919, file: !341, line: 405, baseType: !881, size: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !883, file: !341, line: 3374, baseType: !925, size: 320)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !341, line: 1385, baseType: !919, size: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !925, file: !341, line: 1386, baseType: !929, size: 128, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !930, line: 58, baseType: !931)
!930 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !930, line: 54, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !931, file: !930, line: 56, baseType: !833, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !931, file: !930, line: 57, baseType: !850, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !883, file: !341, line: 3375, baseType: !936, size: 256)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !341, line: 1398, baseType: !919, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !936, file: !341, line: 1399, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !942, line: 52, size: 256, elements: !943)
!942 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!943 = !{!944, !945, !946, !947, !948, !949, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !941, file: !942, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !941, file: !942, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !941, file: !942, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !941, file: !942, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !941, file: !942, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !941, file: !942, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !941, file: !942, line: 62, baseType: !951, size: 192, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 192, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 3)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !883, file: !341, line: 3376, baseType: !955, size: 256)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !341, line: 1409, baseType: !919, size: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !955, file: !341, line: 1410, baseType: !959, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !961, line: 27, size: 192, elements: !962)
!961 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !960, file: !961, line: 29, baseType: !929, size: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !960, file: !961, line: 30, baseType: !189, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !883, file: !341, line: 3377, baseType: !966, size: 256)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !341, line: 1438, baseType: !919, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !966, file: !341, line: 1439, baseType: !881, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !883, file: !341, line: 3378, baseType: !971, size: 256)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !341, line: 1419, baseType: !919, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !971, file: !341, line: 1420, baseType: !783, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !971, file: !341, line: 1421, baseType: !976, size: 8, offset: 224)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 8, elements: !798)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !883, file: !341, line: 3379, baseType: !978, size: 320)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !341, line: 1429, baseType: !919, size: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !978, file: !341, line: 1430, baseType: !881, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !978, file: !341, line: 1431, baseType: !881, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !883, file: !341, line: 3380, baseType: !984, size: 320)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !341, line: 1461, baseType: !919, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !984, file: !341, line: 1462, baseType: !988, size: 128, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !989, line: 31, size: 128, elements: !990)
!989 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!990 = !{!991, !995, !996}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !989, line: 32, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !988, file: !989, line: 33, baseType: !7, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !988, file: !989, line: 34, baseType: !7, size: 32, offset: 96)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !883, file: !341, line: 3381, baseType: !998, size: 384)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !999)
!999 = !{!1000, !1001, !1006, !1007, !1008}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !341, line: 2508, baseType: !919, size: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !998, file: !341, line: 2509, baseType: !1002, size: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1003, line: 58, baseType: !1004)
!1003 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1005, line: 44, baseType: !7)
!1005 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !998, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !341, line: 2511, baseType: !881, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !998, file: !341, line: 2512, baseType: !881, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !883, file: !341, line: 3382, baseType: !1010, size: 896)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !341, line: 2653, baseType: !998, size: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !341, line: 2654, baseType: !881, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1010, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1010, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1010, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1010, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1010, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1010, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1010, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1010, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1010, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1010, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1010, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1010, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1010, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1010, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1010, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1010, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1010, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1010, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1010, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1010, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1010, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1010, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1010, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1010, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1010, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1010, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1010, file: !341, line: 2705, baseType: !881, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1010, file: !341, line: 2706, baseType: !881, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1010, file: !341, line: 2707, baseType: !881, size: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1010, file: !341, line: 2708, baseType: !881, size: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1010, file: !341, line: 2711, baseType: !1045, size: 64, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !883, file: !341, line: 3383, baseType: !1048, size: 960)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !341, line: 2757, baseType: !1010, size: 896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1048, file: !341, line: 2758, baseType: !759, size: 64, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !883, file: !341, line: 3384, baseType: !1053, size: 1472)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1054)
!1054 = !{!1055, !1076, !1077, !1078, !1079}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !341, line: 3115, baseType: !1056, size: 1216)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !341, line: 2985, baseType: !1048, size: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1056, file: !341, line: 2986, baseType: !881, size: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1056, file: !341, line: 2987, baseType: !881, size: 64, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1056, file: !341, line: 2988, baseType: !881, size: 64, offset: 1088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1056, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1056, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1056, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1056, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1056, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1056, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1056, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1056, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1056, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1056, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1056, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1056, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1056, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1056, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1053, file: !341, line: 3117, baseType: !881, size: 64, offset: 1216)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1053, file: !341, line: 3119, baseType: !881, size: 64, offset: 1280)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1053, file: !341, line: 3121, baseType: !881, size: 64, offset: 1344)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1053, file: !341, line: 3123, baseType: !881, size: 64, offset: 1408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !883, file: !341, line: 3385, baseType: !1081, size: 1088)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !341, line: 2875, baseType: !1048, size: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1081, file: !341, line: 2876, baseType: !759, size: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1081, file: !341, line: 2877, baseType: !1086, size: 64, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !883, file: !341, line: 3386, baseType: !1056, size: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !883, file: !341, line: 3387, baseType: !1090, size: 1280)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !341, line: 3094, baseType: !1056, size: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1090, file: !341, line: 3095, baseType: !1086, size: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !883, file: !341, line: 3388, baseType: !1095, size: 1216)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !341, line: 2825, baseType: !1010, size: 896)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1095, file: !341, line: 2827, baseType: !881, size: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1095, file: !341, line: 2828, baseType: !881, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1095, file: !341, line: 2829, baseType: !881, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1095, file: !341, line: 2830, baseType: !881, size: 64, offset: 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1095, file: !341, line: 2831, baseType: !881, size: 64, offset: 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !883, file: !341, line: 3389, baseType: !1104, size: 1024)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !341, line: 2851, baseType: !1048, size: 960)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1104, file: !341, line: 2852, baseType: !783, size: 32, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1104, file: !341, line: 2853, baseType: !783, size: 32, offset: 992)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !883, file: !341, line: 3390, baseType: !1110, size: 1024)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !341, line: 2858, baseType: !1048, size: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1110, file: !341, line: 2859, baseType: !1086, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !883, file: !341, line: 3391, baseType: !1115, size: 960)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !341, line: 2863, baseType: !1048, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !883, file: !341, line: 3392, baseType: !1119, size: 1472)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1120)
!1120 = !{!1121}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !341, line: 3305, baseType: !1053, size: 1472)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !883, file: !341, line: 3393, baseType: !1123, size: 1792)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1124)
!1124 = !{!1125, !1126, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !341, line: 3249, baseType: !1053, size: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1123, file: !341, line: 3251, baseType: !1127, size: 64, offset: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1129, line: 463, size: 1152, elements: !1130)
!1129 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1130 = !{!1131, !1295, !1399, !1400, !1403, !1406, !1407, !1408, !1409, !1410, !1411, !1435, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1128, file: !1129, line: 464, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1134)
!1134 = !{!1135, !1184, !1197, !1211, !1263, !1276}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1133, file: !318, line: 197, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1172, !1181, !1182, !1183}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1138, file: !318, line: 119, baseType: !1137, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1138, file: !318, line: 122, baseType: !1137, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1138, file: !318, line: 123, baseType: !1137, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1138, file: !318, line: 126, baseType: !783, size: 32, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1138, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1138, file: !318, line: 165, baseType: !1146, size: 192, offset: 256)
!1146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1147)
!1147 = !{!1148, !1161, !1167}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1146, file: !318, line: 137, baseType: !1149, size: 128)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1150)
!1150 = !{!1151, !1160}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1149, file: !318, line: 135, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1153, file: !318, line: 96, baseType: !1152, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1153, file: !318, line: 97, baseType: !1152, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1153, file: !318, line: 101, baseType: !881, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1153, file: !318, line: 106, baseType: !881, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1153, file: !318, line: 111, baseType: !881, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1149, file: !318, line: 136, baseType: !1152, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1146, file: !318, line: 151, baseType: !1162, size: 192)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1162, file: !318, line: 141, baseType: !881, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1162, file: !318, line: 145, baseType: !881, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1162, file: !318, line: 150, baseType: !783, size: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1146, file: !318, line: 164, baseType: !1168, size: 128)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1168, file: !318, line: 161, baseType: !881, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1168, file: !318, line: 163, baseType: !1002, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1138, file: !318, line: 168, baseType: !1173, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1174, file: !318, line: 70, baseType: !1173, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1174, file: !318, line: 73, baseType: !1137, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1174, file: !318, line: 78, baseType: !881, size: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1174, file: !318, line: 85, baseType: !759, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1174, file: !318, line: 88, baseType: !783, size: 32, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1138, file: !318, line: 173, baseType: !759, size: 64, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1138, file: !318, line: 173, baseType: !759, size: 64, offset: 576)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1138, file: !318, line: 177, baseType: !994, size: 8, offset: 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1133, file: !318, line: 200, baseType: !1185, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1188)
!1188 = !{!1189}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1187, file: !318, line: 185, baseType: !1190, size: 128)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1191, file: !318, line: 184, baseType: !7, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1191, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1191, file: !318, line: 184, baseType: !1196, size: 64, offset: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 64, elements: !798)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1133, file: !318, line: 203, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1201)
!1201 = !{!1202}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1200, file: !318, line: 189, baseType: !1203, size: 128)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1204, file: !318, line: 188, baseType: !7, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1204, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1204, file: !318, line: 188, baseType: !1209, size: 64, offset: 64)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1210, size: 64, elements: !798)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1173)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1133, file: !318, line: 207, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1213, line: 144, baseType: !1214)
!1213 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1213, line: 100, size: 896, elements: !1216)
!1216 = !{!1217, !1225, !1230, !1235, !1237, !1240, !1241, !1242, !1243, !1244, !1249, !1251, !1252, !1257, !1262}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1215, file: !1213, line: 102, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1213, line: 52, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1213, line: 47, baseType: !7)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1215, file: !1213, line: 105, baseType: !1226, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1213, line: 59, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!783, !1223, !1223}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1215, file: !1213, line: 108, baseType: !1231, size: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1213, line: 63, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !871}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1215, file: !1213, line: 111, baseType: !1236, size: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !1213, line: 114, baseType: !1238, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1239, line: 46, baseType: !833)
!1239 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1215, file: !1213, line: 117, baseType: !1238, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1215, file: !1213, line: 120, baseType: !1238, size: 64, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1215, file: !1213, line: 124, baseType: !7, size: 32, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1215, file: !1213, line: 128, baseType: !7, size: 32, offset: 480)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1215, file: !1213, line: 131, baseType: !1245, size: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1213, line: 75, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!871, !1238, !1238}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1215, file: !1213, line: 132, baseType: !1250, size: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1213, line: 78, baseType: !1232)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1215, file: !1213, line: 135, baseType: !871, size: 64, offset: 640)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1215, file: !1213, line: 136, baseType: !1253, size: 64, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1213, line: 82, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!871, !871, !1238, !1238}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1215, file: !1213, line: 137, baseType: !1258, size: 64, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1213, line: 83, baseType: !1259)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !871, !871}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1215, file: !1213, line: 141, baseType: !7, size: 32, offset: 832)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1133, file: !318, line: 211, baseType: !1264, size: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1267)
!1267 = !{!1268}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1266, file: !341, line: 183, baseType: !1269, size: 128)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1271)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1270, file: !341, line: 182, baseType: !7, size: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1270, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1270, file: !341, line: 182, baseType: !1275, size: 64, offset: 64)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 64, elements: !798)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1133, file: !318, line: 220, baseType: !1277, size: 64, offset: 320)
!1277 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1277, file: !318, line: 218, baseType: !1264, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1277, file: !318, line: 219, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1283, line: 29, baseType: !1284)
!1283 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1283, line: 29, size: 96, elements: !1285)
!1285 = !{!1286}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1284, file: !1283, line: 29, baseType: !1287, size: 96)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1283, line: 27, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1283, line: 27, size: 96, elements: !1289)
!1289 = !{!1290, !1291, !1292}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1288, file: !1283, line: 27, baseType: !7, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1288, file: !1283, line: 27, baseType: !7, size: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1288, file: !1283, line: 27, baseType: !1293, size: 8, offset: 64)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1294, size: 8, elements: !798)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1283, line: 26, baseType: !994)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1128, file: !1129, line: 467, baseType: !1296, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1298)
!1298 = !{!1299, !1374, !1375, !1388, !1389, !1390, !1391, !1392, !1393, !1395, !1397, !1398}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1297, file: !325, line: 377, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !760, line: 111, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1303)
!1303 = !{!1304, !1339, !1340, !1341, !1344, !1348, !1349, !1350, !1368, !1369, !1370, !1371, !1372, !1373}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1302, file: !325, line: 219, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1308)
!1308 = !{!1309}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1307, file: !325, line: 151, baseType: !1310, size: 128)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1311, file: !325, line: 150, baseType: !7, size: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1311, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1311, file: !325, line: 150, baseType: !1316, size: 64, offset: 64)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1317, size: 64, elements: !798)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !760, line: 108, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1319, file: !325, line: 124, baseType: !1301, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1319, file: !325, line: 125, baseType: !1301, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1319, file: !325, line: 131, baseType: !1324, size: 64, offset: 128)
!1324 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1325)
!1325 = !{!1326, !1330}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1324, file: !325, line: 129, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !760, line: 66, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !760, line: 65, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1324, file: !325, line: 130, baseType: !759, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1319, file: !325, line: 134, baseType: !871, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1319, file: !325, line: 137, baseType: !881, size: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1319, file: !325, line: 138, baseType: !1002, size: 32, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1319, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !325, line: 144, baseType: !783, size: 32, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1319, file: !325, line: 145, baseType: !783, size: 32, offset: 416)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1319, file: !325, line: 146, baseType: !1338, size: 64, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !850)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1302, file: !325, line: 220, baseType: !1305, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1302, file: !325, line: 223, baseType: !871, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1302, file: !325, line: 226, baseType: !1342, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1302, file: !325, line: 229, baseType: !1345, size: 128, offset: 256)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1346, size: 128, elements: !834)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1302, file: !325, line: 232, baseType: !1301, size: 64, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1302, file: !325, line: 233, baseType: !1301, size: 64, offset: 448)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1302, file: !325, line: 238, baseType: !1351, size: 64, offset: 512)
!1351 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1352)
!1352 = !{!1353, !1359}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1351, file: !325, line: 236, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1356)
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1355, file: !325, line: 275, baseType: !1327, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1355, file: !325, line: 278, baseType: !1327, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1351, file: !325, line: 237, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1367}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1361, file: !325, line: 261, baseType: !759, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1361, file: !325, line: 262, baseType: !759, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1361, file: !325, line: 266, baseType: !759, size: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1361, file: !325, line: 267, baseType: !759, size: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1361, file: !325, line: 270, baseType: !783, size: 32, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1302, file: !325, line: 241, baseType: !1338, size: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1302, file: !325, line: 244, baseType: !783, size: 32, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1302, file: !325, line: 247, baseType: !783, size: 32, offset: 672)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1302, file: !325, line: 250, baseType: !783, size: 32, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1302, file: !325, line: 253, baseType: !783, size: 32, offset: 736)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1302, file: !325, line: 256, baseType: !783, size: 32, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1297, file: !325, line: 378, baseType: !1300, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1297, file: !325, line: 381, baseType: !1376, size: 64, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1379)
!1379 = !{!1380}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1378, file: !325, line: 282, baseType: !1381, size: 128)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1383)
!1383 = !{!1384, !1385, !1386}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1382, file: !325, line: 281, baseType: !7, size: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1382, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1382, file: !325, line: 281, baseType: !1387, size: 64, offset: 64)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1300, size: 64, elements: !798)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1297, file: !325, line: 384, baseType: !783, size: 32, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1297, file: !325, line: 387, baseType: !783, size: 32, offset: 224)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1297, file: !325, line: 390, baseType: !783, size: 32, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1297, file: !325, line: 394, baseType: !1376, size: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1297, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1297, file: !325, line: 399, baseType: !1394, size: 64, offset: 416)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !834)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1297, file: !325, line: 402, baseType: !1396, size: 64, offset: 480)
!1396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !834)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1297, file: !325, line: 406, baseType: !783, size: 32, offset: 544)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1297, file: !325, line: 409, baseType: !783, size: 32, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1128, file: !1129, line: 470, baseType: !1328, size: 64, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1128, file: !1129, line: 473, baseType: !1401, size: 64, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1129, line: 166, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1128, file: !1129, line: 476, baseType: !1404, size: 64, offset: 256)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1129, line: 476, flags: DIFlagFwdDecl)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1128, file: !1129, line: 479, baseType: !1212, size: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1128, file: !1129, line: 484, baseType: !881, size: 64, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1128, file: !1129, line: 488, baseType: !881, size: 64, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1128, file: !1129, line: 493, baseType: !881, size: 64, offset: 512)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1128, file: !1129, line: 496, baseType: !881, size: 64, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1128, file: !1129, line: 501, baseType: !1412, size: 64, offset: 640)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1414)
!1414 = !{!1415, !1418, !1419, !1420, !1421, !1423, !1424, !1429, !1430, !1431, !1432, !1433, !1434}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1413, file: !336, line: 2356, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1413, file: !336, line: 2357, baseType: !786, size: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1413, file: !336, line: 2358, baseType: !783, size: 32, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1413, file: !336, line: 2359, baseType: !783, size: 32, offset: 160)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1413, file: !336, line: 2360, baseType: !1422, size: 128, offset: 192)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 128, elements: !860)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1413, file: !336, line: 2364, baseType: !783, size: 32, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1413, file: !336, line: 2367, baseType: !1425, size: 128, offset: 384)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1426)
!1426 = !{!1427, !1428}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1425, file: !336, line: 2351, baseType: !759, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1425, file: !336, line: 2352, baseType: !850, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1413, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1413, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1413, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1413, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1413, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1413, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1128, file: !1129, line: 504, baseType: !1436, size: 64, offset: 704)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1129, line: 504, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1128, file: !1129, line: 507, baseType: !1212, size: 64, offset: 768)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1128, file: !1129, line: 510, baseType: !783, size: 32, offset: 832)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1128, file: !1129, line: 513, baseType: !783, size: 32, offset: 864)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1128, file: !1129, line: 516, baseType: !1002, size: 32, offset: 896)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1128, file: !1129, line: 519, baseType: !1002, size: 32, offset: 928)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1128, file: !1129, line: 522, baseType: !7, size: 32, offset: 960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1128, file: !1129, line: 523, baseType: !7, size: 32, offset: 992)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1128, file: !1129, line: 528, baseType: !786, size: 64, offset: 1024)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1128, file: !1129, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1128, file: !1129, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1128, file: !1129, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1128, file: !1129, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1128, file: !1129, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1128, file: !1129, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1128, file: !1129, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1128, file: !1129, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1128, file: !1129, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1128, file: !1129, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1128, file: !1129, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1128, file: !1129, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1128, file: !1129, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1128, file: !1129, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1128, file: !1129, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1128, file: !1129, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1123, file: !341, line: 3254, baseType: !881, size: 64, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1123, file: !341, line: 3257, baseType: !881, size: 64, offset: 1600)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1123, file: !341, line: 3258, baseType: !881, size: 64, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1123, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1123, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1123, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1123, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1123, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1123, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1123, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1123, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1123, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1123, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1123, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1123, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1123, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1123, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1123, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1123, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1123, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1123, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !883, file: !341, line: 3394, baseType: !1484, size: 1344)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1511, !1512, !1513, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1484, file: !341, line: 2280, baseType: !919, size: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1484, file: !341, line: 2281, baseType: !881, size: 64, offset: 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1484, file: !341, line: 2282, baseType: !881, size: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1484, file: !341, line: 2283, baseType: !881, size: 64, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1484, file: !341, line: 2284, baseType: !881, size: 64, offset: 384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1484, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1484, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1484, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1484, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1484, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1484, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1484, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1484, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1484, file: !341, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1484, file: !341, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1484, file: !341, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1484, file: !341, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
