; ModuleID = 'regcprop.c'
source_filename = "regcprop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !146, line: 1188, baseType: !7, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!705 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!717 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!718 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!719 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!720 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!721 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!722 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!723 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!724 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!725 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!726 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!727 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!728 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!729 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!730 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!731 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!732 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "op_type", file: !734, line: 25, baseType: !7, size: 32, elements: !735)
!734 = !DIFile(filename: "./recog.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !{!736, !737, !738}
!736 = !DIEnumerator(name: "OP_IN", value: 0, isUnsigned: true)
!737 = !DIEnumerator(name: "OP_OUT", value: 1, isUnsigned: true)
!738 = !DIEnumerator(name: "OP_INOUT", value: 2, isUnsigned: true)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtx_class", file: !561, line: 60, baseType: !7, size: 32, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!741 = !DIEnumerator(name: "RTX_COMPARE", value: 0, isUnsigned: true)
!742 = !DIEnumerator(name: "RTX_COMM_COMPARE", value: 1, isUnsigned: true)
!743 = !DIEnumerator(name: "RTX_BIN_ARITH", value: 2, isUnsigned: true)
!744 = !DIEnumerator(name: "RTX_COMM_ARITH", value: 3, isUnsigned: true)
!745 = !DIEnumerator(name: "RTX_UNARY", value: 4, isUnsigned: true)
!746 = !DIEnumerator(name: "RTX_EXTRA", value: 5, isUnsigned: true)
!747 = !DIEnumerator(name: "RTX_MATCH", value: 6, isUnsigned: true)
!748 = !DIEnumerator(name: "RTX_INSN", value: 7, isUnsigned: true)
!749 = !DIEnumerator(name: "RTX_OBJ", value: 8, isUnsigned: true)
!750 = !DIEnumerator(name: "RTX_CONST_OBJ", value: 9, isUnsigned: true)
!751 = !DIEnumerator(name: "RTX_TERNARY", value: 10, isUnsigned: true)
!752 = !DIEnumerator(name: "RTX_BITFIELD_OPS", value: 11, isUnsigned: true)
!753 = !DIEnumerator(name: "RTX_AUTOINC", value: 12, isUnsigned: true)
!754 = !{!755, !7, !758, !757, !560, !5, !774, !798, !1857, !769}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !756, line: 42, baseType: !757)
!756 = !DIFile(filename: "./hard-reg-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "value_data", file: !3, line: 75, size: 10240, elements: !760)
!760 = !{!761, !1855, !1856}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !759, file: !3, line: 77, baseType: !762, size: 10176)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 10176, elements: !1853)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "value_data_entry", file: !3, line: 67, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !763, file: !3, line: 69, baseType: !5, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_regno", scope: !763, file: !3, line: 70, baseType: !7, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_regno", scope: !763, file: !3, line: 71, baseType: !7, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "debug_insn_changes", scope: !763, file: !3, line: 72, baseType: !769, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queued_debug_insn_change", file: !3, line: 53, size: 256, elements: !771)
!771 = !{!772, !773, !1850, !1852}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !3, line: 55, baseType: !769, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !770, file: !3, line: 56, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !775, line: 50, baseType: !776)
!775 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !777, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !777, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !777, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !777, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !777, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !777, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !777, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !777, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !777, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !777, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !777, file: !561, line: 321, baseType: !790, size: 320, offset: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !791)
!791 = !{!792, !1785, !1787, !1848, !1849}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !790, file: !561, line: 316, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !813)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !796)
!796 = !{!797, !799, !800, !804, !805, !815, !816, !828, !831, !894, !1763, !1764, !1775, !1782}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !795, file: !561, line: 168, baseType: !798, size: 32)
!798 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !795, file: !561, line: 169, baseType: !7, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !795, file: !561, line: 170, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !795, file: !561, line: 171, baseType: !774, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !795, file: !561, line: 172, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !775, line: 53, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !808, file: !561, line: 360, baseType: !798, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !808, file: !561, line: 361, baseType: !812, size: 64, offset: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 64, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 1)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !795, file: !561, line: 173, baseType: !5, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !795, file: !561, line: 174, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !818, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !818, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !818, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !818, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !818, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !818, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !818, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !818, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !795, file: !561, line: 175, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !795, file: !561, line: 176, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !834, line: 75, size: 256, elements: !835)
!834 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!835 = !{!836, !850, !851, !852}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !833, file: !834, line: 76, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !834, line: 68, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !834, line: 63, size: 320, elements: !840)
!840 = !{!841, !843, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !839, file: !834, line: 64, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !839, file: !834, line: 65, baseType: !842, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !839, file: !834, line: 66, baseType: !7, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !839, file: !834, line: 67, baseType: !846, size: 128, offset: 192)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 128, elements: !848)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !834, line: 29, baseType: !757)
!848 = !{!849}
!849 = !DISubrange(count: 2)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !833, file: !834, line: 77, baseType: !837, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !833, file: !834, line: 78, baseType: !7, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !833, file: !834, line: 79, baseType: !853, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !834, line: 49, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !834, line: 45, size: 832, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !855, file: !834, line: 46, baseType: !842, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !855, file: !834, line: 47, baseType: !832, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !855, file: !834, line: 48, baseType: !860, size: 704, offset: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !861, line: 164, size: 704, elements: !862)
!861 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!862 = !{!863, !865, !876, !877, !878, !879, !880, !881, !886, !890, !891, !892, !893}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !860, file: !861, line: 166, baseType: !864, size: 64)
!864 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !860, file: !861, line: 167, baseType: !866, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !861, line: 157, size: 192, elements: !868)
!868 = !{!869, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !867, file: !861, line: 159, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !867, file: !861, line: 160, baseType: !866, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !867, file: !861, line: 161, baseType: !873, size: 32, offset: 128)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 32, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 4)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !860, file: !861, line: 168, baseType: !870, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !860, file: !861, line: 169, baseType: !870, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !860, file: !861, line: 170, baseType: !870, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !860, file: !861, line: 171, baseType: !864, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !860, file: !861, line: 172, baseType: !798, size: 32, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !860, file: !861, line: 176, baseType: !882, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!866, !885, !864}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !860, file: !861, line: 177, baseType: !887, size: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !885, !866}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !860, file: !861, line: 178, baseType: !885, size: 64, offset: 576)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !860, file: !861, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !860, file: !861, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !860, file: !861, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !795, file: !561, line: 177, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !775, line: 56, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !898)
!898 = !{!899, !932, !938, !949, !968, !979, !984, !991, !997, !1011, !1023, !1061, !1066, !1094, !1102, !1103, !1108, !1117, !1123, !1128, !1132, !1136, !1387, !1436, !1442, !1449, !1456, !1482, !1507, !1524, !1536, !1558, !1573, !1745}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !897, file: !151, line: 3372, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !900, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !900, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !900, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !900, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !900, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !900, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !900, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !900, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !900, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !900, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !900, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !900, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !900, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !900, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !900, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !900, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !900, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !900, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !900, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !900, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !900, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !900, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !900, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !900, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !900, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !900, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !900, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !900, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !900, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !900, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !151, line: 3373, baseType: !933, size: 192)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !933, file: !151, line: 403, baseType: !900, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !933, file: !151, line: 404, baseType: !895, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !933, file: !151, line: 405, baseType: !895, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !897, file: !151, line: 3374, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !151, line: 1385, baseType: !933, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !939, file: !151, line: 1386, baseType: !943, size: 128, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !944, line: 58, baseType: !945)
!944 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !944, line: 54, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !945, file: !944, line: 56, baseType: !757, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !945, file: !944, line: 57, baseType: !864, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !897, file: !151, line: 3375, baseType: !950, size: 256)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !151, line: 1398, baseType: !933, size: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !950, file: !151, line: 1399, baseType: !954, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !956, line: 52, size: 256, elements: !957)
!956 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!957 = !{!958, !959, !960, !961, !962, !963, !964}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !955, file: !956, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !955, file: !956, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !955, file: !956, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !955, file: !956, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !955, file: !956, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !955, file: !956, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !955, file: !956, line: 62, baseType: !965, size: 192, offset: 64)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 192, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 3)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !897, file: !151, line: 3376, baseType: !969, size: 256)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !151, line: 1409, baseType: !933, size: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !969, file: !151, line: 1410, baseType: !973, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !975, line: 27, size: 192, elements: !976)
!975 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !974, file: !975, line: 29, baseType: !943, size: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !974, file: !975, line: 30, baseType: !5, size: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !897, file: !151, line: 3377, baseType: !980, size: 256)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !980, file: !151, line: 1438, baseType: !933, size: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !980, file: !151, line: 1439, baseType: !895, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !897, file: !151, line: 3378, baseType: !985, size: 256)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !985, file: !151, line: 1419, baseType: !933, size: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !985, file: !151, line: 1420, baseType: !798, size: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !985, file: !151, line: 1421, baseType: !990, size: 8, offset: 224)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 8, elements: !813)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !897, file: !151, line: 3379, baseType: !992, size: 320)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !151, line: 1429, baseType: !933, size: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !992, file: !151, line: 1430, baseType: !895, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !992, file: !151, line: 1431, baseType: !895, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !897, file: !151, line: 3380, baseType: !998, size: 320)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !151, line: 1461, baseType: !933, size: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !998, file: !151, line: 1462, baseType: !1002, size: 128, offset: 192)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1003, line: 31, size: 128, elements: !1004)
!1003 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1004 = !{!1005, !1009, !1010}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1002, file: !1003, line: 32, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1002, file: !1003, line: 33, baseType: !7, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1002, file: !1003, line: 34, baseType: !7, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !897, file: !151, line: 3381, baseType: !1012, size: 384)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1013)
!1013 = !{!1014, !1015, !1020, !1021, !1022}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !151, line: 2508, baseType: !933, size: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1012, file: !151, line: 2509, baseType: !1016, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1017, line: 58, baseType: !1018)
!1017 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1019, line: 44, baseType: !7)
!1019 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1012, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1012, file: !151, line: 2511, baseType: !895, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1012, file: !151, line: 2512, baseType: !895, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !897, file: !151, line: 3382, baseType: !1024, size: 896)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !151, line: 2653, baseType: !1012, size: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1024, file: !151, line: 2654, baseType: !895, size: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1024, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1024, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1024, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1024, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1024, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1024, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1024, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1024, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1024, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1024, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1024, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1024, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1024, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1024, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1024, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1024, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1024, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1024, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1024, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1024, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1024, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1024, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1024, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1024, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1024, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1024, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1024, file: !151, line: 2705, baseType: !895, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1024, file: !151, line: 2706, baseType: !895, size: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1024, file: !151, line: 2707, baseType: !895, size: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1024, file: !151, line: 2708, baseType: !895, size: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1024, file: !151, line: 2711, baseType: !1059, size: 64, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !897, file: !151, line: 3383, baseType: !1062, size: 960)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !151, line: 2757, baseType: !1024, size: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1062, file: !151, line: 2758, baseType: !774, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !897, file: !151, line: 3384, baseType: !1067, size: 1472)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1068)
!1068 = !{!1069, !1090, !1091, !1092, !1093}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !151, line: 3115, baseType: !1070, size: 1216)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !151, line: 2985, baseType: !1062, size: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1070, file: !151, line: 2986, baseType: !895, size: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1070, file: !151, line: 2987, baseType: !895, size: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1070, file: !151, line: 2988, baseType: !895, size: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1070, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1070, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1070, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1070, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1070, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1070, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1070, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1070, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1070, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1070, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1070, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1070, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1070, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1070, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1067, file: !151, line: 3117, baseType: !895, size: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1067, file: !151, line: 3119, baseType: !895, size: 64, offset: 1280)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1067, file: !151, line: 3121, baseType: !895, size: 64, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1067, file: !151, line: 3123, baseType: !895, size: 64, offset: 1408)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !897, file: !151, line: 3385, baseType: !1095, size: 1088)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !151, line: 2875, baseType: !1062, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1095, file: !151, line: 2876, baseType: !774, size: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1095, file: !151, line: 2877, baseType: !1100, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !897, file: !151, line: 3386, baseType: !1070, size: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !897, file: !151, line: 3387, baseType: !1104, size: 1280)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1104, file: !151, line: 3094, baseType: !1070, size: 1216)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1104, file: !151, line: 3095, baseType: !1100, size: 64, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !897, file: !151, line: 3388, baseType: !1109, size: 1216)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !151, line: 2825, baseType: !1024, size: 896)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1109, file: !151, line: 2827, baseType: !895, size: 64, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1109, file: !151, line: 2828, baseType: !895, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1109, file: !151, line: 2829, baseType: !895, size: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1109, file: !151, line: 2830, baseType: !895, size: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1109, file: !151, line: 2831, baseType: !895, size: 64, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !897, file: !151, line: 3389, baseType: !1118, size: 1024)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !151, line: 2851, baseType: !1062, size: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1118, file: !151, line: 2852, baseType: !798, size: 32, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1118, file: !151, line: 2853, baseType: !798, size: 32, offset: 992)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !897, file: !151, line: 3390, baseType: !1124, size: 1024)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1124, file: !151, line: 2858, baseType: !1062, size: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1124, file: !151, line: 2859, baseType: !1100, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !897, file: !151, line: 3391, baseType: !1129, size: 960)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1130)
!1130 = !{!1131}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !151, line: 2863, baseType: !1062, size: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !897, file: !151, line: 3392, baseType: !1133, size: 1472)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1134)
!1134 = !{!1135}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !151, line: 3305, baseType: !1067, size: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !897, file: !151, line: 3393, baseType: !1137, size: 1792)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1138)
!1138 = !{!1139, !1140, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !151, line: 3249, baseType: !1067, size: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1137, file: !151, line: 3251, baseType: !1141, size: 64, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1143, line: 463, size: 1152, elements: !1144)
!1143 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1144 = !{!1145, !1148, !1252, !1253, !1256, !1259, !1311, !1312, !1313, !1314, !1315, !1339, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1142, file: !1143, line: 464, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1143, line: 464, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1142, file: !1143, line: 467, baseType: !1149, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1151)
!1151 = !{!1152, !1227, !1228, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1250, !1251}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1150, file: !135, line: 377, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !775, line: 111, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1156)
!1156 = !{!1157, !1192, !1193, !1194, !1197, !1201, !1202, !1203, !1221, !1222, !1223, !1224, !1225, !1226}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1155, file: !135, line: 219, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1161)
!1161 = !{!1162}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1160, file: !135, line: 151, baseType: !1163, size: 128)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1164, file: !135, line: 150, baseType: !7, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1164, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1164, file: !135, line: 150, baseType: !1169, size: 64, offset: 64)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 64, elements: !813)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !775, line: 108, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1172, file: !135, line: 124, baseType: !1154, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1172, file: !135, line: 125, baseType: !1154, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1172, file: !135, line: 131, baseType: !1177, size: 64, offset: 128)
!1177 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1178)
!1178 = !{!1179, !1183}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1177, file: !135, line: 129, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !775, line: 66, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !775, line: 65, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1177, file: !135, line: 130, baseType: !774, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1172, file: !135, line: 134, baseType: !885, size: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1172, file: !135, line: 137, baseType: !895, size: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1172, file: !135, line: 138, baseType: !1016, size: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1172, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1172, file: !135, line: 144, baseType: !798, size: 32, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1172, file: !135, line: 145, baseType: !798, size: 32, offset: 416)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1172, file: !135, line: 146, baseType: !1191, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !864)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1155, file: !135, line: 220, baseType: !1158, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1155, file: !135, line: 223, baseType: !885, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1155, file: !135, line: 226, baseType: !1195, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1155, file: !135, line: 229, baseType: !1198, size: 128, offset: 256)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 128, elements: !848)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1155, file: !135, line: 232, baseType: !1154, size: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1155, file: !135, line: 233, baseType: !1154, size: 64, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1155, file: !135, line: 238, baseType: !1204, size: 64, offset: 512)
!1204 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1205)
!1205 = !{!1206, !1212}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1204, file: !135, line: 236, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1208, file: !135, line: 275, baseType: !1180, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1208, file: !135, line: 278, baseType: !1180, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1204, file: !135, line: 237, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1214, file: !135, line: 261, baseType: !774, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1214, file: !135, line: 262, baseType: !774, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1214, file: !135, line: 266, baseType: !774, size: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1214, file: !135, line: 267, baseType: !774, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1214, file: !135, line: 270, baseType: !798, size: 32, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1155, file: !135, line: 241, baseType: !1191, size: 64, offset: 576)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1155, file: !135, line: 244, baseType: !798, size: 32, offset: 640)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1155, file: !135, line: 247, baseType: !798, size: 32, offset: 672)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1155, file: !135, line: 250, baseType: !798, size: 32, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1155, file: !135, line: 253, baseType: !798, size: 32, offset: 736)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1155, file: !135, line: 256, baseType: !798, size: 32, offset: 768)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1150, file: !135, line: 378, baseType: !1153, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1150, file: !135, line: 381, baseType: !1229, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1232)
!1232 = !{!1233}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1231, file: !135, line: 282, baseType: !1234, size: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !135, line: 281, baseType: !7, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1235, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1235, file: !135, line: 281, baseType: !1240, size: 64, offset: 64)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 64, elements: !813)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1150, file: !135, line: 384, baseType: !798, size: 32, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1150, file: !135, line: 387, baseType: !798, size: 32, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1150, file: !135, line: 390, baseType: !798, size: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1150, file: !135, line: 394, baseType: !1229, size: 64, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1150, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1150, file: !135, line: 399, baseType: !1247, size: 64, offset: 416)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !848)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1150, file: !135, line: 402, baseType: !1249, size: 64, offset: 480)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !848)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1150, file: !135, line: 406, baseType: !798, size: 32, offset: 544)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1150, file: !135, line: 409, baseType: !798, size: 32, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1142, file: !1143, line: 470, baseType: !1181, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1142, file: !1143, line: 473, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1143, line: 166, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1142, file: !1143, line: 476, baseType: !1257, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1143, line: 476, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1142, file: !1143, line: 479, baseType: !1260, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1261, line: 144, baseType: !1262)
!1261 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1261, line: 100, size: 896, elements: !1264)
!1264 = !{!1265, !1273, !1278, !1283, !1285, !1288, !1289, !1290, !1291, !1292, !1297, !1299, !1300, !1305, !1310}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1263, file: !1261, line: 102, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1261, line: 52, baseType: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!1270, !1271}
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1261, line: 47, baseType: !7)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1263, file: !1261, line: 105, baseType: !1274, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1261, line: 59, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!798, !1271, !1271}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1263, file: !1261, line: 108, baseType: !1279, size: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1261, line: 63, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !885}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1263, file: !1261, line: 111, baseType: !1284, size: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1263, file: !1261, line: 114, baseType: !1286, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1287, line: 46, baseType: !757)
!1287 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1263, file: !1261, line: 117, baseType: !1286, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1263, file: !1261, line: 120, baseType: !1286, size: 64, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1263, file: !1261, line: 124, baseType: !7, size: 32, offset: 448)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1263, file: !1261, line: 128, baseType: !7, size: 32, offset: 480)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1263, file: !1261, line: 131, baseType: !1293, size: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1261, line: 75, baseType: !1294)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!885, !1286, !1286}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1263, file: !1261, line: 132, baseType: !1298, size: 64, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1261, line: 78, baseType: !1280)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1263, file: !1261, line: 135, baseType: !885, size: 64, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1263, file: !1261, line: 136, baseType: !1301, size: 64, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1261, line: 82, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!885, !885, !1286, !1286}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1263, file: !1261, line: 137, baseType: !1306, size: 64, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1261, line: 83, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{null, !885, !885}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1263, file: !1261, line: 141, baseType: !7, size: 32, offset: 832)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1142, file: !1143, line: 484, baseType: !895, size: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1142, file: !1143, line: 488, baseType: !895, size: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1142, file: !1143, line: 493, baseType: !895, size: 64, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1142, file: !1143, line: 496, baseType: !895, size: 64, offset: 576)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1142, file: !1143, line: 501, baseType: !1316, size: 64, offset: 640)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1318)
!1318 = !{!1319, !1322, !1323, !1324, !1325, !1327, !1328, !1333, !1334, !1335, !1336, !1337, !1338}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1317, file: !146, line: 2356, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1317, file: !146, line: 2357, baseType: !801, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1317, file: !146, line: 2358, baseType: !798, size: 32, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1317, file: !146, line: 2359, baseType: !798, size: 32, offset: 160)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1317, file: !146, line: 2360, baseType: !1326, size: 128, offset: 192)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !874)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1317, file: !146, line: 2364, baseType: !798, size: 32, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1317, file: !146, line: 2367, baseType: !1329, size: 128, offset: 384)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1330)
!1330 = !{!1331, !1332}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1329, file: !146, line: 2351, baseType: !774, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1329, file: !146, line: 2352, baseType: !864, size: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1317, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1317, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1317, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1317, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1317, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1317, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1142, file: !1143, line: 504, baseType: !1340, size: 64, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1143, line: 504, flags: DIFlagFwdDecl)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1142, file: !1143, line: 507, baseType: !1260, size: 64, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1142, file: !1143, line: 510, baseType: !798, size: 32, offset: 832)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1142, file: !1143, line: 513, baseType: !798, size: 32, offset: 864)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1142, file: !1143, line: 516, baseType: !1016, size: 32, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1142, file: !1143, line: 519, baseType: !1016, size: 32, offset: 928)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1142, file: !1143, line: 522, baseType: !7, size: 32, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1142, file: !1143, line: 523, baseType: !7, size: 32, offset: 992)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1142, file: !1143, line: 528, baseType: !801, size: 64, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1142, file: !1143, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1142, file: !1143, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1142, file: !1143, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1142, file: !1143, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1142, file: !1143, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1142, file: !1143, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1142, file: !1143, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1142, file: !1143, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1142, file: !1143, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1142, file: !1143, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1142, file: !1143, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1142, file: !1143, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1142, file: !1143, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1142, file: !1143, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1142, file: !1143, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1142, file: !1143, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1137, file: !151, line: 3254, baseType: !895, size: 64, offset: 1536)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1137, file: !151, line: 3257, baseType: !895, size: 64, offset: 1600)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1137, file: !151, line: 3258, baseType: !895, size: 64, offset: 1664)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1137, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1137, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1137, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1137, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1137, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1137, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1137, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1137, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1137, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1137, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1137, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1137, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1137, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1137, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1137, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1137, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1137, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1137, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !897, file: !151, line: 3394, baseType: !1388, size: 1344)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1415, !1416, !1417, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1388, file: !151, line: 2280, baseType: !933, size: 192)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1388, file: !151, line: 2281, baseType: !895, size: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1388, file: !151, line: 2282, baseType: !895, size: 64, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1388, file: !151, line: 2283, baseType: !895, size: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1388, file: !151, line: 2284, baseType: !895, size: 64, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1388, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1388, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1388, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1388, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1388, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1388, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1388, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1388, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1388, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1388, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1388, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1388, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1388, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1388, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1388, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1388, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1388, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1388, file: !151, line: 2306, baseType: !1413, size: 32, offset: 544)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1414, line: 31, baseType: !798)
!1414 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1388, file: !151, line: 2307, baseType: !895, size: 64, offset: 576)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1388, file: !151, line: 2308, baseType: !895, size: 64, offset: 640)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1388, file: !151, line: 2314, baseType: !1418, size: 64, offset: 704)
!1418 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1419)
!1419 = !{!1420, !1421, !1422}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1418, file: !151, line: 2310, baseType: !798, size: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1418, file: !151, line: 2311, baseType: !801, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1418, file: !151, line: 2312, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1388, file: !151, line: 2315, baseType: !895, size: 64, offset: 768)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1388, file: !151, line: 2316, baseType: !895, size: 64, offset: 832)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1388, file: !151, line: 2317, baseType: !895, size: 64, offset: 896)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1388, file: !151, line: 2318, baseType: !895, size: 64, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1388, file: !151, line: 2319, baseType: !895, size: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1388, file: !151, line: 2320, baseType: !895, size: 64, offset: 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1388, file: !151, line: 2321, baseType: !895, size: 64, offset: 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1388, file: !151, line: 2322, baseType: !895, size: 64, offset: 1216)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1388, file: !151, line: 2324, baseType: !1434, size: 64, offset: 1280)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !897, file: !151, line: 3395, baseType: !1437, size: 320)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1438)
!1438 = !{!1439, !1440, !1441}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1437, file: !151, line: 1470, baseType: !933, size: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1437, file: !151, line: 1471, baseType: !895, size: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1437, file: !151, line: 1472, baseType: !895, size: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !897, file: !151, line: 3396, baseType: !1443, size: 320)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1444)
!1444 = !{!1445, !1446, !1447}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1443, file: !151, line: 1483, baseType: !933, size: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1443, file: !151, line: 1484, baseType: !798, size: 32, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1443, file: !151, line: 1485, baseType: !1448, size: 64, offset: 256)
!1448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 64, elements: !813)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !897, file: !151, line: 3397, baseType: !1450, size: 384)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !151, line: 1830, baseType: !933, size: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1450, file: !151, line: 1831, baseType: !1016, size: 32, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1450, file: !151, line: 1832, baseType: !895, size: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1450, file: !151, line: 1835, baseType: !1448, size: 64, offset: 320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !897, file: !151, line: 3398, baseType: !1457, size: 704)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1458)
!1458 = !{!1459, !1460, !1461, !1465, !1466, !1469}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1457, file: !151, line: 1899, baseType: !933, size: 192)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1457, file: !151, line: 1902, baseType: !895, size: 64, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1457, file: !151, line: 1905, baseType: !1462, size: 64, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !775, line: 58, baseType: !1463)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !775, line: 57, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1457, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1457, file: !151, line: 1911, baseType: !1467, size: 64, offset: 384)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1457, file: !151, line: 1914, baseType: !1470, size: 256, offset: 448)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1471)
!1471 = !{!1472, !1474, !1475, !1480}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1470, file: !151, line: 1884, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1470, file: !151, line: 1885, baseType: !1473, size: 64, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1470, file: !151, line: 1891, baseType: !1476, size: 64, offset: 128)
!1476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1470, file: !151, line: 1891, size: 64, elements: !1477)
!1477 = !{!1478, !1479}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1476, file: !151, line: 1891, baseType: !1462, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1476, file: !151, line: 1891, baseType: !895, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1470, file: !151, line: 1892, baseType: !1481, size: 64, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !897, file: !151, line: 3399, baseType: !1483, size: 704)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1502, !1503, !1504, !1505, !1506}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1483, file: !151, line: 2009, baseType: !933, size: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1483, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1483, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1483, file: !151, line: 2014, baseType: !1016, size: 32, offset: 224)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1483, file: !151, line: 2016, baseType: !895, size: 64, offset: 256)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1483, file: !151, line: 2017, baseType: !1491, size: 64, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1493)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1494)
!1494 = !{!1495}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1493, file: !151, line: 183, baseType: !1496, size: 128)
