; ModuleID = 'argv.c'
source_filename = "argv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@_sch_istable = external dso_local constant [256 x i16], align 16
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"\0Aout of memory\0A\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local i8** @dupargv(i8** %argv) #0 !dbg !38 {
entry:
  %retval = alloca i8**, align 8
  %argv.addr = alloca i8**, align 8
  %argc = alloca i32, align 4
  %copy = alloca i8**, align 8
  %len = alloca i32, align 4
  store i8** %argv, i8*** %argv.addr, align 8
  call void @llvm.dbg.declare(metadata i8*** %argv.addr, metadata !42, metadata !DIExpression()), !dbg !43
  call void @llvm.dbg.declare(metadata i32* %argc, metadata !44, metadata !DIExpression()), !dbg !46
  call void @llvm.dbg.declare(metadata i8*** %copy, metadata !47, metadata !DIExpression()), !dbg !48

!302 = distinct !DILexicalBlock(scope: !303, file: !1, line: 259, column: 13)
!303 = distinct !DILexicalBlock(scope: !299, file: !1, line: 258, column: 7)
!304 = !DILocation(line: 259, column: 13, scope: !302)
!305 = !DILocation(line: 259, column: 20, scope: !302)
!306 = !DILocation(line: 259, column: 13, scope: !303)
!307 = !DILocation(line: 261, column: 13, scope: !308)
!308 = distinct !DILexicalBlock(scope: !302, file: !1, line: 260, column: 4)
!309 = !DILocation(line: 262, column: 4, scope: !308)
!310 = !DILocation(line: 265, column: 16, scope: !311)
!311 = distinct !DILexicalBlock(scope: !302, file: !1, line: 264, column: 4)
!312 = !DILocation(line: 265, column: 15, scope: !311)
!313 = !DILocation(line: 265, column: 10, scope: !311)
!314 = !DILocation(line: 265, column: 13, scope: !311)
!315 = !DILocation(line: 267, column: 7, scope: !303)
!316 = !DILocation(line: 270, column: 14, scope: !317)
!317 = distinct !DILexicalBlock(scope: !318, file: !1, line: 270, column: 13)
!318 = distinct !DILexicalBlock(scope: !299, file: !1, line: 269, column: 7)
!319 = !DILocation(line: 270, column: 13, scope: !317)
!320 = !DILocation(line: 270, column: 20, scope: !317)
!321 = !DILocation(line: 270, column: 13, scope: !318)
!322 = !DILocation(line: 272, column: 13, scope: !323)
!323 = distinct !DILexicalBlock(scope: !317, file: !1, line: 271, column: 4)
!324 = !DILocation(line: 273, column: 4, scope: !323)
!325 = !DILocation(line: 274, column: 19, scope: !326)
!326 = distinct !DILexicalBlock(scope: !317, file: !1, line: 274, column: 18)
!327 = !DILocation(line: 274, column: 18, scope: !326)
!328 = !DILocation(line: 274, column: 25, scope: !326)
!329 = !DILocation(line: 274, column: 18, scope: !317)
!330 = !DILocation(line: 276, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !326, file: !1, line: 275, column: 4)
!332 = !DILocation(line: 277, column: 4, scope: !331)
!333 = !DILocation(line: 280, column: 16, scope: !334)
!334 = distinct !DILexicalBlock(scope: !326, file: !1, line: 279, column: 4)
!335 = !DILocation(line: 280, column: 15, scope: !334)
!336 = !DILocation(line: 280, column: 10, scope: !334)
!337 = !DILocation(line: 280, column: 13, scope: !334)
!338 = !DILocation(line: 283, column: 10, scope: !263)
!339 = distinct !{!339, !245, !340}
!340 = !DILocation(line: 285, column: 6, scope: !191)
!341 = !DILocation(line: 286, column: 5, scope: !191)
!342 = !DILocation(line: 286, column: 9, scope: !191)
!343 = !DILocation(line: 287, column: 25, scope: !191)
!344 = !DILocation(line: 287, column: 17, scope: !191)
!345 = !DILocation(line: 287, column: 4, scope: !191)
!346 = !DILocation(line: 287, column: 9, scope: !191)
!347 = !DILocation(line: 287, column: 15, scope: !191)
!348 = !DILocation(line: 288, column: 8, scope: !349)
!349 = distinct !DILexicalBlock(scope: !191, file: !1, line: 288, column: 8)
!350 = !DILocation(line: 288, column: 13, scope: !349)
!351 = !DILocation(line: 288, column: 19, scope: !349)
!352 = !DILocation(line: 288, column: 8, scope: !191)
!353 = !DILocation(line: 290, column: 18, scope: !354)
!354 = distinct !DILexicalBlock(scope: !349, file: !1, line: 289, column: 6)
!355 = !DILocation(line: 290, column: 8, scope: !354)
!356 = !DILocation(line: 291, column: 13, scope: !354)
!357 = !DILocation(line: 292, column: 8, scope: !354)
!358 = !DILocation(line: 294, column: 8, scope: !191)
!359 = !DILocation(line: 295, column: 4, scope: !191)
!360 = !DILocation(line: 295, column: 9, scope: !191)
!361 = !DILocation(line: 295, column: 15, scope: !191)
!362 = !DILocation(line: 297, column: 4, scope: !191)
!363 = !DILocation(line: 298, column: 2, scope: !191)
!364 = !DILocation(line: 299, column: 15, scope: !187)
!365 = !DILocation(line: 299, column: 14, scope: !187)
!366 = !DILocation(line: 299, column: 21, scope: !187)
!367 = distinct !{!367, !189, !368}
!368 = !DILocation(line: 299, column: 27, scope: !187)
!369 = !DILocation(line: 300, column: 5, scope: !187)
!370 = !DILocation(line: 301, column: 11, scope: !157)
!371 = !DILocation(line: 301, column: 3, scope: !157)
!372 = distinct !DISubprogram(name: "consume_whitespace", scope: !1, file: !1, line: 123, type: !373, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !41)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!376 = !DILocalVariable(name: "input", arg: 1, scope: !372, file: !1, line: 123, type: !375)
!377 = !DILocation(line: 123, column: 34, scope: !372)
!378 = !DILocation(line: 125, column: 3, scope: !372)
!379 = !DILocation(line: 125, column: 10, scope: !372)
!380 = !DILocation(line: 127, column: 9, scope: !381)
!381 = distinct !DILexicalBlock(scope: !372, file: !1, line: 126, column: 5)
!382 = !DILocation(line: 127, column: 15, scope: !381)
!383 = distinct !{!383, !378, !384}
!384 = !DILocation(line: 128, column: 5, scope: !372)
!385 = !DILocation(line: 129, column: 1, scope: !372)
!386 = distinct !DISubprogram(name: "writeargv", scope: !1, file: !1, line: 317, type: !387, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !41)
!387 = !DISubroutineType(types: !388)
!388 = !{!45, !27, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !391, line: 7, baseType: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !393, line: 49, size: 1728, elements: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !410, !412, !413, !414, !418, !419, !421, !425, !428, !430, !433, !436, !437, !438, !439, !440}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !392, file: !393, line: 51, baseType: !45, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !392, file: !393, line: 54, baseType: !28, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !392, file: !393, line: 55, baseType: !28, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !392, file: !393, line: 56, baseType: !28, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !392, file: !393, line: 57, baseType: !28, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !392, file: !393, line: 58, baseType: !28, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !392, file: !393, line: 59, baseType: !28, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !392, file: !393, line: 60, baseType: !28, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !392, file: !393, line: 61, baseType: !28, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !392, file: !393, line: 64, baseType: !28, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !392, file: !393, line: 65, baseType: !28, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !392, file: !393, line: 66, baseType: !28, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !392, file: !393, line: 68, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !393, line: 36, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !392, file: !393, line: 70, baseType: !411, size: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !392, file: !393, line: 72, baseType: !45, size: 32, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !392, file: !393, line: 73, baseType: !45, size: 32, offset: 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !392, file: !393, line: 74, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !416, line: 152, baseType: !417)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!417 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !392, file: !393, line: 77, baseType: !30, size: 16, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !392, file: !393, line: 78, baseType: !420, size: 8, offset: 1040)
!420 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !392, file: !393, line: 79, baseType: !422, size: 8, offset: 1048)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 1)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !392, file: !393, line: 81, baseType: !426, size: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !393, line: 43, baseType: null)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !392, file: !393, line: 89, baseType: !429, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !416, line: 153, baseType: !417)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !392, file: !393, line: 91, baseType: !431, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !393, line: 37, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !392, file: !393, line: 92, baseType: !434, size: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !393, line: 38, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !392, file: !393, line: 93, baseType: !411, size: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !392, file: !393, line: 94, baseType: !26, size: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !392, file: !393, line: 95, baseType: !31, size: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !392, file: !393, line: 96, baseType: !45, size: 32, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !392, file: !393, line: 98, baseType: !441, size: 160, offset: 1568)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 20)
!444 = !DILocalVariable(name: "argv", arg: 1, scope: !386, file: !1, line: 317, type: !27)
!445 = !DILocation(line: 317, column: 19, scope: !386)
!446 = !DILocalVariable(name: "f", arg: 2, scope: !386, file: !1, line: 317, type: !389)
!447 = !DILocation(line: 317, column: 31, scope: !386)
!448 = !DILocalVariable(name: "status", scope: !386, file: !1, line: 319, type: !45)
!449 = !DILocation(line: 319, column: 7, scope: !386)
!450 = !DILocation(line: 321, column: 7, scope: !451)
!451 = distinct !DILexicalBlock(scope: !386, file: !1, line: 321, column: 7)
!452 = !DILocation(line: 321, column: 9, scope: !451)
!453 = !DILocation(line: 321, column: 7, scope: !386)
!454 = !DILocation(line: 322, column: 5, scope: !451)
!455 = !DILocation(line: 324, column: 3, scope: !386)
!456 = !DILocation(line: 324, column: 11, scope: !386)
!457 = !DILocation(line: 324, column: 10, scope: !386)
!458 = !DILocation(line: 324, column: 16, scope: !386)
!459 = !DILocalVariable(name: "arg", scope: !460, file: !1, line: 326, type: !160)
!460 = distinct !DILexicalBlock(scope: !386, file: !1, line: 325, column: 5)
!461 = !DILocation(line: 326, column: 19, scope: !460)
!462 = !DILocation(line: 326, column: 26, scope: !460)
!463 = !DILocation(line: 326, column: 25, scope: !460)
!464 = !DILocation(line: 328, column: 7, scope: !460)
!465 = !DILocation(line: 328, column: 15, scope: !460)
!466 = !DILocation(line: 328, column: 14, scope: !460)
!467 = !DILocation(line: 328, column: 19, scope: !460)
!468 = !DILocalVariable(name: "c", scope: !469, file: !1, line: 330, type: !29)
!469 = distinct !DILexicalBlock(scope: !460, file: !1, line: 329, column: 9)
!470 = !DILocation(line: 330, column: 16, scope: !469)
!471 = !DILocation(line: 330, column: 21, scope: !469)
!472 = !DILocation(line: 330, column: 20, scope: !469)
!473 = !DILocation(line: 332, column: 15, scope: !474)
!474 = distinct !DILexicalBlock(scope: !469, file: !1, line: 332, column: 15)
!475 = !DILocation(line: 332, column: 26, scope: !474)
!476 = !DILocation(line: 332, column: 29, scope: !474)
!477 = !DILocation(line: 332, column: 31, scope: !474)
!478 = !DILocation(line: 332, column: 39, scope: !474)
!479 = !DILocation(line: 332, column: 42, scope: !474)
!480 = !DILocation(line: 332, column: 44, scope: !474)
!481 = !DILocation(line: 332, column: 52, scope: !474)
!482 = !DILocation(line: 332, column: 55, scope: !474)
!483 = !DILocation(line: 332, column: 57, scope: !474)
!484 = !DILocation(line: 332, column: 15, scope: !469)
!485 = !DILocation(line: 333, column: 37, scope: !486)
!486 = distinct !DILexicalBlock(scope: !474, file: !1, line: 333, column: 17)
!487 = !DILocation(line: 333, column: 24, scope: !486)
!488 = !DILocation(line: 333, column: 21, scope: !486)
!489 = !DILocation(line: 333, column: 17, scope: !474)
!490 = !DILocation(line: 335, column: 24, scope: !491)
!491 = distinct !DILexicalBlock(scope: !486, file: !1, line: 334, column: 15)
!492 = !DILocation(line: 336, column: 17, scope: !491)
!493 = !DILocation(line: 333, column: 38, scope: !486)
!494 = !DILocation(line: 339, column: 29, scope: !495)
!495 = distinct !DILexicalBlock(scope: !469, file: !1, line: 339, column: 15)
!496 = !DILocation(line: 339, column: 32, scope: !495)
!497 = !DILocation(line: 339, column: 22, scope: !495)
!498 = !DILocation(line: 339, column: 19, scope: !495)
!499 = !DILocation(line: 339, column: 15, scope: !469)
!500 = !DILocation(line: 341, column: 22, scope: !501)
!501 = distinct !DILexicalBlock(scope: !495, file: !1, line: 340, column: 13)
!502 = !DILocation(line: 342, column: 15, scope: !501)
!503 = !DILocation(line: 344, column: 14, scope: !469)
!504 = distinct !{!504, !464, !505}
!505 = !DILocation(line: 345, column: 9, scope: !460)
