; ModuleID = 'cpp_pch.c'
source_filename = "cpp_pch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cpp_reader = type { %struct.cpp_buffer*, %struct.cpp_buffer*, %struct.lexer_state, %struct.line_maps*, i32, %struct._cpp_buff*, %struct._cpp_buff*, %struct._cpp_buff*, %struct.cpp_context, %struct.cpp_context*, %struct.directive*, %struct.cpp_token, i32, i8, %struct.cpp_dir*, %struct.cpp_dir*, %struct.cpp_dir, %struct._cpp_file*, %struct._cpp_file*, %struct.htab*, %struct.htab*, %struct.file_hash_entry_pool*, %struct.htab*, %struct.obstack, i8, i8, %struct.cpp_hashnode*, %struct.cpp_hashnode*, i8, %struct.cpp_token*, %struct.tokenrun, %struct.tokenrun*, i32, i32, i8*, i32, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, %struct.cset_converter, i8*, i8*, %struct.cpp_token, %struct.cpp_token, %struct.deps*, %struct.obstack, %struct.obstack, %struct.pragma_entry*, %struct.cpp_callbacks, %struct.ht*, %struct.op*, %struct.op*, %struct.cpp_options, %struct.spec_nodes, i8, %struct.anon.2, i8*, i8*, i8*, %struct.cpp_savedstate*, i32, %struct.cpp_comment_table, %struct.def_pragma_macro* }
%struct.cpp_buffer = type { i8*, i8*, i8*, i8*, i8*, %struct._cpp_line_note*, i32, i32, i32, %struct.cpp_buffer*, %struct._cpp_file*, i8*, %struct.if_stack*, i8, i8, i8, %struct.cpp_dir, %struct.cset_converter }
%struct._cpp_line_note = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cpp_pch.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !17, !29, !35, !40, !45}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_builtin_type", file: !4, line: 593, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./cpplib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "BT_SPECLINE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "BT_DATE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "BT_FILE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "BT_BASE_FILE", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "BT_INCLUDE_LEVEL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "BT_TIME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "BT_STDC", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "BT_PRAGMA", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "BT_TIMESTAMP", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "BT_COUNTER", value: 9, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_lang", file: !4, line: 158, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!19 = !DIEnumerator(name: "CLK_GNUC89", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "CLK_GNUC99", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "CLK_STDC89", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "CLK_STDC94", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "CLK_STDC99", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "CLK_GNUCXX", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "CLK_CXX98", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "CLK_GNUCXX0X", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "CLK_CXX0X", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "CLK_ASM", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_normalize_level", file: !4, line: 265, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "normalized_KC", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "normalized_C", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "normalized_identifier_C", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "normalized_none", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cpp_deps_style", file: !4, line: 262, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "DEPS_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "DEPS_USER", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "DEPS_SYSTEM", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "node_type", file: !4, line: 584, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "NT_VOID", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "NT_MACRO", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "NT_ASSERTION", value: 2, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !46, line: 147, baseType: !5, size: 32, elements: !47)
!46 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !{!48, !49}
!48 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!50 = !{!51, !111, !197, !82, !78, !198, !202, !121, !211, !213, !214, !80, !267, !275, !277, !203, !268, !209}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !1, line: 110, size: 320, elements: !53)
!53 = !{!54, !108, !109, !110, !196}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "definedhash", scope: !52, file: !1, line: 113, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !46, line: 144, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !46, line: 100, size: 896, elements: !58)
!58 = !{!59, !67, !73, !79, !81, !85, !86, !87, !88, !89, !94, !96, !97, !102, !107}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !57, file: !46, line: 102, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !46, line: 52, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !46, line: 47, baseType: !5)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !57, file: !46, line: 105, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !46, line: 59, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !65, !65}
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !57, file: !46, line: 108, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !46, line: 63, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !57, file: !46, line: 111, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !46, line: 114, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !57, file: !46, line: 117, baseType: !82, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !57, file: !46, line: 120, baseType: !82, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !57, file: !46, line: 124, baseType: !5, size: 32, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !57, file: !46, line: 128, baseType: !5, size: 32, offset: 480)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !57, file: !46, line: 131, baseType: !90, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !46, line: 75, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!78, !82, !82}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !57, file: !46, line: 132, baseType: !95, size: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !46, line: 78, baseType: !75)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !57, file: !46, line: 135, baseType: !78, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !57, file: !46, line: 136, baseType: !98, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !46, line: 82, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!78, !78, !82, !82}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !57, file: !46, line: 137, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !46, line: 83, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !78, !78}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !57, file: !46, line: 141, baseType: !5, size: 32, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hashsize", scope: !52, file: !1, line: 116, baseType: !82, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "n_defs", scope: !52, file: !1, line: 118, baseType: !82, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "defs", scope: !52, file: !1, line: 120, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !4, line: 36, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !4, line: 644, size: 256, elements: !115)
!115 = !{!116, !126, !127, !128, !129, !130, !131}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !114, file: !4, line: 645, baseType: !117, size: 128)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !118, line: 31, size: 128, elements: !119)
!118 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !{!120, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !117, file: !118, line: 32, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !117, file: !118, line: 33, baseType: !5, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !117, file: !118, line: 34, baseType: !5, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !114, file: !4, line: 646, baseType: !5, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !114, file: !4, line: 647, baseType: !5, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !114, file: !4, line: 650, baseType: !123, size: 8, offset: 136)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !4, line: 651, baseType: !5, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !4, line: 652, baseType: !5, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !4, line: 654, baseType: !132, size: 64, offset: 192)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !4, line: 633, size: 64, elements: !133)
!133 = !{!134, !184, !194, !195}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !132, file: !4, line: 635, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !4, line: 37, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !138, line: 36, size: 256, elements: !139)
!138 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !{!140, !141, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !137, file: !138, line: 42, baseType: !111, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !137, file: !138, line: 51, baseType: !142, size: 64, offset: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !138, line: 47, size: 64, elements: !143)
!143 = !{!144, !174}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !142, file: !138, line: 49, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !4, line: 34, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !4, line: 212, size: 192, elements: !148)
!148 = !{!149, !152, !153, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !147, file: !4, line: 213, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !151, line: 44, baseType: !5)
!151 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !4, line: 214, baseType: !5, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !4, line: 215, baseType: !154, size: 16, offset: 48)
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !147, file: !4, line: 237, baseType: !156, size: 128, offset: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !4, line: 217, size: 128, elements: !157)
!157 = !{!158, !162, !163, !168, !172, !173}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !156, file: !4, line: 220, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !4, line: 201, size: 64, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !159, file: !4, line: 207, baseType: !112, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !156, file: !4, line: 223, baseType: !145, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !156, file: !4, line: 226, baseType: !164, size: 128)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !4, line: 162, size: 128, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !4, line: 163, baseType: !5, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !164, file: !4, line: 164, baseType: !121, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !156, file: !4, line: 229, baseType: !169, size: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !4, line: 195, size: 32, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !169, file: !4, line: 197, baseType: !5, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !156, file: !4, line: 233, baseType: !5, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !156, file: !4, line: 236, baseType: !5, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !142, file: !138, line: 50, baseType: !121, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !137, file: !138, line: 54, baseType: !150, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !137, file: !138, line: 57, baseType: !5, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !137, file: !138, line: 60, baseType: !154, size: 16, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !137, file: !138, line: 63, baseType: !5, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !137, file: !138, line: 66, baseType: !5, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !137, file: !138, line: 69, baseType: !5, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !137, file: !138, line: 72, baseType: !5, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !137, file: !138, line: 75, baseType: !5, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !137, file: !138, line: 80, baseType: !5, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !132, file: !4, line: 637, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !138, line: 28, size: 320, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !138, line: 29, baseType: !185, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !186, file: !138, line: 30, baseType: !5, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !186, file: !138, line: 31, baseType: !191, size: 192, offset: 128)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 192, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 1)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !132, file: !4, line: 639, baseType: !3, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !132, file: !4, line: 641, baseType: !154, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "definedstrs", scope: !52, file: !1, line: 123, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "save_macro_data", file: !1, line: 749, size: 256, elements: !200)
!200 = !{!201, !205, !206, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "defns", scope: !199, file: !1, line: 751, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !138, line: 22, baseType: !123)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !199, file: !1, line: 752, baseType: !82, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !199, file: !1, line: 753, baseType: !82, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "saved_pragmas", scope: !199, file: !1, line: 754, baseType: !208, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !216, line: 7, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !218, line: 49, size: 1728, elements: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !235, !237, !238, !239, !243, !244, !246, !248, !251, !253, !256, !259, !260, !261, !262, !263}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !217, file: !218, line: 51, baseType: !72, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !217, file: !218, line: 54, baseType: !209, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !217, file: !218, line: 55, baseType: !209, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !217, file: !218, line: 56, baseType: !209, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !217, file: !218, line: 57, baseType: !209, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !217, file: !218, line: 58, baseType: !209, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !217, file: !218, line: 59, baseType: !209, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !217, file: !218, line: 60, baseType: !209, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !217, file: !218, line: 61, baseType: !209, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !217, file: !218, line: 64, baseType: !209, size: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !217, file: !218, line: 65, baseType: !209, size: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !217, file: !218, line: 66, baseType: !209, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !217, file: !218, line: 68, baseType: !233, size: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !218, line: 36, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !217, file: !218, line: 70, baseType: !236, size: 64, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !217, file: !218, line: 72, baseType: !72, size: 32, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !217, file: !218, line: 73, baseType: !72, size: 32, offset: 928)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !217, file: !218, line: 74, baseType: !240, size: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !241, line: 152, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !217, file: !218, line: 77, baseType: !154, size: 16, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !217, file: !218, line: 78, baseType: !245, size: 8, offset: 1040)
!245 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !217, file: !218, line: 79, baseType: !247, size: 8, offset: 1048)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 8, elements: !192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !217, file: !218, line: 81, baseType: !249, size: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !218, line: 43, baseType: null)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !217, file: !218, line: 89, baseType: !252, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !241, line: 153, baseType: !242)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !217, file: !218, line: 91, baseType: !254, size: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !218, line: 37, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !217, file: !218, line: 92, baseType: !257, size: 64, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !218, line: 38, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !217, file: !218, line: 93, baseType: !236, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !217, file: !218, line: 94, baseType: !78, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !217, file: !218, line: 95, baseType: !82, size: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !217, file: !218, line: 96, baseType: !72, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !217, file: !218, line: 98, baseType: !264, size: 160, offset: 1568)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 160, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 20)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !270, line: 310, size: 192, elements: !271)
!270 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !270, line: 312, baseType: !268, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !270, line: 314, baseType: !209, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !269, file: !270, line: 316, baseType: !135, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_node_list", file: !1, line: 529, size: 192, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "defs", scope: !278, file: !1, line: 532, baseType: !111, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "n_defs", scope: !278, file: !1, line: 534, baseType: !82, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "asize", scope: !278, file: !1, line: 536, baseType: !82, size: 64, offset: 128)
!283 = !{i32 7, !"Dwarf Version", i32 4}
!284 = !{i32 2, !"Debug Info Version", i32 3}
!285 = !{i32 1, !"wchar_size", i32 4}
!286 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!287 = distinct !DISubprogram(name: "cpp_save_state", scope: !1, file: !1, line: 200, type: !288, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !758)
!288 = !DISubroutineType(types: !289)
!289 = !{!72, !290, !214}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !4, line: 31, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !270, line: 322, size: 10432, elements: !293)
!293 = !{!294, !367, !368, !385, !415, !416, !426, !427, !428, !458, !460, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !477, !478, !510, !511, !512, !515, !516, !517, !518, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !544, !545, !546, !549, !631, !657, !660, !661, !724, !731, !732, !739, !740, !741, !742, !743, !744, !757}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !292, file: !270, line: 325, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !4, line: 32, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !270, line: 249, size: 1536, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !311, !312, !313, !314, !316, !319, !320, !323, !324, !325, !326, !327, !328, !353}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !297, file: !270, line: 251, baseType: !121, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !297, file: !270, line: 252, baseType: !121, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !297, file: !270, line: 253, baseType: !121, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !297, file: !270, line: 255, baseType: !121, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !297, file: !270, line: 256, baseType: !121, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !297, file: !270, line: 258, baseType: !305, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !270, line: 235, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !270, line: 236, size: 128, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !307, file: !270, line: 239, baseType: !121, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !270, line: 245, baseType: !5, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !297, file: !270, line: 259, baseType: !5, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !297, file: !270, line: 260, baseType: !5, size: 32, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !297, file: !270, line: 261, baseType: !5, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !297, file: !270, line: 263, baseType: !315, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !297, file: !270, line: 267, baseType: !317, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !4, line: 42, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !297, file: !270, line: 271, baseType: !121, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !297, file: !270, line: 275, baseType: !321, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !270, line: 275, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !297, file: !270, line: 278, baseType: !123, size: 8, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !297, file: !270, line: 284, baseType: !5, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !297, file: !270, line: 289, baseType: !5, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !297, file: !270, line: 294, baseType: !5, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !297, file: !270, line: 298, baseType: !123, size: 8, offset: 784)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !297, file: !270, line: 302, baseType: !329, size: 512, offset: 832)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !4, line: 523, size: 512, elements: !330)
!330 = !{!331, !333, !334, !335, !336, !337, !338, !340, !346, !350}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !4, line: 526, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !4, line: 529, baseType: !209, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !329, file: !4, line: 530, baseType: !5, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !329, file: !4, line: 534, baseType: !123, size: 8, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !329, file: !4, line: 537, baseType: !123, size: 8, offset: 168)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !329, file: !4, line: 541, baseType: !209, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !329, file: !4, line: 545, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !329, file: !4, line: 551, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!209, !275, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !4, line: 39, baseType: !329)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !329, file: !4, line: 555, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !348, line: 47, baseType: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !241, line: 148, baseType: !84)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !329, file: !4, line: 556, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !348, line: 59, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !241, line: 145, baseType: !84)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !297, file: !270, line: 306, baseType: !354, size: 192, offset: 1344)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !270, line: 47, size: 192, elements: !355)
!355 = !{!356, !365, !366}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !354, file: !270, line: 49, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !270, line: 45, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!123, !361, !121, !82, !363}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !362, line: 29, baseType: !78)
!362 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !270, line: 43, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !354, file: !270, line: 50, baseType: !361, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !354, file: !270, line: 51, baseType: !72, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !292, file: !270, line: 328, baseType: !295, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !270, line: 331, baseType: !369, size: 160, offset: 128)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !270, line: 177, size: 160, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !369, file: !270, line: 180, baseType: !123, size: 8)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !369, file: !270, line: 185, baseType: !123, size: 8, offset: 8)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !369, file: !270, line: 188, baseType: !123, size: 8, offset: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !369, file: !270, line: 191, baseType: !123, size: 8, offset: 24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !369, file: !270, line: 194, baseType: !123, size: 8, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !369, file: !270, line: 198, baseType: !123, size: 8, offset: 40)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !369, file: !270, line: 201, baseType: !123, size: 8, offset: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !369, file: !270, line: 204, baseType: !123, size: 8, offset: 56)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !369, file: !270, line: 207, baseType: !123, size: 8, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !369, file: !270, line: 210, baseType: !123, size: 8, offset: 72)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !369, file: !270, line: 214, baseType: !123, size: 8, offset: 80)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !369, file: !270, line: 217, baseType: !5, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !369, file: !270, line: 220, baseType: !123, size: 8, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !369, file: !270, line: 223, baseType: !123, size: 8, offset: 136)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !292, file: !270, line: 334, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !151, line: 74, size: 448, elements: !388)
!388 = !{!389, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !387, file: !151, line: 75, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !151, line: 61, size: 192, elements: !392)
!392 = !{!393, !394, !396, !397, !398, !399, !400}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !391, file: !151, line: 62, baseType: !275, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !391, file: !151, line: 63, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !151, line: 39, baseType: !5)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !391, file: !151, line: 64, baseType: !150, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !391, file: !151, line: 65, baseType: !72, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !391, file: !151, line: 66, baseType: !5, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !391, file: !151, line: 68, baseType: !123, size: 8, offset: 168)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !391, file: !151, line: 70, baseType: !5, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !387, file: !151, line: 76, baseType: !5, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !387, file: !151, line: 77, baseType: !5, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !387, file: !151, line: 79, baseType: !5, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !387, file: !151, line: 84, baseType: !72, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !387, file: !151, line: 87, baseType: !5, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !387, file: !151, line: 90, baseType: !123, size: 8, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !387, file: !151, line: 93, baseType: !150, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !387, file: !151, line: 96, baseType: !150, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !387, file: !151, line: 100, baseType: !5, size: 32, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !387, file: !151, line: 104, baseType: !411, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !151, line: 47, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!78, !78, !82}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !292, file: !270, line: 337, baseType: !150, size: 32, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !292, file: !270, line: 340, baseType: !417, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !270, line: 99, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !270, line: 100, size: 256, elements: !420)
!420 = !{!421, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !270, line: 102, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !270, line: 103, baseType: !197, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !419, file: !270, line: 103, baseType: !197, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !419, file: !270, line: 103, baseType: !197, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !292, file: !270, line: 341, baseType: !417, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !292, file: !270, line: 342, baseType: !417, size: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !292, file: !270, line: 345, baseType: !429, size: 448, offset: 640)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !270, line: 142, size: 448, elements: !430)
!430 = !{!431, !434, !435, !455, !456, !457}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !270, line: 145, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !270, line: 141, baseType: !429)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !270, line: 145, baseType: !432, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !429, file: !270, line: 164, baseType: !436, size: 128, offset: 128)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !270, line: 147, size: 128, elements: !437)
!437 = !{!438, !450}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !436, file: !270, line: 156, baseType: !439, size: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !270, line: 152, size: 128, elements: !440)
!440 = !{!441, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !439, file: !270, line: 154, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !270, line: 121, size: 64, elements: !443)
!443 = !{!444, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !442, file: !270, line: 123, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !442, file: !270, line: 124, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !439, file: !270, line: 155, baseType: !442, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !436, file: !270, line: 163, baseType: !451, size: 128)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !270, line: 159, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !451, file: !270, line: 161, baseType: !121, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !451, file: !270, line: 162, baseType: !121, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !429, file: !270, line: 168, baseType: !417, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !429, file: !270, line: 171, baseType: !112, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !429, file: !270, line: 174, baseType: !123, size: 8, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !292, file: !270, line: 346, baseType: !459, size: 64, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !292, file: !270, line: 349, baseType: !461, size: 64, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !270, line: 40, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !292, file: !270, line: 352, baseType: !146, size: 192, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !292, file: !270, line: 356, baseType: !150, size: 32, offset: 1408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !292, file: !270, line: 360, baseType: !123, size: 8, offset: 1440)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !292, file: !270, line: 363, baseType: !332, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !292, file: !270, line: 364, baseType: !332, size: 64, offset: 1536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !292, file: !270, line: 365, baseType: !329, size: 512, offset: 1600)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !292, file: !270, line: 368, baseType: !317, size: 64, offset: 2112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !292, file: !270, line: 370, baseType: !317, size: 64, offset: 2176)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !292, file: !270, line: 373, baseType: !56, size: 64, offset: 2240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !292, file: !270, line: 374, baseType: !56, size: 64, offset: 2304)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !292, file: !270, line: 375, baseType: !475, size: 64, offset: 2368)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !270, line: 375, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !292, file: !270, line: 378, baseType: !56, size: 64, offset: 2432)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !292, file: !270, line: 379, baseType: !479, size: 704, offset: 2496)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !480, line: 164, size: 704, elements: !481)
!480 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!481 = !{!482, !483, !493, !494, !495, !496, !497, !498, !502, !506, !507, !508, !509}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !479, file: !480, line: 166, baseType: !242, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !479, file: !480, line: 167, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !480, line: 157, size: 192, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !485, file: !480, line: 159, baseType: !209, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !485, file: !480, line: 160, baseType: !484, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !485, file: !480, line: 161, baseType: !490, size: 32, offset: 128)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 32, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 4)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !479, file: !480, line: 168, baseType: !209, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !479, file: !480, line: 169, baseType: !209, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !479, file: !480, line: 170, baseType: !209, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !479, file: !480, line: 171, baseType: !242, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !479, file: !480, line: 172, baseType: !72, size: 32, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !479, file: !480, line: 176, baseType: !499, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!484, !78, !242}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !479, file: !480, line: 177, baseType: !503, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !78, !484}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !479, file: !480, line: 178, baseType: !78, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !479, file: !480, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !479, file: !480, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !479, file: !480, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !292, file: !270, line: 383, baseType: !123, size: 8, offset: 3200)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !292, file: !270, line: 387, baseType: !123, size: 8, offset: 3208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !292, file: !270, line: 390, baseType: !513, size: 64, offset: 3264)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !292, file: !270, line: 391, baseType: !513, size: 64, offset: 3328)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !292, file: !270, line: 392, baseType: !123, size: 8, offset: 3392)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !292, file: !270, line: 395, baseType: !145, size: 64, offset: 3456)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !292, file: !270, line: 396, baseType: !519, size: 256, offset: 3520)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !270, line: 128, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !270, line: 129, size: 256, elements: !521)
!521 = !{!522, !524, !525, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !270, line: 131, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !520, file: !270, line: 131, baseType: !523, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !520, file: !270, line: 132, baseType: !145, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !520, file: !270, line: 132, baseType: !145, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !292, file: !270, line: 396, baseType: !523, size: 64, offset: 3776)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !292, file: !270, line: 397, baseType: !5, size: 32, offset: 3840)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !292, file: !270, line: 400, baseType: !5, size: 32, offset: 3872)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !292, file: !270, line: 403, baseType: !197, size: 64, offset: 3904)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !292, file: !270, line: 404, baseType: !5, size: 32, offset: 3968)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !292, file: !270, line: 408, baseType: !354, size: 192, offset: 4032)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !292, file: !270, line: 412, baseType: !354, size: 192, offset: 4224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !292, file: !270, line: 416, baseType: !354, size: 192, offset: 4416)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !292, file: !270, line: 420, baseType: !354, size: 192, offset: 4608)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !292, file: !270, line: 424, baseType: !354, size: 192, offset: 4800)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !292, file: !270, line: 427, baseType: !121, size: 64, offset: 4992)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !292, file: !270, line: 428, baseType: !121, size: 64, offset: 5056)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !292, file: !270, line: 431, baseType: !146, size: 192, offset: 5120)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !292, file: !270, line: 432, baseType: !146, size: 192, offset: 5312)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !292, file: !270, line: 435, baseType: !542, size: 64, offset: 5504)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !4, line: 685, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !292, file: !270, line: 439, baseType: !479, size: 704, offset: 5568)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !292, file: !270, line: 443, baseType: !479, size: 704, offset: 6272)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !292, file: !270, line: 447, baseType: !547, size: 64, offset: 6976)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !270, line: 447, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !292, file: !270, line: 450, baseType: !550, size: 1088, offset: 7040)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !4, line: 472, size: 1088, elements: !551)
!551 = !{!552, !556, !562, !566, !570, !574, !575, !582, !586, !590, !594, !600, !604, !621, !622, !623, !627}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !550, file: !4, line: 475, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !290, !445, !72}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !550, file: !4, line: 481, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !290, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !550, file: !4, line: 483, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !290, !275}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !550, file: !4, line: 484, baseType: !567, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !290, !5, !121, !275, !72, !448}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !550, file: !4, line: 486, baseType: !571, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !290, !5, !112}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !550, file: !4, line: 487, baseType: !571, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !550, file: !4, line: 488, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !290, !5, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !4, line: 35, baseType: !164)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !550, file: !4, line: 489, baseType: !583, size: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !290, !5}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !550, file: !4, line: 490, baseType: !587, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!72, !290, !275, !72}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !550, file: !4, line: 491, baseType: !591, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !290, !275, !72, !275}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !550, file: !4, line: 492, baseType: !595, size: 64, offset: 640)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !4, line: 469, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!275, !290, !275, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !550, file: !4, line: 496, baseType: !601, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!112, !290, !445}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !550, file: !4, line: 500, baseType: !605, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!123, !290, !72, !150, !5, !275, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !610, line: 52, baseType: !611)
!610 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !612, line: 32, baseType: !613)
!612 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !614)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 192, elements: !192)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !616)
!616 = !{!617, !618, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !615, file: !1, baseType: !5, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !615, file: !1, baseType: !5, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !615, file: !1, baseType: !78, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !615, file: !1, baseType: !78, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !550, file: !4, line: 506, baseType: !571, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !550, file: !4, line: 507, baseType: !571, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !550, file: !4, line: 510, baseType: !624, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !290}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !550, file: !4, line: 513, baseType: !628, size: 64, offset: 1024)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !290, !150, !112}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !292, file: !270, line: 453, baseType: !632, size: 64, offset: 8128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !118, line: 46, size: 1152, elements: !634)
!634 = !{!635, !636, !640, !646, !650, !651, !652, !654, !655, !656}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !633, file: !118, line: 49, baseType: !479, size: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !633, file: !118, line: 51, baseType: !637, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !118, line: 41, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !633, file: !118, line: 53, baseType: !641, size: 64, offset: 768)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!638, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !118, line: 40, baseType: !633)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !633, file: !118, line: 56, baseType: !647, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!78, !82}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !633, file: !118, line: 58, baseType: !5, size: 32, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !633, file: !118, line: 59, baseType: !5, size: 32, offset: 928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !633, file: !118, line: 62, baseType: !653, size: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !633, file: !118, line: 65, baseType: !5, size: 32, offset: 1024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !633, file: !118, line: 66, baseType: !5, size: 32, offset: 1056)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !633, file: !118, line: 69, baseType: !123, size: 8, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !292, file: !270, line: 456, baseType: !658, size: 64, offset: 8192)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !270, line: 42, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !292, file: !270, line: 456, baseType: !658, size: 64, offset: 8256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !292, file: !270, line: 459, baseType: !662, size: 1024, offset: 8320)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !4, line: 279, size: 1024, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !662, file: !4, line: 282, baseType: !5, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !662, file: !4, line: 285, baseType: !17, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !662, file: !4, line: 288, baseType: !123, size: 8, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !662, file: !4, line: 291, baseType: !123, size: 8, offset: 72)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !662, file: !4, line: 296, baseType: !123, size: 8, offset: 80)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !662, file: !4, line: 299, baseType: !123, size: 8, offset: 88)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !662, file: !4, line: 303, baseType: !123, size: 8, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !662, file: !4, line: 306, baseType: !123, size: 8, offset: 104)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !662, file: !4, line: 309, baseType: !123, size: 8, offset: 112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !662, file: !4, line: 312, baseType: !123, size: 8, offset: 120)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !662, file: !4, line: 315, baseType: !123, size: 8, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !662, file: !4, line: 318, baseType: !123, size: 8, offset: 136)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !662, file: !4, line: 321, baseType: !123, size: 8, offset: 144)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !662, file: !4, line: 324, baseType: !123, size: 8, offset: 152)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !662, file: !4, line: 328, baseType: !123, size: 8, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !662, file: !4, line: 331, baseType: !123, size: 8, offset: 168)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !662, file: !4, line: 334, baseType: !123, size: 8, offset: 176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !662, file: !4, line: 338, baseType: !123, size: 8, offset: 184)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !662, file: !4, line: 341, baseType: !123, size: 8, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !662, file: !4, line: 344, baseType: !123, size: 8, offset: 200)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !662, file: !4, line: 348, baseType: !123, size: 8, offset: 208)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !662, file: !4, line: 352, baseType: !123, size: 8, offset: 216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !662, file: !4, line: 356, baseType: !123, size: 8, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !662, file: !4, line: 360, baseType: !123, size: 8, offset: 232)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !662, file: !4, line: 363, baseType: !123, size: 8, offset: 240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !662, file: !4, line: 366, baseType: !123, size: 8, offset: 248)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !662, file: !4, line: 370, baseType: !123, size: 8, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !662, file: !4, line: 373, baseType: !123, size: 8, offset: 264)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !662, file: !4, line: 376, baseType: !123, size: 8, offset: 272)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !662, file: !4, line: 379, baseType: !123, size: 8, offset: 280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !662, file: !4, line: 382, baseType: !123, size: 8, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !662, file: !4, line: 385, baseType: !123, size: 8, offset: 296)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !662, file: !4, line: 389, baseType: !123, size: 8, offset: 304)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !662, file: !4, line: 392, baseType: !123, size: 8, offset: 312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !662, file: !4, line: 395, baseType: !123, size: 8, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !662, file: !4, line: 398, baseType: !123, size: 8, offset: 328)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !662, file: !4, line: 401, baseType: !123, size: 8, offset: 336)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !662, file: !4, line: 404, baseType: !275, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !662, file: !4, line: 407, baseType: !275, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !662, file: !4, line: 410, baseType: !275, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !662, file: !4, line: 414, baseType: !29, size: 32, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !662, file: !4, line: 417, baseType: !123, size: 8, offset: 608)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !662, file: !4, line: 420, baseType: !123, size: 8, offset: 616)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !662, file: !4, line: 441, baseType: !708, size: 64, offset: 640)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !662, file: !4, line: 423, size: 64, elements: !709)
!709 = !{!710, !711, !712, !713, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !708, file: !4, line: 426, baseType: !35, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !708, file: !4, line: 429, baseType: !123, size: 8, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !708, file: !4, line: 433, baseType: !123, size: 8, offset: 40)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !708, file: !4, line: 436, baseType: !123, size: 8, offset: 48)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !708, file: !4, line: 440, baseType: !123, size: 8, offset: 56)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !662, file: !4, line: 447, baseType: !82, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !662, file: !4, line: 447, baseType: !82, size: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !662, file: !4, line: 447, baseType: !82, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !662, file: !4, line: 447, baseType: !82, size: 64, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !662, file: !4, line: 450, baseType: !123, size: 8, offset: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !662, file: !4, line: 450, baseType: !123, size: 8, offset: 968)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !662, file: !4, line: 454, baseType: !123, size: 8, offset: 976)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !662, file: !4, line: 457, baseType: !123, size: 8, offset: 984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !662, file: !4, line: 460, baseType: !123, size: 8, offset: 992)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !292, file: !270, line: 463, baseType: !725, size: 256, offset: 9344)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !270, line: 227, size: 256, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !725, file: !270, line: 229, baseType: !112, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !725, file: !270, line: 230, baseType: !112, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !725, file: !270, line: 231, baseType: !112, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !725, file: !270, line: 232, baseType: !112, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !292, file: !270, line: 466, baseType: !123, size: 8, offset: 9600)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !292, file: !270, line: 475, baseType: !733, size: 256, offset: 9664)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !270, line: 469, size: 256, elements: !734)
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !733, file: !270, line: 471, baseType: !197, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !733, file: !270, line: 472, baseType: !197, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !733, file: !270, line: 473, baseType: !197, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !733, file: !270, line: 474, baseType: !150, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !292, file: !270, line: 478, baseType: !121, size: 64, offset: 9920)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !292, file: !270, line: 478, baseType: !121, size: 64, offset: 9984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !292, file: !270, line: 478, baseType: !121, size: 64, offset: 10048)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !292, file: !270, line: 482, baseType: !51, size: 64, offset: 10112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !292, file: !270, line: 485, baseType: !5, size: 32, offset: 10176)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !292, file: !270, line: 488, baseType: !745, size: 128, offset: 10240)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !4, line: 901, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 891, size: 128, elements: !747)
!747 = !{!748, !755, !756}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !746, file: !4, line: 894, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !4, line: 887, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 880, size: 128, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !751, file: !4, line: 883, baseType: !209, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !751, file: !4, line: 886, baseType: !150, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !746, file: !4, line: 897, baseType: !72, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !746, file: !4, line: 900, baseType: !72, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !292, file: !270, line: 491, baseType: !268, size: 64, offset: 10368)
!758 = !{}
!759 = !DILocalVariable(name: "r", arg: 1, scope: !287, file: !1, line: 200, type: !290)
!760 = !DILocation(line: 200, column: 29, scope: !287)
!761 = !DILocalVariable(name: "f", arg: 2, scope: !287, file: !1, line: 200, type: !214)
!762 = !DILocation(line: 200, column: 38, scope: !287)
!763 = !DILocation(line: 203, column: 19, scope: !287)
!764 = !DILocation(line: 203, column: 3, scope: !287)
!765 = !DILocation(line: 203, column: 6, scope: !287)
!766 = !DILocation(line: 203, column: 17, scope: !287)
!767 = !DILocation(line: 204, column: 32, scope: !287)
!768 = !DILocation(line: 204, column: 3, scope: !287)
!769 = !DILocation(line: 204, column: 6, scope: !287)
!770 = !DILocation(line: 204, column: 18, scope: !287)
!771 = !DILocation(line: 204, column: 30, scope: !287)
!772 = !DILocation(line: 206, column: 27, scope: !287)
!773 = !DILocation(line: 206, column: 43, scope: !287)
!774 = !DILocation(line: 206, column: 46, scope: !287)
!775 = !DILocation(line: 206, column: 3, scope: !287)
!776 = !DILocation(line: 209, column: 27, scope: !287)
!777 = !DILocation(line: 209, column: 44, scope: !287)
!778 = !DILocation(line: 209, column: 3, scope: !287)
!779 = !DILocation(line: 211, column: 3, scope: !287)
!780 = distinct !DISubprogram(name: "cpp_string_hash", scope: !1, file: !1, line: 177, type: !62, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !758)
!781 = !DILocalVariable(name: "a_p", arg: 1, scope: !780, file: !1, line: 177, type: !65)
!782 = !DILocation(line: 177, column: 30, scope: !780)
!783 = !DILocalVariable(name: "a", scope: !780, file: !1, line: 179, type: !211)
!784 = !DILocation(line: 179, column: 28, scope: !780)
!785 = !DILocation(line: 179, column: 60, scope: !780)
!786 = !DILocation(line: 179, column: 32, scope: !780)
!787 = !DILocation(line: 180, column: 19, scope: !780)
!788 = !DILocation(line: 180, column: 22, scope: !780)
!789 = !DILocation(line: 180, column: 28, scope: !780)
!790 = !DILocation(line: 180, column: 31, scope: !780)
!791 = !DILocation(line: 180, column: 10, scope: !780)
!792 = !DILocation(line: 180, column: 3, scope: !780)
!793 = distinct !DISubprogram(name: "cpp_string_eq", scope: !1, file: !1, line: 186, type: !70, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !758)
!794 = !DILocalVariable(name: "a_p", arg: 1, scope: !793, file: !1, line: 186, type: !65)
!795 = !DILocation(line: 186, column: 28, scope: !793)
!796 = !DILocalVariable(name: "b_p", arg: 2, scope: !793, file: !1, line: 186, type: !65)
!797 = !DILocation(line: 186, column: 45, scope: !793)
!798 = !DILocalVariable(name: "a", scope: !793, file: !1, line: 188, type: !211)
!799 = !DILocation(line: 188, column: 28, scope: !793)
!800 = !DILocation(line: 188, column: 60, scope: !793)
!801 = !DILocation(line: 188, column: 32, scope: !793)
!802 = !DILocalVariable(name: "b", scope: !793, file: !1, line: 189, type: !211)
!803 = !DILocation(line: 189, column: 28, scope: !793)
!804 = !DILocation(line: 189, column: 60, scope: !793)
!805 = !DILocation(line: 189, column: 32, scope: !793)
!806 = !DILocation(line: 190, column: 11, scope: !793)
!807 = !DILocation(line: 190, column: 14, scope: !793)
!808 = !DILocation(line: 190, column: 21, scope: !793)
!809 = !DILocation(line: 190, column: 24, scope: !793)
!810 = !DILocation(line: 190, column: 18, scope: !793)
!811 = !DILocation(line: 191, column: 4, scope: !793)
!812 = !DILocation(line: 191, column: 15, scope: !793)
!813 = !DILocation(line: 191, column: 18, scope: !793)
!814 = !DILocation(line: 191, column: 24, scope: !793)
!815 = !DILocation(line: 191, column: 27, scope: !793)
!816 = !DILocation(line: 191, column: 33, scope: !793)
!817 = !DILocation(line: 191, column: 36, scope: !793)
!818 = !DILocation(line: 191, column: 7, scope: !793)
!819 = !DILocation(line: 191, column: 41, scope: !793)
!820 = !DILocation(line: 0, scope: !793)
!821 = !DILocation(line: 190, column: 3, scope: !793)
!822 = distinct !DISubprogram(name: "save_idents", scope: !1, file: !1, line: 130, type: !823, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !758)
!823 = !DISubroutineType(types: !824)
!824 = !{!72, !290, !112, !78}
!825 = !DILocalVariable(name: "pfile", arg: 1, scope: !822, file: !1, line: 130, type: !290)
!826 = !DILocation(line: 130, column: 26, scope: !822)
!827 = !DILocalVariable(name: "hn", arg: 2, scope: !822, file: !1, line: 130, type: !112)
!828 = !DILocation(line: 130, column: 64, scope: !822)
!829 = !DILocalVariable(name: "ss_p", arg: 3, scope: !822, file: !1, line: 130, type: !78)
!830 = !DILocation(line: 130, column: 74, scope: !822)
!831 = !DILocalVariable(name: "ss", scope: !822, file: !1, line: 132, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!833 = !DILocation(line: 132, column: 32, scope: !822)
!834 = !DILocation(line: 132, column: 62, scope: !822)
!835 = !DILocation(line: 132, column: 37, scope: !822)
!836 = !DILocation(line: 134, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !822, file: !1, line: 134, column: 7)
!838 = !DILocation(line: 134, column: 11, scope: !837)
!839 = !DILocation(line: 134, column: 16, scope: !837)
!840 = !DILocation(line: 134, column: 7, scope: !822)
!841 = !DILocalVariable(name: "news", scope: !842, file: !1, line: 136, type: !164)
!842 = distinct !DILexicalBlock(scope: !837, file: !1, line: 135, column: 5)
!843 = !DILocation(line: 136, column: 25, scope: !842)
!844 = !DILocalVariable(name: "slot", scope: !842, file: !1, line: 137, type: !80)
!845 = !DILocation(line: 137, column: 14, scope: !842)
!846 = !DILocation(line: 139, column: 18, scope: !842)
!847 = !DILocation(line: 139, column: 12, scope: !842)
!848 = !DILocation(line: 139, column: 16, scope: !842)
!849 = !DILocation(line: 140, column: 18, scope: !842)
!850 = !DILocation(line: 140, column: 12, scope: !842)
!851 = !DILocation(line: 140, column: 16, scope: !842)
!852 = !DILocation(line: 141, column: 30, scope: !842)
!853 = !DILocation(line: 141, column: 34, scope: !842)
!854 = !DILocation(line: 141, column: 47, scope: !842)
!855 = !DILocation(line: 141, column: 14, scope: !842)
!856 = !DILocation(line: 141, column: 12, scope: !842)
!857 = !DILocation(line: 142, column: 12, scope: !858)
!858 = distinct !DILexicalBlock(scope: !842, file: !1, line: 142, column: 11)
!859 = !DILocation(line: 142, column: 11, scope: !858)
!860 = !DILocation(line: 142, column: 17, scope: !858)
!861 = !DILocation(line: 142, column: 11, scope: !842)
!862 = !DILocalVariable(name: "sp", scope: !863, file: !1, line: 144, type: !213)
!863 = distinct !DILexicalBlock(scope: !858, file: !1, line: 143, column: 2)
!864 = !DILocation(line: 144, column: 23, scope: !863)
!865 = !DILocalVariable(name: "text", scope: !863, file: !1, line: 145, type: !197)
!866 = !DILocation(line: 145, column: 19, scope: !863)
!867 = !DILocation(line: 147, column: 9, scope: !863)
!868 = !DILocation(line: 147, column: 7, scope: !863)
!869 = !DILocation(line: 148, column: 12, scope: !863)
!870 = !DILocation(line: 148, column: 5, scope: !863)
!871 = !DILocation(line: 148, column: 10, scope: !863)
!872 = !DILocation(line: 150, column: 14, scope: !863)
!873 = !DILocation(line: 150, column: 4, scope: !863)
!874 = !DILocation(line: 150, column: 8, scope: !863)
!875 = !DILocation(line: 150, column: 12, scope: !863)
!876 = !DILocation(line: 151, column: 22, scope: !863)
!877 = !DILocation(line: 151, column: 20, scope: !863)
!878 = !DILocation(line: 151, column: 4, scope: !863)
!879 = !DILocation(line: 151, column: 8, scope: !863)
!880 = !DILocation(line: 151, column: 13, scope: !863)
!881 = !DILocation(line: 152, column: 12, scope: !863)
!882 = !DILocation(line: 152, column: 18, scope: !863)
!883 = !DILocation(line: 152, column: 34, scope: !863)
!884 = !DILocation(line: 152, column: 4, scope: !863)
!885 = !DILocation(line: 153, column: 2, scope: !863)
!886 = !DILocation(line: 154, column: 5, scope: !842)
!887 = !DILocation(line: 156, column: 3, scope: !822)
!888 = distinct !DISubprogram(name: "write_macdef", scope: !1, file: !1, line: 56, type: !823, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !758)
!889 = !DILocalVariable(name: "pfile", arg: 1, scope: !888, file: !1, line: 56, type: !290)
!890 = !DILocation(line: 56, column: 27, scope: !888)
!891 = !DILocalVariable(name: "hn", arg: 2, scope: !888, file: !1, line: 56, type: !112)
!892 = !DILocation(line: 56, column: 48, scope: !888)
!893 = !DILocalVariable(name: "file_p", arg: 3, scope: !888, file: !1, line: 56, type: !78)
!894 = !DILocation(line: 56, column: 58, scope: !888)
!895 = !DILocalVariable(name: "f", scope: !888, file: !1, line: 58, type: !214)
!896 = !DILocation(line: 58, column: 9, scope: !888)
!897 = !DILocation(line: 58, column: 22, scope: !888)
!898 = !DILocation(line: 58, column: 13, scope: !888)
!899 = !DILocation(line: 59, column: 11, scope: !888)
!900 = !DILocation(line: 59, column: 15, scope: !888)
!901 = !DILocation(line: 59, column: 3, scope: !888)
!902 = !DILocation(line: 62, column: 14, scope: !903)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 62, column: 11)
!904 = distinct !DILexicalBlock(scope: !888, file: !1, line: 60, column: 5)
!905 = !DILocation(line: 62, column: 18, scope: !903)
!906 = !DILocation(line: 62, column: 24, scope: !903)
!907 = !DILocation(line: 62, column: 11, scope: !904)
!908 = !DILocation(line: 63, column: 2, scope: !903)
!909 = !DILocation(line: 62, column: 39, scope: !903)
!910 = !DILocation(line: 66, column: 12, scope: !911)
!911 = distinct !DILexicalBlock(scope: !904, file: !1, line: 66, column: 11)
!912 = !DILocation(line: 66, column: 16, scope: !911)
!913 = !DILocation(line: 66, column: 22, scope: !911)
!914 = !DILocation(line: 66, column: 11, scope: !904)
!915 = !DILocation(line: 67, column: 2, scope: !911)
!916 = !DILocalVariable(name: "s", scope: !917, file: !1, line: 70, type: !918)
!917 = distinct !DILexicalBlock(scope: !904, file: !1, line: 69, column: 7)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macrodef_struct", file: !1, line: 45, size: 64, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "definition_length", scope: !918, file: !1, line: 47, baseType: !5, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !918, file: !1, line: 48, baseType: !154, size: 16, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !1, line: 49, baseType: !154, size: 16, offset: 48)
!923 = !DILocation(line: 70, column: 25, scope: !917)
!924 = !DILocalVariable(name: "defn", scope: !917, file: !1, line: 71, type: !121)
!925 = !DILocation(line: 71, column: 23, scope: !917)
!926 = !DILocation(line: 73, column: 18, scope: !917)
!927 = !DILocation(line: 73, column: 4, scope: !917)
!928 = !DILocation(line: 73, column: 16, scope: !917)
!929 = !DILocation(line: 74, column: 12, scope: !917)
!930 = !DILocation(line: 74, column: 16, scope: !917)
!931 = !DILocation(line: 74, column: 22, scope: !917)
!932 = !DILocation(line: 74, column: 4, scope: !917)
!933 = !DILocation(line: 74, column: 10, scope: !917)
!934 = !DILocation(line: 76, column: 6, scope: !935)
!935 = distinct !DILexicalBlock(scope: !917, file: !1, line: 76, column: 6)
!936 = !DILocation(line: 76, column: 10, scope: !935)
!937 = !DILocation(line: 76, column: 15, scope: !935)
!938 = !DILocation(line: 76, column: 6, scope: !917)
!939 = !DILocation(line: 78, column: 35, scope: !940)
!940 = distinct !DILexicalBlock(scope: !935, file: !1, line: 77, column: 4)
!941 = !DILocation(line: 78, column: 42, scope: !940)
!942 = !DILocation(line: 78, column: 13, scope: !940)
!943 = !DILocation(line: 78, column: 11, scope: !940)
!944 = !DILocation(line: 79, column: 37, scope: !940)
!945 = !DILocation(line: 79, column: 28, scope: !940)
!946 = !DILocation(line: 79, column: 8, scope: !940)
!947 = !DILocation(line: 79, column: 26, scope: !940)
!948 = !DILocation(line: 80, column: 4, scope: !940)
!949 = !DILocation(line: 83, column: 13, scope: !950)
!950 = distinct !DILexicalBlock(scope: !935, file: !1, line: 82, column: 4)
!951 = !DILocation(line: 83, column: 11, scope: !950)
!952 = !DILocation(line: 84, column: 30, scope: !950)
!953 = !DILocation(line: 84, column: 28, scope: !950)
!954 = !DILocation(line: 84, column: 8, scope: !950)
!955 = !DILocation(line: 84, column: 26, scope: !950)
!956 = !DILocation(line: 87, column: 14, scope: !957)
!957 = distinct !DILexicalBlock(scope: !917, file: !1, line: 87, column: 6)
!958 = !DILocation(line: 87, column: 33, scope: !957)
!959 = !DILocation(line: 87, column: 6, scope: !957)
!960 = !DILocation(line: 87, column: 36, scope: !957)
!961 = !DILocation(line: 88, column: 6, scope: !957)
!962 = !DILocation(line: 88, column: 17, scope: !957)
!963 = !DILocation(line: 88, column: 28, scope: !957)
!964 = !DILocation(line: 88, column: 26, scope: !957)
!965 = !DILocation(line: 88, column: 47, scope: !957)
!966 = !DILocation(line: 88, column: 9, scope: !957)
!967 = !DILocation(line: 88, column: 55, scope: !957)
!968 = !DILocation(line: 88, column: 53, scope: !957)
!969 = !DILocation(line: 88, column: 50, scope: !957)
!970 = !DILocation(line: 87, column: 6, scope: !917)
!971 = !DILocation(line: 90, column: 17, scope: !972)
!972 = distinct !DILexicalBlock(scope: !957, file: !1, line: 89, column: 4)
!973 = !DILocation(line: 90, column: 6, scope: !972)
!974 = !DILocation(line: 92, column: 6, scope: !972)
!975 = !DILocation(line: 95, column: 7, scope: !904)
!976 = !DILocation(line: 99, column: 7, scope: !904)
!977 = !DILocation(line: 102, column: 7, scope: !904)
!978 = !DILocation(line: 104, column: 1, scope: !888)
!979 = distinct !DISubprogram(name: "cpp_write_pch_deps", scope: !1, file: !1, line: 307, type: !288, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !758)
!980 = !DILocalVariable(name: "r", arg: 1, scope: !979, file: !1, line: 307, type: !290)
!981 = !DILocation(line: 307, column: 33, scope: !979)
!982 = !DILocalVariable(name: "f", arg: 2, scope: !979, file: !1, line: 307, type: !214)
!983 = !DILocation(line: 307, column: 42, scope: !979)
!984 = !DILocalVariable(name: "z", scope: !979, file: !1, line: 309, type: !918)
!985 = !DILocation(line: 309, column: 26, scope: !979)
!986 = !DILocalVariable(name: "ss", scope: !979, file: !1, line: 310, type: !832)
