; ModuleID = 'tree-ssa-loop-ivcanon.c'
source_filename = "tree-ssa-loop-ivcanon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }

!693 = !DIEnumerator(name: "TI_LLFRACT_TYPE", value: 68, isUnsigned: true)
!694 = !DIEnumerator(name: "TI_USFRACT_TYPE", value: 69, isUnsigned: true)
!695 = !DIEnumerator(name: "TI_UFRACT_TYPE", value: 70, isUnsigned: true)
!696 = !DIEnumerator(name: "TI_ULFRACT_TYPE", value: 71, isUnsigned: true)
!697 = !DIEnumerator(name: "TI_ULLFRACT_TYPE", value: 72, isUnsigned: true)
!698 = !DIEnumerator(name: "TI_SAT_SACCUM_TYPE", value: 73, isUnsigned: true)
!699 = !DIEnumerator(name: "TI_SAT_ACCUM_TYPE", value: 74, isUnsigned: true)
!700 = !DIEnumerator(name: "TI_SAT_LACCUM_TYPE", value: 75, isUnsigned: true)
!701 = !DIEnumerator(name: "TI_SAT_LLACCUM_TYPE", value: 76, isUnsigned: true)
!702 = !DIEnumerator(name: "TI_SAT_USACCUM_TYPE", value: 77, isUnsigned: true)
!703 = !DIEnumerator(name: "TI_SAT_UACCUM_TYPE", value: 78, isUnsigned: true)
!704 = !DIEnumerator(name: "TI_SAT_ULACCUM_TYPE", value: 79, isUnsigned: true)
!705 = !DIEnumerator(name: "TI_SAT_ULLACCUM_TYPE", value: 80, isUnsigned: true)
!706 = !DIEnumerator(name: "TI_SACCUM_TYPE", value: 81, isUnsigned: true)
!707 = !DIEnumerator(name: "TI_ACCUM_TYPE", value: 82, isUnsigned: true)
!708 = !DIEnumerator(name: "TI_LACCUM_TYPE", value: 83, isUnsigned: true)
!709 = !DIEnumerator(name: "TI_LLACCUM_TYPE", value: 84, isUnsigned: true)
!710 = !DIEnumerator(name: "TI_USACCUM_TYPE", value: 85, isUnsigned: true)
!711 = !DIEnumerator(name: "TI_UACCUM_TYPE", value: 86, isUnsigned: true)
!712 = !DIEnumerator(name: "TI_ULACCUM_TYPE", value: 87, isUnsigned: true)
!713 = !DIEnumerator(name: "TI_ULLACCUM_TYPE", value: 88, isUnsigned: true)
!714 = !DIEnumerator(name: "TI_QQ_TYPE", value: 89, isUnsigned: true)
!715 = !DIEnumerator(name: "TI_HQ_TYPE", value: 90, isUnsigned: true)
!716 = !DIEnumerator(name: "TI_SQ_TYPE", value: 91, isUnsigned: true)
!717 = !DIEnumerator(name: "TI_DQ_TYPE", value: 92, isUnsigned: true)
!718 = !DIEnumerator(name: "TI_TQ_TYPE", value: 93, isUnsigned: true)
!719 = !DIEnumerator(name: "TI_UQQ_TYPE", value: 94, isUnsigned: true)
!720 = !DIEnumerator(name: "TI_UHQ_TYPE", value: 95, isUnsigned: true)
!721 = !DIEnumerator(name: "TI_USQ_TYPE", value: 96, isUnsigned: true)
!722 = !DIEnumerator(name: "TI_UDQ_TYPE", value: 97, isUnsigned: true)
!723 = !DIEnumerator(name: "TI_UTQ_TYPE", value: 98, isUnsigned: true)
!724 = !DIEnumerator(name: "TI_SAT_QQ_TYPE", value: 99, isUnsigned: true)
!725 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!726 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!727 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!728 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!729 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!730 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!731 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!732 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!733 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!734 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!735 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!736 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!737 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!738 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!739 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!740 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!741 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!742 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!743 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!744 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!745 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!746 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!747 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!748 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!749 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!750 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!751 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!752 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!753 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!754 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!755 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!756 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!757 = !{!758, !759, !760, !775, !181, !5, !820, !2163, !844, !1464, !1105, !578, !899, !897, !798, !839}
!758 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !762, line: 32, baseType: !763)
!762 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !762, line: 32, size: 96, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !763, file: !762, line: 32, baseType: !766, size: 96)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !762, line: 31, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !762, line: 31, size: 96, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !767, file: !762, line: 31, baseType: !5, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !767, file: !762, line: 31, baseType: !5, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !767, file: !762, line: 31, baseType: !772, size: 32, offset: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 32, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 1)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !778)
!778 = !{!779, !780, !781, !2127, !2128, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2153, !2161, !2162}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !777, file: !376, line: 102, baseType: !758, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !777, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !777, file: !376, line: 108, baseType: !782, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !784)
!784 = !{!785, !2094, !2095, !2096, !2097, !2101, !2102, !2103, !2121, !2122, !2123, !2124, !2125, !2126}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !783, file: !133, line: 219, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !788, file: !133, line: 151, baseType: !791, size: 128)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !792, file: !133, line: 150, baseType: !5, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !792, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !792, file: !133, line: 150, baseType: !797, size: 64, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 64, elements: !773)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !799, line: 108, baseType: !800)
!799 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !802)
!802 = !{!803, !804, !805, !2086, !2087, !2088, !2089, !2090, !2091, !2092}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !801, file: !133, line: 124, baseType: !782, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !801, file: !133, line: 125, baseType: !782, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !801, file: !133, line: 131, baseType: !806, size: 64, offset: 128)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !807)
!807 = !{!808, !2085}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !806, file: !133, line: 129, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !799, line: 66, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !540, line: 143, size: 192, elements: !812)
!812 = !{!813, !2083, !2084}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !811, file: !540, line: 145, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !799, line: 69, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !540, line: 136, size: 192, elements: !817)
!817 = !{!818, !2081, !2082}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !816, file: !540, line: 137, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !799, line: 58, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !540, line: 737, size: 768, elements: !822)
!822 = !{!823, !1928, !1938, !1944, !1949, !1954, !1961, !1967, !1973, !1978, !1992, !1997, !2003, !2008, !2018, !2023, !2039, !2046, !2053, !2059, !2064, !2070, !2076}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !821, file: !540, line: 738, baseType: !824, size: 256)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !540, line: 271, size: 256, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !841, !842, !843}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !824, file: !540, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !824, file: !540, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !824, file: !540, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !824, file: !540, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !824, file: !540, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !824, file: !540, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !824, file: !540, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !824, file: !540, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !824, file: !540, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !824, file: !540, line: 312, baseType: !5, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !824, file: !540, line: 316, baseType: !837, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !838, line: 58, baseType: !839)
!838 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !840, line: 44, baseType: !5)
!840 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!841 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !824, file: !540, line: 319, baseType: !5, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !824, file: !540, line: 323, baseType: !782, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !824, file: !540, line: 327, baseType: !844, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !799, line: 56, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !847)
!847 = !{!848, !881, !887, !900, !919, !930, !935, !943, !949, !963, !971, !1009, !1220, !1248, !1265, !1266, !1271, !1280, !1286, !1291, !1295, !1299, !1579, !1626, !1632, !1638, !1645, !1658, !1672, !1689, !1701, !1723, !1738, !1910}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !846, file: !149, line: 3372, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !849, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !849, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !849, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !849, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !849, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !849, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !849, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !849, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !849, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !849, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !849, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !849, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !849, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !849, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !849, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !849, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !849, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !849, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !849, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !849, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !849, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !849, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !849, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !849, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !849, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !849, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !849, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !849, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !849, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !849, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !149, line: 3373, baseType: !882, size: 192)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !882, file: !149, line: 403, baseType: !849, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !882, file: !149, line: 404, baseType: !844, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !149, line: 405, baseType: !844, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !846, file: !149, line: 3374, baseType: !888, size: 320)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !888, file: !149, line: 1385, baseType: !882, size: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !888, file: !149, line: 1386, baseType: !892, size: 128, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !893, line: 58, baseType: !894)
!893 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !893, line: 54, size: 128, elements: !895)
!895 = !{!896, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !894, file: !893, line: 56, baseType: !897, size: 64)
!897 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !894, file: !893, line: 57, baseType: !899, size: 64, offset: 64)
!899 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !846, file: !149, line: 3375, baseType: !901, size: 256)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !149, line: 1398, baseType: !882, size: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !901, file: !149, line: 1399, baseType: !905, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !907, line: 52, size: 256, elements: !908)
!907 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!908 = !{!909, !910, !911, !912, !913, !914, !915}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !906, file: !907, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !906, file: !907, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !906, file: !907, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !906, file: !907, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !906, file: !907, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !906, file: !907, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !906, file: !907, line: 62, baseType: !916, size: 192, offset: 64)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 192, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 3)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !846, file: !149, line: 3376, baseType: !920, size: 256)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !149, line: 1409, baseType: !882, size: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !920, file: !149, line: 1410, baseType: !924, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !926, line: 27, size: 192, elements: !927)
!926 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !925, file: !926, line: 29, baseType: !892, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !925, file: !926, line: 30, baseType: !3, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !846, file: !149, line: 3377, baseType: !931, size: 256)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !149, line: 1438, baseType: !882, size: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !931, file: !149, line: 1439, baseType: !844, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !846, file: !149, line: 3378, baseType: !936, size: 256)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !149, line: 1419, baseType: !882, size: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !936, file: !149, line: 1420, baseType: !758, size: 32, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !936, file: !149, line: 1421, baseType: !941, size: 8, offset: 224)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 8, elements: !773)
!942 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !846, file: !149, line: 3379, baseType: !944, size: 320)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !149, line: 1429, baseType: !882, size: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !944, file: !149, line: 1430, baseType: !844, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !944, file: !149, line: 1431, baseType: !844, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !846, file: !149, line: 3380, baseType: !950, size: 320)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !149, line: 1461, baseType: !882, size: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !149, line: 1462, baseType: !954, size: 128, offset: 192)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !955, line: 31, size: 128, elements: !956)
!955 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!956 = !{!957, !961, !962}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !954, file: !955, line: 32, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !954, file: !955, line: 33, baseType: !5, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !954, file: !955, line: 34, baseType: !5, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !846, file: !149, line: 3381, baseType: !964, size: 384)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !149, line: 2508, baseType: !882, size: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !964, file: !149, line: 2509, baseType: !837, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !964, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !964, file: !149, line: 2511, baseType: !844, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !964, file: !149, line: 2512, baseType: !844, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !846, file: !149, line: 3382, baseType: !972, size: 896)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !149, line: 2653, baseType: !964, size: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !972, file: !149, line: 2654, baseType: !844, size: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !972, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !972, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !972, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !972, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !972, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !972, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !972, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !972, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !972, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !972, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !972, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !972, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !972, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !972, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !972, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !972, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !972, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !972, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !972, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !972, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !972, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !972, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !972, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !972, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !972, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !972, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !972, file: !149, line: 2705, baseType: !844, size: 64, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !972, file: !149, line: 2706, baseType: !844, size: 64, offset: 640)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !972, file: !149, line: 2707, baseType: !844, size: 64, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !972, file: !149, line: 2708, baseType: !844, size: 64, offset: 768)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !972, file: !149, line: 2711, baseType: !1007, size: 64, offset: 832)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !846, file: !149, line: 3383, baseType: !1010, size: 960)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !149, line: 2757, baseType: !972, size: 896)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1010, file: !149, line: 2758, baseType: !1014, size: 64, offset: 896)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !799, line: 50, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1017, line: 240, size: 384, elements: !1018)
!1017 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1016, file: !1017, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1016, file: !1017, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1016, file: !1017, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1016, file: !1017, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1016, file: !1017, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1016, file: !1017, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1016, file: !1017, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1016, file: !1017, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1016, file: !1017, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1016, file: !1017, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1016, file: !1017, line: 321, baseType: !1030, size: 320, offset: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1017, line: 315, size: 320, elements: !1031)
!1031 = !{!1032, !1153, !1155, !1218, !1219}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1030, file: !1017, line: 316, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 64, elements: !773)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1017, line: 183, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1017, line: 166, size: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1042, !1043, !1051, !1052, !1064, !1067, !1128, !1129, !1130, !1143, !1150}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1035, file: !1017, line: 168, baseType: !758, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1035, file: !1017, line: 169, baseType: !5, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1035, file: !1017, line: 170, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1035, file: !1017, line: 171, baseType: !1014, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1035, file: !1017, line: 172, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !799, line: 53, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1017, line: 359, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1046, file: !1017, line: 360, baseType: !758, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1046, file: !1017, line: 361, baseType: !1050, size: 64, offset: 64)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 64, elements: !773)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1035, file: !1017, line: 173, baseType: !3, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1035, file: !1017, line: 174, baseType: !1053, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1017, line: 133, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 115, size: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1054, file: !1017, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1054, file: !1017, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1054, file: !1017, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1054, file: !1017, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1054, file: !1017, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1054, file: !1017, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1054, file: !1017, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1054, file: !1017, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1035, file: !1017, line: 175, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1017, line: 175, flags: DIFlagFwdDecl)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1035, file: !1017, line: 176, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1070, line: 75, size: 256, elements: !1071)
!1070 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1071 = !{!1072, !1086, !1087, !1088}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1069, file: !1070, line: 76, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1070, line: 68, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1070, line: 63, size: 320, elements: !1076)
!1076 = !{!1077, !1079, !1080, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1075, file: !1070, line: 64, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1075, file: !1070, line: 65, baseType: !1078, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1075, file: !1070, line: 66, baseType: !5, size: 32, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1075, file: !1070, line: 67, baseType: !1082, size: 128, offset: 192)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 128, elements: !1084)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1070, line: 29, baseType: !897)
!1084 = !{!1085}
!1085 = !DISubrange(count: 2)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1069, file: !1070, line: 77, baseType: !1073, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1069, file: !1070, line: 78, baseType: !5, size: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1069, file: !1070, line: 79, baseType: !1089, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1070, line: 49, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1070, line: 45, size: 832, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1091, file: !1070, line: 46, baseType: !1078, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1091, file: !1070, line: 47, baseType: !1068, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1091, file: !1070, line: 48, baseType: !1096, size: 704, offset: 128)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1097, line: 164, size: 704, elements: !1098)
!1097 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1098 = !{!1099, !1100, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1124, !1125, !1126, !1127}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1096, file: !1097, line: 166, baseType: !899, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1096, file: !1097, line: 167, baseType: !1101, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1097, line: 157, size: 192, elements: !1103)
!1103 = !{!1104, !1106, !1107}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1102, file: !1097, line: 159, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1102, file: !1097, line: 160, baseType: !1101, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1102, file: !1097, line: 161, baseType: !1108, size: 32, offset: 128)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 32, elements: !1109)
!1109 = !{!1110}
!1110 = !DISubrange(count: 4)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1096, file: !1097, line: 168, baseType: !1105, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1096, file: !1097, line: 169, baseType: !1105, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1096, file: !1097, line: 170, baseType: !1105, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1096, file: !1097, line: 171, baseType: !899, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1096, file: !1097, line: 172, baseType: !758, size: 32, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1096, file: !1097, line: 176, baseType: !1117, size: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!1101, !759, !899}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1096, file: !1097, line: 177, baseType: !1121, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{null, !759, !1101}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1096, file: !1097, line: 178, baseType: !759, size: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1096, file: !1097, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1096, file: !1097, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1096, file: !1097, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1035, file: !1017, line: 177, baseType: !844, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1035, file: !1017, line: 178, baseType: !782, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1035, file: !1017, line: 179, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1017, line: 150, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1017, line: 142, size: 320, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1141, !1142}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1133, file: !1017, line: 144, baseType: !844, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1133, file: !1017, line: 145, baseType: !1014, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !1017, line: 146, baseType: !1014, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1133, file: !1017, line: 147, baseType: !1139, size: 32, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1140, line: 31, baseType: !758)
!1140 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1133, file: !1017, line: 148, baseType: !5, size: 32, offset: 224)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1133, file: !1017, line: 149, baseType: !960, size: 8, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1035, file: !1017, line: 180, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1017, line: 162, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1017, line: 159, size: 128, elements: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1146, file: !1017, line: 160, baseType: !844, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1146, file: !1017, line: 161, baseType: !899, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1035, file: !1017, line: 181, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1017, line: 181, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1030, file: !1017, line: 317, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 64, elements: !773)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1030, file: !1017, line: 318, baseType: !1156, size: 320)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1017, line: 188, size: 320, elements: !1157)
!1157 = !{!1158, !1160, !1217}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1156, file: !1017, line: 190, baseType: !1159, size: 192)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 192, elements: !917)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1156, file: !1017, line: 193, baseType: !1161, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1017, line: 206, size: 320, elements: !1163)
!1163 = !{!1164, !1202, !1203, !1204, !1216}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1162, file: !1017, line: 208, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !799, line: 62, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1168, line: 538, size: 256, elements: !1169)
!1168 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1169 = !{!1170, !1174, !1180, !1193}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !1168, line: 539, baseType: !1171, size: 32)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1168, line: 482, size: 32, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !1168, line: 484, baseType: !5, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1167, file: !1168, line: 540, baseType: !1175, size: 192)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1168, line: 488, size: 192, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1175, file: !1168, line: 489, baseType: !1171, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1175, file: !1168, line: 492, baseType: !1040, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1175, file: !1168, line: 496, baseType: !844, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1167, file: !1168, line: 541, baseType: !1181, size: 256)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1168, line: 504, size: 256, elements: !1182)
!1182 = !{!1183, !1184, !1191, !1192}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !1168, line: 505, baseType: !1171, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1181, file: !1168, line: 509, baseType: !1185, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1168, line: 501, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !1189}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1181, file: !1168, line: 510, baseType: !1189, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1181, file: !1168, line: 513, baseType: !1165, size: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1167, file: !1168, line: 542, baseType: !1194, size: 128)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1168, line: 530, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1194, file: !1168, line: 531, baseType: !1171, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1194, file: !1168, line: 534, baseType: !1198, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1168, line: 525, baseType: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!960, !844, !1040, !897, !897}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1162, file: !1017, line: 211, baseType: !5, size: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !1017, line: 214, baseType: !899, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1162, file: !1017, line: 224, baseType: !1205, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1017, line: 202, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1017, line: 202, size: 128, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1207, file: !1017, line: 202, baseType: !1210, size: 128)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1017, line: 200, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1017, line: 200, size: 128, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1211, file: !1017, line: 200, baseType: !5, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1211, file: !1017, line: 200, baseType: !5, size: 32, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1211, file: !1017, line: 200, baseType: !1050, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1162, file: !1017, line: 234, baseType: !1205, size: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1156, file: !1017, line: 197, baseType: !899, size: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1030, file: !1017, line: 319, baseType: !906, size: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1030, file: !1017, line: 320, baseType: !925, size: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !846, file: !149, line: 3384, baseType: !1221, size: 1472)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !1222)
!1222 = !{!1223, !1244, !1245, !1246, !1247}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !149, line: 3115, baseType: !1224, size: 1216)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1224, file: !149, line: 2985, baseType: !1010, size: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1224, file: !149, line: 2986, baseType: !844, size: 64, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1224, file: !149, line: 2987, baseType: !844, size: 64, offset: 1024)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1224, file: !149, line: 2988, baseType: !844, size: 64, offset: 1088)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1224, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1224, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1224, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1224, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1224, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1224, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1224, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1224, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1224, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1224, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1224, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1224, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1224, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1224, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1221, file: !149, line: 3117, baseType: !844, size: 64, offset: 1216)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1221, file: !149, line: 3119, baseType: !844, size: 64, offset: 1280)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1221, file: !149, line: 3121, baseType: !844, size: 64, offset: 1344)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1221, file: !149, line: 3123, baseType: !844, size: 64, offset: 1408)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !846, file: !149, line: 3385, baseType: !1249, size: 1088)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !1250)
!1250 = !{!1251, !1252, !1253}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !149, line: 2875, baseType: !1010, size: 960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1249, file: !149, line: 2876, baseType: !1014, size: 64, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1249, file: !149, line: 2877, baseType: !1254, size: 64, offset: 1024)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1256, line: 172, size: 128, elements: !1257)
!1256 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1255, file: !1256, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1255, file: !1256, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1255, file: !1256, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1255, file: !1256, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1255, file: !1256, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1255, file: !1256, line: 195, baseType: !5, size: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1255, file: !1256, line: 199, baseType: !844, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !846, file: !149, line: 3386, baseType: !1224, size: 1216)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !846, file: !149, line: 3387, baseType: !1267, size: 1280)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1267, file: !149, line: 3094, baseType: !1224, size: 1216)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1267, file: !149, line: 3095, baseType: !1254, size: 64, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !846, file: !149, line: 3388, baseType: !1272, size: 1216)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1272, file: !149, line: 2825, baseType: !972, size: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1272, file: !149, line: 2827, baseType: !844, size: 64, offset: 896)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1272, file: !149, line: 2828, baseType: !844, size: 64, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1272, file: !149, line: 2829, baseType: !844, size: 64, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1272, file: !149, line: 2830, baseType: !844, size: 64, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1272, file: !149, line: 2831, baseType: !844, size: 64, offset: 1152)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !846, file: !149, line: 3389, baseType: !1281, size: 1024)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1281, file: !149, line: 2851, baseType: !1010, size: 960)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1281, file: !149, line: 2852, baseType: !758, size: 32, offset: 960)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1281, file: !149, line: 2853, baseType: !758, size: 32, offset: 992)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !846, file: !149, line: 3390, baseType: !1287, size: 1024)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !1288)
!1288 = !{!1289, !1290}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !149, line: 2858, baseType: !1010, size: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1287, file: !149, line: 2859, baseType: !1254, size: 64, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !846, file: !149, line: 3391, baseType: !1292, size: 960)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !1293)
!1293 = !{!1294}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1292, file: !149, line: 2863, baseType: !1010, size: 960)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !846, file: !149, line: 3392, baseType: !1296, size: 1472)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !1297)
!1297 = !{!1298}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1296, file: !149, line: 3305, baseType: !1221, size: 1472)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !846, file: !149, line: 3393, baseType: !1300, size: 1792)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !1301)
!1301 = !{!1302, !1303, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !149, line: 3249, baseType: !1221, size: 1472)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1300, file: !149, line: 3251, baseType: !1304, size: 64, offset: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1306, line: 463, size: 1152, elements: !1307)
!1306 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1307 = !{!1308, !1311, !1342, !1343, !1482, !1502, !1503, !1504, !1505, !1506, !1507, !1531, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1305, file: !1306, line: 464, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1306, line: 464, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1305, file: !1306, line: 467, baseType: !1312, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !1314)
!1314 = !{!1315, !1317, !1318, !1331, !1332, !1333, !1334, !1335, !1336, !1338, !1340, !1341}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1313, file: !133, line: 377, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !799, line: 111, baseType: !782)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1313, file: !133, line: 378, baseType: !1316, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1313, file: !133, line: 381, baseType: !1319, size: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1322)
!1322 = !{!1323}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1321, file: !133, line: 282, baseType: !1324, size: 128)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1325, file: !133, line: 281, baseType: !5, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1325, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1325, file: !133, line: 281, baseType: !1330, size: 64, offset: 64)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1316, size: 64, elements: !773)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1313, file: !133, line: 384, baseType: !758, size: 32, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1313, file: !133, line: 387, baseType: !758, size: 32, offset: 224)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1313, file: !133, line: 390, baseType: !758, size: 32, offset: 256)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1313, file: !133, line: 394, baseType: !1319, size: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1313, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1313, file: !133, line: 399, baseType: !1337, size: 64, offset: 416)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !1084)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1313, file: !133, line: 402, baseType: !1339, size: 64, offset: 480)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1084)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1313, file: !133, line: 406, baseType: !758, size: 32, offset: 544)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1313, file: !133, line: 409, baseType: !758, size: 32, offset: 576)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1305, file: !1306, line: 470, baseType: !810, size: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1305, file: !1306, line: 473, baseType: !1344, size: 64, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1256, line: 39, size: 1152, elements: !1346)
!1346 = !{!1347, !1397, !1410, !1423, !1424, !1436, !1437, !1441, !1442, !1443, !1444, !1445}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1345, file: !1256, line: 41, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1349, line: 144, baseType: !1350)
!1349 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1349, line: 100, size: 896, elements: !1352)
!1352 = !{!1353, !1359, !1364, !1369, !1371, !1374, !1375, !1376, !1377, !1378, !1383, !1385, !1386, !1391, !1396}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1351, file: !1349, line: 102, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1349, line: 52, baseType: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!1358, !1189}
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1349, line: 47, baseType: !5)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1351, file: !1349, line: 105, baseType: !1360, size: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1349, line: 59, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!758, !1189, !1189}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1351, file: !1349, line: 108, baseType: !1365, size: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1349, line: 63, baseType: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{null, !759}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1351, file: !1349, line: 111, baseType: !1370, size: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1351, file: !1349, line: 114, baseType: !1372, size: 64, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1373, line: 46, baseType: !897)
!1373 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1351, file: !1349, line: 117, baseType: !1372, size: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1351, file: !1349, line: 120, baseType: !1372, size: 64, offset: 384)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1351, file: !1349, line: 124, baseType: !5, size: 32, offset: 448)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1351, file: !1349, line: 128, baseType: !5, size: 32, offset: 480)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1351, file: !1349, line: 131, baseType: !1379, size: 64, offset: 512)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1349, line: 75, baseType: !1380)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!759, !1372, !1372}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1351, file: !1349, line: 132, baseType: !1384, size: 64, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1349, line: 78, baseType: !1366)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1351, file: !1349, line: 135, baseType: !759, size: 64, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1351, file: !1349, line: 136, baseType: !1387, size: 64, offset: 704)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1349, line: 82, baseType: !1388)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!759, !759, !1372, !1372}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1351, file: !1349, line: 137, baseType: !1392, size: 64, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1349, line: 83, baseType: !1393)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !759, !759}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1351, file: !1349, line: 141, baseType: !5, size: 32, offset: 832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1345, file: !1256, line: 48, baseType: !1398, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !540, line: 35, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !540, line: 35, size: 128, elements: !1401)
!1401 = !{!1402}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1400, file: !540, line: 35, baseType: !1403, size: 128)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !540, line: 33, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !540, line: 33, size: 128, elements: !1405)
!1405 = !{!1406, !1407, !1408}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1404, file: !540, line: 33, baseType: !5, size: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1404, file: !540, line: 33, baseType: !5, size: 32, offset: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1404, file: !540, line: 33, baseType: !1409, size: 64, offset: 64)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 64, elements: !773)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1345, file: !1256, line: 51, baseType: !1411, size: 64, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1414)
!1414 = !{!1415}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1413, file: !149, line: 183, baseType: !1416, size: 128)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1418)
!1418 = !{!1419, !1420, !1421}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1417, file: !149, line: 182, baseType: !5, size: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1417, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1417, file: !149, line: 182, baseType: !1422, size: 64, offset: 64)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 64, elements: !773)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1345, file: !1256, line: 54, baseType: !844, size: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1345, file: !1256, line: 57, baseType: !1425, size: 128, offset: 256)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1426, line: 31, size: 128, elements: !1427)
!1426 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1433, !1434}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1425, file: !1426, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1425, file: !1426, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1425, file: !1426, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1425, file: !1426, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1425, file: !1426, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1425, file: !1426, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1425, file: !1426, line: 56, baseType: !1435, size: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !799, line: 47, baseType: !1068)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1345, file: !1256, line: 60, baseType: !1425, size: 128, offset: 384)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1345, file: !1256, line: 64, baseType: !1438, size: 64, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1440, line: 33, flags: DIFlagFwdDecl)
!1440 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1345, file: !1256, line: 67, baseType: !844, size: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1345, file: !1256, line: 73, baseType: !1348, size: 64, offset: 640)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1345, file: !1256, line: 77, baseType: !1435, size: 64, offset: 704)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1345, file: !1256, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1345, file: !1256, line: 82, baseType: !1446, size: 320, offset: 832)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1447, line: 62, size: 320, elements: !1448)
!1447 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1448 = !{!1449, !1455, !1456, !1457, !1458, !1465}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1446, file: !1447, line: 63, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1447, line: 56, size: 128, elements: !1452)
!1452 = !{!1453, !1454}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1451, file: !1447, line: 57, baseType: !1450, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1451, file: !1447, line: 58, baseType: !941, size: 8, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1446, file: !1447, line: 64, baseType: !5, size: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1446, file: !1447, line: 66, baseType: !5, size: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1446, file: !1447, line: 68, baseType: !960, size: 8, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1446, file: !1447, line: 70, baseType: !1459, size: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1447, line: 37, size: 128, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1460, file: !1447, line: 39, baseType: !1459, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1460, file: !1447, line: 40, baseType: !1464, size: 64, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1446, file: !1447, line: 71, baseType: !1466, size: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1447, line: 45, size: 320, elements: !1468)
!1468 = !{!1469, !1470}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1467, file: !1447, line: 47, baseType: !1466, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1467, file: !1447, line: 48, baseType: !1471, size: 256, offset: 64)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1472)
!1472 = !{!1473, !1475, !1476, !1481}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1471, file: !149, line: 1884, baseType: !1474, size: 64)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1471, file: !149, line: 1885, baseType: !1474, size: 64, offset: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1471, file: !149, line: 1891, baseType: !1477, size: 64, offset: 128)
!1477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1471, file: !149, line: 1891, size: 64, elements: !1478)
!1478 = !{!1479, !1480}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1477, file: !149, line: 1891, baseType: !819, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1477, file: !149, line: 1891, baseType: !844, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1471, file: !149, line: 1892, baseType: !1464, size: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1305, file: !1306, line: 476, baseType: !1483, size: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1485)
!1485 = !{!1486, !1487, !1500, !1501}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1484, file: !376, line: 189, baseType: !758, size: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1484, file: !376, line: 192, baseType: !1488, size: 64, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1491)
!1491 = !{!1492}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1490, file: !376, line: 87, baseType: !1493, size: 128)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1495)
!1495 = !{!1496, !1497, !1498}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1494, file: !376, line: 85, baseType: !5, size: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1494, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1494, file: !376, line: 85, baseType: !1499, size: 64, offset: 64)
!1499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 64, elements: !773)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1484, file: !376, line: 197, baseType: !1348, size: 64, offset: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1484, file: !376, line: 200, baseType: !776, size: 64, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1305, file: !1306, line: 479, baseType: !1348, size: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1305, file: !1306, line: 484, baseType: !844, size: 64, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1305, file: !1306, line: 488, baseType: !844, size: 64, offset: 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1305, file: !1306, line: 493, baseType: !844, size: 64, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1305, file: !1306, line: 496, baseType: !844, size: 64, offset: 576)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1305, file: !1306, line: 501, baseType: !1508, size: 64, offset: 640)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1510)
!1510 = !{!1511, !1514, !1515, !1516, !1517, !1519, !1520, !1525, !1526, !1527, !1528, !1529, !1530}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1509, file: !144, line: 2356, baseType: !1512, size: 64)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1509, file: !144, line: 2357, baseType: !1040, size: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1509, file: !144, line: 2358, baseType: !758, size: 32, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1509, file: !144, line: 2359, baseType: !758, size: 32, offset: 160)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1509, file: !144, line: 2360, baseType: !1518, size: 128, offset: 192)
!1518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !1109)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1509, file: !144, line: 2364, baseType: !758, size: 32, offset: 320)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1509, file: !144, line: 2367, baseType: !1521, size: 128, offset: 384)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1522)
!1522 = !{!1523, !1524}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1521, file: !144, line: 2351, baseType: !1014, size: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1521, file: !144, line: 2352, baseType: !899, size: 64, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1509, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1509, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1509, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1509, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1509, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1509, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1305, file: !1306, line: 504, baseType: !1532, size: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1306, line: 504, flags: DIFlagFwdDecl)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1305, file: !1306, line: 507, baseType: !1348, size: 64, offset: 768)
