; ModuleID = 'tree-stdarg.c'
source_filename = "tree-stdarg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!1344 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!1345 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!1346 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!1347 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!1348 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!1349 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!1350 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!1351 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!1352 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!1353 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!1354 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!1355 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!1356 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!1357 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!1358 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!1359 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!1360 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!1361 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!1362 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!1363 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!1364 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!1365 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!1366 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!1367 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!1368 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!1369 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!1370 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!1371 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!1372 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!1373 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!1374 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!1375 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!1376 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !1318, line: 727, baseType: !7, size: 32, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1378 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!1379 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!1380 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!1381 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!1382 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!1383 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!1384 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!1385 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!1386 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!1387 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!1388 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!1389 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!1390 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!1391 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!1392 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!1393 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!1394 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!1395 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!1396 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!1397 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!1398 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!1399 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!1400 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!1401 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!1402 = !{!238, !1403, !1908, !2070, !1484, !1702, !2583, !1735, !2106, !2585, !1457, !7, !2588, !2593, !1317, !2594}
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1404, line: 56, baseType: !1405)
!1404 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !206, line: 3371, size: 1792, elements: !1407)
!1407 = !{!1408, !1441, !1447, !1460, !1467, !1474, !1479, !1490, !1496, !1510, !1522, !1560, !1568, !1596, !1613, !1614, !1619, !1628, !1634, !1639, !1643, !1647, !2232, !2281, !2287, !2293, !2300, !2313, !2327, !2344, !2356, !2378, !2393, !2565}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1406, file: !206, line: 3372, baseType: !1409, size: 64)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !206, line: 360, size: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1409, file: !206, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1409, file: !206, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1409, file: !206, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1409, file: !206, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1409, file: !206, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1409, file: !206, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1409, file: !206, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1409, file: !206, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1409, file: !206, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1409, file: !206, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1409, file: !206, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1409, file: !206, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1409, file: !206, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1409, file: !206, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1409, file: !206, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1409, file: !206, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1409, file: !206, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1409, file: !206, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1409, file: !206, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1409, file: !206, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1409, file: !206, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1409, file: !206, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1409, file: !206, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1409, file: !206, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1409, file: !206, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1409, file: !206, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1409, file: !206, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1409, file: !206, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1409, file: !206, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1409, file: !206, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1406, file: !206, line: 3373, baseType: !1442, size: 192)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !206, line: 402, size: 192, elements: !1443)
!1443 = !{!1444, !1445, !1446}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1442, file: !206, line: 403, baseType: !1409, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1442, file: !206, line: 404, baseType: !1403, size: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1442, file: !206, line: 405, baseType: !1403, size: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1406, file: !206, line: 3374, baseType: !1448, size: 320)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !206, line: 1384, size: 320, elements: !1449)
!1449 = !{!1450, !1451}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !206, line: 1385, baseType: !1442, size: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1448, file: !206, line: 1386, baseType: !1452, size: 128, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1453, line: 58, baseType: !1454)
!1453 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1453, line: 54, size: 128, elements: !1455)
!1455 = !{!1456, !1458}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1454, file: !1453, line: 56, baseType: !1457, size: 64)
!1457 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1454, file: !1453, line: 57, baseType: !1459, size: 64, offset: 64)
!1459 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1406, file: !206, line: 3375, baseType: !1461, size: 256)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !206, line: 1397, size: 256, elements: !1462)
!1462 = !{!1463, !1464}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1461, file: !206, line: 1398, baseType: !1442, size: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1461, file: !206, line: 1399, baseType: !1465, size: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !206, line: 1392, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1406, file: !206, line: 3376, baseType: !1468, size: 256)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !206, line: 1408, size: 256, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1468, file: !206, line: 1409, baseType: !1442, size: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1468, file: !206, line: 1410, baseType: !1472, size: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !206, line: 1403, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1406, file: !206, line: 3377, baseType: !1475, size: 256)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !206, line: 1437, size: 256, elements: !1476)
!1476 = !{!1477, !1478}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1475, file: !206, line: 1438, baseType: !1442, size: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1475, file: !206, line: 1439, baseType: !1403, size: 64, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1406, file: !206, line: 3378, baseType: !1480, size: 256)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !206, line: 1418, size: 256, elements: !1481)
!1481 = !{!1482, !1483, !1485}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1480, file: !206, line: 1419, baseType: !1442, size: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1480, file: !206, line: 1420, baseType: !1484, size: 32, offset: 192)
!1484 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1480, file: !206, line: 1421, baseType: !1486, size: 8, offset: 224)
!1486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1487, size: 8, elements: !1488)
!1487 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1488 = !{!1489}
!1489 = !DISubrange(count: 1)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1406, file: !206, line: 3379, baseType: !1491, size: 320)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !206, line: 1428, size: 320, elements: !1492)
!1492 = !{!1493, !1494, !1495}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1491, file: !206, line: 1429, baseType: !1442, size: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1491, file: !206, line: 1430, baseType: !1403, size: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1491, file: !206, line: 1431, baseType: !1403, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1406, file: !206, line: 3380, baseType: !1497, size: 320)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !206, line: 1460, size: 320, elements: !1498)
!1498 = !{!1499, !1500}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !206, line: 1461, baseType: !1442, size: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1497, file: !206, line: 1462, baseType: !1501, size: 128, offset: 192)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1502, line: 31, size: 128, elements: !1503)
!1502 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1503 = !{!1504, !1508, !1509}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1501, file: !1502, line: 32, baseType: !1505, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1507)
!1507 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1501, file: !1502, line: 33, baseType: !7, size: 32, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1501, file: !1502, line: 34, baseType: !7, size: 32, offset: 96)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1406, file: !206, line: 3381, baseType: !1511, size: 384)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !206, line: 2507, size: 384, elements: !1512)
!1512 = !{!1513, !1514, !1519, !1520, !1521}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1511, file: !206, line: 2508, baseType: !1442, size: 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1511, file: !206, line: 2509, baseType: !1515, size: 32, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1516, line: 58, baseType: !1517)
!1516 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1518, line: 44, baseType: !7)
!1518 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1511, file: !206, line: 2510, baseType: !7, size: 32, offset: 224)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1511, file: !206, line: 2511, baseType: !1403, size: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1511, file: !206, line: 2512, baseType: !1403, size: 64, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1406, file: !206, line: 3382, baseType: !1523, size: 896)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !206, line: 2652, size: 896, elements: !1524)
!1524 = !{!1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1523, file: !206, line: 2653, baseType: !1511, size: 384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1523, file: !206, line: 2654, baseType: !1403, size: 64, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1523, file: !206, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1523, file: !206, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1523, file: !206, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1523, file: !206, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1523, file: !206, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1523, file: !206, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1523, file: !206, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1523, file: !206, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1523, file: !206, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1523, file: !206, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1523, file: !206, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1523, file: !206, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1523, file: !206, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1523, file: !206, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1523, file: !206, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1523, file: !206, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1523, file: !206, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1523, file: !206, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1523, file: !206, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1523, file: !206, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1523, file: !206, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1523, file: !206, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1523, file: !206, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1523, file: !206, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1523, file: !206, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1523, file: !206, line: 2703, baseType: !7, size: 32, offset: 512)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1523, file: !206, line: 2705, baseType: !1403, size: 64, offset: 576)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1523, file: !206, line: 2706, baseType: !1403, size: 64, offset: 640)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1523, file: !206, line: 2707, baseType: !1403, size: 64, offset: 704)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1523, file: !206, line: 2708, baseType: !1403, size: 64, offset: 768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1523, file: !206, line: 2711, baseType: !1558, size: 64, offset: 832)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !206, line: 2711, flags: DIFlagFwdDecl)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1406, file: !206, line: 3383, baseType: !1561, size: 960)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !206, line: 2756, size: 960, elements: !1562)
!1562 = !{!1563, !1564}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1561, file: !206, line: 2757, baseType: !1523, size: 896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1561, file: !206, line: 2758, baseType: !1565, size: 64, offset: 896)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1404, line: 50, baseType: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1404, line: 49, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1406, file: !206, line: 3384, baseType: !1569, size: 1472)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !206, line: 3114, size: 1472, elements: !1570)
!1570 = !{!1571, !1592, !1593, !1594, !1595}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1569, file: !206, line: 3115, baseType: !1572, size: 1216)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !206, line: 2984, size: 1216, elements: !1573)
!1573 = !{!1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1572, file: !206, line: 2985, baseType: !1561, size: 960)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1572, file: !206, line: 2986, baseType: !1403, size: 64, offset: 960)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1572, file: !206, line: 2987, baseType: !1403, size: 64, offset: 1024)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1572, file: !206, line: 2988, baseType: !1403, size: 64, offset: 1088)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1572, file: !206, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1572, file: !206, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1572, file: !206, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1572, file: !206, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1572, file: !206, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1572, file: !206, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1572, file: !206, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1572, file: !206, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1572, file: !206, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1572, file: !206, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1572, file: !206, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1572, file: !206, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1572, file: !206, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1572, file: !206, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1569, file: !206, line: 3117, baseType: !1403, size: 64, offset: 1216)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1569, file: !206, line: 3119, baseType: !1403, size: 64, offset: 1280)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1569, file: !206, line: 3121, baseType: !1403, size: 64, offset: 1344)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1569, file: !206, line: 3123, baseType: !1403, size: 64, offset: 1408)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1406, file: !206, line: 3385, baseType: !1597, size: 1088)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !206, line: 2874, size: 1088, elements: !1598)
!1598 = !{!1599, !1600, !1601}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1597, file: !206, line: 2875, baseType: !1561, size: 960)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1597, file: !206, line: 2876, baseType: !1565, size: 64, offset: 960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1597, file: !206, line: 2877, baseType: !1602, size: 64, offset: 1024)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1604, line: 172, size: 128, elements: !1605)
!1604 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1605 = !{!1606, !1607, !1608, !1609, !1610, !1611, !1612}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1603, file: !1604, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1603, file: !1604, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1603, file: !1604, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1603, file: !1604, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1603, file: !1604, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1603, file: !1604, line: 195, baseType: !7, size: 32, offset: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1603, file: !1604, line: 199, baseType: !1403, size: 64, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1406, file: !206, line: 3386, baseType: !1572, size: 1216)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1406, file: !206, line: 3387, baseType: !1615, size: 1280)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !206, line: 3093, size: 1280, elements: !1616)
!1616 = !{!1617, !1618}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1615, file: !206, line: 3094, baseType: !1572, size: 1216)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1615, file: !206, line: 3095, baseType: !1602, size: 64, offset: 1216)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1406, file: !206, line: 3388, baseType: !1620, size: 1216)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !206, line: 2824, size: 1216, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625, !1626, !1627}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1620, file: !206, line: 2825, baseType: !1523, size: 896)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1620, file: !206, line: 2827, baseType: !1403, size: 64, offset: 896)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1620, file: !206, line: 2828, baseType: !1403, size: 64, offset: 960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1620, file: !206, line: 2829, baseType: !1403, size: 64, offset: 1024)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1620, file: !206, line: 2830, baseType: !1403, size: 64, offset: 1088)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1620, file: !206, line: 2831, baseType: !1403, size: 64, offset: 1152)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1406, file: !206, line: 3389, baseType: !1629, size: 1024)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !206, line: 2850, size: 1024, elements: !1630)
!1630 = !{!1631, !1632, !1633}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1629, file: !206, line: 2851, baseType: !1561, size: 960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1629, file: !206, line: 2852, baseType: !1484, size: 32, offset: 960)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1629, file: !206, line: 2853, baseType: !1484, size: 32, offset: 992)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1406, file: !206, line: 3390, baseType: !1635, size: 1024)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !206, line: 2857, size: 1024, elements: !1636)
!1636 = !{!1637, !1638}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1635, file: !206, line: 2858, baseType: !1561, size: 960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1635, file: !206, line: 2859, baseType: !1602, size: 64, offset: 960)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1406, file: !206, line: 3391, baseType: !1640, size: 960)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !206, line: 2862, size: 960, elements: !1641)
!1641 = !{!1642}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1640, file: !206, line: 2863, baseType: !1561, size: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1406, file: !206, line: 3392, baseType: !1644, size: 1472)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !206, line: 3304, size: 1472, elements: !1645)
!1645 = !{!1646}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1644, file: !206, line: 3305, baseType: !1569, size: 1472)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1406, file: !206, line: 3393, baseType: !1648, size: 1792)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !206, line: 3248, size: 1792, elements: !1649)
!1649 = !{!1650, !1651, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1648, file: !206, line: 3249, baseType: !1569, size: 1472)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1648, file: !206, line: 3251, baseType: !1652, size: 64, offset: 1472)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1654, line: 463, size: 1152, elements: !1655)
!1654 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1655 = !{!1656, !1659, !1978, !1979, !2152, !2155, !2156, !2157, !2158, !2159, !2160, !2184, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1653, file: !1654, line: 464, baseType: !1657, size: 64)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1654, line: 464, flags: DIFlagFwdDecl)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1653, file: !1654, line: 467, baseType: !1660, size: 64, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !190, line: 374, size: 640, elements: !1662)
!1662 = !{!1663, !1953, !1954, !1967, !1968, !1969, !1970, !1971, !1972, !1974, !1976, !1977}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1661, file: !190, line: 377, baseType: !1664, size: 64)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1404, line: 111, baseType: !1665)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !190, line: 217, size: 832, elements: !1667)
!1667 = !{!1668, !1916, !1917, !1918, !1921, !1927, !1928, !1929, !1947, !1948, !1949, !1950, !1951, !1952}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1666, file: !190, line: 219, baseType: !1669, size: 64)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !190, line: 151, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !190, line: 151, size: 128, elements: !1672)
!1672 = !{!1673}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1671, file: !190, line: 151, baseType: !1674, size: 128)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !190, line: 150, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !190, line: 150, size: 128, elements: !1676)
!1676 = !{!1677, !1678, !1679}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1675, file: !190, line: 150, baseType: !7, size: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1675, file: !190, line: 150, baseType: !7, size: 32, offset: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1675, file: !190, line: 150, baseType: !1680, size: 64, offset: 64)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1681, size: 64, elements: !1488)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1404, line: 108, baseType: !1682)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !190, line: 122, size: 512, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1907, !1909, !1910, !1911, !1912, !1913, !1914}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1683, file: !190, line: 124, baseType: !1665, size: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1683, file: !190, line: 125, baseType: !1665, size: 64, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1683, file: !190, line: 131, baseType: !1688, size: 64, offset: 128)
!1688 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !190, line: 128, size: 64, elements: !1689)
!1689 = !{!1690, !1906}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1688, file: !190, line: 129, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1404, line: 66, baseType: !1692)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1318, line: 143, size: 192, elements: !1694)
!1694 = !{!1695, !1904, !1905}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1693, file: !1318, line: 145, baseType: !1696, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1404, line: 69, baseType: !1697)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64)
!1698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1318, line: 136, size: 192, elements: !1699)
!1699 = !{!1700, !1902, !1903}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1698, file: !1318, line: 137, baseType: !1701, size: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1404, line: 58, baseType: !1702)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64)
!1703 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1318, line: 737, size: 768, elements: !1704)
!1704 = !{!1705, !1722, !1755, !1761, !1766, !1771, !1778, !1784, !1790, !1795, !1809, !1814, !1820, !1825, !1837, !1842, !1860, !1867, !1874, !1880, !1885, !1891, !1897}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1703, file: !1318, line: 738, baseType: !1706, size: 256)
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1318, line: 271, size: 256, elements: !1707)
!1707 = !{!1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1706, file: !1318, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1706, file: !1318, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1706, file: !1318, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1706, file: !1318, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1706, file: !1318, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1706, file: !1318, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1706, file: !1318, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1706, file: !1318, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1706, file: !1318, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1706, file: !1318, line: 312, baseType: !7, size: 32, offset: 32)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1706, file: !1318, line: 316, baseType: !1515, size: 32, offset: 64)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1706, file: !1318, line: 319, baseType: !7, size: 32, offset: 96)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1706, file: !1318, line: 323, baseType: !1665, size: 64, offset: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1706, file: !1318, line: 327, baseType: !1403, size: 64, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1703, file: !1318, line: 739, baseType: !1723, size: 448)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1318, line: 350, size: 448, elements: !1724)
!1724 = !{!1725, !1753}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1723, file: !1318, line: 353, baseType: !1726, size: 384)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1318, line: 333, size: 384, elements: !1727)
!1727 = !{!1728, !1729, !1736}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1726, file: !1318, line: 336, baseType: !1706, size: 256)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1726, file: !1318, line: 343, baseType: !1730, size: 64, offset: 256)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !591, line: 37, size: 128, elements: !1732)
!1732 = !{!1733, !1734}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1731, file: !591, line: 39, baseType: !1730, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1731, file: !591, line: 40, baseType: !1735, size: 64, offset: 64)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1726, file: !1318, line: 344, baseType: !1737, size: 64, offset: 320)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !591, line: 45, size: 320, elements: !1739)
!1739 = !{!1740, !1741}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1738, file: !591, line: 47, baseType: !1737, size: 64)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1738, file: !591, line: 48, baseType: !1742, size: 256, offset: 64)
!1742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !206, line: 1883, size: 256, elements: !1743)
!1743 = !{!1744, !1746, !1747, !1752}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1742, file: !206, line: 1884, baseType: !1745, size: 64)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1742, file: !206, line: 1885, baseType: !1745, size: 64, offset: 64)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1742, file: !206, line: 1891, baseType: !1748, size: 64, offset: 128)
!1748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1742, file: !206, line: 1891, size: 64, elements: !1749)
!1749 = !{!1750, !1751}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1748, file: !206, line: 1891, baseType: !1701, size: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1748, file: !206, line: 1891, baseType: !1403, size: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1742, file: !206, line: 1892, baseType: !1735, size: 64, offset: 192)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1723, file: !1318, line: 359, baseType: !1754, size: 64, offset: 384)
!1754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1403, size: 64, elements: !1488)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1703, file: !1318, line: 740, baseType: !1756, size: 512)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1318, line: 365, size: 512, elements: !1757)
!1757 = !{!1758, !1759, !1760}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1756, file: !1318, line: 368, baseType: !1726, size: 384)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1756, file: !1318, line: 373, baseType: !1403, size: 64, offset: 384)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1756, file: !1318, line: 374, baseType: !1403, size: 64, offset: 448)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1703, file: !1318, line: 741, baseType: !1762, size: 576)
!1762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1318, line: 380, size: 576, elements: !1763)
!1763 = !{!1764, !1765}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1762, file: !1318, line: 383, baseType: !1756, size: 512)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1762, file: !1318, line: 389, baseType: !1754, size: 64, offset: 512)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1703, file: !1318, line: 742, baseType: !1767, size: 320)
!1767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1318, line: 395, size: 320, elements: !1768)
!1768 = !{!1769, !1770}
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1767, file: !1318, line: 397, baseType: !1706, size: 256)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1767, file: !1318, line: 400, baseType: !1691, size: 64, offset: 256)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1703, file: !1318, line: 743, baseType: !1772, size: 448)
!1772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1318, line: 406, size: 448, elements: !1773)
!1773 = !{!1774, !1775, !1776, !1777}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1772, file: !1318, line: 408, baseType: !1706, size: 256)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1772, file: !1318, line: 412, baseType: !1403, size: 64, offset: 256)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1772, file: !1318, line: 420, baseType: !1403, size: 64, offset: 320)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1772, file: !1318, line: 423, baseType: !1691, size: 64, offset: 384)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1703, file: !1318, line: 744, baseType: !1779, size: 384)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1318, line: 429, size: 384, elements: !1780)
!1780 = !{!1781, !1782, !1783}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1779, file: !1318, line: 431, baseType: !1706, size: 256)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1779, file: !1318, line: 434, baseType: !1403, size: 64, offset: 256)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1779, file: !1318, line: 437, baseType: !1691, size: 64, offset: 320)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1703, file: !1318, line: 745, baseType: !1785, size: 384)
!1785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1318, line: 443, size: 384, elements: !1786)
!1786 = !{!1787, !1788, !1789}
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1785, file: !1318, line: 445, baseType: !1706, size: 256)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1785, file: !1318, line: 449, baseType: !1403, size: 64, offset: 256)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1785, file: !1318, line: 453, baseType: !1691, size: 64, offset: 320)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1703, file: !1318, line: 746, baseType: !1791, size: 320)
!1791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1318, line: 459, size: 320, elements: !1792)
!1792 = !{!1793, !1794}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1791, file: !1318, line: 461, baseType: !1706, size: 256)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1791, file: !1318, line: 464, baseType: !1403, size: 64, offset: 256)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1703, file: !1318, line: 747, baseType: !1796, size: 768)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1318, line: 469, size: 768, elements: !1797)
!1797 = !{!1798, !1799, !1800, !1801, !1802}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1796, file: !1318, line: 471, baseType: !1706, size: 256)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1796, file: !1318, line: 474, baseType: !7, size: 32, offset: 256)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1796, file: !1318, line: 475, baseType: !7, size: 32, offset: 288)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1796, file: !1318, line: 478, baseType: !1403, size: 64, offset: 320)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1796, file: !1318, line: 481, baseType: !1803, size: 384, offset: 384)
!1803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1804, size: 384, elements: !1488)
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !206, line: 1917, size: 384, elements: !1805)
!1805 = !{!1806, !1807, !1808}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1804, file: !206, line: 1920, baseType: !1742, size: 256)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1804, file: !206, line: 1921, baseType: !1403, size: 64, offset: 256)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1804, file: !206, line: 1922, baseType: !1515, size: 32, offset: 320)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1703, file: !1318, line: 748, baseType: !1810, size: 320)
!1810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1318, line: 487, size: 320, elements: !1811)
!1811 = !{!1812, !1813}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1810, file: !1318, line: 490, baseType: !1706, size: 256)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1810, file: !1318, line: 494, baseType: !1484, size: 32, offset: 256)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1703, file: !1318, line: 749, baseType: !1815, size: 384)
!1815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1318, line: 500, size: 384, elements: !1816)
!1816 = !{!1817, !1818, !1819}
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1815, file: !1318, line: 502, baseType: !1706, size: 256)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1815, file: !1318, line: 506, baseType: !1691, size: 64, offset: 256)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1815, file: !1318, line: 510, baseType: !1691, size: 64, offset: 320)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1703, file: !1318, line: 750, baseType: !1821, size: 320)
!1821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1318, line: 529, size: 320, elements: !1822)
!1822 = !{!1823, !1824}
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1821, file: !1318, line: 531, baseType: !1706, size: 256)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1821, file: !1318, line: 540, baseType: !1691, size: 64, offset: 256)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1703, file: !1318, line: 751, baseType: !1826, size: 704)
!1826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1318, line: 546, size: 704, elements: !1827)
!1827 = !{!1828, !1829, !1832, !1833, !1834, !1835, !1836}
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1826, file: !1318, line: 549, baseType: !1756, size: 512)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1826, file: !1318, line: 553, baseType: !1830, size: 64, offset: 512)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64)
!1831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1487)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1826, file: !1318, line: 557, baseType: !1507, size: 8, offset: 576)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1826, file: !1318, line: 558, baseType: !1507, size: 8, offset: 584)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1826, file: !1318, line: 559, baseType: !1507, size: 8, offset: 592)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1826, file: !1318, line: 560, baseType: !1507, size: 8, offset: 600)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1826, file: !1318, line: 566, baseType: !1754, size: 64, offset: 640)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1703, file: !1318, line: 752, baseType: !1838, size: 384)
!1838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1318, line: 571, size: 384, elements: !1839)
!1839 = !{!1840, !1841}
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1838, file: !1318, line: 573, baseType: !1767, size: 320)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1838, file: !1318, line: 577, baseType: !1403, size: 64, offset: 320)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1703, file: !1318, line: 753, baseType: !1843, size: 576)
!1843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1318, line: 600, size: 576, elements: !1844)
!1844 = !{!1845, !1846, !1847, !1850, !1859}
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1843, file: !1318, line: 602, baseType: !1767, size: 320)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1843, file: !1318, line: 605, baseType: !1403, size: 64, offset: 320)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1843, file: !1318, line: 609, baseType: !1848, size: 64, offset: 384)
!1848 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1849, line: 46, baseType: !1457)
!1849 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1843, file: !1318, line: 612, baseType: !1851, size: 64, offset: 448)
!1851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1852, size: 64)
!1852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1318, line: 581, size: 320, elements: !1853)
!1853 = !{!1854, !1855, !1856, !1857, !1858}
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1852, file: !1318, line: 583, baseType: !238, size: 32)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1852, file: !1318, line: 586, baseType: !1403, size: 64, offset: 64)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1852, file: !1318, line: 589, baseType: !1403, size: 64, offset: 128)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1852, file: !1318, line: 592, baseType: !1403, size: 64, offset: 192)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1852, file: !1318, line: 595, baseType: !1403, size: 64, offset: 256)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1843, file: !1318, line: 616, baseType: !1691, size: 64, offset: 512)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1703, file: !1318, line: 754, baseType: !1861, size: 512)
!1861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1318, line: 622, size: 512, elements: !1862)
!1862 = !{!1863, !1864, !1865, !1866}
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1861, file: !1318, line: 624, baseType: !1767, size: 320)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1861, file: !1318, line: 628, baseType: !1403, size: 64, offset: 320)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1861, file: !1318, line: 632, baseType: !1403, size: 64, offset: 384)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1861, file: !1318, line: 636, baseType: !1403, size: 64, offset: 448)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1703, file: !1318, line: 755, baseType: !1868, size: 704)
!1868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1318, line: 642, size: 704, elements: !1869)
!1869 = !{!1870, !1871, !1872, !1873}
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1868, file: !1318, line: 644, baseType: !1861, size: 512)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1868, file: !1318, line: 648, baseType: !1403, size: 64, offset: 512)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1868, file: !1318, line: 652, baseType: !1403, size: 64, offset: 576)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1868, file: !1318, line: 653, baseType: !1403, size: 64, offset: 640)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1703, file: !1318, line: 756, baseType: !1875, size: 448)
!1875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1318, line: 663, size: 448, elements: !1876)
!1876 = !{!1877, !1878, !1879}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1875, file: !1318, line: 665, baseType: !1767, size: 320)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1875, file: !1318, line: 668, baseType: !1403, size: 64, offset: 320)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1875, file: !1318, line: 673, baseType: !1403, size: 64, offset: 384)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1703, file: !1318, line: 757, baseType: !1881, size: 384)
!1881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1318, line: 694, size: 384, elements: !1882)
!1882 = !{!1883, !1884}
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1881, file: !1318, line: 696, baseType: !1767, size: 320)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1881, file: !1318, line: 699, baseType: !1403, size: 64, offset: 320)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1703, file: !1318, line: 758, baseType: !1886, size: 384)
!1886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1318, line: 681, size: 384, elements: !1887)
!1887 = !{!1888, !1889, !1890}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1886, file: !1318, line: 683, baseType: !1706, size: 256)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1886, file: !1318, line: 686, baseType: !1403, size: 64, offset: 256)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1886, file: !1318, line: 689, baseType: !1403, size: 64, offset: 320)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1703, file: !1318, line: 759, baseType: !1892, size: 384)
!1892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1318, line: 707, size: 384, elements: !1893)
!1893 = !{!1894, !1895, !1896}
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1892, file: !1318, line: 709, baseType: !1706, size: 256)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1892, file: !1318, line: 712, baseType: !1403, size: 64, offset: 256)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1892, file: !1318, line: 712, baseType: !1403, size: 64, offset: 320)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1703, file: !1318, line: 760, baseType: !1898, size: 320)
!1898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1318, line: 718, size: 320, elements: !1899)
!1899 = !{!1900, !1901}
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1898, file: !1318, line: 720, baseType: !1706, size: 256)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1898, file: !1318, line: 723, baseType: !1403, size: 64, offset: 256)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1698, file: !1318, line: 138, baseType: !1697, size: 64, offset: 64)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1698, file: !1318, line: 139, baseType: !1697, size: 64, offset: 128)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1693, file: !1318, line: 146, baseType: !1696, size: 64, offset: 64)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1693, file: !1318, line: 152, baseType: !1691, size: 64, offset: 128)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1688, file: !190, line: 130, baseType: !1565, size: 64)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1683, file: !190, line: 134, baseType: !1908, size: 64, offset: 192)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1683, file: !190, line: 137, baseType: !1403, size: 64, offset: 256)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1683, file: !190, line: 138, baseType: !1515, size: 32, offset: 320)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1683, file: !190, line: 142, baseType: !7, size: 32, offset: 352)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1683, file: !190, line: 144, baseType: !1484, size: 32, offset: 384)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1683, file: !190, line: 145, baseType: !1484, size: 32, offset: 416)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1683, file: !190, line: 146, baseType: !1915, size: 64, offset: 448)
!1915 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !190, line: 119, baseType: !1459)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1666, file: !190, line: 220, baseType: !1669, size: 64, offset: 64)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1666, file: !190, line: 223, baseType: !1908, size: 64, offset: 128)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1666, file: !190, line: 226, baseType: !1919, size: 64, offset: 192)
!1919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1920, size: 64)
!1920 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !190, line: 185, flags: DIFlagFwdDecl)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1666, file: !190, line: 229, baseType: !1922, size: 128, offset: 256)
!1922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1923, size: 128, elements: !1925)
!1923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1924, size: 64)
!1924 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !190, line: 229, flags: DIFlagFwdDecl)
!1925 = !{!1926}
!1926 = !DISubrange(count: 2)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1666, file: !190, line: 232, baseType: !1665, size: 64, offset: 384)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1666, file: !190, line: 233, baseType: !1665, size: 64, offset: 448)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1666, file: !190, line: 238, baseType: !1930, size: 64, offset: 512)
!1930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !190, line: 235, size: 64, elements: !1931)
!1931 = !{!1932, !1938}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1930, file: !190, line: 236, baseType: !1933, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1934, size: 64)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !190, line: 273, size: 128, elements: !1935)
!1935 = !{!1936, !1937}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1934, file: !190, line: 275, baseType: !1691, size: 64)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1934, file: !190, line: 278, baseType: !1691, size: 64, offset: 64)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1930, file: !190, line: 237, baseType: !1939, size: 64)
!1939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1940, size: 64)
!1940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !190, line: 259, size: 320, elements: !1941)
!1941 = !{!1942, !1943, !1944, !1945, !1946}
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1940, file: !190, line: 261, baseType: !1565, size: 64)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1940, file: !190, line: 262, baseType: !1565, size: 64, offset: 64)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1940, file: !190, line: 266, baseType: !1565, size: 64, offset: 128)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1940, file: !190, line: 267, baseType: !1565, size: 64, offset: 192)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1940, file: !190, line: 270, baseType: !1484, size: 32, offset: 256)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1666, file: !190, line: 241, baseType: !1915, size: 64, offset: 576)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1666, file: !190, line: 244, baseType: !1484, size: 32, offset: 640)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1666, file: !190, line: 247, baseType: !1484, size: 32, offset: 672)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1666, file: !190, line: 250, baseType: !1484, size: 32, offset: 704)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1666, file: !190, line: 253, baseType: !1484, size: 32, offset: 736)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1666, file: !190, line: 256, baseType: !1484, size: 32, offset: 768)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1661, file: !190, line: 378, baseType: !1664, size: 64, offset: 64)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1661, file: !190, line: 381, baseType: !1955, size: 64, offset: 128)
!1955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1956, size: 64)
!1956 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !190, line: 282, baseType: !1957)
!1957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !190, line: 282, size: 128, elements: !1958)
!1958 = !{!1959}
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1957, file: !190, line: 282, baseType: !1960, size: 128)
!1960 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !190, line: 281, baseType: !1961)
!1961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !190, line: 281, size: 128, elements: !1962)
!1962 = !{!1963, !1964, !1965}
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1961, file: !190, line: 281, baseType: !7, size: 32)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1961, file: !190, line: 281, baseType: !7, size: 32, offset: 32)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1961, file: !190, line: 281, baseType: !1966, size: 64, offset: 64)
!1966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1664, size: 64, elements: !1488)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1661, file: !190, line: 384, baseType: !1484, size: 32, offset: 192)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1661, file: !190, line: 387, baseType: !1484, size: 32, offset: 224)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1661, file: !190, line: 390, baseType: !1484, size: 32, offset: 256)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1661, file: !190, line: 394, baseType: !1955, size: 64, offset: 320)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1661, file: !190, line: 396, baseType: !189, size: 32, offset: 384)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1661, file: !190, line: 399, baseType: !1973, size: 64, offset: 416)
!1973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !1925)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1661, file: !190, line: 402, baseType: !1975, size: 64, offset: 480)
!1975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1925)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1661, file: !190, line: 406, baseType: !1484, size: 32, offset: 544)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1661, file: !190, line: 409, baseType: !1484, size: 32, offset: 576)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1653, file: !1654, line: 470, baseType: !1692, size: 64, offset: 128)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1653, file: !1654, line: 473, baseType: !1980, size: 64, offset: 192)
!1980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1981, size: 64)
!1981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1604, line: 39, size: 1152, elements: !1982)
!1982 = !{!1983, !2033, !2046, !2058, !2059, !2129, !2130, !2134, !2135, !2136, !2137, !2138}
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1981, file: !1604, line: 41, baseType: !1984, size: 64)
!1984 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1985, line: 144, baseType: !1986)
!1985 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1987, size: 64)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1985, line: 100, size: 896, elements: !1988)
!1988 = !{!1989, !1997, !2002, !2007, !2009, !2010, !2011, !2012, !2013, !2014, !2019, !2021, !2022, !2027, !2032}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1987, file: !1985, line: 102, baseType: !1990, size: 64)
!1990 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1985, line: 52, baseType: !1991)
!1991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1992, size: 64)
!1992 = !DISubroutineType(types: !1993)
!1993 = !{!1994, !1995}
!1994 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1985, line: 47, baseType: !7)
!1995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1996, size: 64)
!1996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1987, file: !1985, line: 105, baseType: !1998, size: 64, offset: 64)
!1998 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1985, line: 59, baseType: !1999)
!1999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2000, size: 64)
!2000 = !DISubroutineType(types: !2001)
!2001 = !{!1484, !1995, !1995}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1987, file: !1985, line: 108, baseType: !2003, size: 64, offset: 128)
!2003 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1985, line: 63, baseType: !2004)
!2004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2005, size: 64)
!2005 = !DISubroutineType(types: !2006)
!2006 = !{null, !1908}
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1987, file: !1985, line: 111, baseType: !2008, size: 64, offset: 192)
!2008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1908, size: 64)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1987, file: !1985, line: 114, baseType: !1848, size: 64, offset: 256)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1987, file: !1985, line: 117, baseType: !1848, size: 64, offset: 320)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1987, file: !1985, line: 120, baseType: !1848, size: 64, offset: 384)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1987, file: !1985, line: 124, baseType: !7, size: 32, offset: 448)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1987, file: !1985, line: 128, baseType: !7, size: 32, offset: 480)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1987, file: !1985, line: 131, baseType: !2015, size: 64, offset: 512)
!2015 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1985, line: 75, baseType: !2016)
!2016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2017, size: 64)
!2017 = !DISubroutineType(types: !2018)
!2018 = !{!1908, !1848, !1848}
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1987, file: !1985, line: 132, baseType: !2020, size: 64, offset: 576)
!2020 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1985, line: 78, baseType: !2004)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1987, file: !1985, line: 135, baseType: !1908, size: 64, offset: 640)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1987, file: !1985, line: 136, baseType: !2023, size: 64, offset: 704)
!2023 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1985, line: 82, baseType: !2024)
!2024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2025, size: 64)
!2025 = !DISubroutineType(types: !2026)
!2026 = !{!1908, !1908, !1848, !1848}
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1987, file: !1985, line: 137, baseType: !2028, size: 64, offset: 768)
!2028 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1985, line: 83, baseType: !2029)
!2029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2030, size: 64)
!2030 = !DISubroutineType(types: !2031)
!2031 = !{null, !1908, !1908}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1987, file: !1985, line: 141, baseType: !7, size: 32, offset: 832)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1981, file: !1604, line: 48, baseType: !2034, size: 64, offset: 64)
!2034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2035, size: 64)
!2035 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !1318, line: 35, baseType: !2036)
!2036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !1318, line: 35, size: 128, elements: !2037)
!2037 = !{!2038}
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2036, file: !1318, line: 35, baseType: !2039, size: 128)
!2039 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !1318, line: 33, baseType: !2040)
!2040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !1318, line: 33, size: 128, elements: !2041)
!2041 = !{!2042, !2043, !2044}
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2040, file: !1318, line: 33, baseType: !7, size: 32)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2040, file: !1318, line: 33, baseType: !7, size: 32, offset: 32)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2040, file: !1318, line: 33, baseType: !2045, size: 64, offset: 64)
!2045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1701, size: 64, elements: !1488)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1981, file: !1604, line: 51, baseType: !2047, size: 64, offset: 128)
!2047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2048, size: 64)
!2048 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !206, line: 183, baseType: !2049)
!2049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !206, line: 183, size: 128, elements: !2050)
!2050 = !{!2051}
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2049, file: !206, line: 183, baseType: !2052, size: 128)
!2052 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !206, line: 182, baseType: !2053)
!2053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !206, line: 182, size: 128, elements: !2054)
!2054 = !{!2055, !2056, !2057}
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2053, file: !206, line: 182, baseType: !7, size: 32)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2053, file: !206, line: 182, baseType: !7, size: 32, offset: 32)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2053, file: !206, line: 182, baseType: !1754, size: 64, offset: 64)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1981, file: !1604, line: 54, baseType: !1403, size: 64, offset: 192)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1981, file: !1604, line: 57, baseType: !2060, size: 128, offset: 256)
!2060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !2061, line: 31, size: 128, elements: !2062)
!2061 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2062 = !{!2063, !2064, !2065, !2066, !2067, !2068, !2069}
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !2060, file: !2061, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !2060, file: !2061, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2060, file: !2061, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !2060, file: !2061, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !2060, file: !2061, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !2060, file: !2061, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2060, file: !2061, line: 56, baseType: !2070, size: 64, offset: 64)
!2070 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1404, line: 47, baseType: !2071)
!2071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64)
!2072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2073, line: 75, size: 256, elements: !2074)
!2073 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2074 = !{!2075, !2087, !2088, !2089}
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2072, file: !2073, line: 76, baseType: !2076, size: 64)
!2076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2077, size: 64)
!2077 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2073, line: 68, baseType: !2078)
!2078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2073, line: 63, size: 320, elements: !2079)
!2079 = !{!2080, !2082, !2083, !2084}
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2078, file: !2073, line: 64, baseType: !2081, size: 64)
!2081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2078, size: 64)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2078, file: !2073, line: 65, baseType: !2081, size: 64, offset: 64)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2078, file: !2073, line: 66, baseType: !7, size: 32, offset: 128)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2078, file: !2073, line: 67, baseType: !2085, size: 128, offset: 192)
!2085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2086, size: 128, elements: !1925)
!2086 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2073, line: 29, baseType: !1457)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2072, file: !2073, line: 77, baseType: !2076, size: 64, offset: 64)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2072, file: !2073, line: 78, baseType: !7, size: 32, offset: 128)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2072, file: !2073, line: 79, baseType: !2090, size: 64, offset: 192)
!2090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2091, size: 64)
!2091 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2073, line: 49, baseType: !2092)
!2092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2073, line: 45, size: 832, elements: !2093)
!2093 = !{!2094, !2095, !2096}
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2092, file: !2073, line: 46, baseType: !2081, size: 64)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2092, file: !2073, line: 47, baseType: !2071, size: 64, offset: 64)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2092, file: !2073, line: 48, baseType: !2097, size: 704, offset: 128)
!2097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2098, line: 164, size: 704, elements: !2099)
!2098 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2099 = !{!2100, !2101, !2112, !2113, !2114, !2115, !2116, !2117, !2121, !2125, !2126, !2127, !2128}
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2097, file: !2098, line: 166, baseType: !1459, size: 64)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2097, file: !2098, line: 167, baseType: !2102, size: 64, offset: 64)
!2102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2103, size: 64)
!2103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2098, line: 157, size: 192, elements: !2104)
!2104 = !{!2105, !2107, !2108}
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2103, file: !2098, line: 159, baseType: !2106, size: 64)
!2106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2103, file: !2098, line: 160, baseType: !2102, size: 64, offset: 64)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2103, file: !2098, line: 161, baseType: !2109, size: 32, offset: 128)
!2109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1487, size: 32, elements: !2110)
!2110 = !{!2111}
!2111 = !DISubrange(count: 4)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2097, file: !2098, line: 168, baseType: !2106, size: 64, offset: 128)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2097, file: !2098, line: 169, baseType: !2106, size: 64, offset: 192)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2097, file: !2098, line: 170, baseType: !2106, size: 64, offset: 256)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2097, file: !2098, line: 171, baseType: !1459, size: 64, offset: 320)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2097, file: !2098, line: 172, baseType: !1484, size: 32, offset: 384)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2097, file: !2098, line: 176, baseType: !2118, size: 64, offset: 448)
!2118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2119, size: 64)
!2119 = !DISubroutineType(types: !2120)
!2120 = !{!2102, !1908, !1459}
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2097, file: !2098, line: 177, baseType: !2122, size: 64, offset: 512)
!2122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2123, size: 64)
!2123 = !DISubroutineType(types: !2124)
!2124 = !{null, !1908, !2102}
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2097, file: !2098, line: 178, baseType: !1908, size: 64, offset: 576)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2097, file: !2098, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2097, file: !2098, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2097, file: !2098, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1981, file: !1604, line: 60, baseType: !2060, size: 128, offset: 384)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1981, file: !1604, line: 64, baseType: !2131, size: 64, offset: 512)
!2131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2132, size: 64)
!2132 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !2133, line: 33, flags: DIFlagFwdDecl)
!2133 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1981, file: !1604, line: 67, baseType: !1403, size: 64, offset: 576)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1981, file: !1604, line: 73, baseType: !1984, size: 64, offset: 640)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1981, file: !1604, line: 77, baseType: !2070, size: 64, offset: 704)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1981, file: !1604, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1981, file: !1604, line: 82, baseType: !2139, size: 320, offset: 832)
!2139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !591, line: 62, size: 320, elements: !2140)
!2140 = !{!2141, !2147, !2148, !2149, !2150, !2151}
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !2139, file: !591, line: 63, baseType: !2142, size: 64)
!2142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2143, size: 64)
!2143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !591, line: 56, size: 128, elements: !2144)
!2144 = !{!2145, !2146}
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2143, file: !591, line: 57, baseType: !2142, size: 64)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !2143, file: !591, line: 58, baseType: !1486, size: 8, offset: 64)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !2139, file: !591, line: 64, baseType: !7, size: 32, offset: 64)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !2139, file: !591, line: 66, baseType: !7, size: 32, offset: 96)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !2139, file: !591, line: 68, baseType: !1507, size: 8, offset: 128)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !2139, file: !591, line: 70, baseType: !1730, size: 64, offset: 192)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !2139, file: !591, line: 71, baseType: !1737, size: 64, offset: 256)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1653, file: !1654, line: 476, baseType: !2153, size: 64, offset: 256)
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1654, line: 476, flags: DIFlagFwdDecl)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1653, file: !1654, line: 479, baseType: !1984, size: 64, offset: 320)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1653, file: !1654, line: 484, baseType: !1403, size: 64, offset: 384)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1653, file: !1654, line: 488, baseType: !1403, size: 64, offset: 448)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1653, file: !1654, line: 493, baseType: !1403, size: 64, offset: 512)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1653, file: !1654, line: 496, baseType: !1403, size: 64, offset: 576)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1653, file: !1654, line: 501, baseType: !2161, size: 64, offset: 640)
!2161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2162, size: 64)
!2162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !201, line: 2355, size: 576, elements: !2163)
!2163 = !{!2164, !2167, !2168, !2169, !2170, !2172, !2173, !2178, !2179, !2180, !2181, !2182, !2183}
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2162, file: !201, line: 2356, baseType: !2165, size: 64)
!2165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2166, size: 64)
!2166 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !201, line: 2356, flags: DIFlagFwdDecl)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2162, file: !201, line: 2357, baseType: !1830, size: 64, offset: 64)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2162, file: !201, line: 2358, baseType: !1484, size: 32, offset: 128)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2162, file: !201, line: 2359, baseType: !1484, size: 32, offset: 160)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2162, file: !201, line: 2360, baseType: !2171, size: 128, offset: 192)
!2171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1484, size: 128, elements: !2110)
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2162, file: !201, line: 2364, baseType: !1484, size: 32, offset: 320)
