; ModuleID = 'tree-ssa-copy.c'
source_filename = "tree-ssa-copy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!759 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!760 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!761 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!762 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!763 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!764 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!765 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!766 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!767 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!768 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!769 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!770 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!771 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !773, line: 119, baseType: !7, size: 32, elements: !774)
!773 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !{!775, !776, !777, !778}
!775 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!776 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!777 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!778 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 170, baseType: !7, size: 32, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788}
!781 = !DIEnumerator(name: "LOOPS_HAVE_PREHEADERS", value: 1, isUnsigned: true)
!782 = !DIEnumerator(name: "LOOPS_HAVE_SIMPLE_LATCHES", value: 2, isUnsigned: true)
!783 = !DIEnumerator(name: "LOOPS_HAVE_MARKED_IRREDUCIBLE_REGIONS", value: 4, isUnsigned: true)
!784 = !DIEnumerator(name: "LOOPS_HAVE_RECORDED_EXITS", value: 8, isUnsigned: true)
!785 = !DIEnumerator(name: "LOOPS_MAY_HAVE_MULTIPLE_LATCHES", value: 16, isUnsigned: true)
!786 = !DIEnumerator(name: "LOOP_CLOSED_SSA", value: 32, isUnsigned: true)
!787 = !DIEnumerator(name: "LOOPS_NEED_FIXUP", value: 64, isUnsigned: true)
!788 = !DIEnumerator(name: "LOOPS_HAVE_FALLTHRU_PREHEADERS", value: 128, isUnsigned: true)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !343, line: 295, baseType: !7, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!791 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!792 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!793 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!794 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!795 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!796 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!797 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!798 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!799 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!800 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!801 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!802 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!806 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!807 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!808 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_prop_result", file: !810, line: 44, baseType: !7, size: 32, elements: !811)
!810 = !DIFile(filename: "./tree-ssa-propagate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!811 = !{!812, !813, !814}
!812 = !DIEnumerator(name: "SSA_PROP_NOT_INTERESTING", value: 0, isUnsigned: true)
!813 = !DIEnumerator(name: "SSA_PROP_INTERESTING", value: 1, isUnsigned: true)
!814 = !DIEnumerator(name: "SSA_PROP_VARYING", value: 2, isUnsigned: true)
!815 = !{!134, !816, !1100, !946, !1148, !2207, !1181, !1085, !2209, !7, !803, !913, !870}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !817, line: 56, baseType: !818)
!817 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !820)
!820 = !{!821, !854, !860, !873, !892, !903, !908, !919, !925, !939, !951, !989, !1537, !1565, !1582, !1583, !1588, !1597, !1603, !1608, !1612, !1616, !1858, !1905, !1911, !1917, !1924, !1937, !1951, !1968, !1980, !2002, !2017, !2189}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !819, file: !135, line: 3372, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !822, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !822, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !822, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !822, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !822, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !822, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !822, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !822, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !822, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !822, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !822, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !822, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !822, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !822, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !822, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !822, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !822, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !822, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !822, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !822, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !822, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !822, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !822, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !822, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !822, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !822, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !822, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !822, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !822, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !822, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !135, line: 3373, baseType: !855, size: 192)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !855, file: !135, line: 403, baseType: !822, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !855, file: !135, line: 404, baseType: !816, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !855, file: !135, line: 405, baseType: !816, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !819, file: !135, line: 3374, baseType: !861, size: 320)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !861, file: !135, line: 1385, baseType: !855, size: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !861, file: !135, line: 1386, baseType: !865, size: 128, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !866, line: 58, baseType: !867)
!866 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !866, line: 54, size: 128, elements: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !867, file: !866, line: 56, baseType: !870, size: 64)
!870 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !867, file: !866, line: 57, baseType: !872, size: 64, offset: 64)
!872 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !819, file: !135, line: 3375, baseType: !874, size: 256)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !135, line: 1398, baseType: !855, size: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !874, file: !135, line: 1399, baseType: !878, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !880, line: 52, size: 256, elements: !881)
!880 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!881 = !{!882, !883, !884, !885, !886, !887, !888}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !879, file: !880, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !879, file: !880, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !879, file: !880, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !879, file: !880, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !879, file: !880, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !879, file: !880, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !879, file: !880, line: 62, baseType: !889, size: 192, offset: 64)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 192, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 3)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !819, file: !135, line: 3376, baseType: !893, size: 256)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !135, line: 1409, baseType: !855, size: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !893, file: !135, line: 1410, baseType: !897, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !899, line: 27, size: 192, elements: !900)
!899 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !898, file: !899, line: 29, baseType: !865, size: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !898, file: !899, line: 30, baseType: !5, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !819, file: !135, line: 3377, baseType: !904, size: 256)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !135, line: 1438, baseType: !855, size: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !904, file: !135, line: 1439, baseType: !816, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !819, file: !135, line: 3378, baseType: !909, size: 256)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !910)
!910 = !{!911, !912, !914}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !135, line: 1419, baseType: !855, size: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !909, file: !135, line: 1420, baseType: !913, size: 32, offset: 192)
!913 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !909, file: !135, line: 1421, baseType: !915, size: 8, offset: 224)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 8, elements: !917)
!916 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!917 = !{!918}
!918 = !DISubrange(count: 1)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !819, file: !135, line: 3379, baseType: !920, size: 320)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !135, line: 1429, baseType: !855, size: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !920, file: !135, line: 1430, baseType: !816, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !920, file: !135, line: 1431, baseType: !816, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !819, file: !135, line: 3380, baseType: !926, size: 320)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !135, line: 1461, baseType: !855, size: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !926, file: !135, line: 1462, baseType: !930, size: 128, offset: 192)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !931, line: 31, size: 128, elements: !932)
!931 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!932 = !{!933, !937, !938}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !930, file: !931, line: 32, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !930, file: !931, line: 33, baseType: !7, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !930, file: !931, line: 34, baseType: !7, size: 32, offset: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !819, file: !135, line: 3381, baseType: !940, size: 384)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !941)
!941 = !{!942, !943, !948, !949, !950}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !135, line: 2508, baseType: !855, size: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !940, file: !135, line: 2509, baseType: !944, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !945, line: 58, baseType: !946)
!945 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !947, line: 44, baseType: !7)
!947 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!948 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !940, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !940, file: !135, line: 2511, baseType: !816, size: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !940, file: !135, line: 2512, baseType: !816, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !819, file: !135, line: 3382, baseType: !952, size: 896)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !135, line: 2653, baseType: !940, size: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !952, file: !135, line: 2654, baseType: !816, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !952, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !952, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !952, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !952, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !952, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !952, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !952, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !952, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !952, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !952, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !952, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !952, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !952, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !952, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !952, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !952, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !952, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !952, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !952, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !952, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !952, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !952, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !952, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !952, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !952, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !952, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !952, file: !135, line: 2705, baseType: !816, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !952, file: !135, line: 2706, baseType: !816, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !952, file: !135, line: 2707, baseType: !816, size: 64, offset: 704)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !952, file: !135, line: 2708, baseType: !816, size: 64, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !952, file: !135, line: 2711, baseType: !987, size: 64, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !819, file: !135, line: 3383, baseType: !990, size: 960)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !990, file: !135, line: 2757, baseType: !952, size: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !990, file: !135, line: 2758, baseType: !994, size: 64, offset: 896)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !817, line: 50, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !997, line: 240, size: 384, elements: !998)
!997 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !996, file: !997, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !996, file: !997, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !996, file: !997, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !996, file: !997, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !996, file: !997, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !996, file: !997, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !996, file: !997, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !996, file: !997, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !996, file: !997, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !996, file: !997, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !996, file: !997, line: 321, baseType: !1010, size: 320, offset: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !997, line: 315, size: 320, elements: !1011)
!1011 = !{!1012, !1470, !1472, !1535, !1536}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1010, file: !997, line: 316, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 64, elements: !917)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !997, line: 183, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !997, line: 166, size: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1022, !1023, !1031, !1032, !1044, !1047, !1109, !1110, !1447, !1460, !1467}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1015, file: !997, line: 168, baseType: !913, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1015, file: !997, line: 169, baseType: !7, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1015, file: !997, line: 170, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1015, file: !997, line: 171, baseType: !994, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1015, file: !997, line: 172, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !817, line: 53, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !997, line: 359, size: 128, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1026, file: !997, line: 360, baseType: !913, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1026, file: !997, line: 361, baseType: !1030, size: 64, offset: 64)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 64, elements: !917)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1015, file: !997, line: 173, baseType: !5, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1015, file: !997, line: 174, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !997, line: 133, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !997, line: 115, size: 32, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1034, file: !997, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1034, file: !997, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1034, file: !997, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1034, file: !997, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1034, file: !997, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1034, file: !997, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1034, file: !997, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1034, file: !997, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1015, file: !997, line: 175, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !997, line: 175, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1015, file: !997, line: 176, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1050, line: 75, size: 256, elements: !1051)
!1050 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1051 = !{!1052, !1066, !1067, !1068}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1049, file: !1050, line: 76, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1050, line: 68, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1050, line: 63, size: 320, elements: !1056)
!1056 = !{!1057, !1059, !1060, !1061}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !1050, line: 64, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1055, file: !1050, line: 65, baseType: !1058, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1055, file: !1050, line: 66, baseType: !7, size: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1055, file: !1050, line: 67, baseType: !1062, size: 128, offset: 192)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 128, elements: !1064)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1050, line: 29, baseType: !870)
!1064 = !{!1065}
!1065 = !DISubrange(count: 2)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1049, file: !1050, line: 77, baseType: !1053, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1049, file: !1050, line: 78, baseType: !7, size: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1049, file: !1050, line: 79, baseType: !1069, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1050, line: 49, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1050, line: 45, size: 832, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1071, file: !1050, line: 46, baseType: !1058, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1071, file: !1050, line: 47, baseType: !1048, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1071, file: !1050, line: 48, baseType: !1076, size: 704, offset: 128)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1077, line: 164, size: 704, elements: !1078)
!1077 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1078 = !{!1079, !1080, !1091, !1092, !1093, !1094, !1095, !1096, !1101, !1105, !1106, !1107, !1108}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1076, file: !1077, line: 166, baseType: !872, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1076, file: !1077, line: 167, baseType: !1081, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1077, line: 157, size: 192, elements: !1083)
!1083 = !{!1084, !1086, !1087}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1082, file: !1077, line: 159, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1082, file: !1077, line: 160, baseType: !1081, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1082, file: !1077, line: 161, baseType: !1088, size: 32, offset: 128)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 32, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 4)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1076, file: !1077, line: 168, baseType: !1085, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1076, file: !1077, line: 169, baseType: !1085, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1076, file: !1077, line: 170, baseType: !1085, size: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1076, file: !1077, line: 171, baseType: !872, size: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1076, file: !1077, line: 172, baseType: !913, size: 32, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1076, file: !1077, line: 176, baseType: !1097, size: 64, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!1081, !1100, !872}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1076, file: !1077, line: 177, baseType: !1102, size: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !1100, !1081}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1076, file: !1077, line: 178, baseType: !1100, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1076, file: !1077, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1076, file: !1077, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1076, file: !1077, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1015, file: !997, line: 177, baseType: !816, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1015, file: !997, line: 178, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !1113)
!1113 = !{!1114, !1359, !1360, !1361, !1417, !1421, !1422, !1423, !1441, !1442, !1443, !1444, !1445, !1446}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1112, file: !343, line: 219, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !1118)
!1118 = !{!1119}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1117, file: !343, line: 151, baseType: !1120, size: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1121, file: !343, line: 150, baseType: !7, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1121, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1121, file: !343, line: 150, baseType: !1126, size: 64, offset: 64)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 64, elements: !917)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !817, line: 108, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1129, file: !343, line: 124, baseType: !1111, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1129, file: !343, line: 125, baseType: !1111, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1129, file: !343, line: 131, baseType: !1134, size: 64, offset: 128)
!1134 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !1135)
!1135 = !{!1136, !1350}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1134, file: !343, line: 129, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !817, line: 66, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !1140)
!1140 = !{!1141, !1348, !1349}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1139, file: !391, line: 145, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !817, line: 69, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !1145)
!1145 = !{!1146, !1346, !1347}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1144, file: !391, line: 137, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !817, line: 58, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !1150)
!1150 = !{!1151, !1168, !1201, !1207, !1212, !1217, !1224, !1230, !1236, !1241, !1255, !1260, !1266, !1271, !1281, !1286, !1304, !1311, !1318, !1324, !1329, !1335, !1341}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1149, file: !391, line: 738, baseType: !1152, size: 256)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1152, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1152, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1152, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1152, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1152, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1152, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1152, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1152, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1152, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1152, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1152, file: !391, line: 316, baseType: !944, size: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1152, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1152, file: !391, line: 323, baseType: !1111, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1152, file: !391, line: 327, baseType: !816, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1149, file: !391, line: 739, baseType: !1169, size: 448)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !1170)
!1170 = !{!1171, !1199}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1169, file: !391, line: 353, baseType: !1172, size: 384)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !1173)
!1173 = !{!1174, !1175, !1182}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1172, file: !391, line: 336, baseType: !1152, size: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1172, file: !391, line: 343, baseType: !1176, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !773, line: 37, size: 128, elements: !1178)
!1178 = !{!1179, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1177, file: !773, line: 39, baseType: !1176, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1177, file: !773, line: 40, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1172, file: !391, line: 344, baseType: !1183, size: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !773, line: 45, size: 320, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1184, file: !773, line: 47, baseType: !1183, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1184, file: !773, line: 48, baseType: !1188, size: 256, offset: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1189)
!1189 = !{!1190, !1192, !1193, !1198}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1188, file: !135, line: 1884, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1188, file: !135, line: 1885, baseType: !1191, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1188, file: !135, line: 1891, baseType: !1194, size: 64, offset: 128)
!1194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1188, file: !135, line: 1891, size: 64, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1194, file: !135, line: 1891, baseType: !1147, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1194, file: !135, line: 1891, baseType: !816, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1188, file: !135, line: 1892, baseType: !1181, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1169, file: !391, line: 359, baseType: !1200, size: 64, offset: 384)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 64, elements: !917)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1149, file: !391, line: 740, baseType: !1202, size: 512)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1202, file: !391, line: 368, baseType: !1172, size: 384)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1202, file: !391, line: 373, baseType: !816, size: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1202, file: !391, line: 374, baseType: !816, size: 64, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1149, file: !391, line: 741, baseType: !1208, size: 576)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1208, file: !391, line: 383, baseType: !1202, size: 512)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1208, file: !391, line: 389, baseType: !1200, size: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1149, file: !391, line: 742, baseType: !1213, size: 320)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1213, file: !391, line: 397, baseType: !1152, size: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1213, file: !391, line: 400, baseType: !1137, size: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1149, file: !391, line: 743, baseType: !1218, size: 448)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1218, file: !391, line: 408, baseType: !1152, size: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1218, file: !391, line: 412, baseType: !816, size: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1218, file: !391, line: 420, baseType: !816, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1218, file: !391, line: 423, baseType: !1137, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1149, file: !391, line: 744, baseType: !1225, size: 384)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1225, file: !391, line: 431, baseType: !1152, size: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1225, file: !391, line: 434, baseType: !816, size: 64, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1225, file: !391, line: 437, baseType: !1137, size: 64, offset: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1149, file: !391, line: 745, baseType: !1231, size: 384)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1231, file: !391, line: 445, baseType: !1152, size: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1231, file: !391, line: 449, baseType: !816, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1231, file: !391, line: 453, baseType: !1137, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1149, file: !391, line: 746, baseType: !1237, size: 320)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1237, file: !391, line: 461, baseType: !1152, size: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1237, file: !391, line: 464, baseType: !816, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1149, file: !391, line: 747, baseType: !1242, size: 768)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1242, file: !391, line: 471, baseType: !1152, size: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1242, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1242, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1242, file: !391, line: 478, baseType: !816, size: 64, offset: 320)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1242, file: !391, line: 481, baseType: !1249, size: 384, offset: 384)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1250, size: 384, elements: !917)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1250, file: !135, line: 1920, baseType: !1188, size: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1250, file: !135, line: 1921, baseType: !816, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1250, file: !135, line: 1922, baseType: !944, size: 32, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1149, file: !391, line: 748, baseType: !1256, size: 320)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !1257)
!1257 = !{!1258, !1259}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1256, file: !391, line: 490, baseType: !1152, size: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1256, file: !391, line: 494, baseType: !913, size: 32, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1149, file: !391, line: 749, baseType: !1261, size: 384)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !1262)
!1262 = !{!1263, !1264, !1265}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1261, file: !391, line: 502, baseType: !1152, size: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1261, file: !391, line: 506, baseType: !1137, size: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1261, file: !391, line: 510, baseType: !1137, size: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1149, file: !391, line: 750, baseType: !1267, size: 320)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1267, file: !391, line: 531, baseType: !1152, size: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1267, file: !391, line: 540, baseType: !1137, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1149, file: !391, line: 751, baseType: !1272, size: 704)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !1273)
!1273 = !{!1274, !1275, !1276, !1277, !1278, !1279, !1280}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1272, file: !391, line: 549, baseType: !1202, size: 512)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1272, file: !391, line: 553, baseType: !1020, size: 64, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1272, file: !391, line: 557, baseType: !936, size: 8, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1272, file: !391, line: 558, baseType: !936, size: 8, offset: 584)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1272, file: !391, line: 559, baseType: !936, size: 8, offset: 592)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1272, file: !391, line: 560, baseType: !936, size: 8, offset: 600)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1272, file: !391, line: 566, baseType: !1200, size: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1149, file: !391, line: 752, baseType: !1282, size: 384)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !1283)
!1283 = !{!1284, !1285}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1282, file: !391, line: 573, baseType: !1213, size: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1282, file: !391, line: 577, baseType: !816, size: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1149, file: !391, line: 753, baseType: !1287, size: 576)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !1288)
!1288 = !{!1289, !1290, !1291, !1294, !1303}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1287, file: !391, line: 602, baseType: !1213, size: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1287, file: !391, line: 605, baseType: !816, size: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1287, file: !391, line: 609, baseType: !1292, size: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1293, line: 46, baseType: !870)
!1293 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1287, file: !391, line: 612, baseType: !1295, size: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1302}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1296, file: !391, line: 583, baseType: !134, size: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1296, file: !391, line: 586, baseType: !816, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1296, file: !391, line: 589, baseType: !816, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1296, file: !391, line: 592, baseType: !816, size: 64, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1296, file: !391, line: 595, baseType: !816, size: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1287, file: !391, line: 616, baseType: !1137, size: 64, offset: 512)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1149, file: !391, line: 754, baseType: !1305, size: 512)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1305, file: !391, line: 624, baseType: !1213, size: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1305, file: !391, line: 628, baseType: !816, size: 64, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1305, file: !391, line: 632, baseType: !816, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1305, file: !391, line: 636, baseType: !816, size: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1149, file: !391, line: 755, baseType: !1312, size: 704)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1312, file: !391, line: 644, baseType: !1305, size: 512)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1312, file: !391, line: 648, baseType: !816, size: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1312, file: !391, line: 652, baseType: !816, size: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1312, file: !391, line: 653, baseType: !816, size: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1149, file: !391, line: 756, baseType: !1319, size: 448)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !1320)
!1320 = !{!1321, !1322, !1323}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1319, file: !391, line: 665, baseType: !1213, size: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1319, file: !391, line: 668, baseType: !816, size: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1319, file: !391, line: 673, baseType: !816, size: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1149, file: !391, line: 757, baseType: !1325, size: 384)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !1326)
!1326 = !{!1327, !1328}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1325, file: !391, line: 696, baseType: !1213, size: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1325, file: !391, line: 699, baseType: !816, size: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1149, file: !391, line: 758, baseType: !1330, size: 384)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !1331)
!1331 = !{!1332, !1333, !1334}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1330, file: !391, line: 683, baseType: !1152, size: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1330, file: !391, line: 686, baseType: !816, size: 64, offset: 256)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1330, file: !391, line: 689, baseType: !816, size: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1149, file: !391, line: 759, baseType: !1336, size: 384)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1336, file: !391, line: 709, baseType: !1152, size: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1336, file: !391, line: 712, baseType: !816, size: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1336, file: !391, line: 712, baseType: !816, size: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1149, file: !391, line: 760, baseType: !1342, size: 320)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !1343)
!1343 = !{!1344, !1345}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1342, file: !391, line: 720, baseType: !1152, size: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1342, file: !391, line: 723, baseType: !816, size: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1144, file: !391, line: 138, baseType: !1143, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !391, line: 139, baseType: !1143, size: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1139, file: !391, line: 146, baseType: !1142, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1139, file: !391, line: 152, baseType: !1137, size: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1134, file: !343, line: 130, baseType: !994, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1129, file: !343, line: 134, baseType: !1100, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1129, file: !343, line: 137, baseType: !816, size: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1129, file: !343, line: 138, baseType: !944, size: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1129, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1129, file: !343, line: 144, baseType: !913, size: 32, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1129, file: !343, line: 145, baseType: !913, size: 32, offset: 416)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1129, file: !343, line: 146, baseType: !1358, size: 64, offset: 448)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !872)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1112, file: !343, line: 220, baseType: !1115, size: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1112, file: !343, line: 223, baseType: !1100, size: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1112, file: !343, line: 226, baseType: !1362, size: 64, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1369, !1374, !1375, !1376, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1407, !1415, !1416}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1363, file: !330, line: 102, baseType: !913, size: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1363, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1363, file: !330, line: 108, baseType: !1111, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1363, file: !330, line: 111, baseType: !1111, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1363, file: !330, line: 114, baseType: !1370, size: 64, offset: 192)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1370, file: !330, line: 42, baseType: !329, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1370, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1363, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1363, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1363, file: !330, line: 123, baseType: !1377, size: 64, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1379)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1380)
!1380 = !{!1381}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1379, file: !330, line: 87, baseType: !1382, size: 128)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1384)
!1384 = !{!1385, !1386, !1387}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1383, file: !330, line: 85, baseType: !7, size: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1383, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1383, file: !330, line: 85, baseType: !1388, size: 64, offset: 64)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1389, size: 64, elements: !917)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1362)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1363, file: !330, line: 126, baseType: !1362, size: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1363, file: !330, line: 129, baseType: !1362, size: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1363, file: !330, line: 132, baseType: !1100, size: 64, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1363, file: !330, line: 139, baseType: !816, size: 64, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1363, file: !330, line: 143, baseType: !865, size: 128, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1363, file: !330, line: 146, baseType: !865, size: 128, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1363, file: !330, line: 148, baseType: !936, size: 8, offset: 896)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1363, file: !330, line: 149, baseType: !936, size: 8, offset: 904)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1363, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1363, file: !330, line: 156, baseType: !1400, size: 64, offset: 960)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1402)
!1402 = !{!1403, !1404, !1405, !1406}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1401, file: !330, line: 50, baseType: !1147, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1401, file: !330, line: 59, baseType: !865, size: 128, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1401, file: !330, line: 64, baseType: !936, size: 8, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1401, file: !330, line: 67, baseType: !1400, size: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1363, file: !330, line: 159, baseType: !1408, size: 64, offset: 1024)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1409, file: !330, line: 74, baseType: !1128, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1409, file: !330, line: 77, baseType: !1408, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1409, file: !330, line: 78, baseType: !1408, size: 64, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1409, file: !330, line: 81, baseType: !1408, size: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1363, file: !330, line: 162, baseType: !936, size: 8, offset: 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1363, file: !330, line: 166, baseType: !816, size: 64, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1112, file: !343, line: 229, baseType: !1418, size: 128, offset: 256)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1419, size: 128, elements: !1064)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1112, file: !343, line: 232, baseType: !1111, size: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1112, file: !343, line: 233, baseType: !1111, size: 64, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1112, file: !343, line: 238, baseType: !1424, size: 64, offset: 512)
!1424 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1425)
!1425 = !{!1426, !1432}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1424, file: !343, line: 236, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1428, file: !343, line: 275, baseType: !1137, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1428, file: !343, line: 278, baseType: !1137, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1424, file: !343, line: 237, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1435)
!1435 = !{!1436, !1437, !1438, !1439, !1440}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1434, file: !343, line: 261, baseType: !994, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1434, file: !343, line: 262, baseType: !994, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1434, file: !343, line: 266, baseType: !994, size: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1434, file: !343, line: 267, baseType: !994, size: 64, offset: 192)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1434, file: !343, line: 270, baseType: !913, size: 32, offset: 256)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1112, file: !343, line: 241, baseType: !1358, size: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1112, file: !343, line: 244, baseType: !913, size: 32, offset: 640)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1112, file: !343, line: 247, baseType: !913, size: 32, offset: 672)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1112, file: !343, line: 250, baseType: !913, size: 32, offset: 704)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1112, file: !343, line: 253, baseType: !913, size: 32, offset: 736)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !343, line: 256, baseType: !913, size: 32, offset: 768)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1015, file: !997, line: 179, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !997, line: 150, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !997, line: 142, size: 320, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455, !1458, !1459}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1450, file: !997, line: 144, baseType: !816, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1450, file: !997, line: 145, baseType: !994, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1450, file: !997, line: 146, baseType: !994, size: 64, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1450, file: !997, line: 147, baseType: !1456, size: 32, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1457, line: 31, baseType: !913)
!1457 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1450, file: !997, line: 148, baseType: !7, size: 32, offset: 224)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1450, file: !997, line: 149, baseType: !936, size: 8, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1015, file: !997, line: 180, baseType: !1461, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !997, line: 162, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !997, line: 159, size: 128, elements: !1464)
!1464 = !{!1465, !1466}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1463, file: !997, line: 160, baseType: !816, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1463, file: !997, line: 161, baseType: !872, size: 64, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1015, file: !997, line: 181, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !997, line: 181, flags: DIFlagFwdDecl)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1010, file: !997, line: 317, baseType: !1471, size: 64)
!1471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 64, elements: !917)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1010, file: !997, line: 318, baseType: !1473, size: 320)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !997, line: 188, size: 320, elements: !1474)
!1474 = !{!1475, !1477, !1534}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1473, file: !997, line: 190, baseType: !1476, size: 192)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 192, elements: !890)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1473, file: !997, line: 193, baseType: !1478, size: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !997, line: 206, size: 320, elements: !1480)
!1480 = !{!1481, !1519, !1520, !1521, !1533}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1479, file: !997, line: 208, baseType: !1482, size: 64)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !817, line: 62, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1485, line: 538, size: 256, elements: !1486)
!1485 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1486 = !{!1487, !1491, !1497, !1510}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1484, file: !1485, line: 539, baseType: !1488, size: 32)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1485, line: 482, size: 32, elements: !1489)
!1489 = !{!1490}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1488, file: !1485, line: 484, baseType: !7, size: 32)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1484, file: !1485, line: 540, baseType: !1492, size: 192)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1485, line: 488, size: 192, elements: !1493)
!1493 = !{!1494, !1495, !1496}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1492, file: !1485, line: 489, baseType: !1488, size: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1492, file: !1485, line: 492, baseType: !1020, size: 64, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1492, file: !1485, line: 496, baseType: !816, size: 64, offset: 128)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1484, file: !1485, line: 541, baseType: !1498, size: 256)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1485, line: 504, size: 256, elements: !1499)
!1499 = !{!1500, !1501, !1508, !1509}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1498, file: !1485, line: 505, baseType: !1488, size: 32)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1498, file: !1485, line: 509, baseType: !1502, size: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1485, line: 501, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{null, !1506}
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1498, file: !1485, line: 510, baseType: !1506, size: 64, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1498, file: !1485, line: 513, baseType: !1482, size: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1484, file: !1485, line: 542, baseType: !1511, size: 128)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1485, line: 530, size: 128, elements: !1512)
!1512 = !{!1513, !1514}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1511, file: !1485, line: 531, baseType: !1488, size: 32)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1511, file: !1485, line: 534, baseType: !1515, size: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1485, line: 525, baseType: !1516)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!936, !816, !1020, !870, !870}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1479, file: !997, line: 211, baseType: !7, size: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1479, file: !997, line: 214, baseType: !872, size: 64, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1479, file: !997, line: 224, baseType: !1522, size: 64, offset: 192)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !997, line: 202, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !997, line: 202, size: 128, elements: !1525)
!1525 = !{!1526}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1524, file: !997, line: 202, baseType: !1527, size: 128)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !997, line: 200, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !997, line: 200, size: 128, elements: !1529)
!1529 = !{!1530, !1531, !1532}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1528, file: !997, line: 200, baseType: !7, size: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1528, file: !997, line: 200, baseType: !7, size: 32, offset: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1528, file: !997, line: 200, baseType: !1030, size: 64, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1479, file: !997, line: 234, baseType: !1522, size: 64, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1473, file: !997, line: 197, baseType: !872, size: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1010, file: !997, line: 319, baseType: !879, size: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1010, file: !997, line: 320, baseType: !898, size: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !819, file: !135, line: 3384, baseType: !1538, size: 1472)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1539)
!1539 = !{!1540, !1561, !1562, !1563, !1564}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1538, file: !135, line: 3115, baseType: !1541, size: 1216)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1542)
!1542 = !{!1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1541, file: !135, line: 2985, baseType: !990, size: 960)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1541, file: !135, line: 2986, baseType: !816, size: 64, offset: 960)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1541, file: !135, line: 2987, baseType: !816, size: 64, offset: 1024)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1541, file: !135, line: 2988, baseType: !816, size: 64, offset: 1088)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1541, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1541, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1541, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1541, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1541, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1541, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1541, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1541, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1541, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1541, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1541, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1541, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1541, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1541, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1538, file: !135, line: 3117, baseType: !816, size: 64, offset: 1216)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1538, file: !135, line: 3119, baseType: !816, size: 64, offset: 1280)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1538, file: !135, line: 3121, baseType: !816, size: 64, offset: 1344)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1538, file: !135, line: 3123, baseType: !816, size: 64, offset: 1408)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !819, file: !135, line: 3385, baseType: !1566, size: 1088)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1567)
!1567 = !{!1568, !1569, !1570}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1566, file: !135, line: 2875, baseType: !990, size: 960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1566, file: !135, line: 2876, baseType: !994, size: 64, offset: 960)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1566, file: !135, line: 2877, baseType: !1571, size: 64, offset: 1024)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1573, line: 172, size: 128, elements: !1574)
!1573 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1574 = !{!1575, !1576, !1577, !1578, !1579, !1580, !1581}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1572, file: !1573, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1572, file: !1573, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1572, file: !1573, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1572, file: !1573, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1572, file: !1573, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1572, file: !1573, line: 195, baseType: !7, size: 32, offset: 32)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1572, file: !1573, line: 199, baseType: !816, size: 64, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !819, file: !135, line: 3386, baseType: !1541, size: 1216)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !819, file: !135, line: 3387, baseType: !1584, size: 1280)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1585)
!1585 = !{!1586, !1587}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1584, file: !135, line: 3094, baseType: !1541, size: 1216)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1584, file: !135, line: 3095, baseType: !1571, size: 64, offset: 1216)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !819, file: !135, line: 3388, baseType: !1589, size: 1216)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1590)
!1590 = !{!1591, !1592, !1593, !1594, !1595, !1596}
