; ModuleID = 'langhooks.c'
source_filename = "langhooks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!1115 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_GUIDED_NEXT", value: 676, isUnsigned: true)
!1116 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_RUNTIME_NEXT", value: 677, isUnsigned: true)
!1117 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_START", value: 678, isUnsigned: true)
!1118 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_START", value: 679, isUnsigned: true)
!1119 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_START", value: 680, isUnsigned: true)
!1120 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_START", value: 681, isUnsigned: true)
!1121 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_START", value: 682, isUnsigned: true)
!1122 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_START", value: 683, isUnsigned: true)
!1123 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_START", value: 684, isUnsigned: true)
!1124 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_START", value: 685, isUnsigned: true)
!1125 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_NEXT", value: 686, isUnsigned: true)
!1126 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_NEXT", value: 687, isUnsigned: true)
!1127 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_NEXT", value: 688, isUnsigned: true)
!1128 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_NEXT", value: 689, isUnsigned: true)
!1129 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_NEXT", value: 690, isUnsigned: true)
!1130 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1131 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1132 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1133 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1134 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1135 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1136 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1137 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1138 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1139 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1140 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1141 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1142 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1143 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1144 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1145 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1146 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1147 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1148 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1149 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1150 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1151 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1152 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1153 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1154 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1155 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1156 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "attribute_flags", file: !135, line: 4092, baseType: !7, size: 32, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DIEnumerator(name: "ATTR_FLAG_DECL_NEXT", value: 1, isUnsigned: true)
!1160 = !DIEnumerator(name: "ATTR_FLAG_FUNCTION_NEXT", value: 2, isUnsigned: true)
!1161 = !DIEnumerator(name: "ATTR_FLAG_ARRAY_NEXT", value: 4, isUnsigned: true)
!1162 = !DIEnumerator(name: "ATTR_FLAG_TYPE_IN_PLACE", value: 8, isUnsigned: true)
!1163 = !DIEnumerator(name: "ATTR_FLAG_BUILT_IN", value: 16, isUnsigned: true)
!1164 = !{!1165, !1448, !134, !1368, !1433, !1219, !398, !1530, !1294, !437}
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1166, line: 56, baseType: !1167)
!1166 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1169)
!1169 = !{!1170, !1203, !1209, !1222, !1241, !1252, !1257, !1267, !1273, !1287, !1299, !1337, !1833, !1861, !1869, !1870, !1875, !1884, !1890, !1895, !1899, !1903, !2077, !2124, !2130, !2136, !2143, !2154, !2179, !2196, !2208, !2230, !2245, !2417}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1168, file: !135, line: 3372, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1171, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1171, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1171, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1171, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1171, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1171, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1171, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1171, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1171, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1171, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1171, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1171, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1171, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1171, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1171, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1171, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1171, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1171, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1171, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1171, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1171, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1171, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1171, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1171, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1171, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1171, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1171, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1171, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1171, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1171, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !135, line: 3373, baseType: !1204, size: 192)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1204, file: !135, line: 403, baseType: !1171, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1204, file: !135, line: 404, baseType: !1165, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1204, file: !135, line: 405, baseType: !1165, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1168, file: !135, line: 3374, baseType: !1210, size: 320)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1210, file: !135, line: 1385, baseType: !1204, size: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1210, file: !135, line: 1386, baseType: !1214, size: 128, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1215, line: 58, baseType: !1216)
!1215 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1215, line: 54, size: 128, elements: !1217)
!1217 = !{!1218, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1216, file: !1215, line: 56, baseType: !1219, size: 64)
!1219 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1216, file: !1215, line: 57, baseType: !1221, size: 64, offset: 64)
!1221 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1168, file: !135, line: 3375, baseType: !1223, size: 256)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1224)
!1224 = !{!1225, !1226}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1223, file: !135, line: 1398, baseType: !1204, size: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1223, file: !135, line: 1399, baseType: !1227, size: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1229, line: 52, size: 256, elements: !1230)
!1229 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1228, file: !1229, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1228, file: !1229, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1228, file: !1229, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1228, file: !1229, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1228, file: !1229, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1228, file: !1229, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1228, file: !1229, line: 62, baseType: !1238, size: 192, offset: 64)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1219, size: 192, elements: !1239)
!1239 = !{!1240}
!1240 = !DISubrange(count: 3)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1168, file: !135, line: 3376, baseType: !1242, size: 256)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1242, file: !135, line: 1409, baseType: !1204, size: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1242, file: !135, line: 1410, baseType: !1246, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1248, line: 27, size: 192, elements: !1249)
!1248 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !1248, line: 29, baseType: !1214, size: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1247, file: !1248, line: 30, baseType: !5, size: 32, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1168, file: !135, line: 3377, baseType: !1253, size: 256)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1253, file: !135, line: 1438, baseType: !1204, size: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1253, file: !135, line: 1439, baseType: !1165, size: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1168, file: !135, line: 3378, baseType: !1258, size: 256)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1258, file: !135, line: 1419, baseType: !1204, size: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1258, file: !135, line: 1420, baseType: !398, size: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1258, file: !135, line: 1421, baseType: !1263, size: 8, offset: 224)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 8, elements: !1265)
!1264 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1265 = !{!1266}
!1266 = !DISubrange(count: 1)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1168, file: !135, line: 3379, baseType: !1268, size: 320)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1268, file: !135, line: 1429, baseType: !1204, size: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1268, file: !135, line: 1430, baseType: !1165, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1268, file: !135, line: 1431, baseType: !1165, size: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1168, file: !135, line: 3380, baseType: !1274, size: 320)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1274, file: !135, line: 1461, baseType: !1204, size: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1274, file: !135, line: 1462, baseType: !1278, size: 128, offset: 192)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1279, line: 31, size: 128, elements: !1280)
!1279 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1280 = !{!1281, !1285, !1286}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1278, file: !1279, line: 32, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1278, file: !1279, line: 33, baseType: !7, size: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1278, file: !1279, line: 34, baseType: !7, size: 32, offset: 96)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1168, file: !135, line: 3381, baseType: !1288, size: 384)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1289)
!1289 = !{!1290, !1291, !1296, !1297, !1298}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1288, file: !135, line: 2508, baseType: !1204, size: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1288, file: !135, line: 2509, baseType: !1292, size: 32, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1293, line: 58, baseType: !1294)
!1293 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1295, line: 44, baseType: !7)
!1295 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1288, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !135, line: 2511, baseType: !1165, size: 64, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1288, file: !135, line: 2512, baseType: !1165, size: 64, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1168, file: !135, line: 3382, baseType: !1300, size: 896)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !135, line: 2653, baseType: !1288, size: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1300, file: !135, line: 2654, baseType: !1165, size: 64, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1300, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1300, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1300, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1300, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1300, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1300, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1300, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1300, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1300, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1300, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1300, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1300, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1300, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1300, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1300, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1300, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1300, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1300, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1300, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1300, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1300, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1300, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1300, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1300, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1300, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1300, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1300, file: !135, line: 2705, baseType: !1165, size: 64, offset: 576)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1300, file: !135, line: 2706, baseType: !1165, size: 64, offset: 640)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1300, file: !135, line: 2707, baseType: !1165, size: 64, offset: 704)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1300, file: !135, line: 2708, baseType: !1165, size: 64, offset: 768)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1300, file: !135, line: 2711, baseType: !1335, size: 64, offset: 832)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1168, file: !135, line: 3383, baseType: !1338, size: 960)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1339)
!1339 = !{!1340, !1341}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1338, file: !135, line: 2757, baseType: !1300, size: 896)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1338, file: !135, line: 2758, baseType: !1342, size: 64, offset: 896)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1166, line: 50, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1345, line: 240, size: 384, elements: !1346)
!1345 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1346 = !{!1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1344, file: !1345, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1344, file: !1345, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1344, file: !1345, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1344, file: !1345, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1344, file: !1345, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1344, file: !1345, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1344, file: !1345, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1344, file: !1345, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1344, file: !1345, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1344, file: !1345, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1344, file: !1345, line: 321, baseType: !1358, size: 320, offset: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1345, line: 315, size: 320, elements: !1359)
!1359 = !{!1360, !1766, !1768, !1831, !1832}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1358, file: !1345, line: 316, baseType: !1361, size: 64)
!1361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1362, size: 64, elements: !1265)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1345, line: 183, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1345, line: 166, size: 64, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1370, !1371, !1379, !1380, !1392, !1395, !1457, !1458, !1743, !1756, !1763}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1363, file: !1345, line: 168, baseType: !398, size: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1363, file: !1345, line: 169, baseType: !7, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1363, file: !1345, line: 170, baseType: !1368, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1363, file: !1345, line: 171, baseType: !1342, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1363, file: !1345, line: 172, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1166, line: 53, baseType: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1345, line: 359, size: 128, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1374, file: !1345, line: 360, baseType: !398, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1374, file: !1345, line: 361, baseType: !1378, size: 64, offset: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1342, size: 64, elements: !1265)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1363, file: !1345, line: 173, baseType: !5, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1363, file: !1345, line: 174, baseType: !1381, size: 32)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1345, line: 133, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1345, line: 115, size: 32, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1382, file: !1345, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1382, file: !1345, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1382, file: !1345, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1382, file: !1345, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1382, file: !1345, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1382, file: !1345, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1382, file: !1345, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1382, file: !1345, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1363, file: !1345, line: 175, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1345, line: 175, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1363, file: !1345, line: 176, baseType: !1396, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1398, line: 75, size: 256, elements: !1399)
!1398 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1399 = !{!1400, !1414, !1415, !1416}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1397, file: !1398, line: 76, baseType: !1401, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1398, line: 68, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1398, line: 63, size: 320, elements: !1404)
!1404 = !{!1405, !1407, !1408, !1409}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1403, file: !1398, line: 64, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1403, file: !1398, line: 65, baseType: !1406, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1403, file: !1398, line: 66, baseType: !7, size: 32, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1403, file: !1398, line: 67, baseType: !1410, size: 128, offset: 192)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1411, size: 128, elements: !1412)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1398, line: 29, baseType: !1219)
!1412 = !{!1413}
!1413 = !DISubrange(count: 2)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1397, file: !1398, line: 77, baseType: !1401, size: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1397, file: !1398, line: 78, baseType: !7, size: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1397, file: !1398, line: 79, baseType: !1417, size: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1398, line: 49, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1398, line: 45, size: 832, elements: !1420)
!1420 = !{!1421, !1422, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1419, file: !1398, line: 46, baseType: !1406, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1419, file: !1398, line: 47, baseType: !1396, size: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1419, file: !1398, line: 48, baseType: !1424, size: 704, offset: 128)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1425, line: 164, size: 704, elements: !1426)
!1425 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1426 = !{!1427, !1428, !1439, !1440, !1441, !1442, !1443, !1444, !1449, !1453, !1454, !1455, !1456}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1424, file: !1425, line: 166, baseType: !1221, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1424, file: !1425, line: 167, baseType: !1429, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1425, line: 157, size: 192, elements: !1431)
!1431 = !{!1432, !1434, !1435}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1430, file: !1425, line: 159, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1430, file: !1425, line: 160, baseType: !1429, size: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1430, file: !1425, line: 161, baseType: !1436, size: 32, offset: 128)
!1436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 32, elements: !1437)
!1437 = !{!1438}
!1438 = !DISubrange(count: 4)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1424, file: !1425, line: 168, baseType: !1433, size: 64, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1424, file: !1425, line: 169, baseType: !1433, size: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1424, file: !1425, line: 170, baseType: !1433, size: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1424, file: !1425, line: 171, baseType: !1221, size: 64, offset: 320)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1424, file: !1425, line: 172, baseType: !398, size: 32, offset: 384)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1424, file: !1425, line: 176, baseType: !1445, size: 64, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!1429, !1448, !1221}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1424, file: !1425, line: 177, baseType: !1450, size: 64, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !1448, !1429}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1424, file: !1425, line: 178, baseType: !1448, size: 64, offset: 576)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1424, file: !1425, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1424, file: !1425, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1424, file: !1425, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1363, file: !1345, line: 177, baseType: !1165, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1363, file: !1345, line: 178, baseType: !1459, size: 64)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !1461)
!1461 = !{!1462, !1708, !1709, !1710, !1713, !1717, !1718, !1719, !1737, !1738, !1739, !1740, !1741, !1742}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1460, file: !330, line: 219, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !1466)
!1466 = !{!1467}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1465, file: !330, line: 151, baseType: !1468, size: 128)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !1470)
!1470 = !{!1471, !1472, !1473}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1469, file: !330, line: 150, baseType: !7, size: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1469, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1469, file: !330, line: 150, baseType: !1474, size: 64, offset: 64)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1475, size: 64, elements: !1265)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1166, line: 108, baseType: !1476)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !1478)
!1478 = !{!1479, !1480, !1481, !1700, !1701, !1702, !1703, !1704, !1705, !1706}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1477, file: !330, line: 124, baseType: !1459, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1477, file: !330, line: 125, baseType: !1459, size: 64, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1477, file: !330, line: 131, baseType: !1482, size: 64, offset: 128)
!1482 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !1483)
!1483 = !{!1484, !1699}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1482, file: !330, line: 129, baseType: !1485, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1166, line: 66, baseType: !1486)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !397, line: 143, size: 192, elements: !1488)
!1488 = !{!1489, !1697, !1698}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1487, file: !397, line: 145, baseType: !1490, size: 64)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1166, line: 69, baseType: !1491)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !397, line: 136, size: 192, elements: !1493)
!1493 = !{!1494, !1695, !1696}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1492, file: !397, line: 137, baseType: !1495, size: 64)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1166, line: 58, baseType: !1496)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !397, line: 737, size: 768, elements: !1498)
!1498 = !{!1499, !1516, !1550, !1556, !1561, !1566, !1573, !1579, !1585, !1590, !1604, !1609, !1615, !1620, !1630, !1635, !1653, !1660, !1667, !1673, !1678, !1684, !1690}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1497, file: !397, line: 738, baseType: !1500, size: 256)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !397, line: 271, size: 256, elements: !1501)
!1501 = !{!1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1500, file: !397, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1500, file: !397, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1500, file: !397, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1500, file: !397, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1500, file: !397, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1500, file: !397, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1500, file: !397, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1500, file: !397, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1500, file: !397, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1500, file: !397, line: 312, baseType: !7, size: 32, offset: 32)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1500, file: !397, line: 316, baseType: !1292, size: 32, offset: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1500, file: !397, line: 319, baseType: !7, size: 32, offset: 96)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1500, file: !397, line: 323, baseType: !1459, size: 64, offset: 128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1500, file: !397, line: 327, baseType: !1165, size: 64, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1497, file: !397, line: 739, baseType: !1517, size: 448)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !397, line: 350, size: 448, elements: !1518)
!1518 = !{!1519, !1548}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1517, file: !397, line: 353, baseType: !1520, size: 384)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !397, line: 333, size: 384, elements: !1521)
!1521 = !{!1522, !1523, !1531}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1520, file: !397, line: 336, baseType: !1500, size: 256)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1520, file: !397, line: 343, baseType: !1524, size: 64, offset: 256)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1526, line: 37, size: 128, elements: !1527)
!1526 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1527 = !{!1528, !1529}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1525, file: !1526, line: 39, baseType: !1524, size: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1525, file: !1526, line: 40, baseType: !1530, size: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1520, file: !397, line: 344, baseType: !1532, size: 64, offset: 320)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1526, line: 45, size: 320, elements: !1534)
!1534 = !{!1535, !1536}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1533, file: !1526, line: 47, baseType: !1532, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1533, file: !1526, line: 48, baseType: !1537, size: 256, offset: 64)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1538)
!1538 = !{!1539, !1541, !1542, !1547}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1537, file: !135, line: 1884, baseType: !1540, size: 64)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1537, file: !135, line: 1885, baseType: !1540, size: 64, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1537, file: !135, line: 1891, baseType: !1543, size: 64, offset: 128)
!1543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1537, file: !135, line: 1891, size: 64, elements: !1544)
!1544 = !{!1545, !1546}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1543, file: !135, line: 1891, baseType: !1495, size: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1543, file: !135, line: 1891, baseType: !1165, size: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1537, file: !135, line: 1892, baseType: !1530, size: 64, offset: 192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1517, file: !397, line: 359, baseType: !1549, size: 64, offset: 384)
!1549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 64, elements: !1265)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1497, file: !397, line: 740, baseType: !1551, size: 512)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !397, line: 365, size: 512, elements: !1552)
!1552 = !{!1553, !1554, !1555}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1551, file: !397, line: 368, baseType: !1520, size: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1551, file: !397, line: 373, baseType: !1165, size: 64, offset: 384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1551, file: !397, line: 374, baseType: !1165, size: 64, offset: 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1497, file: !397, line: 741, baseType: !1557, size: 576)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !397, line: 380, size: 576, elements: !1558)
!1558 = !{!1559, !1560}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1557, file: !397, line: 383, baseType: !1551, size: 512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1557, file: !397, line: 389, baseType: !1549, size: 64, offset: 512)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1497, file: !397, line: 742, baseType: !1562, size: 320)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !397, line: 395, size: 320, elements: !1563)
!1563 = !{!1564, !1565}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1562, file: !397, line: 397, baseType: !1500, size: 256)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1562, file: !397, line: 400, baseType: !1485, size: 64, offset: 256)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1497, file: !397, line: 743, baseType: !1567, size: 448)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !397, line: 406, size: 448, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1572}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1567, file: !397, line: 408, baseType: !1500, size: 256)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1567, file: !397, line: 412, baseType: !1165, size: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1567, file: !397, line: 420, baseType: !1165, size: 64, offset: 320)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1567, file: !397, line: 423, baseType: !1485, size: 64, offset: 384)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1497, file: !397, line: 744, baseType: !1574, size: 384)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !397, line: 429, size: 384, elements: !1575)
!1575 = !{!1576, !1577, !1578}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1574, file: !397, line: 431, baseType: !1500, size: 256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1574, file: !397, line: 434, baseType: !1165, size: 64, offset: 256)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1574, file: !397, line: 437, baseType: !1485, size: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1497, file: !397, line: 745, baseType: !1580, size: 384)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !397, line: 443, size: 384, elements: !1581)
!1581 = !{!1582, !1583, !1584}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1580, file: !397, line: 445, baseType: !1500, size: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1580, file: !397, line: 449, baseType: !1165, size: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1580, file: !397, line: 453, baseType: !1485, size: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1497, file: !397, line: 746, baseType: !1586, size: 320)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !397, line: 459, size: 320, elements: !1587)
!1587 = !{!1588, !1589}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1586, file: !397, line: 461, baseType: !1500, size: 256)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1586, file: !397, line: 464, baseType: !1165, size: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1497, file: !397, line: 747, baseType: !1591, size: 768)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !397, line: 469, size: 768, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596, !1597}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1591, file: !397, line: 471, baseType: !1500, size: 256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1591, file: !397, line: 474, baseType: !7, size: 32, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1591, file: !397, line: 475, baseType: !7, size: 32, offset: 288)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1591, file: !397, line: 478, baseType: !1165, size: 64, offset: 320)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1591, file: !397, line: 481, baseType: !1598, size: 384, offset: 384)
!1598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1599, size: 384, elements: !1265)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1600)
!1600 = !{!1601, !1602, !1603}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1599, file: !135, line: 1920, baseType: !1537, size: 256)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1599, file: !135, line: 1921, baseType: !1165, size: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1599, file: !135, line: 1922, baseType: !1292, size: 32, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1497, file: !397, line: 748, baseType: !1605, size: 320)
!1605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !397, line: 487, size: 320, elements: !1606)
!1606 = !{!1607, !1608}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1605, file: !397, line: 490, baseType: !1500, size: 256)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1605, file: !397, line: 494, baseType: !398, size: 32, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1497, file: !397, line: 749, baseType: !1610, size: 384)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !397, line: 500, size: 384, elements: !1611)
!1611 = !{!1612, !1613, !1614}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1610, file: !397, line: 502, baseType: !1500, size: 256)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1610, file: !397, line: 506, baseType: !1485, size: 64, offset: 256)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1610, file: !397, line: 510, baseType: !1485, size: 64, offset: 320)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1497, file: !397, line: 750, baseType: !1616, size: 320)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !397, line: 529, size: 320, elements: !1617)
!1617 = !{!1618, !1619}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1616, file: !397, line: 531, baseType: !1500, size: 256)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1616, file: !397, line: 540, baseType: !1485, size: 64, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1497, file: !397, line: 751, baseType: !1621, size: 704)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !397, line: 546, size: 704, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1629}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1621, file: !397, line: 549, baseType: !1551, size: 512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1621, file: !397, line: 553, baseType: !1368, size: 64, offset: 512)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1621, file: !397, line: 557, baseType: !1284, size: 8, offset: 576)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1621, file: !397, line: 558, baseType: !1284, size: 8, offset: 584)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1621, file: !397, line: 559, baseType: !1284, size: 8, offset: 592)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1621, file: !397, line: 560, baseType: !1284, size: 8, offset: 600)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1621, file: !397, line: 566, baseType: !1549, size: 64, offset: 640)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1497, file: !397, line: 752, baseType: !1631, size: 384)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !397, line: 571, size: 384, elements: !1632)
!1632 = !{!1633, !1634}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1631, file: !397, line: 573, baseType: !1562, size: 320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1631, file: !397, line: 577, baseType: !1165, size: 64, offset: 320)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1497, file: !397, line: 753, baseType: !1636, size: 576)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !397, line: 600, size: 576, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1643, !1652}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1636, file: !397, line: 602, baseType: !1562, size: 320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1636, file: !397, line: 605, baseType: !1165, size: 64, offset: 320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1636, file: !397, line: 609, baseType: !1641, size: 64, offset: 384)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1642, line: 46, baseType: !1219)
!1642 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1636, file: !397, line: 612, baseType: !1644, size: 64, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !397, line: 581, size: 320, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1651}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1645, file: !397, line: 583, baseType: !134, size: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1645, file: !397, line: 586, baseType: !1165, size: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1645, file: !397, line: 589, baseType: !1165, size: 64, offset: 128)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1645, file: !397, line: 592, baseType: !1165, size: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1645, file: !397, line: 595, baseType: !1165, size: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1636, file: !397, line: 616, baseType: !1485, size: 64, offset: 512)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1497, file: !397, line: 754, baseType: !1654, size: 512)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !397, line: 622, size: 512, elements: !1655)
!1655 = !{!1656, !1657, !1658, !1659}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1654, file: !397, line: 624, baseType: !1562, size: 320)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1654, file: !397, line: 628, baseType: !1165, size: 64, offset: 320)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1654, file: !397, line: 632, baseType: !1165, size: 64, offset: 384)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1654, file: !397, line: 636, baseType: !1165, size: 64, offset: 448)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1497, file: !397, line: 755, baseType: !1661, size: 704)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !397, line: 642, size: 704, elements: !1662)
!1662 = !{!1663, !1664, !1665, !1666}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1661, file: !397, line: 644, baseType: !1654, size: 512)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1661, file: !397, line: 648, baseType: !1165, size: 64, offset: 512)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1661, file: !397, line: 652, baseType: !1165, size: 64, offset: 576)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1661, file: !397, line: 653, baseType: !1165, size: 64, offset: 640)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1497, file: !397, line: 756, baseType: !1668, size: 448)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !397, line: 663, size: 448, elements: !1669)
!1669 = !{!1670, !1671, !1672}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1668, file: !397, line: 665, baseType: !1562, size: 320)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1668, file: !397, line: 668, baseType: !1165, size: 64, offset: 320)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1668, file: !397, line: 673, baseType: !1165, size: 64, offset: 384)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1497, file: !397, line: 757, baseType: !1674, size: 384)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !397, line: 694, size: 384, elements: !1675)
!1675 = !{!1676, !1677}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1674, file: !397, line: 696, baseType: !1562, size: 320)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1674, file: !397, line: 699, baseType: !1165, size: 64, offset: 320)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1497, file: !397, line: 758, baseType: !1679, size: 384)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !397, line: 681, size: 384, elements: !1680)
!1680 = !{!1681, !1682, !1683}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1679, file: !397, line: 683, baseType: !1500, size: 256)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1679, file: !397, line: 686, baseType: !1165, size: 64, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1679, file: !397, line: 689, baseType: !1165, size: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1497, file: !397, line: 759, baseType: !1685, size: 384)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !397, line: 707, size: 384, elements: !1686)
!1686 = !{!1687, !1688, !1689}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1685, file: !397, line: 709, baseType: !1500, size: 256)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1685, file: !397, line: 712, baseType: !1165, size: 64, offset: 256)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1685, file: !397, line: 712, baseType: !1165, size: 64, offset: 320)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1497, file: !397, line: 760, baseType: !1691, size: 320)
!1691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !397, line: 718, size: 320, elements: !1692)
!1692 = !{!1693, !1694}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1691, file: !397, line: 720, baseType: !1500, size: 256)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1691, file: !397, line: 723, baseType: !1165, size: 64, offset: 256)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1492, file: !397, line: 138, baseType: !1491, size: 64, offset: 64)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1492, file: !397, line: 139, baseType: !1491, size: 64, offset: 128)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1487, file: !397, line: 146, baseType: !1490, size: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1487, file: !397, line: 152, baseType: !1485, size: 64, offset: 128)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1482, file: !330, line: 130, baseType: !1342, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1477, file: !330, line: 134, baseType: !1448, size: 64, offset: 192)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1477, file: !330, line: 137, baseType: !1165, size: 64, offset: 256)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1477, file: !330, line: 138, baseType: !1292, size: 32, offset: 320)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1477, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1477, file: !330, line: 144, baseType: !398, size: 32, offset: 384)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1477, file: !330, line: 145, baseType: !398, size: 32, offset: 416)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1477, file: !330, line: 146, baseType: !1707, size: 64, offset: 448)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !1221)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1460, file: !330, line: 220, baseType: !1463, size: 64, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1460, file: !330, line: 223, baseType: !1448, size: 64, offset: 128)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1460, file: !330, line: 226, baseType: !1711, size: 64, offset: 192)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64)
!1712 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1460, file: !330, line: 229, baseType: !1714, size: 128, offset: 256)
!1714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1715, size: 128, elements: !1412)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1460, file: !330, line: 232, baseType: !1459, size: 64, offset: 384)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1460, file: !330, line: 233, baseType: !1459, size: 64, offset: 448)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1460, file: !330, line: 238, baseType: !1720, size: 64, offset: 512)
!1720 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1721)
!1721 = !{!1722, !1728}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1720, file: !330, line: 236, baseType: !1723, size: 64)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1725)
!1725 = !{!1726, !1727}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1724, file: !330, line: 275, baseType: !1485, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1724, file: !330, line: 278, baseType: !1485, size: 64, offset: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1720, file: !330, line: 237, baseType: !1729, size: 64)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1731)
!1731 = !{!1732, !1733, !1734, !1735, !1736}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1730, file: !330, line: 261, baseType: !1342, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1730, file: !330, line: 262, baseType: !1342, size: 64, offset: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1730, file: !330, line: 266, baseType: !1342, size: 64, offset: 128)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1730, file: !330, line: 267, baseType: !1342, size: 64, offset: 192)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1730, file: !330, line: 270, baseType: !398, size: 32, offset: 256)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1460, file: !330, line: 241, baseType: !1707, size: 64, offset: 576)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1460, file: !330, line: 244, baseType: !398, size: 32, offset: 640)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1460, file: !330, line: 247, baseType: !398, size: 32, offset: 672)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1460, file: !330, line: 250, baseType: !398, size: 32, offset: 704)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1460, file: !330, line: 253, baseType: !398, size: 32, offset: 736)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1460, file: !330, line: 256, baseType: !398, size: 32, offset: 768)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1363, file: !1345, line: 179, baseType: !1744, size: 64)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1345, line: 150, baseType: !1746)
!1746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1345, line: 142, size: 320, elements: !1747)
!1747 = !{!1748, !1749, !1750, !1751, !1754, !1755}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1746, file: !1345, line: 144, baseType: !1165, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1746, file: !1345, line: 145, baseType: !1342, size: 64, offset: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1746, file: !1345, line: 146, baseType: !1342, size: 64, offset: 128)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1746, file: !1345, line: 147, baseType: !1752, size: 32, offset: 192)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1753, line: 31, baseType: !398)
!1753 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1746, file: !1345, line: 148, baseType: !7, size: 32, offset: 224)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1746, file: !1345, line: 149, baseType: !1284, size: 8, offset: 256)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1363, file: !1345, line: 180, baseType: !1757, size: 64)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1345, line: 162, baseType: !1759)
!1759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1345, line: 159, size: 128, elements: !1760)
!1760 = !{!1761, !1762}
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1759, file: !1345, line: 160, baseType: !1165, size: 64)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1759, file: !1345, line: 161, baseType: !1221, size: 64, offset: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1363, file: !1345, line: 181, baseType: !1764, size: 64)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1345, line: 181, flags: DIFlagFwdDecl)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1358, file: !1345, line: 317, baseType: !1767, size: 64)
!1767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 64, elements: !1265)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1358, file: !1345, line: 318, baseType: !1769, size: 320)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1345, line: 188, size: 320, elements: !1770)
!1770 = !{!1771, !1773, !1830}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1769, file: !1345, line: 190, baseType: !1772, size: 192)
!1772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1362, size: 192, elements: !1239)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1769, file: !1345, line: 193, baseType: !1774, size: 64, offset: 192)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1345, line: 206, size: 320, elements: !1776)
!1776 = !{!1777, !1815, !1816, !1817, !1829}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1775, file: !1345, line: 208, baseType: !1778, size: 64)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64)
!1779 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1166, line: 62, baseType: !1780)
!1780 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1781, line: 538, size: 256, elements: !1782)
!1781 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1782 = !{!1783, !1787, !1793, !1806}
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1780, file: !1781, line: 539, baseType: !1784, size: 32)
!1784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1781, line: 482, size: 32, elements: !1785)
!1785 = !{!1786}
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1784, file: !1781, line: 484, baseType: !7, size: 32)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1780, file: !1781, line: 540, baseType: !1788, size: 192)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1781, line: 488, size: 192, elements: !1789)
!1789 = !{!1790, !1791, !1792}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1788, file: !1781, line: 489, baseType: !1784, size: 32)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1788, file: !1781, line: 492, baseType: !1368, size: 64, offset: 64)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1788, file: !1781, line: 496, baseType: !1165, size: 64, offset: 128)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1780, file: !1781, line: 541, baseType: !1794, size: 256)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1781, line: 504, size: 256, elements: !1795)
!1795 = !{!1796, !1797, !1804, !1805}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1794, file: !1781, line: 505, baseType: !1784, size: 32)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1794, file: !1781, line: 509, baseType: !1798, size: 64, offset: 64)
!1798 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1781, line: 501, baseType: !1799)
!1799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1800, size: 64)
!1800 = !DISubroutineType(types: !1801)
!1801 = !{null, !1802}
!1802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1803, size: 64)
!1803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1794, file: !1781, line: 510, baseType: !1802, size: 64, offset: 128)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1794, file: !1781, line: 513, baseType: !1778, size: 64, offset: 192)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1780, file: !1781, line: 542, baseType: !1807, size: 128)
!1807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1781, line: 530, size: 128, elements: !1808)
!1808 = !{!1809, !1810}
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1807, file: !1781, line: 531, baseType: !1784, size: 32)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1807, file: !1781, line: 534, baseType: !1811, size: 64, offset: 64)
!1811 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1781, line: 525, baseType: !1812)
!1812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1813, size: 64)
!1813 = !DISubroutineType(types: !1814)
!1814 = !{!1284, !1165, !1368, !1219, !1219}
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1775, file: !1345, line: 211, baseType: !7, size: 32, offset: 64)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1775, file: !1345, line: 214, baseType: !1221, size: 64, offset: 128)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1775, file: !1345, line: 224, baseType: !1818, size: 64, offset: 192)
!1818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1819, size: 64)
!1819 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1345, line: 202, baseType: !1820)
!1820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1345, line: 202, size: 128, elements: !1821)
!1821 = !{!1822}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1820, file: !1345, line: 202, baseType: !1823, size: 128)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1345, line: 200, baseType: !1824)
!1824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1345, line: 200, size: 128, elements: !1825)
!1825 = !{!1826, !1827, !1828}
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1824, file: !1345, line: 200, baseType: !7, size: 32)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1824, file: !1345, line: 200, baseType: !7, size: 32, offset: 32)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1824, file: !1345, line: 200, baseType: !1378, size: 64, offset: 64)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1775, file: !1345, line: 234, baseType: !1818, size: 64, offset: 256)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1769, file: !1345, line: 197, baseType: !1221, size: 64, offset: 256)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1358, file: !1345, line: 319, baseType: !1228, size: 256)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1358, file: !1345, line: 320, baseType: !1247, size: 192)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1168, file: !135, line: 3384, baseType: !1834, size: 1472)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1835)
!1835 = !{!1836, !1857, !1858, !1859, !1860}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1834, file: !135, line: 3115, baseType: !1837, size: 1216)
!1837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1838)
!1838 = !{!1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856}
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1837, file: !135, line: 2985, baseType: !1338, size: 960)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1837, file: !135, line: 2986, baseType: !1165, size: 64, offset: 960)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1837, file: !135, line: 2987, baseType: !1165, size: 64, offset: 1024)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1837, file: !135, line: 2988, baseType: !1165, size: 64, offset: 1088)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1837, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1837, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1837, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1837, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1837, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1837, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1837, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1837, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1837, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1837, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1837, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1837, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1837, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1837, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1834, file: !135, line: 3117, baseType: !1165, size: 64, offset: 1216)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1834, file: !135, line: 3119, baseType: !1165, size: 64, offset: 1280)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1834, file: !135, line: 3121, baseType: !1165, size: 64, offset: 1344)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1834, file: !135, line: 3123, baseType: !1165, size: 64, offset: 1408)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1168, file: !135, line: 3385, baseType: !1862, size: 1088)
!1862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1863)
!1863 = !{!1864, !1865, !1866}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1862, file: !135, line: 2875, baseType: !1338, size: 960)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1862, file: !135, line: 2876, baseType: !1342, size: 64, offset: 960)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1862, file: !135, line: 2877, baseType: !1867, size: 64, offset: 1024)
!1867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1868, size: 64)
!1868 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1168, file: !135, line: 3386, baseType: !1837, size: 1216)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1168, file: !135, line: 3387, baseType: !1871, size: 1280)
!1871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1872)
!1872 = !{!1873, !1874}
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1871, file: !135, line: 3094, baseType: !1837, size: 1216)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1871, file: !135, line: 3095, baseType: !1867, size: 64, offset: 1216)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1168, file: !135, line: 3388, baseType: !1876, size: 1216)
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1877)
!1877 = !{!1878, !1879, !1880, !1881, !1882, !1883}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1876, file: !135, line: 2825, baseType: !1300, size: 896)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1876, file: !135, line: 2827, baseType: !1165, size: 64, offset: 896)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1876, file: !135, line: 2828, baseType: !1165, size: 64, offset: 960)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1876, file: !135, line: 2829, baseType: !1165, size: 64, offset: 1024)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1876, file: !135, line: 2830, baseType: !1165, size: 64, offset: 1088)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1876, file: !135, line: 2831, baseType: !1165, size: 64, offset: 1152)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1168, file: !135, line: 3389, baseType: !1885, size: 1024)
!1885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1886)
!1886 = !{!1887, !1888, !1889}
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1885, file: !135, line: 2851, baseType: !1338, size: 960)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1885, file: !135, line: 2852, baseType: !398, size: 32, offset: 960)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1885, file: !135, line: 2853, baseType: !398, size: 32, offset: 992)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1168, file: !135, line: 3390, baseType: !1891, size: 1024)
!1891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1892)
!1892 = !{!1893, !1894}
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1891, file: !135, line: 2858, baseType: !1338, size: 960)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1891, file: !135, line: 2859, baseType: !1867, size: 64, offset: 960)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1168, file: !135, line: 3391, baseType: !1896, size: 960)
!1896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1897)
!1897 = !{!1898}
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1896, file: !135, line: 2863, baseType: !1338, size: 960)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1168, file: !135, line: 3392, baseType: !1900, size: 1472)
!1900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1901)
!1901 = !{!1902}
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1900, file: !135, line: 3305, baseType: !1834, size: 1472)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1168, file: !135, line: 3393, baseType: !1904, size: 1792)
!1904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1905)
!1905 = !{!1906, !1907, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076}
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1904, file: !135, line: 3249, baseType: !1834, size: 1472)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1904, file: !135, line: 3251, baseType: !1908, size: 64, offset: 1472)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1909, size: 64)
!1909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1910, line: 463, size: 1152, elements: !1911)
!1910 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1911 = !{!1912, !1915, !1946, !1947, !1950, !1953, !2001, !2002, !2003, !2004, !2005, !2029, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055}
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1909, file: !1910, line: 464, baseType: !1913, size: 64)
!1913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1914, size: 64)
!1914 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1910, line: 464, flags: DIFlagFwdDecl)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1909, file: !1910, line: 467, baseType: !1916, size: 64, offset: 64)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1918)
!1918 = !{!1919, !1921, !1922, !1935, !1936, !1937, !1938, !1939, !1940, !1942, !1944, !1945}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1917, file: !330, line: 377, baseType: !1920, size: 64)
!1920 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1166, line: 111, baseType: !1459)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1917, file: !330, line: 378, baseType: !1920, size: 64, offset: 64)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1917, file: !330, line: 381, baseType: !1923, size: 64, offset: 128)
!1923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1924, size: 64)
!1924 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1925)
!1925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1926)
!1926 = !{!1927}
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1925, file: !330, line: 282, baseType: !1928, size: 128)
!1928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1929)
!1929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1930)
!1930 = !{!1931, !1932, !1933}
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1929, file: !330, line: 281, baseType: !7, size: 32)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1929, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1929, file: !330, line: 281, baseType: !1934, size: 64, offset: 64)
!1934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1920, size: 64, elements: !1265)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1917, file: !330, line: 384, baseType: !398, size: 32, offset: 192)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1917, file: !330, line: 387, baseType: !398, size: 32, offset: 224)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1917, file: !330, line: 390, baseType: !398, size: 32, offset: 256)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1917, file: !330, line: 394, baseType: !1923, size: 64, offset: 320)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1917, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1917, file: !330, line: 399, baseType: !1941, size: 64, offset: 416)
!1941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !1412)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1917, file: !330, line: 402, baseType: !1943, size: 64, offset: 480)
!1943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1412)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1917, file: !330, line: 406, baseType: !398, size: 32, offset: 544)
