; ModuleID = 'bb-reorder.c'
source_filename = "bb-reorder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.loop = type opaque
%struct.et_node = type opaque
%union.basic_block_il_dependent = type { %struct.gimple_bb_info* }

!827 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!828 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!829 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!830 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!831 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!832 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!833 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!834 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!835 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!836 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!837 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!838 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!839 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!840 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!841 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!842 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!843 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!844 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!845 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !704, line: 836, baseType: !7, size: 32, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!848 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!849 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!850 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!851 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!852 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!853 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!854 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!855 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!856 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!857 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!858 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!859 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!860 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!861 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!862 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!863 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!864 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!865 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!866 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!867 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!868 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!869 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!870 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!871 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!872 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!873 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!874 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!875 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!876 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!877 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!878 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!879 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !704, line: 956, baseType: !7, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!882 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!883 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!884 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!885 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!886 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!887 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!888 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!889 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!890 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!891 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!892 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!893 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!894 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!895 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!896 = !{!897, !933, !937, !925, !902, !703, !968, !927, !2010, !2011, !1085, !2012}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "bbro_basic_block_data", file: !3, line: 133, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bbro_basic_block_data_def", file: !3, line: 117, size: 256, elements: !900)
!900 = !{!901, !903, !904, !905, !931}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "start_of_trace", scope: !899, file: !3, line: 120, baseType: !902, size: 32)
!902 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "end_of_trace", scope: !899, file: !3, line: 123, baseType: !902, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "in_trace", scope: !899, file: !3, line: 126, baseType: !902, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !899, file: !3, line: 129, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheap_t", file: !907, line: 57, baseType: !908)
!907 = !DIFile(filename: "./include/fibheap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibheap", file: !907, line: 52, size: 192, elements: !910)
!910 = !{!911, !915, !930}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !909, file: !907, line: 54, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !913, line: 46, baseType: !914)
!913 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!914 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !909, file: !907, line: 55, baseType: !916, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibnode", file: !907, line: 59, size: 448, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !926, !928, !929}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !917, file: !907, line: 61, baseType: !916, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !917, file: !907, line: 62, baseType: !916, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !917, file: !907, line: 63, baseType: !916, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !917, file: !907, line: 64, baseType: !916, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !917, file: !907, line: 65, baseType: !924, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheapkey_t", file: !907, line: 50, baseType: !925)
!925 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !917, file: !907, line: 66, baseType: !927, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !917, file: !907, line: 71, baseType: !7, size: 31, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !917, file: !907, line: 72, baseType: !7, size: 1, offset: 415, flags: DIFlagBitField, extraData: i64 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !909, file: !907, line: 56, baseType: !916, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !899, file: !3, line: 132, baseType: !932, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibnode_t", file: !907, line: 74, baseType: !916)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trace", file: !3, line: 149, size: 192, elements: !935)
!935 = !{!936, !2007, !2008, !2009}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !934, file: !3, line: 152, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !378, line: 111, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !940)
!940 = !{!941, !1972, !1973, !1974, !1977, !1981, !1982, !1983, !2001, !2002, !2003, !2004, !2005, !2006}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !939, file: !135, line: 219, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !944, file: !135, line: 151, baseType: !947, size: 128)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !948, file: !135, line: 150, baseType: !7, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !948, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !948, file: !135, line: 150, baseType: !953, size: 64, offset: 64)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 64, elements: !1005)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !378, line: 108, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !957)
!957 = !{!958, !959, !960, !1964, !1965, !1966, !1967, !1968, !1969, !1970}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !956, file: !135, line: 124, baseType: !938, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !956, file: !135, line: 125, baseType: !938, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !956, file: !135, line: 131, baseType: !961, size: 64, offset: 128)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !962)
!962 = !{!963, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !961, file: !135, line: 129, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !378, line: 66, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !378, line: 65, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !961, file: !135, line: 130, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !378, line: 50, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !704, line: 240, size: 384, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !970, file: !704, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !970, file: !704, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !970, file: !704, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !970, file: !704, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !970, file: !704, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !970, file: !704, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !970, file: !704, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !970, file: !704, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !970, file: !704, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !970, file: !704, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !970, file: !704, line: 321, baseType: !983, size: 320, offset: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !704, line: 315, size: 320, elements: !984)
!984 = !{!985, !1899, !1901, !1962, !1963}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !983, file: !704, line: 316, baseType: !986, size: 64)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 64, elements: !1005)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !704, line: 183, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !704, line: 166, size: 64, elements: !989)
!989 = !{!990, !991, !992, !996, !997, !1007, !1008, !1020, !1023, !1084, !1877, !1878, !1889, !1896}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !988, file: !704, line: 168, baseType: !902, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !988, file: !704, line: 169, baseType: !7, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !988, file: !704, line: 170, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !988, file: !704, line: 171, baseType: !968, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !988, file: !704, line: 172, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !378, line: 53, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !704, line: 359, size: 128, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1000, file: !704, line: 360, baseType: !902, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1000, file: !704, line: 361, baseType: !1004, size: 64, offset: 64)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 64, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 1)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !988, file: !704, line: 173, baseType: !5, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !988, file: !704, line: 174, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !704, line: 133, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 115, size: 32, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1010, file: !704, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1010, file: !704, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1010, file: !704, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1010, file: !704, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1010, file: !704, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1010, file: !704, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1010, file: !704, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1010, file: !704, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !988, file: !704, line: 175, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !704, line: 175, flags: DIFlagFwdDecl)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !988, file: !704, line: 176, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1026, line: 75, size: 256, elements: !1027)
!1026 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1027 = !{!1028, !1042, !1043, !1044}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1025, file: !1026, line: 76, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1026, line: 68, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1026, line: 63, size: 320, elements: !1032)
!1032 = !{!1033, !1035, !1036, !1037}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !1026, line: 64, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1031, file: !1026, line: 65, baseType: !1034, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1031, file: !1026, line: 66, baseType: !7, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1031, file: !1026, line: 67, baseType: !1038, size: 128, offset: 192)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 128, elements: !1040)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1026, line: 29, baseType: !914)
!1040 = !{!1041}
!1041 = !DISubrange(count: 2)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1025, file: !1026, line: 77, baseType: !1029, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1025, file: !1026, line: 78, baseType: !7, size: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1025, file: !1026, line: 79, baseType: !1045, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1026, line: 49, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1026, line: 45, size: 832, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1047, file: !1026, line: 46, baseType: !1034, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1047, file: !1026, line: 47, baseType: !1024, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1047, file: !1026, line: 48, baseType: !1052, size: 704, offset: 128)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1053, line: 164, size: 704, elements: !1054)
!1053 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1054 = !{!1055, !1056, !1067, !1068, !1069, !1070, !1071, !1072, !1076, !1080, !1081, !1082, !1083}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1052, file: !1053, line: 166, baseType: !925, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1052, file: !1053, line: 167, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1053, line: 157, size: 192, elements: !1059)
!1059 = !{!1060, !1062, !1063}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1058, file: !1053, line: 159, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1058, file: !1053, line: 160, baseType: !1057, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1058, file: !1053, line: 161, baseType: !1064, size: 32, offset: 128)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 32, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 4)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1052, file: !1053, line: 168, baseType: !1061, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1052, file: !1053, line: 169, baseType: !1061, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1052, file: !1053, line: 170, baseType: !1061, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1052, file: !1053, line: 171, baseType: !925, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1052, file: !1053, line: 172, baseType: !902, size: 32, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1052, file: !1053, line: 176, baseType: !1073, size: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!1057, !927, !925}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1052, file: !1053, line: 177, baseType: !1077, size: 64, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !927, !1057}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1052, file: !1053, line: 178, baseType: !927, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1052, file: !1053, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1052, file: !1053, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1052, file: !1053, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !988, file: !704, line: 177, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !378, line: 56, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !1088)
!1088 = !{!1089, !1122, !1128, !1139, !1158, !1169, !1174, !1181, !1187, !1201, !1213, !1251, !1256, !1284, !1292, !1293, !1298, !1307, !1313, !1318, !1322, !1326, !1501, !1550, !1556, !1563, !1570, !1596, !1621, !1638, !1650, !1672, !1687, !1859}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1087, file: !151, line: 3372, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1090, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1090, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1090, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1090, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1090, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1090, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1090, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1090, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1090, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1090, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1090, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1090, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1090, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1090, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1090, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1090, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1090, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1090, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1090, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1090, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1090, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1090, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1090, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1090, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1090, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1090, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1090, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1090, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1090, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1090, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !151, line: 3373, baseType: !1123, size: 192)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1123, file: !151, line: 403, baseType: !1090, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1123, file: !151, line: 404, baseType: !1085, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !151, line: 405, baseType: !1085, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1087, file: !151, line: 3374, baseType: !1129, size: 320)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !151, line: 1385, baseType: !1123, size: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1129, file: !151, line: 1386, baseType: !1133, size: 128, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1134, line: 58, baseType: !1135)
!1134 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1134, line: 54, size: 128, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1135, file: !1134, line: 56, baseType: !914, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1135, file: !1134, line: 57, baseType: !925, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1087, file: !151, line: 3375, baseType: !1140, size: 256)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !151, line: 1398, baseType: !1123, size: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1140, file: !151, line: 1399, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1146, line: 52, size: 256, elements: !1147)
!1146 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1145, file: !1146, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1145, file: !1146, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1145, file: !1146, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1145, file: !1146, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1145, file: !1146, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1145, file: !1146, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1145, file: !1146, line: 62, baseType: !1155, size: 192, offset: 64)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 192, elements: !1156)
!1156 = !{!1157}
!1157 = !DISubrange(count: 3)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1087, file: !151, line: 3376, baseType: !1159, size: 256)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !151, line: 1409, baseType: !1123, size: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1159, file: !151, line: 1410, baseType: !1163, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1165, line: 27, size: 192, elements: !1166)
!1165 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !1165, line: 29, baseType: !1133, size: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1164, file: !1165, line: 30, baseType: !5, size: 32, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1087, file: !151, line: 3377, baseType: !1170, size: 256)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !1171)
!1171 = !{!1172, !1173}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !151, line: 1438, baseType: !1123, size: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1170, file: !151, line: 1439, baseType: !1085, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1087, file: !151, line: 3378, baseType: !1175, size: 256)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1175, file: !151, line: 1419, baseType: !1123, size: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1175, file: !151, line: 1420, baseType: !902, size: 32, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1175, file: !151, line: 1421, baseType: !1180, size: 8, offset: 224)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 8, elements: !1005)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1087, file: !151, line: 3379, baseType: !1182, size: 320)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1182, file: !151, line: 1429, baseType: !1123, size: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1182, file: !151, line: 1430, baseType: !1085, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1182, file: !151, line: 1431, baseType: !1085, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1087, file: !151, line: 3380, baseType: !1188, size: 320)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1188, file: !151, line: 1461, baseType: !1123, size: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1188, file: !151, line: 1462, baseType: !1192, size: 128, offset: 192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1193, line: 31, size: 128, elements: !1194)
!1193 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1194 = !{!1195, !1199, !1200}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1192, file: !1193, line: 32, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1198 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1192, file: !1193, line: 33, baseType: !7, size: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1192, file: !1193, line: 34, baseType: !7, size: 32, offset: 96)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1087, file: !151, line: 3381, baseType: !1202, size: 384)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1203)
!1203 = !{!1204, !1205, !1210, !1211, !1212}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1202, file: !151, line: 2508, baseType: !1123, size: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1202, file: !151, line: 2509, baseType: !1206, size: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1207, line: 58, baseType: !1208)
!1207 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1209, line: 44, baseType: !7)
!1209 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1202, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1202, file: !151, line: 2511, baseType: !1085, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1202, file: !151, line: 2512, baseType: !1085, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1087, file: !151, line: 3382, baseType: !1214, size: 896)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !151, line: 2653, baseType: !1202, size: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1214, file: !151, line: 2654, baseType: !1085, size: 64, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1214, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1214, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1214, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1214, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1214, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1214, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1214, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1214, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1214, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1214, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1214, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1214, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1214, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1214, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1214, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1214, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1214, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1214, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1214, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1214, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1214, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1214, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1214, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1214, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1214, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1214, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1214, file: !151, line: 2705, baseType: !1085, size: 64, offset: 576)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1214, file: !151, line: 2706, baseType: !1085, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1214, file: !151, line: 2707, baseType: !1085, size: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1214, file: !151, line: 2708, baseType: !1085, size: 64, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1214, file: !151, line: 2711, baseType: !1249, size: 64, offset: 832)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1087, file: !151, line: 3383, baseType: !1252, size: 960)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !151, line: 2757, baseType: !1214, size: 896)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1252, file: !151, line: 2758, baseType: !968, size: 64, offset: 896)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1087, file: !151, line: 3384, baseType: !1257, size: 1472)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1258)
!1258 = !{!1259, !1280, !1281, !1282, !1283}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1257, file: !151, line: 3115, baseType: !1260, size: 1216)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !151, line: 2985, baseType: !1252, size: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1260, file: !151, line: 2986, baseType: !1085, size: 64, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1260, file: !151, line: 2987, baseType: !1085, size: 64, offset: 1024)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1260, file: !151, line: 2988, baseType: !1085, size: 64, offset: 1088)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1260, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1260, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1260, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1260, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1260, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1260, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1260, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1260, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1260, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1260, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1260, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1260, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1260, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1260, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1257, file: !151, line: 3117, baseType: !1085, size: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1257, file: !151, line: 3119, baseType: !1085, size: 64, offset: 1280)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1257, file: !151, line: 3121, baseType: !1085, size: 64, offset: 1344)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1257, file: !151, line: 3123, baseType: !1085, size: 64, offset: 1408)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1087, file: !151, line: 3385, baseType: !1285, size: 1088)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1286)
!1286 = !{!1287, !1288, !1289}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1285, file: !151, line: 2875, baseType: !1252, size: 960)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1285, file: !151, line: 2876, baseType: !968, size: 64, offset: 960)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1285, file: !151, line: 2877, baseType: !1290, size: 64, offset: 1024)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1087, file: !151, line: 3386, baseType: !1260, size: 1216)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1087, file: !151, line: 3387, baseType: !1294, size: 1280)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1295)
!1295 = !{!1296, !1297}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1294, file: !151, line: 3094, baseType: !1260, size: 1216)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1294, file: !151, line: 3095, baseType: !1290, size: 64, offset: 1216)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1087, file: !151, line: 3388, baseType: !1299, size: 1216)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1299, file: !151, line: 2825, baseType: !1214, size: 896)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1299, file: !151, line: 2827, baseType: !1085, size: 64, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1299, file: !151, line: 2828, baseType: !1085, size: 64, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1299, file: !151, line: 2829, baseType: !1085, size: 64, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1299, file: !151, line: 2830, baseType: !1085, size: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1299, file: !151, line: 2831, baseType: !1085, size: 64, offset: 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1087, file: !151, line: 3389, baseType: !1308, size: 1024)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1309)
!1309 = !{!1310, !1311, !1312}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1308, file: !151, line: 2851, baseType: !1252, size: 960)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1308, file: !151, line: 2852, baseType: !902, size: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1308, file: !151, line: 2853, baseType: !902, size: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1087, file: !151, line: 3390, baseType: !1314, size: 1024)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1314, file: !151, line: 2858, baseType: !1252, size: 960)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1314, file: !151, line: 2859, baseType: !1290, size: 64, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1087, file: !151, line: 3391, baseType: !1319, size: 960)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1320)
!1320 = !{!1321}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1319, file: !151, line: 2863, baseType: !1252, size: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1087, file: !151, line: 3392, baseType: !1323, size: 1472)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1324)
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1323, file: !151, line: 3305, baseType: !1257, size: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1087, file: !151, line: 3393, baseType: !1327, size: 1792)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1328)
!1328 = !{!1329, !1330, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !151, line: 3249, baseType: !1257, size: 1472)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1327, file: !151, line: 3251, baseType: !1331, size: 64, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1333, line: 463, size: 1152, elements: !1334)
!1333 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1334 = !{!1335, !1338, !1368, !1369, !1372, !1375, !1425, !1426, !1427, !1428, !1429, !1453, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1332, file: !1333, line: 464, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1333, line: 464, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1332, file: !1333, line: 467, baseType: !1339, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1357, !1358, !1359, !1360, !1361, !1362, !1364, !1366, !1367}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1340, file: !135, line: 377, baseType: !937, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1340, file: !135, line: 378, baseType: !937, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1340, file: !135, line: 381, baseType: !1345, size: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1347)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1348)
!1348 = !{!1349}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1347, file: !135, line: 282, baseType: !1350, size: 128)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1351, file: !135, line: 281, baseType: !7, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1351, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1351, file: !135, line: 281, baseType: !1356, size: 64, offset: 64)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 64, elements: !1005)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1340, file: !135, line: 384, baseType: !902, size: 32, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1340, file: !135, line: 387, baseType: !902, size: 32, offset: 224)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1340, file: !135, line: 390, baseType: !902, size: 32, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1340, file: !135, line: 394, baseType: !1345, size: 64, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1340, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1340, file: !135, line: 399, baseType: !1363, size: 64, offset: 416)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !1040)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1340, file: !135, line: 402, baseType: !1365, size: 64, offset: 480)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1040)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1340, file: !135, line: 406, baseType: !902, size: 32, offset: 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1340, file: !135, line: 409, baseType: !902, size: 32, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1332, file: !1333, line: 470, baseType: !965, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1332, file: !1333, line: 473, baseType: !1370, size: 64, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1333, line: 166, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1332, file: !1333, line: 476, baseType: !1373, size: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1333, line: 476, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1332, file: !1333, line: 479, baseType: !1376, size: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1377, line: 144, baseType: !1378)
!1377 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1377, line: 100, size: 896, elements: !1380)
!1380 = !{!1381, !1389, !1394, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1411, !1413, !1414, !1419, !1424}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1379, file: !1377, line: 102, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1377, line: 52, baseType: !1383)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1377, line: 47, baseType: !7)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1379, file: !1377, line: 105, baseType: !1390, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1377, line: 59, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!902, !1387, !1387}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1379, file: !1377, line: 108, baseType: !1395, size: 64, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1377, line: 63, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !927}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1379, file: !1377, line: 111, baseType: !1400, size: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1379, file: !1377, line: 114, baseType: !912, size: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1379, file: !1377, line: 117, baseType: !912, size: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1379, file: !1377, line: 120, baseType: !912, size: 64, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1379, file: !1377, line: 124, baseType: !7, size: 32, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1379, file: !1377, line: 128, baseType: !7, size: 32, offset: 480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1379, file: !1377, line: 131, baseType: !1407, size: 64, offset: 512)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1377, line: 75, baseType: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!927, !912, !912}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1379, file: !1377, line: 132, baseType: !1412, size: 64, offset: 576)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1377, line: 78, baseType: !1396)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1379, file: !1377, line: 135, baseType: !927, size: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1379, file: !1377, line: 136, baseType: !1415, size: 64, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1377, line: 82, baseType: !1416)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!927, !927, !912, !912}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1379, file: !1377, line: 137, baseType: !1420, size: 64, offset: 768)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1377, line: 83, baseType: !1421)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !927, !927}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1379, file: !1377, line: 141, baseType: !7, size: 32, offset: 832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1332, file: !1333, line: 484, baseType: !1085, size: 64, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1332, file: !1333, line: 488, baseType: !1085, size: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1332, file: !1333, line: 493, baseType: !1085, size: 64, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1332, file: !1333, line: 496, baseType: !1085, size: 64, offset: 576)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1332, file: !1333, line: 501, baseType: !1430, size: 64, offset: 640)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1432)
!1432 = !{!1433, !1436, !1437, !1438, !1439, !1441, !1442, !1447, !1448, !1449, !1450, !1451, !1452}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1431, file: !146, line: 2356, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1431, file: !146, line: 2357, baseType: !993, size: 64, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1431, file: !146, line: 2358, baseType: !902, size: 32, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1431, file: !146, line: 2359, baseType: !902, size: 32, offset: 160)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1431, file: !146, line: 2360, baseType: !1440, size: 128, offset: 192)
!1440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, elements: !1065)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1431, file: !146, line: 2364, baseType: !902, size: 32, offset: 320)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1431, file: !146, line: 2367, baseType: !1443, size: 128, offset: 384)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1444)
!1444 = !{!1445, !1446}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1443, file: !146, line: 2351, baseType: !968, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1443, file: !146, line: 2352, baseType: !925, size: 64, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1431, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1431, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1431, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1431, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1431, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1431, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1332, file: !1333, line: 504, baseType: !1454, size: 64, offset: 704)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1333, line: 504, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1332, file: !1333, line: 507, baseType: !1376, size: 64, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1332, file: !1333, line: 510, baseType: !902, size: 32, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1332, file: !1333, line: 513, baseType: !902, size: 32, offset: 864)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1332, file: !1333, line: 516, baseType: !1206, size: 32, offset: 896)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1332, file: !1333, line: 519, baseType: !1206, size: 32, offset: 928)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1332, file: !1333, line: 522, baseType: !7, size: 32, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1332, file: !1333, line: 523, baseType: !7, size: 32, offset: 992)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1332, file: !1333, line: 528, baseType: !993, size: 64, offset: 1024)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1332, file: !1333, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1332, file: !1333, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1332, file: !1333, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1332, file: !1333, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1332, file: !1333, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1332, file: !1333, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1332, file: !1333, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1332, file: !1333, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1332, file: !1333, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1332, file: !1333, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1332, file: !1333, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1332, file: !1333, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1332, file: !1333, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1332, file: !1333, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1332, file: !1333, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1332, file: !1333, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1327, file: !151, line: 3254, baseType: !1085, size: 64, offset: 1536)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1327, file: !151, line: 3257, baseType: !1085, size: 64, offset: 1600)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1327, file: !151, line: 3258, baseType: !1085, size: 64, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1327, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1327, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1327, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1327, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1327, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1327, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1327, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1327, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1327, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1327, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1327, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1327, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1327, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1327, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1327, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1327, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1327, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1327, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !151, line: 3394, baseType: !1502, size: 1344)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1529, !1530, !1531, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1502, file: !151, line: 2280, baseType: !1123, size: 192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1502, file: !151, line: 2281, baseType: !1085, size: 64, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1502, file: !151, line: 2282, baseType: !1085, size: 64, offset: 256)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1502, file: !151, line: 2283, baseType: !1085, size: 64, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1502, file: !151, line: 2284, baseType: !1085, size: 64, offset: 384)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1502, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1502, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1502, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1502, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1502, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1502, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1502, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1502, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1502, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1502, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1502, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1502, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1502, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1502, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1502, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1502, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1502, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1502, file: !151, line: 2306, baseType: !1527, size: 32, offset: 544)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1528, line: 31, baseType: !902)
!1528 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1502, file: !151, line: 2307, baseType: !1085, size: 64, offset: 576)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1502, file: !151, line: 2308, baseType: !1085, size: 64, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1502, file: !151, line: 2314, baseType: !1532, size: 64, offset: 704)
!1532 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1533)
!1533 = !{!1534, !1535, !1536}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1532, file: !151, line: 2310, baseType: !902, size: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1532, file: !151, line: 2311, baseType: !993, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1532, file: !151, line: 2312, baseType: !1537, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1502, file: !151, line: 2315, baseType: !1085, size: 64, offset: 768)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1502, file: !151, line: 2316, baseType: !1085, size: 64, offset: 832)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1502, file: !151, line: 2317, baseType: !1085, size: 64, offset: 896)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1502, file: !151, line: 2318, baseType: !1085, size: 64, offset: 960)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1502, file: !151, line: 2319, baseType: !1085, size: 64, offset: 1024)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1502, file: !151, line: 2320, baseType: !1085, size: 64, offset: 1088)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1502, file: !151, line: 2321, baseType: !1085, size: 64, offset: 1152)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1502, file: !151, line: 2322, baseType: !1085, size: 64, offset: 1216)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1502, file: !151, line: 2324, baseType: !1548, size: 64, offset: 1280)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1087, file: !151, line: 3395, baseType: !1551, size: 320)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1552)
!1552 = !{!1553, !1554, !1555}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1551, file: !151, line: 1470, baseType: !1123, size: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1551, file: !151, line: 1471, baseType: !1085, size: 64, offset: 192)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1551, file: !151, line: 1472, baseType: !1085, size: 64, offset: 256)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1087, file: !151, line: 3396, baseType: !1557, size: 320)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1558)
!1558 = !{!1559, !1560, !1561}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1557, file: !151, line: 1483, baseType: !1123, size: 192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1557, file: !151, line: 1484, baseType: !902, size: 32, offset: 192)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1557, file: !151, line: 1485, baseType: !1562, size: 64, offset: 256)
!1562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 64, elements: !1005)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1087, file: !151, line: 3397, baseType: !1564, size: 384)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1565)
!1565 = !{!1566, !1567, !1568, !1569}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1564, file: !151, line: 1830, baseType: !1123, size: 192)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1564, file: !151, line: 1831, baseType: !1206, size: 32, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1564, file: !151, line: 1832, baseType: !1085, size: 64, offset: 256)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1564, file: !151, line: 1835, baseType: !1562, size: 64, offset: 320)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1087, file: !151, line: 3398, baseType: !1571, size: 704)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1579, !1580, !1583}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1571, file: !151, line: 1899, baseType: !1123, size: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1571, file: !151, line: 1902, baseType: !1085, size: 64, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1571, file: !151, line: 1905, baseType: !1576, size: 64, offset: 256)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !378, line: 58, baseType: !1577)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64)
!1578 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !378, line: 57, flags: DIFlagFwdDecl)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1571, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1571, file: !151, line: 1911, baseType: !1581, size: 64, offset: 384)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64)
!1582 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1571, file: !151, line: 1914, baseType: !1584, size: 256, offset: 448)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1585)
!1585 = !{!1586, !1588, !1589, !1594}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1584, file: !151, line: 1884, baseType: !1587, size: 64)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1584, file: !151, line: 1885, baseType: !1587, size: 64, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1584, file: !151, line: 1891, baseType: !1590, size: 64, offset: 128)
!1590 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1584, file: !151, line: 1891, size: 64, elements: !1591)
!1591 = !{!1592, !1593}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1590, file: !151, line: 1891, baseType: !1576, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1590, file: !151, line: 1891, baseType: !1085, size: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1584, file: !151, line: 1892, baseType: !1595, size: 64, offset: 192)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1087, file: !151, line: 3399, baseType: !1597, size: 704)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603, !1604, !1616, !1617, !1618, !1619, !1620}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1597, file: !151, line: 2009, baseType: !1123, size: 192)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1597, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1597, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1597, file: !151, line: 2014, baseType: !1206, size: 32, offset: 224)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1597, file: !151, line: 2016, baseType: !1085, size: 64, offset: 256)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1597, file: !151, line: 2017, baseType: !1605, size: 64, offset: 320)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1608)
!1608 = !{!1609}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1607, file: !151, line: 183, baseType: !1610, size: 128)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1612)
!1612 = !{!1613, !1614, !1615}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1611, file: !151, line: 182, baseType: !7, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1611, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1611, file: !151, line: 182, baseType: !1562, size: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1597, file: !151, line: 2019, baseType: !1085, size: 64, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1597, file: !151, line: 2020, baseType: !1085, size: 64, offset: 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1597, file: !151, line: 2021, baseType: !1085, size: 64, offset: 512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1597, file: !151, line: 2022, baseType: !1085, size: 64, offset: 576)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1597, file: !151, line: 2023, baseType: !1085, size: 64, offset: 640)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1087, file: !151, line: 3400, baseType: !1622, size: 832)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1622, file: !151, line: 2431, baseType: !1123, size: 192)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1622, file: !151, line: 2433, baseType: !1085, size: 64, offset: 192)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1622, file: !151, line: 2434, baseType: !1085, size: 64, offset: 256)
