; ModuleID = 'c-pragma.c'
source_filename = "c-pragma.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }

!1836 = !DIEnumerator(name: "TI_ULACCUM_TYPE", value: 87, isUnsigned: true)
!1837 = !DIEnumerator(name: "TI_ULLACCUM_TYPE", value: 88, isUnsigned: true)
!1838 = !DIEnumerator(name: "TI_QQ_TYPE", value: 89, isUnsigned: true)
!1839 = !DIEnumerator(name: "TI_HQ_TYPE", value: 90, isUnsigned: true)
!1840 = !DIEnumerator(name: "TI_SQ_TYPE", value: 91, isUnsigned: true)
!1841 = !DIEnumerator(name: "TI_DQ_TYPE", value: 92, isUnsigned: true)
!1842 = !DIEnumerator(name: "TI_TQ_TYPE", value: 93, isUnsigned: true)
!1843 = !DIEnumerator(name: "TI_UQQ_TYPE", value: 94, isUnsigned: true)
!1844 = !DIEnumerator(name: "TI_UHQ_TYPE", value: 95, isUnsigned: true)
!1845 = !DIEnumerator(name: "TI_USQ_TYPE", value: 96, isUnsigned: true)
!1846 = !DIEnumerator(name: "TI_UDQ_TYPE", value: 97, isUnsigned: true)
!1847 = !DIEnumerator(name: "TI_UTQ_TYPE", value: 98, isUnsigned: true)
!1848 = !DIEnumerator(name: "TI_SAT_QQ_TYPE", value: 99, isUnsigned: true)
!1849 = !DIEnumerator(name: "TI_SAT_HQ_TYPE", value: 100, isUnsigned: true)
!1850 = !DIEnumerator(name: "TI_SAT_SQ_TYPE", value: 101, isUnsigned: true)
!1851 = !DIEnumerator(name: "TI_SAT_DQ_TYPE", value: 102, isUnsigned: true)
!1852 = !DIEnumerator(name: "TI_SAT_TQ_TYPE", value: 103, isUnsigned: true)
!1853 = !DIEnumerator(name: "TI_SAT_UQQ_TYPE", value: 104, isUnsigned: true)
!1854 = !DIEnumerator(name: "TI_SAT_UHQ_TYPE", value: 105, isUnsigned: true)
!1855 = !DIEnumerator(name: "TI_SAT_USQ_TYPE", value: 106, isUnsigned: true)
!1856 = !DIEnumerator(name: "TI_SAT_UDQ_TYPE", value: 107, isUnsigned: true)
!1857 = !DIEnumerator(name: "TI_SAT_UTQ_TYPE", value: 108, isUnsigned: true)
!1858 = !DIEnumerator(name: "TI_HA_TYPE", value: 109, isUnsigned: true)
!1859 = !DIEnumerator(name: "TI_SA_TYPE", value: 110, isUnsigned: true)
!1860 = !DIEnumerator(name: "TI_DA_TYPE", value: 111, isUnsigned: true)
!1861 = !DIEnumerator(name: "TI_TA_TYPE", value: 112, isUnsigned: true)
!1862 = !DIEnumerator(name: "TI_UHA_TYPE", value: 113, isUnsigned: true)
!1863 = !DIEnumerator(name: "TI_USA_TYPE", value: 114, isUnsigned: true)
!1864 = !DIEnumerator(name: "TI_UDA_TYPE", value: 115, isUnsigned: true)
!1865 = !DIEnumerator(name: "TI_UTA_TYPE", value: 116, isUnsigned: true)
!1866 = !DIEnumerator(name: "TI_SAT_HA_TYPE", value: 117, isUnsigned: true)
!1867 = !DIEnumerator(name: "TI_SAT_SA_TYPE", value: 118, isUnsigned: true)
!1868 = !DIEnumerator(name: "TI_SAT_DA_TYPE", value: 119, isUnsigned: true)
!1869 = !DIEnumerator(name: "TI_SAT_TA_TYPE", value: 120, isUnsigned: true)
!1870 = !DIEnumerator(name: "TI_SAT_UHA_TYPE", value: 121, isUnsigned: true)
!1871 = !DIEnumerator(name: "TI_SAT_USA_TYPE", value: 122, isUnsigned: true)
!1872 = !DIEnumerator(name: "TI_SAT_UDA_TYPE", value: 123, isUnsigned: true)
!1873 = !DIEnumerator(name: "TI_SAT_UTA_TYPE", value: 124, isUnsigned: true)
!1874 = !DIEnumerator(name: "TI_OPTIMIZATION_DEFAULT", value: 125, isUnsigned: true)
!1875 = !DIEnumerator(name: "TI_OPTIMIZATION_CURRENT", value: 126, isUnsigned: true)
!1876 = !DIEnumerator(name: "TI_TARGET_OPTION_DEFAULT", value: 127, isUnsigned: true)
!1877 = !DIEnumerator(name: "TI_TARGET_OPTION_CURRENT", value: 128, isUnsigned: true)
!1878 = !DIEnumerator(name: "TI_CURRENT_TARGET_PRAGMA", value: 129, isUnsigned: true)
!1879 = !DIEnumerator(name: "TI_CURRENT_OPTIMIZE_PRAGMA", value: 130, isUnsigned: true)
!1880 = !DIEnumerator(name: "TI_MAX", value: 131, isUnsigned: true)
!1881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_language_kind", file: !367, line: 378, baseType: !7, size: 32, elements: !1882)
!1882 = !{!1883, !1884, !1885, !1886}
!1883 = !DIEnumerator(name: "clk_c", value: 0, isUnsigned: true)
!1884 = !DIEnumerator(name: "clk_objc", value: 1, isUnsigned: true)
!1885 = !DIEnumerator(name: "clk_cxx", value: 2, isUnsigned: true)
!1886 = !DIEnumerator(name: "clk_objcxx", value: 3, isUnsigned: true)
!1887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pragma_switch_t", file: !3, line: 1045, baseType: !7, size: 32, elements: !1888)
!1888 = !{!1889, !1890, !1891, !1892}
!1889 = !DIEnumerator(name: "PRAGMA_ON", value: 0, isUnsigned: true)
!1890 = !DIEnumerator(name: "PRAGMA_OFF", value: 1, isUnsigned: true)
!1891 = !DIEnumerator(name: "PRAGMA_DEFAULT", value: 2, isUnsigned: true)
!1892 = !DIEnumerator(name: "PRAGMA_BAD", value: 3, isUnsigned: true)
!1893 = !{!172, !1894, !1895, !1897, !2098, !2818, !1993, !1336, !2819, !2827, !2833, !7, !2846, !2863, !2880, !2882, !2883}
!1894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1895 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1896, line: 44, baseType: !7)
!1896 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1897 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1700, line: 56, baseType: !1898)
!1898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1899, size: 64)
!1899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !1900)
!1900 = !{!1901, !1934, !1940, !1953, !1972, !1983, !1988, !1999, !2005, !2019, !2029, !2067, !2222, !2250, !2258, !2259, !2264, !2273, !2279, !2284, !2288, !2292, !2444, !2491, !2497, !2504, !2511, !2537, !2562, !2579, !2591, !2613, !2629, !2800}
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1899, file: !140, line: 3372, baseType: !1902, size: 64)
!1902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !1903)
!1903 = !{!1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933}
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1902, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1902, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1902, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1902, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1902, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1902, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1902, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1902, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1902, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1902, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1902, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1902, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1902, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1902, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1902, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1902, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1902, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1902, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1902, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1902, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1902, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1902, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1902, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1902, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1902, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1902, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1902, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1902, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1902, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1902, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1899, file: !140, line: 3373, baseType: !1935, size: 192)
!1935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !1936)
!1936 = !{!1937, !1938, !1939}
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1935, file: !140, line: 403, baseType: !1902, size: 64)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1935, file: !140, line: 404, baseType: !1897, size: 64, offset: 64)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1935, file: !140, line: 405, baseType: !1897, size: 64, offset: 128)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1899, file: !140, line: 3374, baseType: !1941, size: 320)
!1941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !1942)
!1942 = !{!1943, !1944}
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1941, file: !140, line: 1385, baseType: !1935, size: 192)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1941, file: !140, line: 1386, baseType: !1945, size: 128, offset: 192)
!1945 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1946, line: 58, baseType: !1947)
!1946 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1946, line: 54, size: 128, elements: !1948)
!1948 = !{!1949, !1951}
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1947, file: !1946, line: 56, baseType: !1950, size: 64)
!1950 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1947, file: !1946, line: 57, baseType: !1952, size: 64, offset: 64)
!1952 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1899, file: !140, line: 3375, baseType: !1954, size: 256)
!1954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !1955)
!1955 = !{!1956, !1957}
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1954, file: !140, line: 1398, baseType: !1935, size: 192)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1954, file: !140, line: 1399, baseType: !1958, size: 64, offset: 192)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1960, line: 52, size: 256, elements: !1961)
!1960 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1961 = !{!1962, !1963, !1964, !1965, !1966, !1967, !1968}
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1959, file: !1960, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1959, file: !1960, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1959, file: !1960, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1959, file: !1960, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1959, file: !1960, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1959, file: !1960, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1959, file: !1960, line: 62, baseType: !1969, size: 192, offset: 64)
!1969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1950, size: 192, elements: !1970)
!1970 = !{!1971}
!1971 = !DISubrange(count: 3)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1899, file: !140, line: 3376, baseType: !1973, size: 256)
!1973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !1974)
!1974 = !{!1975, !1976}
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1973, file: !140, line: 1409, baseType: !1935, size: 192)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1973, file: !140, line: 1410, baseType: !1977, size: 64, offset: 192)
!1977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1978, size: 64)
!1978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1979, line: 27, size: 192, elements: !1980)
!1979 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1980 = !{!1981, !1982}
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1978, file: !1979, line: 29, baseType: !1945, size: 128)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1978, file: !1979, line: 30, baseType: !5, size: 32, offset: 128)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1899, file: !140, line: 3377, baseType: !1984, size: 256)
!1984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !1985)
!1985 = !{!1986, !1987}
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1984, file: !140, line: 1438, baseType: !1935, size: 192)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1984, file: !140, line: 1439, baseType: !1897, size: 64, offset: 192)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1899, file: !140, line: 3378, baseType: !1989, size: 256)
!1989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !1990)
!1990 = !{!1991, !1992, !1994}
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1989, file: !140, line: 1419, baseType: !1935, size: 192)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1989, file: !140, line: 1420, baseType: !1993, size: 32, offset: 192)
!1993 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1989, file: !140, line: 1421, baseType: !1995, size: 8, offset: 224)
!1995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1996, size: 8, elements: !1997)
!1996 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1997 = !{!1998}
!1998 = !DISubrange(count: 1)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1899, file: !140, line: 3379, baseType: !2000, size: 320)
!2000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !2001)
!2001 = !{!2002, !2003, !2004}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2000, file: !140, line: 1429, baseType: !1935, size: 192)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2000, file: !140, line: 1430, baseType: !1897, size: 64, offset: 192)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2000, file: !140, line: 1431, baseType: !1897, size: 64, offset: 256)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1899, file: !140, line: 3380, baseType: !2006, size: 320)
!2006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !2007)
!2007 = !{!2008, !2009}
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2006, file: !140, line: 1461, baseType: !1935, size: 192)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2006, file: !140, line: 1462, baseType: !2010, size: 128, offset: 192)
!2010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2011, line: 31, size: 128, elements: !2012)
!2011 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2012 = !{!2013, !2017, !2018}
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2010, file: !2011, line: 32, baseType: !2014, size: 64)
!2014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2015, size: 64)
!2015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2016)
!2016 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2010, file: !2011, line: 33, baseType: !7, size: 32, offset: 64)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2010, file: !2011, line: 34, baseType: !7, size: 32, offset: 96)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1899, file: !140, line: 3381, baseType: !2020, size: 384)
!2020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !2021)
!2021 = !{!2022, !2023, !2026, !2027, !2028}
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2020, file: !140, line: 2508, baseType: !1935, size: 192)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2020, file: !140, line: 2509, baseType: !2024, size: 32, offset: 192)
!2024 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2025, line: 58, baseType: !1895)
!2025 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2020, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2020, file: !140, line: 2511, baseType: !1897, size: 64, offset: 256)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2020, file: !140, line: 2512, baseType: !1897, size: 64, offset: 320)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1899, file: !140, line: 3382, baseType: !2030, size: 896)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !2031)
!2031 = !{!2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2030, file: !140, line: 2653, baseType: !2020, size: 384)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2030, file: !140, line: 2654, baseType: !1897, size: 64, offset: 384)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2030, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2030, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2030, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2030, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2030, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2030, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2030, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2030, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2030, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2030, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2030, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2030, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2030, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2030, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2030, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2030, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2030, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2030, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2030, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2030, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2030, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2030, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2030, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2030, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2030, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2030, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2030, file: !140, line: 2705, baseType: !1897, size: 64, offset: 576)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2030, file: !140, line: 2706, baseType: !1897, size: 64, offset: 640)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2030, file: !140, line: 2707, baseType: !1897, size: 64, offset: 704)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2030, file: !140, line: 2708, baseType: !1897, size: 64, offset: 768)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2030, file: !140, line: 2711, baseType: !2065, size: 64, offset: 832)
!2065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2066, size: 64)
!2066 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1899, file: !140, line: 3383, baseType: !2068, size: 960)
!2068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !2069)
!2069 = !{!2070, !2071}
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2068, file: !140, line: 2757, baseType: !2030, size: 896)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2068, file: !140, line: 2758, baseType: !2072, size: 64, offset: 896)
!2072 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1700, line: 50, baseType: !2073)
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64)
!2074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !2075, line: 240, size: 384, elements: !2076)
!2075 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2076 = !{!2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087}
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2074, file: !2075, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2074, file: !2075, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2074, file: !2075, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2074, file: !2075, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2074, file: !2075, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2074, file: !2075, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2074, file: !2075, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2074, file: !2075, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2074, file: !2075, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2074, file: !2075, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2074, file: !2075, line: 321, baseType: !2088, size: 320, offset: 64)
!2088 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !2075, line: 315, size: 320, elements: !2089)
!2089 = !{!2090, !2155, !2157, !2220, !2221}
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2088, file: !2075, line: 316, baseType: !2091, size: 64)
!2091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2092, size: 64, elements: !1997)
!2092 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !2075, line: 183, baseType: !2093)
!2093 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !2075, line: 166, size: 64, elements: !2094)
!2094 = !{!2095, !2096, !2097, !2100, !2101, !2109, !2110, !2122, !2125, !2128, !2129, !2132, !2145, !2152}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2093, file: !2075, line: 168, baseType: !1993, size: 32)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2093, file: !2075, line: 169, baseType: !7, size: 32)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2093, file: !2075, line: 170, baseType: !2098, size: 64)
!2098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2099, size: 64)
!2099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1996)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2093, file: !2075, line: 171, baseType: !2072, size: 64)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2093, file: !2075, line: 172, baseType: !2102, size: 64)
!2102 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1700, line: 53, baseType: !2103)
!2103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2104, size: 64)
!2104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !2075, line: 359, size: 128, elements: !2105)
!2105 = !{!2106, !2107}
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2104, file: !2075, line: 360, baseType: !1993, size: 32)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2104, file: !2075, line: 361, baseType: !2108, size: 64, offset: 64)
!2108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2072, size: 64, elements: !1997)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2093, file: !2075, line: 173, baseType: !5, size: 32)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2093, file: !2075, line: 174, baseType: !2111, size: 32)
!2111 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !2075, line: 133, baseType: !2112)
!2112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2075, line: 115, size: 32, elements: !2113)
!2113 = !{!2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121}
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2112, file: !2075, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2112, file: !2075, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2112, file: !2075, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2112, file: !2075, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2112, file: !2075, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2112, file: !2075, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2112, file: !2075, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2112, file: !2075, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2093, file: !2075, line: 175, baseType: !2123, size: 64)
!2123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2124, size: 64)
!2124 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !2075, line: 175, flags: DIFlagFwdDecl)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2093, file: !2075, line: 176, baseType: !2126, size: 64)
!2126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2127, size: 64)
!2127 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1700, line: 46, flags: DIFlagFwdDecl)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2093, file: !2075, line: 177, baseType: !1897, size: 64)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !2093, file: !2075, line: 178, baseType: !2130, size: 64)
!2130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2131, size: 64)
!2131 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !1700, line: 110, flags: DIFlagFwdDecl)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !2093, file: !2075, line: 179, baseType: !2133, size: 64)
!2133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2134, size: 64)
!2134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !2075, line: 150, baseType: !2135)
!2135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !2075, line: 142, size: 320, elements: !2136)
!2136 = !{!2137, !2138, !2139, !2140, !2143, !2144}
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2135, file: !2075, line: 144, baseType: !1897, size: 64)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2135, file: !2075, line: 145, baseType: !2072, size: 64, offset: 64)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2135, file: !2075, line: 146, baseType: !2072, size: 64, offset: 128)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2135, file: !2075, line: 147, baseType: !2141, size: 32, offset: 192)
!2141 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2142, line: 31, baseType: !1993)
!2142 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2135, file: !2075, line: 148, baseType: !7, size: 32, offset: 224)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2135, file: !2075, line: 149, baseType: !2016, size: 8, offset: 256)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !2093, file: !2075, line: 180, baseType: !2146, size: 64)
!2146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2147, size: 64)
!2147 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !2075, line: 162, baseType: !2148)
!2148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !2075, line: 159, size: 128, elements: !2149)
!2149 = !{!2150, !2151}
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2148, file: !2075, line: 160, baseType: !1897, size: 64)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2148, file: !2075, line: 161, baseType: !1952, size: 64, offset: 64)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !2093, file: !2075, line: 181, baseType: !2153, size: 64)
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !2075, line: 181, flags: DIFlagFwdDecl)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !2088, file: !2075, line: 317, baseType: !2156, size: 64)
!2156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1952, size: 64, elements: !1997)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !2088, file: !2075, line: 318, baseType: !2158, size: 320)
!2158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !2075, line: 188, size: 320, elements: !2159)
!2159 = !{!2160, !2162, !2219}
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2158, file: !2075, line: 190, baseType: !2161, size: 192)
!2161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2092, size: 192, elements: !1970)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2158, file: !2075, line: 193, baseType: !2163, size: 64, offset: 192)
!2163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2164, size: 64)
!2164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !2075, line: 206, size: 320, elements: !2165)
!2165 = !{!2166, !2204, !2205, !2206, !2218}
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2164, file: !2075, line: 208, baseType: !2167, size: 64)
!2167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2168, size: 64)
!2168 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1700, line: 62, baseType: !2169)
!2169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2170, line: 538, size: 256, elements: !2171)
!2170 = !DIFile(filename: "./output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2171 = !{!2172, !2176, !2182, !2195}
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2169, file: !2170, line: 539, baseType: !2173, size: 32)
!2173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2170, line: 482, size: 32, elements: !2174)
!2174 = !{!2175}
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2173, file: !2170, line: 484, baseType: !7, size: 32)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2169, file: !2170, line: 540, baseType: !2177, size: 192)
!2177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2170, line: 488, size: 192, elements: !2178)
!2178 = !{!2179, !2180, !2181}
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2177, file: !2170, line: 489, baseType: !2173, size: 32)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2177, file: !2170, line: 492, baseType: !2098, size: 64, offset: 64)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2177, file: !2170, line: 496, baseType: !1897, size: 64, offset: 128)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2169, file: !2170, line: 541, baseType: !2183, size: 256)
!2183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2170, line: 504, size: 256, elements: !2184)
!2184 = !{!2185, !2186, !2193, !2194}
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2183, file: !2170, line: 505, baseType: !2173, size: 32)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2183, file: !2170, line: 509, baseType: !2187, size: 64, offset: 64)
!2187 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2170, line: 501, baseType: !2188)
!2188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2189, size: 64)
!2189 = !DISubroutineType(types: !2190)
!2190 = !{null, !2191}
!2191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2192, size: 64)
!2192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2183, file: !2170, line: 510, baseType: !2191, size: 64, offset: 128)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2183, file: !2170, line: 513, baseType: !2167, size: 64, offset: 192)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2169, file: !2170, line: 542, baseType: !2196, size: 128)
!2196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2170, line: 530, size: 128, elements: !2197)
!2197 = !{!2198, !2199}
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2196, file: !2170, line: 531, baseType: !2173, size: 32)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2196, file: !2170, line: 534, baseType: !2200, size: 64, offset: 64)
!2200 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2170, line: 525, baseType: !2201)
!2201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2202, size: 64)
!2202 = !DISubroutineType(types: !2203)
!2203 = !{!2016, !1897, !2098, !1950, !1950}
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2164, file: !2075, line: 211, baseType: !7, size: 32, offset: 64)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2164, file: !2075, line: 214, baseType: !1952, size: 64, offset: 128)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2164, file: !2075, line: 224, baseType: !2207, size: 64, offset: 192)
!2207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2208, size: 64)
!2208 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !2075, line: 202, baseType: !2209)
!2209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !2075, line: 202, size: 128, elements: !2210)
!2210 = !{!2211}
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2209, file: !2075, line: 202, baseType: !2212, size: 128)
!2212 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !2075, line: 200, baseType: !2213)
!2213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !2075, line: 200, size: 128, elements: !2214)
!2214 = !{!2215, !2216, !2217}
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2213, file: !2075, line: 200, baseType: !7, size: 32)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2213, file: !2075, line: 200, baseType: !7, size: 32, offset: 32)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2213, file: !2075, line: 200, baseType: !2108, size: 64, offset: 64)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2164, file: !2075, line: 234, baseType: !2207, size: 64, offset: 256)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2158, file: !2075, line: 197, baseType: !1952, size: 64, offset: 256)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !2088, file: !2075, line: 319, baseType: !1959, size: 256)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !2088, file: !2075, line: 320, baseType: !1978, size: 192)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1899, file: !140, line: 3384, baseType: !2223, size: 1472)
!2223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !2224)
!2224 = !{!2225, !2246, !2247, !2248, !2249}
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2223, file: !140, line: 3115, baseType: !2226, size: 1216)
!2226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !2227)
!2227 = !{!2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245}
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2226, file: !140, line: 2985, baseType: !2068, size: 960)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2226, file: !140, line: 2986, baseType: !1897, size: 64, offset: 960)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2226, file: !140, line: 2987, baseType: !1897, size: 64, offset: 1024)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2226, file: !140, line: 2988, baseType: !1897, size: 64, offset: 1088)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2226, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2226, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2226, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2226, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2226, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2226, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2226, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2226, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2226, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2226, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2226, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2226, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2226, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2226, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2223, file: !140, line: 3117, baseType: !1897, size: 64, offset: 1216)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2223, file: !140, line: 3119, baseType: !1897, size: 64, offset: 1280)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2223, file: !140, line: 3121, baseType: !1897, size: 64, offset: 1344)
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2223, file: !140, line: 3123, baseType: !1897, size: 64, offset: 1408)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1899, file: !140, line: 3385, baseType: !2251, size: 1088)
!2251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !2252)
!2252 = !{!2253, !2254, !2255}
!2253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2251, file: !140, line: 2875, baseType: !2068, size: 960)
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2251, file: !140, line: 2876, baseType: !2072, size: 64, offset: 960)
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2251, file: !140, line: 2877, baseType: !2256, size: 64, offset: 1024)
!2256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2257, size: 64)
!2257 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1899, file: !140, line: 3386, baseType: !2226, size: 1216)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1899, file: !140, line: 3387, baseType: !2260, size: 1280)
!2260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !2261)
!2261 = !{!2262, !2263}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2260, file: !140, line: 3094, baseType: !2226, size: 1216)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2260, file: !140, line: 3095, baseType: !2256, size: 64, offset: 1216)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1899, file: !140, line: 3388, baseType: !2265, size: 1216)
!2265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !2266)
!2266 = !{!2267, !2268, !2269, !2270, !2271, !2272}
!2267 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2265, file: !140, line: 2825, baseType: !2030, size: 896)
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2265, file: !140, line: 2827, baseType: !1897, size: 64, offset: 896)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2265, file: !140, line: 2828, baseType: !1897, size: 64, offset: 960)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2265, file: !140, line: 2829, baseType: !1897, size: 64, offset: 1024)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2265, file: !140, line: 2830, baseType: !1897, size: 64, offset: 1088)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2265, file: !140, line: 2831, baseType: !1897, size: 64, offset: 1152)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1899, file: !140, line: 3389, baseType: !2274, size: 1024)
!2274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !2275)
!2275 = !{!2276, !2277, !2278}
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2274, file: !140, line: 2851, baseType: !2068, size: 960)
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2274, file: !140, line: 2852, baseType: !1993, size: 32, offset: 960)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2274, file: !140, line: 2853, baseType: !1993, size: 32, offset: 992)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1899, file: !140, line: 3390, baseType: !2280, size: 1024)
!2280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !2281)
!2281 = !{!2282, !2283}
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2280, file: !140, line: 2858, baseType: !2068, size: 960)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2280, file: !140, line: 2859, baseType: !2256, size: 64, offset: 960)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1899, file: !140, line: 3391, baseType: !2285, size: 960)
!2285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !2286)
!2286 = !{!2287}
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2285, file: !140, line: 2863, baseType: !2068, size: 960)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1899, file: !140, line: 3392, baseType: !2289, size: 1472)
!2289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !2290)
!2290 = !{!2291}
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2289, file: !140, line: 3305, baseType: !2223, size: 1472)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1899, file: !140, line: 3393, baseType: !2293, size: 1792)
!2293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !2294)
!2294 = !{!2295, !2296, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443}
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2293, file: !140, line: 3249, baseType: !2223, size: 1472)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2293, file: !140, line: 3251, baseType: !2297, size: 64, offset: 1472)
!2297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2298, size: 64)
!2298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2299, line: 463, size: 1152, elements: !2300)
!2299 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2300 = !{!2301, !2304, !2307, !2310, !2313, !2316, !2366, !2367, !2368, !2369, !2370, !2396, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422}
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2298, file: !2299, line: 464, baseType: !2302, size: 64)
!2302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2303, size: 64)
!2303 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2299, line: 464, flags: DIFlagFwdDecl)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2298, file: !2299, line: 467, baseType: !2305, size: 64, offset: 64)
!2305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2306, size: 64)
!2306 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !2299, line: 467, flags: DIFlagFwdDecl)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2298, file: !2299, line: 470, baseType: !2308, size: 64, offset: 128)
!2308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2309, size: 64)
!2309 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1700, line: 65, flags: DIFlagFwdDecl)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2298, file: !2299, line: 473, baseType: !2311, size: 64, offset: 192)
!2311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2312, size: 64)
!2312 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2299, line: 166, flags: DIFlagFwdDecl)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2298, file: !2299, line: 476, baseType: !2314, size: 64, offset: 256)
!2314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2315, size: 64)
!2315 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2299, line: 476, flags: DIFlagFwdDecl)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2298, file: !2299, line: 479, baseType: !2317, size: 64, offset: 320)
!2317 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2318, line: 144, baseType: !2319)
!2318 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2320, size: 64)
!2320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2318, line: 100, size: 896, elements: !2321)
!2321 = !{!2322, !2328, !2333, !2338, !2340, !2343, !2344, !2345, !2346, !2347, !2352, !2354, !2355, !2360, !2365}
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2320, file: !2318, line: 102, baseType: !2323, size: 64)
!2323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2318, line: 52, baseType: !2324)
!2324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2325, size: 64)
!2325 = !DISubroutineType(types: !2326)
!2326 = !{!2327, !2191}
!2327 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2318, line: 47, baseType: !7)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2320, file: !2318, line: 105, baseType: !2329, size: 64, offset: 64)
!2329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2318, line: 59, baseType: !2330)
!2330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2331, size: 64)
!2331 = !DISubroutineType(types: !2332)
!2332 = !{!1993, !2191, !2191}
!2333 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2320, file: !2318, line: 108, baseType: !2334, size: 64, offset: 128)
!2334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2318, line: 63, baseType: !2335)
!2335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2336, size: 64)
!2336 = !DISubroutineType(types: !2337)
!2337 = !{null, !1894}
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2320, file: !2318, line: 111, baseType: !2339, size: 64, offset: 192)
!2339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1894, size: 64)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2320, file: !2318, line: 114, baseType: !2341, size: 64, offset: 256)
!2341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2342, line: 46, baseType: !1950)
!2342 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2320, file: !2318, line: 117, baseType: !2341, size: 64, offset: 320)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2320, file: !2318, line: 120, baseType: !2341, size: 64, offset: 384)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2320, file: !2318, line: 124, baseType: !7, size: 32, offset: 448)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2320, file: !2318, line: 128, baseType: !7, size: 32, offset: 480)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2320, file: !2318, line: 131, baseType: !2348, size: 64, offset: 512)
!2348 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2318, line: 75, baseType: !2349)
!2349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2350, size: 64)
!2350 = !DISubroutineType(types: !2351)
!2351 = !{!1894, !2341, !2341}
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2320, file: !2318, line: 132, baseType: !2353, size: 64, offset: 576)
!2353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2318, line: 78, baseType: !2335)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2320, file: !2318, line: 135, baseType: !1894, size: 64, offset: 640)
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2320, file: !2318, line: 136, baseType: !2356, size: 64, offset: 704)
!2356 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2318, line: 82, baseType: !2357)
!2357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2358, size: 64)
!2358 = !DISubroutineType(types: !2359)
!2359 = !{!1894, !1894, !2341, !2341}
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2320, file: !2318, line: 137, baseType: !2361, size: 64, offset: 768)
!2361 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2318, line: 83, baseType: !2362)
!2362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2363, size: 64)
!2363 = !DISubroutineType(types: !2364)
!2364 = !{null, !1894, !1894}
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2320, file: !2318, line: 141, baseType: !7, size: 32, offset: 832)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2298, file: !2299, line: 484, baseType: !1897, size: 64, offset: 384)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2298, file: !2299, line: 488, baseType: !1897, size: 64, offset: 448)
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2298, file: !2299, line: 493, baseType: !1897, size: 64, offset: 512)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2298, file: !2299, line: 496, baseType: !1897, size: 64, offset: 576)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2298, file: !2299, line: 501, baseType: !2371, size: 64, offset: 640)
!2371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2372, size: 64)
!2372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !2373)
!2373 = !{!2374, !2377, !2378, !2379, !2380, !2384, !2385, !2390, !2391, !2392, !2393, !2394, !2395}
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2372, file: !135, line: 2356, baseType: !2375, size: 64)
!2375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2376, size: 64)
!2376 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2372, file: !135, line: 2357, baseType: !2098, size: 64, offset: 64)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2372, file: !135, line: 2358, baseType: !1993, size: 32, offset: 128)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2372, file: !135, line: 2359, baseType: !1993, size: 32, offset: 160)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2372, file: !135, line: 2360, baseType: !2381, size: 128, offset: 192)
!2381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1993, size: 128, elements: !2382)
!2382 = !{!2383}
!2383 = !DISubrange(count: 4)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2372, file: !135, line: 2364, baseType: !1993, size: 32, offset: 320)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2372, file: !135, line: 2367, baseType: !2386, size: 128, offset: 384)
!2386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !2387)
!2387 = !{!2388, !2389}
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2386, file: !135, line: 2351, baseType: !2072, size: 64)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2386, file: !135, line: 2352, baseType: !1952, size: 64, offset: 64)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2372, file: !135, line: 2371, baseType: !134, size: 32, offset: 512)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2372, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2372, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2372, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2372, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2372, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2298, file: !2299, line: 504, baseType: !2397, size: 64, offset: 704)
!2397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2398, size: 64)
!2398 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2299, line: 504, flags: DIFlagFwdDecl)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2298, file: !2299, line: 507, baseType: !2317, size: 64, offset: 768)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2298, file: !2299, line: 510, baseType: !1993, size: 32, offset: 832)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2298, file: !2299, line: 513, baseType: !1993, size: 32, offset: 864)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2298, file: !2299, line: 516, baseType: !2024, size: 32, offset: 896)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2298, file: !2299, line: 519, baseType: !2024, size: 32, offset: 928)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2298, file: !2299, line: 522, baseType: !7, size: 32, offset: 960)
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2298, file: !2299, line: 523, baseType: !7, size: 32, offset: 992)
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2298, file: !2299, line: 528, baseType: !2098, size: 64, offset: 1024)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2298, file: !2299, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2298, file: !2299, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2298, file: !2299, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2298, file: !2299, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2298, file: !2299, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2298, file: !2299, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2298, file: !2299, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2414 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2298, file: !2299, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2298, file: !2299, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2298, file: !2299, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2298, file: !2299, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2298, file: !2299, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2298, file: !2299, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2298, file: !2299, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2298, file: !2299, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2298, file: !2299, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2293, file: !140, line: 3254, baseType: !1897, size: 64, offset: 1536)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2293, file: !140, line: 3257, baseType: !1897, size: 64, offset: 1600)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2293, file: !140, line: 3258, baseType: !1897, size: 64, offset: 1664)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2293, file: !140, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2293, file: !140, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2293, file: !140, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2293, file: !140, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2293, file: !140, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2293, file: !140, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2293, file: !140, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2293, file: !140, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2293, file: !140, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2293, file: !140, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2293, file: !140, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2293, file: !140, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2293, file: !140, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2293, file: !140, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2293, file: !140, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2293, file: !140, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2293, file: !140, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2293, file: !140, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1899, file: !140, line: 3394, baseType: !2445, size: 1344)
!2445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !140, line: 2279, size: 1344, elements: !2446)
!2446 = !{!2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488}
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2445, file: !140, line: 2280, baseType: !1935, size: 192)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2445, file: !140, line: 2281, baseType: !1897, size: 64, offset: 192)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2445, file: !140, line: 2282, baseType: !1897, size: 64, offset: 256)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2445, file: !140, line: 2283, baseType: !1897, size: 64, offset: 320)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2445, file: !140, line: 2284, baseType: !1897, size: 64, offset: 384)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2445, file: !140, line: 2285, baseType: !7, size: 32, offset: 448)
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2445, file: !140, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2445, file: !140, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2445, file: !140, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2445, file: !140, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2445, file: !140, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !2445, file: !140, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2445, file: !140, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !2445, file: !140, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2445, file: !140, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2445, file: !140, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2445, file: !140, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2445, file: !140, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2445, file: !140, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2445, file: !140, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2445, file: !140, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2445, file: !140, line: 2305, baseType: !7, size: 32, offset: 512)
!2469 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !2445, file: !140, line: 2306, baseType: !2141, size: 32, offset: 544)
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !2445, file: !140, line: 2307, baseType: !1897, size: 64, offset: 576)
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !2445, file: !140, line: 2308, baseType: !1897, size: 64, offset: 640)
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !2445, file: !140, line: 2314, baseType: !2473, size: 64, offset: 704)
!2473 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !140, line: 2309, size: 64, elements: !2474)
!2474 = !{!2475, !2476, !2477}
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !2473, file: !140, line: 2310, baseType: !1993, size: 32)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2473, file: !140, line: 2311, baseType: !2098, size: 64)
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !2473, file: !140, line: 2312, baseType: !2478, size: 64)
!2478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2479, size: 64)
!2479 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !140, line: 2277, flags: DIFlagFwdDecl)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2445, file: !140, line: 2315, baseType: !1897, size: 64, offset: 768)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !2445, file: !140, line: 2316, baseType: !1897, size: 64, offset: 832)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !2445, file: !140, line: 2317, baseType: !1897, size: 64, offset: 896)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !2445, file: !140, line: 2318, baseType: !1897, size: 64, offset: 960)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !2445, file: !140, line: 2319, baseType: !1897, size: 64, offset: 1024)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2445, file: !140, line: 2320, baseType: !1897, size: 64, offset: 1088)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2445, file: !140, line: 2321, baseType: !1897, size: 64, offset: 1152)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2445, file: !140, line: 2322, baseType: !1897, size: 64, offset: 1216)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2445, file: !140, line: 2324, baseType: !2489, size: 64, offset: 1280)
!2489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2490, size: 64)
!2490 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !140, line: 2324, flags: DIFlagFwdDecl)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1899, file: !140, line: 3395, baseType: !2492, size: 320)
!2492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !140, line: 1469, size: 320, elements: !2493)
!2493 = !{!2494, !2495, !2496}
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2492, file: !140, line: 1470, baseType: !1935, size: 192)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !2492, file: !140, line: 1471, baseType: !1897, size: 64, offset: 192)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2492, file: !140, line: 1472, baseType: !1897, size: 64, offset: 256)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1899, file: !140, line: 3396, baseType: !2498, size: 320)
!2498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !140, line: 1482, size: 320, elements: !2499)
!2499 = !{!2500, !2501, !2502}
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2498, file: !140, line: 1483, baseType: !1935, size: 192)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2498, file: !140, line: 1484, baseType: !1993, size: 32, offset: 192)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !2498, file: !140, line: 1485, baseType: !2503, size: 64, offset: 256)
!2503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1897, size: 64, elements: !1997)
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1899, file: !140, line: 3397, baseType: !2505, size: 384)
!2505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !140, line: 1829, size: 384, elements: !2506)
!2506 = !{!2507, !2508, !2509, !2510}
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2505, file: !140, line: 1830, baseType: !1935, size: 192)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2505, file: !140, line: 1831, baseType: !2024, size: 32, offset: 192)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2505, file: !140, line: 1832, baseType: !1897, size: 64, offset: 256)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !2505, file: !140, line: 1835, baseType: !2503, size: 64, offset: 320)
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1899, file: !140, line: 3398, baseType: !2512, size: 704)
!2512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !140, line: 1898, size: 704, elements: !2513)
!2513 = !{!2514, !2515, !2516, !2520, !2521, !2524}
!2514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2512, file: !140, line: 1899, baseType: !1935, size: 192)
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !2512, file: !140, line: 1902, baseType: !1897, size: 64, offset: 192)
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !2512, file: !140, line: 1905, baseType: !2517, size: 64, offset: 256)
!2517 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1700, line: 58, baseType: !2518)
!2518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2519, size: 64)
!2519 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1700, line: 57, flags: DIFlagFwdDecl)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !2512, file: !140, line: 1908, baseType: !7, size: 32, offset: 320)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !2512, file: !140, line: 1911, baseType: !2522, size: 64, offset: 384)
!2522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2523, size: 64)
!2523 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !140, line: 1876, flags: DIFlagFwdDecl)
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !2512, file: !140, line: 1914, baseType: !2525, size: 256, offset: 448)
!2525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !2526)
!2526 = !{!2527, !2529, !2530, !2535}
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2525, file: !140, line: 1884, baseType: !2528, size: 64)
!2528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2525, size: 64)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2525, file: !140, line: 1885, baseType: !2528, size: 64, offset: 64)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2525, file: !140, line: 1891, baseType: !2531, size: 64, offset: 128)
!2531 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2525, file: !140, line: 1891, size: 64, elements: !2532)
!2532 = !{!2533, !2534}
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2531, file: !140, line: 1891, baseType: !2517, size: 64)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2531, file: !140, line: 1891, baseType: !1897, size: 64)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2525, file: !140, line: 1892, baseType: !2536, size: 64, offset: 192)
!2536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1897, size: 64)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1899, file: !140, line: 3399, baseType: !2538, size: 704)
!2538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !140, line: 2008, size: 704, elements: !2539)
!2539 = !{!2540, !2541, !2542, !2543, !2544, !2545, !2557, !2558, !2559, !2560, !2561}
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2538, file: !140, line: 2009, baseType: !1935, size: 192)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2538, file: !140, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !2538, file: !140, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2538, file: !140, line: 2014, baseType: !2024, size: 32, offset: 224)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2538, file: !140, line: 2016, baseType: !1897, size: 64, offset: 256)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !2538, file: !140, line: 2017, baseType: !2546, size: 64, offset: 320)
!2546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2547, size: 64)
!2547 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !2548)
!2548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !2549)
!2549 = !{!2550}
!2550 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2548, file: !140, line: 183, baseType: !2551, size: 128)
!2551 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !2552)
!2552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !2553)
!2553 = !{!2554, !2555, !2556}
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2552, file: !140, line: 182, baseType: !7, size: 32)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2552, file: !140, line: 182, baseType: !7, size: 32, offset: 32)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2552, file: !140, line: 182, baseType: !2503, size: 64, offset: 64)
!2557 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !2538, file: !140, line: 2019, baseType: !1897, size: 64, offset: 384)
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !2538, file: !140, line: 2020, baseType: !1897, size: 64, offset: 448)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2538, file: !140, line: 2021, baseType: !1897, size: 64, offset: 512)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !2538, file: !140, line: 2022, baseType: !1897, size: 64, offset: 576)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !2538, file: !140, line: 2023, baseType: !1897, size: 64, offset: 640)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1899, file: !140, line: 3400, baseType: !2563, size: 832)
!2563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !140, line: 2430, size: 832, elements: !2564)
!2564 = !{!2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574}
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2563, file: !140, line: 2431, baseType: !1935, size: 192)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2563, file: !140, line: 2433, baseType: !1897, size: 64, offset: 192)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2563, file: !140, line: 2434, baseType: !1897, size: 64, offset: 256)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !2563, file: !140, line: 2435, baseType: !1897, size: 64, offset: 320)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !2563, file: !140, line: 2436, baseType: !1897, size: 64, offset: 384)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !2563, file: !140, line: 2437, baseType: !2546, size: 64, offset: 448)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !2563, file: !140, line: 2438, baseType: !1897, size: 64, offset: 512)
!2572 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !2563, file: !140, line: 2440, baseType: !1897, size: 64, offset: 576)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !2563, file: !140, line: 2441, baseType: !1897, size: 64, offset: 640)
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !2563, file: !140, line: 2443, baseType: !2575, size: 128, offset: 704)
!2575 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !140, line: 182, baseType: !2576)
!2576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !140, line: 182, size: 128, elements: !2577)
!2577 = !{!2578}
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2576, file: !140, line: 182, baseType: !2551, size: 128)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !1899, file: !140, line: 3401, baseType: !2580, size: 320)
!2580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !140, line: 3327, size: 320, elements: !2581)
!2581 = !{!2582, !2583, !2590}
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2580, file: !140, line: 3329, baseType: !1935, size: 192)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !2580, file: !140, line: 3330, baseType: !2584, size: 64, offset: 192)
!2584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2585, size: 64)
!2585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !140, line: 3320, size: 192, elements: !2586)
!2586 = !{!2587, !2588, !2589}
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2585, file: !140, line: 3322, baseType: !2584, size: 64)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2585, file: !140, line: 3323, baseType: !2584, size: 64, offset: 64)
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2585, file: !140, line: 3324, baseType: !1897, size: 64, offset: 128)
!2590 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !2580, file: !140, line: 3331, baseType: !2584, size: 64, offset: 256)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !1899, file: !140, line: 3402, baseType: !2592, size: 256)
!2592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !140, line: 1540, size: 256, elements: !2593)
!2593 = !{!2594, !2595}
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2592, file: !140, line: 1541, baseType: !1935, size: 192)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !2592, file: !140, line: 1542, baseType: !2596, size: 64, offset: 192)
!2596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2597, size: 64)
!2597 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !140, line: 1538, baseType: !2598)
!2598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !140, line: 1538, size: 192, elements: !2599)
!2599 = !{!2600}
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2598, file: !140, line: 1538, baseType: !2601, size: 192)
!2601 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !140, line: 1537, baseType: !2602)
!2602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !140, line: 1537, size: 192, elements: !2603)
!2603 = !{!2604, !2605, !2606}
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2602, file: !140, line: 1537, baseType: !7, size: 32)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2602, file: !140, line: 1537, baseType: !7, size: 32, offset: 32)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2602, file: !140, line: 1537, baseType: !2607, size: 128, offset: 64)
!2607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2608, size: 128, elements: !1997)
!2608 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !140, line: 1535, baseType: !2609)
!2609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !140, line: 1532, size: 128, elements: !2610)
!2610 = !{!2611, !2612}
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2609, file: !140, line: 1533, baseType: !1897, size: 64)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2609, file: !140, line: 1534, baseType: !1897, size: 64, offset: 64)
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !1899, file: !140, line: 3403, baseType: !2614, size: 512)
!2614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !140, line: 1938, size: 512, elements: !2615)
!2615 = !{!2616, !2617, !2618, !2619, !2625, !2627, !2628}
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2614, file: !140, line: 1939, baseType: !1935, size: 192)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2614, file: !140, line: 1940, baseType: !2024, size: 32, offset: 192)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2614, file: !140, line: 1941, baseType: !139, size: 32, offset: 224)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2614, file: !140, line: 1946, baseType: !2620, size: 32, offset: 256)
!2620 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !140, line: 1942, size: 32, elements: !2621)
!2621 = !{!2622, !2623, !2624}
!2622 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !2620, file: !140, line: 1943, baseType: !158, size: 32)
!2623 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !2620, file: !140, line: 1944, baseType: !165, size: 32)
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !2620, file: !140, line: 1945, baseType: !172, size: 32)
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !2614, file: !140, line: 1950, baseType: !2626, size: 64, offset: 320)
!2626 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1700, line: 66, baseType: !2308)
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !2614, file: !140, line: 1951, baseType: !2626, size: 64, offset: 384)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !2614, file: !140, line: 1953, baseType: !2503, size: 64, offset: 448)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !1899, file: !140, line: 3404, baseType: !2630, size: 1664)
!2630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !140, line: 3337, size: 1664, elements: !2631)
!2631 = !{!2632, !2633}
