; ModuleID = 'cfghooks.c'
source_filename = "cfghooks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!601 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!602 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!603 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cdi_direction", file: !135, line: 912, baseType: !7, size: 32, elements: !605)
!605 = !{!606, !607}
!606 = !DIEnumerator(name: "CDI_DOMINATORS", value: 1, isUnsigned: true)
!607 = !DIEnumerator(name: "CDI_POST_DOMINATORS", value: 2, isUnsigned: true)
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !135, line: 295, baseType: !7, size: 32, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!610 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!611 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!612 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!613 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!614 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!615 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!616 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!617 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!618 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!619 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!620 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!621 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !623, line: 836, baseType: !7, size: 32, elements: !624)
!623 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!625 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!626 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!627 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!628 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!629 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!630 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!631 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!632 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!633 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!634 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!635 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!636 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!637 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!638 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!639 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!640 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!641 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!642 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!643 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!644 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!645 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!646 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!647 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!648 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!649 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!650 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!651 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!652 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!653 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!654 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!655 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!656 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!657 = !{!658, !2018, !1000, !818, !1220, !985, !777, !895, !2019}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !423, line: 111, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !662)
!662 = !{!663, !1985, !1986, !1987, !1988, !1992, !1993, !1994, !2012, !2013, !2014, !2015, !2016, !2017}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !661, file: !135, line: 219, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !666, file: !135, line: 151, baseType: !669, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !670, file: !135, line: 150, baseType: !7, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !670, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !670, file: !135, line: 150, baseType: !675, size: 64, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 64, elements: !822)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !423, line: 108, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !679)
!679 = !{!680, !681, !682, !1977, !1978, !1979, !1980, !1981, !1982, !1983}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !678, file: !135, line: 124, baseType: !660, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !678, file: !135, line: 125, baseType: !660, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !678, file: !135, line: 131, baseType: !683, size: 64, offset: 128)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !684)
!684 = !{!685, !1976}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !683, file: !135, line: 129, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !423, line: 66, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !689, line: 143, size: 192, elements: !690)
!689 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !{!691, !1974, !1975}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !688, file: !689, line: 145, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !423, line: 69, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !689, line: 136, size: 192, elements: !695)
!695 = !{!696, !1972, !1973}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !694, file: !689, line: 137, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !423, line: 58, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !689, line: 737, size: 768, elements: !700)
!700 = !{!701, !1819, !1829, !1835, !1840, !1845, !1852, !1858, !1864, !1869, !1883, !1888, !1894, !1899, !1909, !1914, !1930, !1937, !1944, !1950, !1955, !1961, !1967}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !699, file: !689, line: 738, baseType: !702, size: 256)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !689, line: 271, size: 256, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !719, !720, !721}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !702, file: !689, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !702, file: !689, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !702, file: !689, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !702, file: !689, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !702, file: !689, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !702, file: !689, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !702, file: !689, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !702, file: !689, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !702, file: !689, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !702, file: !689, line: 312, baseType: !7, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !702, file: !689, line: 316, baseType: !715, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !716, line: 58, baseType: !717)
!716 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !718, line: 44, baseType: !7)
!718 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !702, file: !689, line: 319, baseType: !7, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !702, file: !689, line: 323, baseType: !660, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !702, file: !689, line: 327, baseType: !722, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !423, line: 56, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !725)
!725 = !{!726, !759, !765, !778, !797, !808, !813, !824, !830, !844, !852, !890, !1067, !1095, !1112, !1113, !1118, !1127, !1133, !1138, !1142, !1146, !1470, !1517, !1523, !1529, !1536, !1549, !1563, !1580, !1592, !1614, !1629, !1801}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !724, file: !164, line: 3372, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !727, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !727, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !727, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !727, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !727, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !727, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !727, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !727, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !727, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !727, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !727, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !727, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !727, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !727, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !727, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !727, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !727, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !727, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !727, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !727, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !727, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !727, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !727, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !727, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !727, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !727, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !727, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !727, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !727, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !727, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !724, file: !164, line: 3373, baseType: !760, size: 192)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !760, file: !164, line: 403, baseType: !727, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !760, file: !164, line: 404, baseType: !722, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !760, file: !164, line: 405, baseType: !722, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !724, file: !164, line: 3374, baseType: !766, size: 320)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !164, line: 1385, baseType: !760, size: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !766, file: !164, line: 1386, baseType: !770, size: 128, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !771, line: 58, baseType: !772)
!771 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 54, size: 128, elements: !773)
!773 = !{!774, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !772, file: !771, line: 56, baseType: !775, size: 64)
!775 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !772, file: !771, line: 57, baseType: !777, size: 64, offset: 64)
!777 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !724, file: !164, line: 3375, baseType: !779, size: 256)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !164, line: 1398, baseType: !760, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !779, file: !164, line: 1399, baseType: !783, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !785, line: 52, size: 256, elements: !786)
!785 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!786 = !{!787, !788, !789, !790, !791, !792, !793}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !784, file: !785, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !784, file: !785, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !784, file: !785, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !784, file: !785, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !784, file: !785, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !784, file: !785, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !784, file: !785, line: 62, baseType: !794, size: 192, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 192, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 3)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !724, file: !164, line: 3376, baseType: !798, size: 256)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !164, line: 1409, baseType: !760, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !798, file: !164, line: 1410, baseType: !802, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !804, line: 27, size: 192, elements: !805)
!804 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !804, line: 29, baseType: !770, size: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !803, file: !804, line: 30, baseType: !5, size: 32, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !724, file: !164, line: 3377, baseType: !809, size: 256)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !164, line: 1438, baseType: !760, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !809, file: !164, line: 1439, baseType: !722, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !724, file: !164, line: 3378, baseType: !814, size: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !815)
!815 = !{!816, !817, !819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !164, line: 1419, baseType: !760, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !814, file: !164, line: 1420, baseType: !818, size: 32, offset: 192)
!818 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !814, file: !164, line: 1421, baseType: !820, size: 8, offset: 224)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 8, elements: !822)
!821 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!822 = !{!823}
!823 = !DISubrange(count: 1)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !724, file: !164, line: 3379, baseType: !825, size: 320)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !164, line: 1429, baseType: !760, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !825, file: !164, line: 1430, baseType: !722, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !825, file: !164, line: 1431, baseType: !722, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !724, file: !164, line: 3380, baseType: !831, size: 320)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !164, line: 1461, baseType: !760, size: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !831, file: !164, line: 1462, baseType: !835, size: 128, offset: 192)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !836, line: 31, size: 128, elements: !837)
!836 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!837 = !{!838, !842, !843}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !835, file: !836, line: 32, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!841 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !835, file: !836, line: 33, baseType: !7, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !835, file: !836, line: 34, baseType: !7, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !724, file: !164, line: 3381, baseType: !845, size: 384)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !846)
!846 = !{!847, !848, !849, !850, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !164, line: 2508, baseType: !760, size: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !845, file: !164, line: 2509, baseType: !715, size: 32, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !845, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !164, line: 2511, baseType: !722, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !845, file: !164, line: 2512, baseType: !722, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !724, file: !164, line: 3382, baseType: !853, size: 896)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !164, line: 2653, baseType: !845, size: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !853, file: !164, line: 2654, baseType: !722, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !853, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !853, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !853, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !853, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !853, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !853, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !853, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !853, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !853, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !853, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !853, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !853, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !853, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !853, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !853, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !853, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !853, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !853, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !853, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !853, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !853, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !853, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !853, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !853, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !853, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !853, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !853, file: !164, line: 2705, baseType: !722, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !853, file: !164, line: 2706, baseType: !722, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !853, file: !164, line: 2707, baseType: !722, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !853, file: !164, line: 2708, baseType: !722, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !853, file: !164, line: 2711, baseType: !888, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !724, file: !164, line: 3383, baseType: !891, size: 960)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !164, line: 2757, baseType: !853, size: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !891, file: !164, line: 2758, baseType: !895, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !423, line: 50, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !623, line: 240, size: 384, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !897, file: !623, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !897, file: !623, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !897, file: !623, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !897, file: !623, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !897, file: !623, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !897, file: !623, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !897, file: !623, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !897, file: !623, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !897, file: !623, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !897, file: !623, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !897, file: !623, line: 321, baseType: !910, size: 320, offset: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !623, line: 315, size: 320, elements: !911)
!911 = !{!912, !1034, !1036, !1065, !1066}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !910, file: !623, line: 316, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 64, elements: !822)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !623, line: 183, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !623, line: 166, size: 64, elements: !916)
!916 = !{!917, !918, !919, !922, !923, !931, !932, !944, !947, !1009, !1010, !1011, !1024, !1031}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !915, file: !623, line: 168, baseType: !818, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !915, file: !623, line: 169, baseType: !7, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !915, file: !623, line: 170, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !915, file: !623, line: 171, baseType: !895, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !915, file: !623, line: 172, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !423, line: 53, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !623, line: 359, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !926, file: !623, line: 360, baseType: !818, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !926, file: !623, line: 361, baseType: !930, size: 64, offset: 64)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 64, elements: !822)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !915, file: !623, line: 173, baseType: !5, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !915, file: !623, line: 174, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !623, line: 133, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 115, size: 32, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !934, file: !623, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !934, file: !623, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !934, file: !623, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !934, file: !623, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !934, file: !623, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !934, file: !623, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !934, file: !623, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !934, file: !623, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !915, file: !623, line: 175, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !623, line: 175, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !915, file: !623, line: 176, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !950, line: 75, size: 256, elements: !951)
!950 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!951 = !{!952, !966, !967, !968}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !949, file: !950, line: 76, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !950, line: 68, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !950, line: 63, size: 320, elements: !956)
!956 = !{!957, !959, !960, !961}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !950, line: 64, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !955, file: !950, line: 65, baseType: !958, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !955, file: !950, line: 66, baseType: !7, size: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !955, file: !950, line: 67, baseType: !962, size: 128, offset: 192)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 128, elements: !964)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !950, line: 29, baseType: !775)
!964 = !{!965}
!965 = !DISubrange(count: 2)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !949, file: !950, line: 77, baseType: !953, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !949, file: !950, line: 78, baseType: !7, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !949, file: !950, line: 79, baseType: !969, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !950, line: 49, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !950, line: 45, size: 832, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !971, file: !950, line: 46, baseType: !958, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !971, file: !950, line: 47, baseType: !948, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !971, file: !950, line: 48, baseType: !976, size: 704, offset: 128)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !977, line: 164, size: 704, elements: !978)
!977 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!978 = !{!979, !980, !991, !992, !993, !994, !995, !996, !1001, !1005, !1006, !1007, !1008}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !976, file: !977, line: 166, baseType: !777, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !976, file: !977, line: 167, baseType: !981, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !977, line: 157, size: 192, elements: !983)
!983 = !{!984, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !982, file: !977, line: 159, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !982, file: !977, line: 160, baseType: !981, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !982, file: !977, line: 161, baseType: !988, size: 32, offset: 128)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 32, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 4)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !976, file: !977, line: 168, baseType: !985, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !976, file: !977, line: 169, baseType: !985, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !976, file: !977, line: 170, baseType: !985, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !976, file: !977, line: 171, baseType: !777, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !976, file: !977, line: 172, baseType: !818, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !976, file: !977, line: 176, baseType: !997, size: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!981, !1000, !777}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !976, file: !977, line: 177, baseType: !1002, size: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !1000, !981}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !976, file: !977, line: 178, baseType: !1000, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !976, file: !977, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !976, file: !977, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !976, file: !977, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !915, file: !623, line: 177, baseType: !722, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !915, file: !623, line: 178, baseType: !660, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !915, file: !623, line: 179, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !623, line: 150, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !623, line: 142, size: 320, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1022, !1023}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1014, file: !623, line: 144, baseType: !722, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1014, file: !623, line: 145, baseType: !895, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1014, file: !623, line: 146, baseType: !895, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1014, file: !623, line: 147, baseType: !1020, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1021, line: 31, baseType: !818)
!1021 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1014, file: !623, line: 148, baseType: !7, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1014, file: !623, line: 149, baseType: !841, size: 8, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !915, file: !623, line: 180, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !623, line: 162, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !623, line: 159, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1027, file: !623, line: 160, baseType: !722, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1027, file: !623, line: 161, baseType: !777, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !915, file: !623, line: 181, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !623, line: 181, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !910, file: !623, line: 317, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 64, elements: !822)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !910, file: !623, line: 318, baseType: !1037, size: 320)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !623, line: 188, size: 320, elements: !1038)
!1038 = !{!1039, !1041, !1064}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1037, file: !623, line: 190, baseType: !1040, size: 192)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 192, elements: !795)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1037, file: !623, line: 193, baseType: !1042, size: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !623, line: 206, size: 320, elements: !1044)
!1044 = !{!1045, !1049, !1050, !1051, !1063}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1043, file: !623, line: 208, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !423, line: 62, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !423, line: 61, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1043, file: !623, line: 211, baseType: !7, size: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !623, line: 214, baseType: !777, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1043, file: !623, line: 224, baseType: !1052, size: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !623, line: 202, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !623, line: 202, size: 128, elements: !1055)
!1055 = !{!1056}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1054, file: !623, line: 202, baseType: !1057, size: 128)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !623, line: 200, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !623, line: 200, size: 128, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1058, file: !623, line: 200, baseType: !7, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1058, file: !623, line: 200, baseType: !7, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1058, file: !623, line: 200, baseType: !930, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1043, file: !623, line: 234, baseType: !1052, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1037, file: !623, line: 197, baseType: !777, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !910, file: !623, line: 319, baseType: !784, size: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !910, file: !623, line: 320, baseType: !803, size: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !724, file: !164, line: 3384, baseType: !1068, size: 1472)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1069)
!1069 = !{!1070, !1091, !1092, !1093, !1094}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !164, line: 3115, baseType: !1071, size: 1216)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !164, line: 2985, baseType: !891, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1071, file: !164, line: 2986, baseType: !722, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1071, file: !164, line: 2987, baseType: !722, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1071, file: !164, line: 2988, baseType: !722, size: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1071, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1071, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1071, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1071, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1071, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1071, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1071, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1071, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1071, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1071, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1071, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1071, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1071, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1071, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1068, file: !164, line: 3117, baseType: !722, size: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1068, file: !164, line: 3119, baseType: !722, size: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1068, file: !164, line: 3121, baseType: !722, size: 64, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1068, file: !164, line: 3123, baseType: !722, size: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !724, file: !164, line: 3385, baseType: !1096, size: 1088)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !164, line: 2875, baseType: !891, size: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1096, file: !164, line: 2876, baseType: !895, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1096, file: !164, line: 2877, baseType: !1101, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1103, line: 172, size: 128, elements: !1104)
!1103 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1102, file: !1103, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1102, file: !1103, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1102, file: !1103, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1102, file: !1103, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1102, file: !1103, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1102, file: !1103, line: 195, baseType: !7, size: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1102, file: !1103, line: 199, baseType: !722, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !724, file: !164, line: 3386, baseType: !1071, size: 1216)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !724, file: !164, line: 3387, baseType: !1114, size: 1280)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !164, line: 3094, baseType: !1071, size: 1216)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1114, file: !164, line: 3095, baseType: !1101, size: 64, offset: 1216)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !724, file: !164, line: 3388, baseType: !1119, size: 1216)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !164, line: 2825, baseType: !853, size: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1119, file: !164, line: 2827, baseType: !722, size: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1119, file: !164, line: 2828, baseType: !722, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1119, file: !164, line: 2829, baseType: !722, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1119, file: !164, line: 2830, baseType: !722, size: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1119, file: !164, line: 2831, baseType: !722, size: 64, offset: 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !724, file: !164, line: 3389, baseType: !1128, size: 1024)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1129)
!1129 = !{!1130, !1131, !1132}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1128, file: !164, line: 2851, baseType: !891, size: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1128, file: !164, line: 2852, baseType: !818, size: 32, offset: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1128, file: !164, line: 2853, baseType: !818, size: 32, offset: 992)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !724, file: !164, line: 3390, baseType: !1134, size: 1024)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !164, line: 2858, baseType: !891, size: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1134, file: !164, line: 2859, baseType: !1101, size: 64, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !724, file: !164, line: 3391, baseType: !1139, size: 960)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1140)
!1140 = !{!1141}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !164, line: 2863, baseType: !891, size: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !724, file: !164, line: 3392, baseType: !1143, size: 1472)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1144)
!1144 = !{!1145}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1143, file: !164, line: 3305, baseType: !1068, size: 1472)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !724, file: !164, line: 3393, baseType: !1147, size: 1792)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1148)
!1148 = !{!1149, !1150, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !164, line: 3249, baseType: !1068, size: 1472)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1147, file: !164, line: 3251, baseType: !1151, size: 64, offset: 1472)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1153, line: 463, size: 1152, elements: !1154)
!1153 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1154 = !{!1155, !1158, !1188, !1189, !1330, !1393, !1394, !1395, !1396, !1397, !1398, !1422, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1152, file: !1153, line: 464, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1153, line: 464, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1152, file: !1153, line: 467, baseType: !1159, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1177, !1178, !1179, !1180, !1181, !1182, !1184, !1186, !1187}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1160, file: !135, line: 377, baseType: !659, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1160, file: !135, line: 378, baseType: !659, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1160, file: !135, line: 381, baseType: !1165, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1167, file: !135, line: 282, baseType: !1170, size: 128)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1171, file: !135, line: 281, baseType: !7, size: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1171, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1171, file: !135, line: 281, baseType: !1176, size: 64, offset: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 64, elements: !822)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1160, file: !135, line: 384, baseType: !818, size: 32, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1160, file: !135, line: 387, baseType: !818, size: 32, offset: 224)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1160, file: !135, line: 390, baseType: !818, size: 32, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1160, file: !135, line: 394, baseType: !1165, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1160, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1160, file: !135, line: 399, baseType: !1183, size: 64, offset: 416)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !964)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1160, file: !135, line: 402, baseType: !1185, size: 64, offset: 480)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !964)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1160, file: !135, line: 406, baseType: !818, size: 32, offset: 544)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1160, file: !135, line: 409, baseType: !818, size: 32, offset: 576)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1152, file: !1153, line: 470, baseType: !687, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1152, file: !1153, line: 473, baseType: !1190, size: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1103, line: 39, size: 1152, elements: !1192)
!1192 = !{!1193, !1245, !1258, !1271, !1272, !1284, !1285, !1289, !1290, !1291, !1292, !1293}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1191, file: !1103, line: 41, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1195, line: 144, baseType: !1196)
!1195 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1195, line: 100, size: 896, elements: !1198)
!1198 = !{!1199, !1207, !1212, !1217, !1219, !1222, !1223, !1224, !1225, !1226, !1231, !1233, !1234, !1239, !1244}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1197, file: !1195, line: 102, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1195, line: 52, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1195, line: 47, baseType: !7)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1197, file: !1195, line: 105, baseType: !1208, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1195, line: 59, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!818, !1205, !1205}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1197, file: !1195, line: 108, baseType: !1213, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1195, line: 63, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{null, !1000}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1197, file: !1195, line: 111, baseType: !1218, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !1195, line: 114, baseType: !1220, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1221, line: 46, baseType: !775)
!1221 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1197, file: !1195, line: 117, baseType: !1220, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1197, file: !1195, line: 120, baseType: !1220, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1197, file: !1195, line: 124, baseType: !7, size: 32, offset: 448)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1197, file: !1195, line: 128, baseType: !7, size: 32, offset: 480)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1197, file: !1195, line: 131, baseType: !1227, size: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1195, line: 75, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!1000, !1220, !1220}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1197, file: !1195, line: 132, baseType: !1232, size: 64, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1195, line: 78, baseType: !1214)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1197, file: !1195, line: 135, baseType: !1000, size: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1197, file: !1195, line: 136, baseType: !1235, size: 64, offset: 704)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1195, line: 82, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!1000, !1000, !1220, !1220}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1197, file: !1195, line: 137, baseType: !1240, size: 64, offset: 768)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1195, line: 83, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1000, !1000}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1197, file: !1195, line: 141, baseType: !7, size: 32, offset: 832)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1191, file: !1103, line: 48, baseType: !1246, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !689, line: 35, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !689, line: 35, size: 128, elements: !1249)
!1249 = !{!1250}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1248, file: !689, line: 35, baseType: !1251, size: 128)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !689, line: 33, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !689, line: 33, size: 128, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1252, file: !689, line: 33, baseType: !7, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1252, file: !689, line: 33, baseType: !7, size: 32, offset: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1252, file: !689, line: 33, baseType: !1257, size: 64, offset: 64)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 64, elements: !822)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1191, file: !1103, line: 51, baseType: !1259, size: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1262)
!1262 = !{!1263}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1261, file: !164, line: 183, baseType: !1264, size: 128)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !164, line: 182, size: 128, elements: !1266)
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1265, file: !164, line: 182, baseType: !7, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1265, file: !164, line: 182, baseType: !7, size: 32, offset: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1265, file: !164, line: 182, baseType: !1270, size: 64, offset: 64)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 64, elements: !822)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1191, file: !1103, line: 54, baseType: !722, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1191, file: !1103, line: 57, baseType: !1273, size: 128, offset: 256)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1274, line: 31, size: 128, elements: !1275)
!1274 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1282}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1273, file: !1274, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1273, file: !1274, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1273, file: !1274, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1273, file: !1274, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1273, file: !1274, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1273, file: !1274, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1273, file: !1274, line: 56, baseType: !1283, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !423, line: 47, baseType: !948)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1191, file: !1103, line: 60, baseType: !1273, size: 128, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1191, file: !1103, line: 64, baseType: !1286, size: 64, offset: 512)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1288, line: 33, flags: DIFlagFwdDecl)
!1288 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1191, file: !1103, line: 67, baseType: !722, size: 64, offset: 576)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1191, file: !1103, line: 73, baseType: !1194, size: 64, offset: 640)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1191, file: !1103, line: 77, baseType: !1283, size: 64, offset: 704)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1191, file: !1103, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1191, file: !1103, line: 82, baseType: !1294, size: 320, offset: 832)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1295, line: 62, size: 320, elements: !1296)
!1295 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1296 = !{!1297, !1303, !1304, !1305, !1306, !1313}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1294, file: !1295, line: 63, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1295, line: 56, size: 128, elements: !1300)
!1300 = !{!1301, !1302}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1299, file: !1295, line: 57, baseType: !1298, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1299, file: !1295, line: 58, baseType: !820, size: 8, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1294, file: !1295, line: 64, baseType: !7, size: 32, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1294, file: !1295, line: 66, baseType: !7, size: 32, offset: 96)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1294, file: !1295, line: 68, baseType: !841, size: 8, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1294, file: !1295, line: 70, baseType: !1307, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1295, line: 37, size: 128, elements: !1309)
!1309 = !{!1310, !1311}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1308, file: !1295, line: 39, baseType: !1307, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1308, file: !1295, line: 40, baseType: !1312, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1294, file: !1295, line: 71, baseType: !1314, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1295, line: 45, size: 320, elements: !1316)
!1316 = !{!1317, !1318}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1315, file: !1295, line: 47, baseType: !1314, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1315, file: !1295, line: 48, baseType: !1319, size: 256, offset: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1320)
!1320 = !{!1321, !1323, !1324, !1329}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1319, file: !164, line: 1884, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1319, file: !164, line: 1885, baseType: !1322, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1319, file: !164, line: 1891, baseType: !1325, size: 64, offset: 128)
!1325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1319, file: !164, line: 1891, size: 64, elements: !1326)
!1326 = !{!1327, !1328}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1325, file: !164, line: 1891, baseType: !697, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1325, file: !164, line: 1891, baseType: !722, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1319, file: !164, line: 1892, baseType: !1312, size: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1152, file: !1153, line: 476, baseType: !1331, size: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1333)
!1333 = !{!1334, !1335, !1391, !1392}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1332, file: !146, line: 189, baseType: !818, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1332, file: !146, line: 192, baseType: !1336, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1339)
!1339 = !{!1340}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1338, file: !146, line: 87, baseType: !1341, size: 128)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1343)
!1343 = !{!1344, !1345, !1346}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1342, file: !146, line: 85, baseType: !7, size: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1342, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1342, file: !146, line: 85, baseType: !1347, size: 64, offset: 64)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1348, size: 64, elements: !822)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1381, !1389, !1390}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1350, file: !146, line: 102, baseType: !818, size: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1350, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1350, file: !146, line: 108, baseType: !660, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1350, file: !146, line: 111, baseType: !660, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1350, file: !146, line: 114, baseType: !1357, size: 64, offset: 192)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1357, file: !146, line: 42, baseType: !145, size: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1357, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1350, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1350, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1350, file: !146, line: 123, baseType: !1336, size: 64, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1350, file: !146, line: 126, baseType: !1349, size: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1350, file: !146, line: 129, baseType: !1349, size: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1350, file: !146, line: 132, baseType: !1000, size: 64, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1350, file: !146, line: 139, baseType: !722, size: 64, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1350, file: !146, line: 143, baseType: !770, size: 128, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1350, file: !146, line: 146, baseType: !770, size: 128, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1350, file: !146, line: 148, baseType: !841, size: 8, offset: 896)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1350, file: !146, line: 149, baseType: !841, size: 8, offset: 904)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1350, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1350, file: !146, line: 156, baseType: !1374, size: 64, offset: 960)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1375, file: !146, line: 50, baseType: !697, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1375, file: !146, line: 59, baseType: !770, size: 128, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1375, file: !146, line: 64, baseType: !841, size: 8, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1375, file: !146, line: 67, baseType: !1374, size: 64, offset: 256)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1350, file: !146, line: 159, baseType: !1382, size: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1383, file: !146, line: 74, baseType: !677, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1383, file: !146, line: 77, baseType: !1382, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1383, file: !146, line: 78, baseType: !1382, size: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1383, file: !146, line: 81, baseType: !1382, size: 64, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1350, file: !146, line: 162, baseType: !841, size: 8, offset: 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1350, file: !146, line: 166, baseType: !722, size: 64, offset: 1152)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1332, file: !146, line: 197, baseType: !1194, size: 64, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1332, file: !146, line: 200, baseType: !1349, size: 64, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1152, file: !1153, line: 479, baseType: !1194, size: 64, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1152, file: !1153, line: 484, baseType: !722, size: 64, offset: 384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1152, file: !1153, line: 488, baseType: !722, size: 64, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1152, file: !1153, line: 493, baseType: !722, size: 64, offset: 512)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1152, file: !1153, line: 496, baseType: !722, size: 64, offset: 576)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1152, file: !1153, line: 501, baseType: !1399, size: 64, offset: 640)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1401)
!1401 = !{!1402, !1405, !1406, !1407, !1408, !1410, !1411, !1416, !1417, !1418, !1419, !1420, !1421}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1400, file: !159, line: 2356, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1400, file: !159, line: 2357, baseType: !920, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1400, file: !159, line: 2358, baseType: !818, size: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1400, file: !159, line: 2359, baseType: !818, size: 32, offset: 160)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1400, file: !159, line: 2360, baseType: !1409, size: 128, offset: 192)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 128, elements: !989)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1400, file: !159, line: 2364, baseType: !818, size: 32, offset: 320)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1400, file: !159, line: 2367, baseType: !1412, size: 128, offset: 384)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1413)
!1413 = !{!1414, !1415}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1412, file: !159, line: 2351, baseType: !895, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1412, file: !159, line: 2352, baseType: !777, size: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1400, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1400, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1400, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1400, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1400, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1400, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1152, file: !1153, line: 504, baseType: !1423, size: 64, offset: 704)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1153, line: 504, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1152, file: !1153, line: 507, baseType: !1194, size: 64, offset: 768)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1152, file: !1153, line: 510, baseType: !818, size: 32, offset: 832)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1152, file: !1153, line: 513, baseType: !818, size: 32, offset: 864)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1152, file: !1153, line: 516, baseType: !715, size: 32, offset: 896)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1152, file: !1153, line: 519, baseType: !715, size: 32, offset: 928)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1152, file: !1153, line: 522, baseType: !7, size: 32, offset: 960)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1152, file: !1153, line: 523, baseType: !7, size: 32, offset: 992)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1152, file: !1153, line: 528, baseType: !920, size: 64, offset: 1024)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1152, file: !1153, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1152, file: !1153, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1152, file: !1153, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1152, file: !1153, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1152, file: !1153, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1152, file: !1153, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
