; ModuleID = 'store-motion.c'
source_filename = "store-motion.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }

!758 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!764 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!765 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!766 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!767 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!768 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!769 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!770 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!771 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!772 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!773 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!774 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!775 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!776 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!777 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!778 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!779 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!780 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!781 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!782 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!783 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!784 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!785 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!786 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !787, line: 147, baseType: !7, size: 32, elements: !788)
!787 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!788 = !{!789, !790}
!789 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!790 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_rtl_index", file: !610, line: 1994, baseType: !7, size: 32, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!793 = !DIEnumerator(name: "GR_PC", value: 0, isUnsigned: true)
!794 = !DIEnumerator(name: "GR_CC0", value: 1, isUnsigned: true)
!795 = !DIEnumerator(name: "GR_STACK_POINTER", value: 2, isUnsigned: true)
!796 = !DIEnumerator(name: "GR_FRAME_POINTER", value: 3, isUnsigned: true)
!797 = !DIEnumerator(name: "GR_HARD_FRAME_POINTER", value: 4, isUnsigned: true)
!798 = !DIEnumerator(name: "GR_ARG_POINTER", value: 5, isUnsigned: true)
!799 = !DIEnumerator(name: "GR_VIRTUAL_INCOMING_ARGS", value: 6, isUnsigned: true)
!800 = !DIEnumerator(name: "GR_VIRTUAL_STACK_ARGS", value: 7, isUnsigned: true)
!801 = !DIEnumerator(name: "GR_VIRTUAL_STACK_DYNAMIC", value: 8, isUnsigned: true)
!802 = !DIEnumerator(name: "GR_VIRTUAL_OUTGOING_ARGS", value: 9, isUnsigned: true)
!803 = !DIEnumerator(name: "GR_VIRTUAL_CFA", value: 10, isUnsigned: true)
!804 = !DIEnumerator(name: "GR_MAX", value: 11, isUnsigned: true)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insn_note", file: !610, line: 956, baseType: !7, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!807 = !DIEnumerator(name: "NOTE_INSN_DELETED", value: 0, isUnsigned: true)
!808 = !DIEnumerator(name: "NOTE_INSN_DELETED_LABEL", value: 1, isUnsigned: true)
!809 = !DIEnumerator(name: "NOTE_INSN_BLOCK_BEG", value: 2, isUnsigned: true)
!810 = !DIEnumerator(name: "NOTE_INSN_BLOCK_END", value: 3, isUnsigned: true)
!811 = !DIEnumerator(name: "NOTE_INSN_FUNCTION_BEG", value: 4, isUnsigned: true)
!812 = !DIEnumerator(name: "NOTE_INSN_PROLOGUE_END", value: 5, isUnsigned: true)
!813 = !DIEnumerator(name: "NOTE_INSN_EPILOGUE_BEG", value: 6, isUnsigned: true)
!814 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_BEG", value: 7, isUnsigned: true)
!815 = !DIEnumerator(name: "NOTE_INSN_EH_REGION_END", value: 8, isUnsigned: true)
!816 = !DIEnumerator(name: "NOTE_INSN_VAR_LOCATION", value: 9, isUnsigned: true)
!817 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!818 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!819 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!820 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!821 = !{!822, !7, !823, !609, !825, !1997, !231, !2006, !2010, !824, !2011, !898}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !826, line: 50, baseType: !827)
!826 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !610, line: 240, size: 384, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !828, file: !610, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !828, file: !610, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !828, file: !610, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !828, file: !610, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !828, file: !610, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !828, file: !610, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !828, file: !610, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !828, file: !610, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !828, file: !610, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !828, file: !610, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !828, file: !610, line: 321, baseType: !841, size: 320, offset: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !610, line: 315, size: 320, elements: !842)
!842 = !{!843, !1932, !1934, !1995, !1996}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !841, file: !610, line: 316, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 64, elements: !863)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !610, line: 183, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !610, line: 166, size: 64, elements: !847)
!847 = !{!848, !849, !850, !854, !855, !865, !866, !878, !881, !944, !1910, !1911, !1922, !1929}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !846, file: !610, line: 168, baseType: !824, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !846, file: !610, line: 169, baseType: !7, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !846, file: !610, line: 170, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !846, file: !610, line: 171, baseType: !825, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !846, file: !610, line: 172, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !826, line: 53, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !610, line: 359, size: 128, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !858, file: !610, line: 360, baseType: !824, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !858, file: !610, line: 361, baseType: !862, size: 64, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 64, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 1)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !846, file: !610, line: 173, baseType: !231, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !846, file: !610, line: 174, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !610, line: 133, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 115, size: 32, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !868, file: !610, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !868, file: !610, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !868, file: !610, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !868, file: !610, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !868, file: !610, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !868, file: !610, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !868, file: !610, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !868, file: !610, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !846, file: !610, line: 175, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !610, line: 175, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !846, file: !610, line: 176, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !884, line: 75, size: 256, elements: !885)
!884 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!885 = !{!886, !901, !902, !903}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !883, file: !884, line: 76, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !884, line: 68, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !884, line: 63, size: 320, elements: !890)
!890 = !{!891, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !884, line: 64, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !884, line: 65, baseType: !892, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !889, file: !884, line: 66, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !889, file: !884, line: 67, baseType: !896, size: 128, offset: 192)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, elements: !899)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !884, line: 29, baseType: !898)
!898 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!899 = !{!900}
!900 = !DISubrange(count: 2)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !883, file: !884, line: 77, baseType: !887, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !883, file: !884, line: 78, baseType: !7, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !883, file: !884, line: 79, baseType: !904, size: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !884, line: 49, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !884, line: 45, size: 832, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !906, file: !884, line: 46, baseType: !892, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !906, file: !884, line: 47, baseType: !882, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !906, file: !884, line: 48, baseType: !911, size: 704, offset: 128)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !912, line: 164, size: 704, elements: !913)
!912 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!913 = !{!914, !916, !927, !928, !929, !930, !931, !932, !936, !940, !941, !942, !943}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !911, file: !912, line: 166, baseType: !915, size: 64)
!915 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !911, file: !912, line: 167, baseType: !917, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !912, line: 157, size: 192, elements: !919)
!919 = !{!920, !922, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !918, file: !912, line: 159, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !918, file: !912, line: 160, baseType: !917, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !918, file: !912, line: 161, baseType: !924, size: 32, offset: 128)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 32, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 4)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !911, file: !912, line: 168, baseType: !921, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !911, file: !912, line: 169, baseType: !921, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !911, file: !912, line: 170, baseType: !921, size: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !911, file: !912, line: 171, baseType: !915, size: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !911, file: !912, line: 172, baseType: !824, size: 32, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !911, file: !912, line: 176, baseType: !933, size: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!917, !822, !915}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !911, file: !912, line: 177, baseType: !937, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !822, !917}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !911, file: !912, line: 178, baseType: !822, size: 64, offset: 576)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !911, file: !912, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !911, file: !912, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !911, file: !912, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !846, file: !610, line: 177, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !826, line: 56, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !383, line: 3371, size: 1792, elements: !948)
!948 = !{!949, !982, !988, !999, !1018, !1029, !1034, !1041, !1047, !1061, !1073, !1111, !1116, !1144, !1152, !1153, !1158, !1167, !1173, !1178, !1182, !1186, !1546, !1595, !1601, !1607, !1614, !1640, !1654, !1671, !1683, !1705, !1720, !1892}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !947, file: !383, line: 3372, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !383, line: 360, size: 64, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !950, file: !383, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !950, file: !383, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !950, file: !383, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !950, file: !383, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !950, file: !383, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !950, file: !383, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !950, file: !383, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !950, file: !383, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !950, file: !383, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !950, file: !383, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !950, file: !383, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !950, file: !383, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !950, file: !383, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !950, file: !383, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !950, file: !383, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !950, file: !383, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !950, file: !383, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !950, file: !383, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !950, file: !383, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !950, file: !383, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !950, file: !383, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !950, file: !383, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !950, file: !383, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !950, file: !383, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !950, file: !383, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !950, file: !383, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !950, file: !383, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !950, file: !383, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !950, file: !383, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !950, file: !383, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !947, file: !383, line: 3373, baseType: !983, size: 192)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !383, line: 402, size: 192, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !983, file: !383, line: 403, baseType: !950, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !983, file: !383, line: 404, baseType: !945, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !383, line: 405, baseType: !945, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !947, file: !383, line: 3374, baseType: !989, size: 320)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !383, line: 1384, size: 320, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !383, line: 1385, baseType: !983, size: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !989, file: !383, line: 1386, baseType: !993, size: 128, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !994, line: 58, baseType: !995)
!994 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !994, line: 54, size: 128, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !995, file: !994, line: 56, baseType: !898, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !995, file: !994, line: 57, baseType: !915, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !947, file: !383, line: 3375, baseType: !1000, size: 256)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !383, line: 1397, size: 256, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !383, line: 1398, baseType: !983, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1000, file: !383, line: 1399, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1006, line: 52, size: 256, elements: !1007)
!1006 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1005, file: !1006, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1005, file: !1006, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1005, file: !1006, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1005, file: !1006, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1005, file: !1006, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1005, file: !1006, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1005, file: !1006, line: 62, baseType: !1015, size: 192, offset: 64)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 192, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 3)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !947, file: !383, line: 3376, baseType: !1019, size: 256)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !383, line: 1408, size: 256, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !383, line: 1409, baseType: !983, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1019, file: !383, line: 1410, baseType: !1023, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1025, line: 27, size: 192, elements: !1026)
!1025 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1024, file: !1025, line: 29, baseType: !993, size: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1024, file: !1025, line: 30, baseType: !231, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !947, file: !383, line: 3377, baseType: !1030, size: 256)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !383, line: 1437, size: 256, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !383, line: 1438, baseType: !983, size: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1030, file: !383, line: 1439, baseType: !945, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !947, file: !383, line: 3378, baseType: !1035, size: 256)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !383, line: 1418, size: 256, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !383, line: 1419, baseType: !983, size: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1035, file: !383, line: 1420, baseType: !824, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1035, file: !383, line: 1421, baseType: !1040, size: 8, offset: 224)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 8, elements: !863)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !947, file: !383, line: 3379, baseType: !1042, size: 320)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !383, line: 1428, size: 320, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !383, line: 1429, baseType: !983, size: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1042, file: !383, line: 1430, baseType: !945, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1042, file: !383, line: 1431, baseType: !945, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !947, file: !383, line: 3380, baseType: !1048, size: 320)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !383, line: 1460, size: 320, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !383, line: 1461, baseType: !983, size: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1048, file: !383, line: 1462, baseType: !1052, size: 128, offset: 192)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1053, line: 31, size: 128, elements: !1054)
!1053 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1054 = !{!1055, !1059, !1060}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1052, file: !1053, line: 32, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1052, file: !1053, line: 33, baseType: !7, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1052, file: !1053, line: 34, baseType: !7, size: 32, offset: 96)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !947, file: !383, line: 3381, baseType: !1062, size: 384)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !383, line: 2507, size: 384, elements: !1063)
!1063 = !{!1064, !1065, !1070, !1071, !1072}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !383, line: 2508, baseType: !983, size: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1062, file: !383, line: 2509, baseType: !1066, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1067, line: 58, baseType: !1068)
!1067 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1069, line: 44, baseType: !7)
!1069 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1062, file: !383, line: 2510, baseType: !7, size: 32, offset: 224)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !383, line: 2511, baseType: !945, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1062, file: !383, line: 2512, baseType: !945, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !947, file: !383, line: 3382, baseType: !1074, size: 896)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !383, line: 2652, size: 896, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !383, line: 2653, baseType: !1062, size: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !383, line: 2654, baseType: !945, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1074, file: !383, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1074, file: !383, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1074, file: !383, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1074, file: !383, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1074, file: !383, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1074, file: !383, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1074, file: !383, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1074, file: !383, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1074, file: !383, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1074, file: !383, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1074, file: !383, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1074, file: !383, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1074, file: !383, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1074, file: !383, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1074, file: !383, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1074, file: !383, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1074, file: !383, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1074, file: !383, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1074, file: !383, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1074, file: !383, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1074, file: !383, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1074, file: !383, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1074, file: !383, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1074, file: !383, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1074, file: !383, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1074, file: !383, line: 2703, baseType: !7, size: 32, offset: 512)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1074, file: !383, line: 2705, baseType: !945, size: 64, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1074, file: !383, line: 2706, baseType: !945, size: 64, offset: 640)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1074, file: !383, line: 2707, baseType: !945, size: 64, offset: 704)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1074, file: !383, line: 2708, baseType: !945, size: 64, offset: 768)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1074, file: !383, line: 2711, baseType: !1109, size: 64, offset: 832)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !383, line: 2711, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !947, file: !383, line: 3383, baseType: !1112, size: 960)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !383, line: 2756, size: 960, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !383, line: 2757, baseType: !1074, size: 896)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1112, file: !383, line: 2758, baseType: !825, size: 64, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !947, file: !383, line: 3384, baseType: !1117, size: 1472)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !383, line: 3114, size: 1472, elements: !1118)
!1118 = !{!1119, !1140, !1141, !1142, !1143}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1117, file: !383, line: 3115, baseType: !1120, size: 1216)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !383, line: 2984, size: 1216, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !383, line: 2985, baseType: !1112, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1120, file: !383, line: 2986, baseType: !945, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1120, file: !383, line: 2987, baseType: !945, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1120, file: !383, line: 2988, baseType: !945, size: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1120, file: !383, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1120, file: !383, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1120, file: !383, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1120, file: !383, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1120, file: !383, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1120, file: !383, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1120, file: !383, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1120, file: !383, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1120, file: !383, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1120, file: !383, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1120, file: !383, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1120, file: !383, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1120, file: !383, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1120, file: !383, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1117, file: !383, line: 3117, baseType: !945, size: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1117, file: !383, line: 3119, baseType: !945, size: 64, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1117, file: !383, line: 3121, baseType: !945, size: 64, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1117, file: !383, line: 3123, baseType: !945, size: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !947, file: !383, line: 3385, baseType: !1145, size: 1088)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !383, line: 2874, size: 1088, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !383, line: 2875, baseType: !1112, size: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1145, file: !383, line: 2876, baseType: !825, size: 64, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1145, file: !383, line: 2877, baseType: !1150, size: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !383, line: 2856, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !947, file: !383, line: 3386, baseType: !1120, size: 1216)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !947, file: !383, line: 3387, baseType: !1154, size: 1280)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !383, line: 3093, size: 1280, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !383, line: 3094, baseType: !1120, size: 1216)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1154, file: !383, line: 3095, baseType: !1150, size: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !947, file: !383, line: 3388, baseType: !1159, size: 1216)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !383, line: 2824, size: 1216, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !383, line: 2825, baseType: !1074, size: 896)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1159, file: !383, line: 2827, baseType: !945, size: 64, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1159, file: !383, line: 2828, baseType: !945, size: 64, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1159, file: !383, line: 2829, baseType: !945, size: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1159, file: !383, line: 2830, baseType: !945, size: 64, offset: 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1159, file: !383, line: 2831, baseType: !945, size: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !947, file: !383, line: 3389, baseType: !1168, size: 1024)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !383, line: 2850, size: 1024, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !383, line: 2851, baseType: !1112, size: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1168, file: !383, line: 2852, baseType: !824, size: 32, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1168, file: !383, line: 2853, baseType: !824, size: 32, offset: 992)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !947, file: !383, line: 3390, baseType: !1174, size: 1024)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !383, line: 2857, size: 1024, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1174, file: !383, line: 2858, baseType: !1112, size: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1174, file: !383, line: 2859, baseType: !1150, size: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !947, file: !383, line: 3391, baseType: !1179, size: 960)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !383, line: 2862, size: 960, elements: !1180)
!1180 = !{!1181}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1179, file: !383, line: 2863, baseType: !1112, size: 960)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !947, file: !383, line: 3392, baseType: !1183, size: 1472)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !383, line: 3304, size: 1472, elements: !1184)
!1184 = !{!1185}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1183, file: !383, line: 3305, baseType: !1117, size: 1472)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !947, file: !383, line: 3393, baseType: !1187, size: 1792)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !383, line: 3248, size: 1792, elements: !1188)
!1188 = !{!1189, !1190, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1187, file: !383, line: 3249, baseType: !1117, size: 1472)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1187, file: !383, line: 3251, baseType: !1191, size: 64, offset: 1472)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1193, line: 463, size: 1152, elements: !1194)
!1193 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1194 = !{!1195, !1358, !1462, !1463, !1466, !1469, !1470, !1471, !1472, !1473, !1474, !1498, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1192, file: !1193, line: 464, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !360, line: 194, size: 384, elements: !1198)
!1198 = !{!1199, !1248, !1261, !1275, !1326, !1339}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1197, file: !360, line: 197, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !360, line: 182, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !360, line: 116, size: 704, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208, !1209, !1236, !1245, !1246, !1247}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1202, file: !360, line: 119, baseType: !1201, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1202, file: !360, line: 122, baseType: !1201, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1202, file: !360, line: 123, baseType: !1201, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1202, file: !360, line: 126, baseType: !824, size: 32, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1202, file: !360, line: 129, baseType: !359, size: 32, offset: 224)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1202, file: !360, line: 165, baseType: !1210, size: 192, offset: 256)
!1210 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !360, line: 132, size: 192, elements: !1211)
!1211 = !{!1212, !1225, !1231}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1210, file: !360, line: 137, baseType: !1213, size: 128)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !360, line: 133, size: 128, elements: !1214)
!1214 = !{!1215, !1224}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1213, file: !360, line: 135, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !360, line: 93, size: 320, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1217, file: !360, line: 96, baseType: !1216, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1217, file: !360, line: 97, baseType: !1216, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1217, file: !360, line: 101, baseType: !945, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1217, file: !360, line: 106, baseType: !945, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1217, file: !360, line: 111, baseType: !945, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1213, file: !360, line: 136, baseType: !1216, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1210, file: !360, line: 151, baseType: !1226, size: 192)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !360, line: 139, size: 192, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1226, file: !360, line: 141, baseType: !945, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1226, file: !360, line: 145, baseType: !945, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1226, file: !360, line: 150, baseType: !824, size: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1210, file: !360, line: 164, baseType: !1232, size: 128)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !360, line: 153, size: 128, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1232, file: !360, line: 161, baseType: !945, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1232, file: !360, line: 163, baseType: !1066, size: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1202, file: !360, line: 168, baseType: !1237, size: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !360, line: 67, size: 320, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1238, file: !360, line: 70, baseType: !1237, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1238, file: !360, line: 73, baseType: !1201, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1238, file: !360, line: 78, baseType: !945, size: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1238, file: !360, line: 85, baseType: !825, size: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1238, file: !360, line: 88, baseType: !824, size: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1202, file: !360, line: 173, baseType: !825, size: 64, offset: 512)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1202, file: !360, line: 173, baseType: !825, size: 64, offset: 576)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1202, file: !360, line: 177, baseType: !1058, size: 8, offset: 640)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1197, file: !360, line: 200, baseType: !1249, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !360, line: 185, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !360, line: 185, size: 128, elements: !1252)
!1252 = !{!1253}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1251, file: !360, line: 185, baseType: !1254, size: 128)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !360, line: 184, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !360, line: 184, size: 128, elements: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1255, file: !360, line: 184, baseType: !7, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1255, file: !360, line: 184, baseType: !7, size: 32, offset: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1255, file: !360, line: 184, baseType: !1260, size: 64, offset: 64)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 64, elements: !863)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1197, file: !360, line: 203, baseType: !1262, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !360, line: 189, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !360, line: 189, size: 128, elements: !1265)
!1265 = !{!1266}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1264, file: !360, line: 189, baseType: !1267, size: 128)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !360, line: 188, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !360, line: 188, size: 128, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1268, file: !360, line: 188, baseType: !7, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1268, file: !360, line: 188, baseType: !7, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1268, file: !360, line: 188, baseType: !1273, size: 64, offset: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1274, size: 64, elements: !863)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !360, line: 180, baseType: !1237)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1197, file: !360, line: 207, baseType: !1276, size: 64, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !787, line: 144, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !787, line: 100, size: 896, elements: !1279)
!1279 = !{!1280, !1288, !1293, !1298, !1300, !1303, !1304, !1305, !1306, !1307, !1312, !1314, !1315, !1320, !1325}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1278, file: !787, line: 102, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !787, line: 52, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!1285, !1286}
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !787, line: 47, baseType: !7)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1278, file: !787, line: 105, baseType: !1289, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !787, line: 59, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!824, !1286, !1286}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1278, file: !787, line: 108, baseType: !1294, size: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !787, line: 63, baseType: !1295)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !822}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1278, file: !787, line: 111, baseType: !1299, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1278, file: !787, line: 114, baseType: !1301, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1302, line: 46, baseType: !898)
!1302 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1278, file: !787, line: 117, baseType: !1301, size: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1278, file: !787, line: 120, baseType: !1301, size: 64, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1278, file: !787, line: 124, baseType: !7, size: 32, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1278, file: !787, line: 128, baseType: !7, size: 32, offset: 480)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1278, file: !787, line: 131, baseType: !1308, size: 64, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !787, line: 75, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!822, !1301, !1301}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1278, file: !787, line: 132, baseType: !1313, size: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !787, line: 78, baseType: !1295)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1278, file: !787, line: 135, baseType: !822, size: 64, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1278, file: !787, line: 136, baseType: !1316, size: 64, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !787, line: 82, baseType: !1317)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!822, !822, !1301, !1301}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1278, file: !787, line: 137, baseType: !1321, size: 64, offset: 768)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !787, line: 83, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{null, !822, !822}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1278, file: !787, line: 141, baseType: !7, size: 32, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1197, file: !360, line: 211, baseType: !1327, size: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !383, line: 183, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !383, line: 183, size: 128, elements: !1330)
!1330 = !{!1331}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1329, file: !383, line: 183, baseType: !1332, size: 128)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !383, line: 182, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !383, line: 182, size: 128, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1333, file: !383, line: 182, baseType: !7, size: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1333, file: !383, line: 182, baseType: !7, size: 32, offset: 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1333, file: !383, line: 182, baseType: !1338, size: 64, offset: 64)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 64, elements: !863)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1197, file: !360, line: 220, baseType: !1340, size: 64, offset: 320)
!1340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !360, line: 217, size: 64, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1340, file: !360, line: 218, baseType: !1327, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1340, file: !360, line: 219, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1346, line: 29, baseType: !1347)
!1346 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1346, line: 29, size: 96, elements: !1348)
!1348 = !{!1349}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1347, file: !1346, line: 29, baseType: !1350, size: 96)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1346, line: 27, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1346, line: 27, size: 96, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1351, file: !1346, line: 27, baseType: !7, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1351, file: !1346, line: 27, baseType: !7, size: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1351, file: !1346, line: 27, baseType: !1356, size: 8, offset: 64)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1357, size: 8, elements: !863)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1346, line: 26, baseType: !1058)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1192, file: !1193, line: 467, baseType: !1359, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !367, line: 374, size: 640, elements: !1361)
!1361 = !{!1362, !1437, !1438, !1451, !1452, !1453, !1454, !1455, !1456, !1458, !1460, !1461}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1360, file: !367, line: 377, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !826, line: 111, baseType: !1364)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !367, line: 217, size: 832, elements: !1366)
!1366 = !{!1367, !1402, !1403, !1404, !1407, !1411, !1412, !1413, !1431, !1432, !1433, !1434, !1435, !1436}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1365, file: !367, line: 219, baseType: !1368, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !367, line: 151, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !367, line: 151, size: 128, elements: !1371)
!1371 = !{!1372}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1370, file: !367, line: 151, baseType: !1373, size: 128)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !367, line: 150, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !367, line: 150, size: 128, elements: !1375)
!1375 = !{!1376, !1377, !1378}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1374, file: !367, line: 150, baseType: !7, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1374, file: !367, line: 150, baseType: !7, size: 32, offset: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1374, file: !367, line: 150, baseType: !1379, size: 64, offset: 64)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 64, elements: !863)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !826, line: 108, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !367, line: 122, size: 512, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1382, file: !367, line: 124, baseType: !1364, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1382, file: !367, line: 125, baseType: !1364, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1382, file: !367, line: 131, baseType: !1387, size: 64, offset: 128)
!1387 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !367, line: 128, size: 64, elements: !1388)
!1388 = !{!1389, !1393}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1387, file: !367, line: 129, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !826, line: 66, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !826, line: 65, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1387, file: !367, line: 130, baseType: !825, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1382, file: !367, line: 134, baseType: !822, size: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1382, file: !367, line: 137, baseType: !945, size: 64, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1382, file: !367, line: 138, baseType: !1066, size: 32, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1382, file: !367, line: 142, baseType: !7, size: 32, offset: 352)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1382, file: !367, line: 144, baseType: !824, size: 32, offset: 384)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1382, file: !367, line: 145, baseType: !824, size: 32, offset: 416)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1382, file: !367, line: 146, baseType: !1401, size: 64, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !367, line: 119, baseType: !915)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1365, file: !367, line: 220, baseType: !1368, size: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1365, file: !367, line: 223, baseType: !822, size: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1365, file: !367, line: 226, baseType: !1405, size: 64, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !367, line: 185, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1365, file: !367, line: 229, baseType: !1408, size: 128, offset: 256)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1409, size: 128, elements: !899)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !367, line: 229, flags: DIFlagFwdDecl)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1365, file: !367, line: 232, baseType: !1364, size: 64, offset: 384)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1365, file: !367, line: 233, baseType: !1364, size: 64, offset: 448)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1365, file: !367, line: 238, baseType: !1414, size: 64, offset: 512)
!1414 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !367, line: 235, size: 64, elements: !1415)
!1415 = !{!1416, !1422}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1414, file: !367, line: 236, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !367, line: 273, size: 128, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1418, file: !367, line: 275, baseType: !1390, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1418, file: !367, line: 278, baseType: !1390, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1414, file: !367, line: 237, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !367, line: 259, size: 320, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1424, file: !367, line: 261, baseType: !825, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1424, file: !367, line: 262, baseType: !825, size: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1424, file: !367, line: 266, baseType: !825, size: 64, offset: 128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1424, file: !367, line: 267, baseType: !825, size: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1424, file: !367, line: 270, baseType: !824, size: 32, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1365, file: !367, line: 241, baseType: !1401, size: 64, offset: 576)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1365, file: !367, line: 244, baseType: !824, size: 32, offset: 640)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1365, file: !367, line: 247, baseType: !824, size: 32, offset: 672)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1365, file: !367, line: 250, baseType: !824, size: 32, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1365, file: !367, line: 253, baseType: !824, size: 32, offset: 736)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1365, file: !367, line: 256, baseType: !824, size: 32, offset: 768)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1360, file: !367, line: 378, baseType: !1363, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1360, file: !367, line: 381, baseType: !1439, size: 64, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !367, line: 282, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !367, line: 282, size: 128, elements: !1442)
!1442 = !{!1443}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1441, file: !367, line: 282, baseType: !1444, size: 128)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !367, line: 281, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !367, line: 281, size: 128, elements: !1446)
!1446 = !{!1447, !1448, !1449}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1445, file: !367, line: 281, baseType: !7, size: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1445, file: !367, line: 281, baseType: !7, size: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1445, file: !367, line: 281, baseType: !1450, size: 64, offset: 64)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1363, size: 64, elements: !863)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1360, file: !367, line: 384, baseType: !824, size: 32, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1360, file: !367, line: 387, baseType: !824, size: 32, offset: 224)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1360, file: !367, line: 390, baseType: !824, size: 32, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1360, file: !367, line: 394, baseType: !1439, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1360, file: !367, line: 396, baseType: !366, size: 32, offset: 384)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1360, file: !367, line: 399, baseType: !1457, size: 64, offset: 416)
!1457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 64, elements: !899)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1360, file: !367, line: 402, baseType: !1459, size: 64, offset: 480)
!1459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !899)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1360, file: !367, line: 406, baseType: !824, size: 32, offset: 544)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1360, file: !367, line: 409, baseType: !824, size: 32, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1192, file: !1193, line: 470, baseType: !1391, size: 64, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1192, file: !1193, line: 473, baseType: !1464, size: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1193, line: 166, flags: DIFlagFwdDecl)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1192, file: !1193, line: 476, baseType: !1467, size: 64, offset: 256)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1193, line: 476, flags: DIFlagFwdDecl)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1192, file: !1193, line: 479, baseType: !1276, size: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1192, file: !1193, line: 484, baseType: !945, size: 64, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1192, file: !1193, line: 488, baseType: !945, size: 64, offset: 448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1192, file: !1193, line: 493, baseType: !945, size: 64, offset: 512)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1192, file: !1193, line: 496, baseType: !945, size: 64, offset: 576)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1192, file: !1193, line: 501, baseType: !1475, size: 64, offset: 640)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !378, line: 2355, size: 576, elements: !1477)
!1477 = !{!1478, !1481, !1482, !1483, !1484, !1486, !1487, !1492, !1493, !1494, !1495, !1496, !1497}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1476, file: !378, line: 2356, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !378, line: 2356, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1476, file: !378, line: 2357, baseType: !851, size: 64, offset: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1476, file: !378, line: 2358, baseType: !824, size: 32, offset: 128)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1476, file: !378, line: 2359, baseType: !824, size: 32, offset: 160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1476, file: !378, line: 2360, baseType: !1485, size: 128, offset: 192)
!1485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 128, elements: !925)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1476, file: !378, line: 2364, baseType: !824, size: 32, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1476, file: !378, line: 2367, baseType: !1488, size: 128, offset: 384)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !378, line: 2349, size: 128, elements: !1489)
!1489 = !{!1490, !1491}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1488, file: !378, line: 2351, baseType: !825, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1488, file: !378, line: 2352, baseType: !915, size: 64, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1476, file: !378, line: 2371, baseType: !377, size: 32, offset: 512)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1476, file: !378, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1476, file: !378, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1476, file: !378, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1476, file: !378, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1476, file: !378, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1192, file: !1193, line: 504, baseType: !1499, size: 64, offset: 704)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1193, line: 504, flags: DIFlagFwdDecl)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1192, file: !1193, line: 507, baseType: !1276, size: 64, offset: 768)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1192, file: !1193, line: 510, baseType: !824, size: 32, offset: 832)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1192, file: !1193, line: 513, baseType: !824, size: 32, offset: 864)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1192, file: !1193, line: 516, baseType: !1066, size: 32, offset: 896)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1192, file: !1193, line: 519, baseType: !1066, size: 32, offset: 928)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1192, file: !1193, line: 522, baseType: !7, size: 32, offset: 960)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1192, file: !1193, line: 523, baseType: !7, size: 32, offset: 992)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1192, file: !1193, line: 528, baseType: !851, size: 64, offset: 1024)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1192, file: !1193, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1192, file: !1193, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1192, file: !1193, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1192, file: !1193, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1192, file: !1193, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1192, file: !1193, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1192, file: !1193, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1192, file: !1193, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1192, file: !1193, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1192, file: !1193, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1192, file: !1193, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1192, file: !1193, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1192, file: !1193, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1192, file: !1193, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1192, file: !1193, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1192, file: !1193, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1187, file: !383, line: 3254, baseType: !945, size: 64, offset: 1536)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1187, file: !383, line: 3257, baseType: !945, size: 64, offset: 1600)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1187, file: !383, line: 3258, baseType: !945, size: 64, offset: 1664)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1187, file: !383, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1187, file: !383, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1187, file: !383, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1187, file: !383, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1187, file: !383, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1187, file: !383, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1187, file: !383, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1187, file: !383, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1187, file: !383, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1187, file: !383, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1187, file: !383, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1187, file: !383, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1187, file: !383, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1187, file: !383, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1187, file: !383, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1187, file: !383, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1187, file: !383, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1187, file: !383, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !947, file: !383, line: 3394, baseType: !1547, size: 1344)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !383, line: 2279, size: 1344, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1574, !1575, !1576, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1547, file: !383, line: 2280, baseType: !983, size: 192)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1547, file: !383, line: 2281, baseType: !945, size: 64, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1547, file: !383, line: 2282, baseType: !945, size: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1547, file: !383, line: 2283, baseType: !945, size: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1547, file: !383, line: 2284, baseType: !945, size: 64, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1547, file: !383, line: 2285, baseType: !7, size: 32, offset: 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1547, file: !383, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1547, file: !383, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1547, file: !383, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1547, file: !383, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1547, file: !383, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1547, file: !383, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1547, file: !383, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1547, file: !383, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1547, file: !383, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1547, file: !383, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1547, file: !383, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1547, file: !383, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
