; ModuleID = 'insn-extract.c'
source_filename = "insn-extract.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.recog_data = type { [30 x %struct.rtx_def*], [30 x %struct.rtx_def**], [30 x i8*], [30 x i32], [30 x i32], [14 x %struct.rtx_def**], [14 x i8], i8, i8, i8, [30 x i8], %struct.rtx_def* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.rtvec_def = type { i32, [1 x %struct.rtx_def*] }

@recog_data = external dso_local global %struct.recog_data, align 8
@.str = private unnamed_addr constant [21 x i8] c"unrecognizable insn:\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"insn-extract.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"?\00", align 1
@.str.3 = private unnamed_addr constant [31 x i8] c"insn with invalid code number:\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @insn_extract(%struct.rtx_def* %insn) #0 !dbg !136 {
entry:
  %insn.addr = alloca %struct.rtx_def*, align 8

!69 = !DIEnumerator(name: "V1DImode", value: 62, isUnsigned: true)
!70 = !DIEnumerator(name: "V16QImode", value: 63, isUnsigned: true)
!71 = !DIEnumerator(name: "V8HImode", value: 64, isUnsigned: true)
!72 = !DIEnumerator(name: "V4SImode", value: 65, isUnsigned: true)
!73 = !DIEnumerator(name: "V2DImode", value: 66, isUnsigned: true)
!74 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!75 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!76 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!77 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!78 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!79 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!80 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!81 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!82 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!83 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!84 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!85 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!86 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!87 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!88 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!89 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!90 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!91 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!92 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!93 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!94 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!95 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!99 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!100 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!104 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!105 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!107 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!108 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!109 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!110 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!112 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!113 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!114 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!115 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!116 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!117 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!118 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!119 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!120 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!121 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!130 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!131 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!132 = !{i32 7, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{i32 1, !"wchar_size", i32 4}
!135 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!136 = distinct !DISubprogram(name: "insn_extract", scope: !1, file: !1, line: 18, type: !137, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !290)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !140, line: 50, baseType: !141)
!140 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !143, line: 240, size: 384, elements: !144)
!143 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !142, file: !143, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !142, file: !143, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !142, file: !143, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !142, file: !143, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !142, file: !143, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !142, file: !143, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !142, file: !143, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !142, file: !143, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !142, file: !143, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !142, file: !143, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !142, file: !143, line: 321, baseType: !156, size: 320, offset: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !143, line: 315, size: 320, elements: !157)
!157 = !{!158, !232, !234, !265, !278}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !156, file: !143, line: 316, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !179)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !143, line: 183, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !143, line: 166, size: 64, elements: !162)
!162 = !{!163, !165, !166, !170, !171, !181, !182, !194, !197, !200, !204, !207, !221, !229}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !161, file: !143, line: 168, baseType: !164, size: 32)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !161, file: !143, line: 169, baseType: !5, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !161, file: !143, line: 170, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !161, file: !143, line: 171, baseType: !139, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !161, file: !143, line: 172, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !140, line: 53, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !143, line: 359, size: 128, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !174, file: !143, line: 360, baseType: !164, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !174, file: !143, line: 361, baseType: !178, size: 64, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !161, file: !143, line: 173, baseType: !3, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !161, file: !143, line: 174, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !143, line: 133, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 115, size: 32, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !184, file: !143, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !184, file: !143, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !184, file: !143, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !184, file: !143, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !184, file: !143, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !184, file: !143, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !184, file: !143, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !184, file: !143, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !161, file: !143, line: 175, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !143, line: 175, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !161, file: !143, line: 176, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !140, line: 46, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !161, file: !143, line: 177, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !140, line: 56, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 55, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !161, file: !143, line: 178, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !140, line: 110, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !161, file: !143, line: 179, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !143, line: 150, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !143, line: 142, size: 320, elements: !211)
!211 = !{!212, !213, !214, !215, !218, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !210, file: !143, line: 144, baseType: !201, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !210, file: !143, line: 145, baseType: !139, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !210, file: !143, line: 146, baseType: !139, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !210, file: !143, line: 147, baseType: !216, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !217, line: 31, baseType: !164)
!217 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !210, file: !143, line: 148, baseType: !5, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !210, file: !143, line: 149, baseType: !220, size: 8, offset: 256)
!220 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !161, file: !143, line: 180, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !143, line: 162, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !143, line: 159, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !224, file: !143, line: 160, baseType: !201, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !224, file: !143, line: 161, baseType: !228, size: 64, offset: 64)
!228 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !161, file: !143, line: 181, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !143, line: 181, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !156, file: !143, line: 317, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 64, elements: !179)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !156, file: !143, line: 318, baseType: !235, size: 320)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !143, line: 188, size: 320, elements: !236)
!236 = !{!237, !241, !264}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !235, file: !143, line: 190, baseType: !238, size: 192)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 192, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 3)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !235, file: !143, line: 193, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !143, line: 206, size: 320, elements: !244)
!244 = !{!245, !249, !250, !251, !263}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !243, file: !143, line: 208, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !140, line: 62, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !140, line: 61, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !243, file: !143, line: 211, baseType: !5, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !143, line: 214, baseType: !228, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !243, file: !143, line: 224, baseType: !252, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !143, line: 202, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !143, line: 202, size: 128, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !254, file: !143, line: 202, baseType: !257, size: 128)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !143, line: 200, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !143, line: 200, size: 128, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !258, file: !143, line: 200, baseType: !5, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !258, file: !143, line: 200, baseType: !5, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !258, file: !143, line: 200, baseType: !178, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !243, file: !143, line: 234, baseType: !252, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !235, file: !143, line: 197, baseType: !228, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !156, file: !143, line: 319, baseType: !266, size: 256)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !267, line: 52, size: 256, elements: !268)
!267 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271, !272, !273, !274, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !266, file: !267, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !266, file: !267, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !266, file: !267, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !266, file: !267, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !266, file: !267, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !266, file: !267, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !266, file: !267, line: 62, baseType: !276, size: 192, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 192, elements: !239)
!277 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !156, file: !143, line: 320, baseType: !279, size: 192)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !280, line: 27, size: 192, elements: !281)
!280 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !280, line: 29, baseType: !283, size: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !284, line: 58, baseType: !285)
!284 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 54, size: 128, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !285, file: !284, line: 56, baseType: !277, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !285, file: !284, line: 57, baseType: !228, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !279, file: !280, line: 30, baseType: !3, size: 32, offset: 128)
!290 = !{}
!291 = !DILocalVariable(name: "insn", arg: 1, scope: !136, file: !1, line: 18, type: !139)
!292 = !DILocation(line: 18, column: 19, scope: !136)
!293 = !DILocalVariable(name: "ro", scope: !136, file: !1, line: 20, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!295 = !DILocation(line: 20, column: 8, scope: !136)
!296 = !DILocalVariable(name: "ro_loc", scope: !136, file: !1, line: 21, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DILocation(line: 21, column: 9, scope: !136)
!299 = !DILocalVariable(name: "pat", scope: !136, file: !1, line: 22, type: !139)
!300 = !DILocation(line: 22, column: 7, scope: !136)
!301 = !DILocation(line: 22, column: 13, scope: !136)
!302 = !DILocalVariable(name: "i", scope: !136, file: !1, line: 23, type: !164)
!303 = !DILocation(line: 23, column: 7, scope: !136)
!304 = !DILocation(line: 30, column: 11, scope: !136)
!305 = !DILocation(line: 30, column: 3, scope: !136)
!306 = !DILocation(line: 37, column: 11, scope: !307)
!307 = distinct !DILexicalBlock(scope: !308, file: !1, line: 37, column: 11)
!308 = distinct !DILexicalBlock(scope: !136, file: !1, line: 31, column: 5)
!309 = !DILocation(line: 37, column: 28, scope: !307)
!310 = !DILocation(line: 37, column: 11, scope: !308)
!311 = !DILocation(line: 38, column: 9, scope: !307)
!312 = !DILocation(line: 40, column: 9, scope: !307)
!313 = !DILocation(line: 37, column: 30, scope: !307)
!314 = !DILocation(line: 57, column: 30, scope: !308)
!315 = !DILocation(line: 57, column: 17, scope: !308)
!316 = !DILocation(line: 57, column: 27, scope: !308)
!317 = !DILocation(line: 57, column: 15, scope: !308)
!318 = !DILocation(line: 57, column: 7, scope: !308)
!319 = !DILocation(line: 57, column: 13, scope: !308)
!320 = !DILocation(line: 58, column: 30, scope: !308)
!321 = !DILocation(line: 58, column: 17, scope: !308)
!322 = !DILocation(line: 58, column: 27, scope: !308)
!323 = !DILocation(line: 58, column: 15, scope: !308)
!324 = !DILocation(line: 58, column: 7, scope: !308)
!325 = !DILocation(line: 58, column: 13, scope: !308)
!326 = !DILocation(line: 59, column: 32, scope: !308)
!327 = !DILocation(line: 59, column: 29, scope: !308)
!328 = !DILocation(line: 60, column: 29, scope: !308)
!329 = !DILocation(line: 61, column: 7, scope: !308)
!330 = !DILocation(line: 66, column: 30, scope: !308)
!331 = !DILocation(line: 66, column: 17, scope: !308)
!332 = !DILocation(line: 66, column: 27, scope: !308)
!333 = !DILocation(line: 66, column: 15, scope: !308)
!334 = !DILocation(line: 66, column: 7, scope: !308)
!335 = !DILocation(line: 66, column: 13, scope: !308)
!336 = !DILocation(line: 67, column: 30, scope: !308)
!337 = !DILocation(line: 67, column: 17, scope: !308)
!338 = !DILocation(line: 67, column: 27, scope: !308)
!339 = !DILocation(line: 67, column: 15, scope: !308)
!340 = !DILocation(line: 67, column: 7, scope: !308)
!341 = !DILocation(line: 67, column: 13, scope: !308)
!342 = !DILocation(line: 68, column: 30, scope: !308)
!343 = !DILocation(line: 68, column: 17, scope: !308)
!344 = !DILocation(line: 68, column: 27, scope: !308)
!345 = !DILocation(line: 68, column: 15, scope: !308)
!346 = !DILocation(line: 68, column: 7, scope: !308)
!347 = !DILocation(line: 68, column: 13, scope: !308)
!348 = !DILocation(line: 69, column: 32, scope: !308)
!349 = !DILocation(line: 69, column: 29, scope: !308)
!350 = !DILocation(line: 70, column: 29, scope: !308)
!351 = !DILocation(line: 71, column: 7, scope: !308)
!352 = !DILocation(line: 76, column: 30, scope: !308)
!353 = !DILocation(line: 76, column: 17, scope: !308)
!354 = !DILocation(line: 76, column: 27, scope: !308)
!355 = !DILocation(line: 76, column: 15, scope: !308)
!356 = !DILocation(line: 76, column: 7, scope: !308)
!357 = !DILocation(line: 76, column: 13, scope: !308)
