; ModuleID = 'lambda-mat.c'
source_filename = "lambda-mat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"lambda-mat.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"?\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"./lambda.h\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%3d \00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32** @lambda_matrix_new(i32 %m, i32 %n) #0 !dbg !14 {
entry:
  %m.addr = alloca i32, align 4
  %n.addr = alloca i32, align 4
  %mat = alloca i32**, align 8
  %i = alloca i32, align 4
  store i32 %m, i32* %m.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %m.addr, metadata !18, metadata !DIExpression()), !dbg !19
  store i32 %n, i32* %n.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %n.addr, metadata !20, metadata !DIExpression()), !dbg !21

!1828 = !DILocation(line: 178, column: 18, scope: !1823)
!1829 = !DILocation(line: 178, column: 21, scope: !1823)
!1830 = !DILocation(line: 178, column: 5, scope: !1823)
!1831 = !DILocation(line: 178, column: 9, scope: !1823)
!1832 = !DILocation(line: 178, column: 12, scope: !1823)
!1833 = !DILocation(line: 177, column: 23, scope: !1823)
!1834 = !DILocation(line: 177, column: 3, scope: !1823)
!1835 = distinct !{!1835, !1826, !1836}
!1836 = !DILocation(line: 178, column: 24, scope: !1820)
!1837 = !DILocation(line: 179, column: 1, scope: !1806)
!1838 = distinct !DISubprogram(name: "lambda_matrix_vector_mult", scope: !1, file: !1, line: 639, type: !1839, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1839 = !DISubroutineType(types: !1840)
!1840 = !{null, !17, !8, !8, !5, !5}
!1841 = !DILocalVariable(name: "matrix", arg: 1, scope: !1838, file: !1, line: 639, type: !17)
!1842 = !DILocation(line: 639, column: 42, scope: !1838)
!1843 = !DILocalVariable(name: "m", arg: 2, scope: !1838, file: !1, line: 639, type: !8)
!1844 = !DILocation(line: 639, column: 54, scope: !1838)
!1845 = !DILocalVariable(name: "n", arg: 3, scope: !1838, file: !1, line: 639, type: !8)
!1846 = !DILocation(line: 639, column: 61, scope: !1838)
!1847 = !DILocalVariable(name: "vec", arg: 4, scope: !1838, file: !1, line: 640, type: !5)
!1848 = !DILocation(line: 640, column: 21, scope: !1838)
!1849 = !DILocalVariable(name: "dest", arg: 5, scope: !1838, file: !1, line: 640, type: !5)
!1850 = !DILocation(line: 640, column: 40, scope: !1838)
!1851 = !DILocalVariable(name: "i", scope: !1838, file: !1, line: 642, type: !8)
!1852 = !DILocation(line: 642, column: 7, scope: !1838)
!1853 = !DILocalVariable(name: "j", scope: !1838, file: !1, line: 642, type: !8)
!1854 = !DILocation(line: 642, column: 10, scope: !1838)
!1855 = !DILocation(line: 644, column: 24, scope: !1838)
!1856 = !DILocation(line: 644, column: 30, scope: !1838)
!1857 = !DILocation(line: 644, column: 3, scope: !1838)
!1858 = !DILocation(line: 645, column: 10, scope: !1859)
!1859 = distinct !DILexicalBlock(scope: !1838, file: !1, line: 645, column: 3)
!1860 = !DILocation(line: 645, column: 8, scope: !1859)
!1861 = !DILocation(line: 645, column: 15, scope: !1862)
!1862 = distinct !DILexicalBlock(scope: !1859, file: !1, line: 645, column: 3)
!1863 = !DILocation(line: 645, column: 19, scope: !1862)
!1864 = !DILocation(line: 645, column: 17, scope: !1862)
!1865 = !DILocation(line: 645, column: 3, scope: !1859)
!1866 = !DILocation(line: 646, column: 12, scope: !1867)
!1867 = distinct !DILexicalBlock(scope: !1862, file: !1, line: 646, column: 5)
!1868 = !DILocation(line: 646, column: 10, scope: !1867)
!1869 = !DILocation(line: 646, column: 17, scope: !1870)
!1870 = distinct !DILexicalBlock(scope: !1867, file: !1, line: 646, column: 5)
!1871 = !DILocation(line: 646, column: 21, scope: !1870)
!1872 = !DILocation(line: 646, column: 19, scope: !1870)
!1873 = !DILocation(line: 646, column: 5, scope: !1867)
!1874 = !DILocation(line: 647, column: 18, scope: !1870)
!1875 = !DILocation(line: 647, column: 25, scope: !1870)
!1876 = !DILocation(line: 647, column: 28, scope: !1870)
!1877 = !DILocation(line: 647, column: 33, scope: !1870)
!1878 = !DILocation(line: 647, column: 37, scope: !1870)
!1879 = !DILocation(line: 647, column: 31, scope: !1870)
!1880 = !DILocation(line: 647, column: 7, scope: !1870)
!1881 = !DILocation(line: 647, column: 12, scope: !1870)
!1882 = !DILocation(line: 647, column: 15, scope: !1870)
!1883 = !DILocation(line: 646, column: 25, scope: !1870)
!1884 = !DILocation(line: 646, column: 5, scope: !1870)
!1885 = distinct !{!1885, !1873, !1886}
!1886 = !DILocation(line: 647, column: 38, scope: !1867)
!1887 = !DILocation(line: 645, column: 23, scope: !1862)
!1888 = !DILocation(line: 645, column: 3, scope: !1862)
!1889 = distinct !{!1889, !1865, !1890}
!1890 = !DILocation(line: 647, column: 38, scope: !1859)
!1891 = !DILocation(line: 648, column: 1, scope: !1838)
!1892 = distinct !DISubprogram(name: "lambda_vector_clear", scope: !6, file: !6, line: 319, type: !1893, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1893 = !DISubroutineType(types: !1894)
!1894 = !{null, !5, !8}
!1895 = !DILocalVariable(name: "vec1", arg: 1, scope: !1892, file: !6, line: 319, type: !5)
!1896 = !DILocation(line: 319, column: 36, scope: !1892)
!1897 = !DILocalVariable(name: "size", arg: 2, scope: !1892, file: !6, line: 319, type: !8)
!1898 = !DILocation(line: 319, column: 46, scope: !1892)
!1899 = !DILocation(line: 321, column: 11, scope: !1892)
!1900 = !DILocation(line: 321, column: 3, scope: !1892)
!1901 = !DILocation(line: 321, column: 20, scope: !1892)
!1902 = !DILocation(line: 321, column: 25, scope: !1892)
!1903 = !DILocation(line: 322, column: 1, scope: !1892)
!1904 = distinct !DISubprogram(name: "print_lambda_matrix", scope: !1, file: !1, line: 653, type: !1905, scopeLine: 654, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1905 = !DISubroutineType(types: !1906)
!1906 = !{null, !1907, !17, !8, !8}
!1907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1908, size: 64)
!1908 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1909, line: 7, baseType: !1910)
!1909 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1911, line: 49, size: 1728, elements: !1912)
!1911 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1912 = !{!1913, !1914, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1930, !1932, !1933, !1934, !1938, !1940, !1942, !1946, !1949, !1951, !1954, !1957, !1958, !1959, !1963, !1964}
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1910, file: !1911, line: 51, baseType: !8, size: 32)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1910, file: !1911, line: 54, baseType: !1915, size: 64, offset: 64)
!1915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1916, size: 64)
!1916 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1910, file: !1911, line: 55, baseType: !1915, size: 64, offset: 128)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1910, file: !1911, line: 56, baseType: !1915, size: 64, offset: 192)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1910, file: !1911, line: 57, baseType: !1915, size: 64, offset: 256)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1910, file: !1911, line: 58, baseType: !1915, size: 64, offset: 320)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1910, file: !1911, line: 59, baseType: !1915, size: 64, offset: 384)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1910, file: !1911, line: 60, baseType: !1915, size: 64, offset: 448)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1910, file: !1911, line: 61, baseType: !1915, size: 64, offset: 512)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1910, file: !1911, line: 64, baseType: !1915, size: 64, offset: 576)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1910, file: !1911, line: 65, baseType: !1915, size: 64, offset: 640)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1910, file: !1911, line: 66, baseType: !1915, size: 64, offset: 704)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1910, file: !1911, line: 68, baseType: !1928, size: 64, offset: 768)
!1928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1929, size: 64)
!1929 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1911, line: 36, flags: DIFlagFwdDecl)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1910, file: !1911, line: 70, baseType: !1931, size: 64, offset: 832)
!1931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1910, size: 64)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1910, file: !1911, line: 72, baseType: !8, size: 32, offset: 896)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1910, file: !1911, line: 73, baseType: !8, size: 32, offset: 928)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1910, file: !1911, line: 74, baseType: !1935, size: 64, offset: 960)
!1935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1936, line: 152, baseType: !1937)
!1936 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1937 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1910, file: !1911, line: 77, baseType: !1939, size: 16, offset: 1024)
!1939 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1910, file: !1911, line: 78, baseType: !1941, size: 8, offset: 1040)
!1941 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1910, file: !1911, line: 79, baseType: !1943, size: 8, offset: 1048)
!1943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1916, size: 8, elements: !1944)
!1944 = !{!1945}
!1945 = !DISubrange(count: 1)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1910, file: !1911, line: 81, baseType: !1947, size: 64, offset: 1088)
!1947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1948, size: 64)
!1948 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1911, line: 43, baseType: null)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1910, file: !1911, line: 89, baseType: !1950, size: 64, offset: 1152)
!1950 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1936, line: 153, baseType: !1937)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1910, file: !1911, line: 91, baseType: !1952, size: 64, offset: 1216)
!1952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1953, size: 64)
!1953 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1911, line: 37, flags: DIFlagFwdDecl)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1910, file: !1911, line: 92, baseType: !1955, size: 64, offset: 1280)
!1955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1956, size: 64)
!1956 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1911, line: 38, flags: DIFlagFwdDecl)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1910, file: !1911, line: 93, baseType: !1931, size: 64, offset: 1344)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1910, file: !1911, line: 94, baseType: !9, size: 64, offset: 1408)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1910, file: !1911, line: 95, baseType: !1960, size: 64, offset: 1472)
!1960 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1961, line: 46, baseType: !1962)
!1961 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1962 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1910, file: !1911, line: 96, baseType: !8, size: 32, offset: 1536)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1910, file: !1911, line: 98, baseType: !1965, size: 160, offset: 1568)
!1965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1916, size: 160, elements: !1966)
!1966 = !{!1967}
!1967 = !DISubrange(count: 20)
!1968 = !DILocalVariable(name: "outfile", arg: 1, scope: !1904, file: !1, line: 653, type: !1907)
!1969 = !DILocation(line: 653, column: 29, scope: !1904)
!1970 = !DILocalVariable(name: "matrix", arg: 2, scope: !1904, file: !1, line: 653, type: !17)
!1971 = !DILocation(line: 653, column: 52, scope: !1904)
!1972 = !DILocalVariable(name: "m", arg: 3, scope: !1904, file: !1, line: 653, type: !8)
!1973 = !DILocation(line: 653, column: 64, scope: !1904)
!1974 = !DILocalVariable(name: "n", arg: 4, scope: !1904, file: !1, line: 653, type: !8)
!1975 = !DILocation(line: 653, column: 71, scope: !1904)
!1976 = !DILocalVariable(name: "i", scope: !1904, file: !1, line: 655, type: !8)
!1977 = !DILocation(line: 655, column: 7, scope: !1904)
!1978 = !DILocation(line: 657, column: 10, scope: !1979)
!1979 = distinct !DILexicalBlock(scope: !1904, file: !1, line: 657, column: 3)
!1980 = !DILocation(line: 657, column: 8, scope: !1979)
!1981 = !DILocation(line: 657, column: 15, scope: !1982)
!1982 = distinct !DILexicalBlock(scope: !1979, file: !1, line: 657, column: 3)
!1983 = !DILocation(line: 657, column: 19, scope: !1982)
!1984 = !DILocation(line: 657, column: 17, scope: !1982)
!1985 = !DILocation(line: 657, column: 3, scope: !1979)
!1986 = !DILocation(line: 658, column: 26, scope: !1982)
!1987 = !DILocation(line: 658, column: 35, scope: !1982)
!1988 = !DILocation(line: 658, column: 42, scope: !1982)
!1989 = !DILocation(line: 658, column: 46, scope: !1982)
!1990 = !DILocation(line: 658, column: 5, scope: !1982)
!1991 = !DILocation(line: 657, column: 23, scope: !1982)
!1992 = !DILocation(line: 657, column: 3, scope: !1982)
!1993 = distinct !{!1993, !1985, !1994}
!1994 = !DILocation(line: 658, column: 47, scope: !1979)
!1995 = !DILocation(line: 659, column: 12, scope: !1904)
!1996 = !DILocation(line: 659, column: 3, scope: !1904)
!1997 = !DILocation(line: 660, column: 1, scope: !1904)
!1998 = distinct !DISubprogram(name: "print_lambda_vector", scope: !6, file: !6, line: 414, type: !1999, scopeLine: 415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1999 = !DISubroutineType(types: !2000)
!2000 = !{null, !1907, !5, !8}
!2001 = !DILocalVariable(name: "outfile", arg: 1, scope: !1998, file: !6, line: 414, type: !1907)
!2002 = !DILocation(line: 414, column: 29, scope: !1998)
!2003 = !DILocalVariable(name: "vector", arg: 2, scope: !1998, file: !6, line: 414, type: !5)
!2004 = !DILocation(line: 414, column: 52, scope: !1998)
!2005 = !DILocalVariable(name: "n", arg: 3, scope: !1998, file: !6, line: 414, type: !8)
!2006 = !DILocation(line: 414, column: 64, scope: !1998)
!2007 = !DILocalVariable(name: "i", scope: !1998, file: !6, line: 416, type: !8)
!2008 = !DILocation(line: 416, column: 7, scope: !1998)
!2009 = !DILocation(line: 418, column: 10, scope: !2010)
!2010 = distinct !DILexicalBlock(scope: !1998, file: !6, line: 418, column: 3)
!2011 = !DILocation(line: 418, column: 8, scope: !2010)
!2012 = !DILocation(line: 418, column: 15, scope: !2013)
!2013 = distinct !DILexicalBlock(scope: !2010, file: !6, line: 418, column: 3)
!2014 = !DILocation(line: 418, column: 19, scope: !2013)
!2015 = !DILocation(line: 418, column: 17, scope: !2013)
!2016 = !DILocation(line: 418, column: 3, scope: !2010)
!2017 = !DILocation(line: 419, column: 14, scope: !2013)
!2018 = !DILocation(line: 419, column: 31, scope: !2013)
!2019 = !DILocation(line: 419, column: 38, scope: !2013)
!2020 = !DILocation(line: 419, column: 5, scope: !2013)
!2021 = !DILocation(line: 418, column: 23, scope: !2013)
!2022 = !DILocation(line: 418, column: 3, scope: !2013)
!2023 = distinct !{!2023, !2016, !2024}
!2024 = !DILocation(line: 419, column: 40, scope: !2010)
