; ModuleID = 'tree-vect-slp.c'
source_filename = "tree-vect-slp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "number_of_mask_fixes", scope: !2, file: !3, line: 1716, type: !100, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "vect_get_mask_element", scope: !3, file: !3, line: 1710, type: !4, scopeLine: 1714, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1754, retainedNodes: !4011)
!3 = !DIFile(filename: "tree-vect-slp.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !100, !100, !100, !6, !100, !1752, !1752, !1753}
!6 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !8, line: 58, baseType: !9)
!8 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !11, line: 737, size: 768, elements: !12)
!11 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !{!13, !1599, !1609, !1615, !1620, !1625, !1632, !1638, !1644, !1649, !1663, !1668, !1674, !1679, !1689, !1694, !1710, !1717, !1724, !1730, !1735, !1741, !1747}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !10, file: !11, line: 738, baseType: !14, size: 256)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !11, line: 271, size: 256, elements: !15)
!15 = !{!16, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !32, !33, !1598}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !14, file: !11, line: 274, baseType: !17, size: 8, flags: DIFlagBitField, extraData: i64 0)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !14, file: !11, line: 277, baseType: !17, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !14, file: !11, line: 281, baseType: !17, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !14, file: !11, line: 284, baseType: !17, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !14, file: !11, line: 291, baseType: !17, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !14, file: !11, line: 295, baseType: !17, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !14, file: !11, line: 298, baseType: !17, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !14, file: !11, line: 301, baseType: !17, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !14, file: !11, line: 307, baseType: !17, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !14, file: !11, line: 312, baseType: !17, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !14, file: !11, line: 316, baseType: !28, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !29, line: 58, baseType: !30)
!29 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !31, line: 44, baseType: !17)
!31 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !14, file: !11, line: 319, baseType: !17, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !14, file: !11, line: 323, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !36, line: 217, size: 832, elements: !37)
!36 = !DIFile(filename: "./basic-block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !1565, !1566, !1567, !1568, !1572, !1573, !1574, !1592, !1593, !1594, !1595, !1596, !1597}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !35, file: !36, line: 219, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !36, line: 151, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !36, line: 151, size: 128, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !41, file: !36, line: 151, baseType: !44, size: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !36, line: 150, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !36, line: 150, size: 128, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !45, file: !36, line: 150, baseType: !17, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !45, file: !36, line: 150, baseType: !17, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !45, file: !36, line: 150, baseType: !50, size: 64, offset: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !115)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !8, line: 108, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !36, line: 122, size: 512, elements: !54)
!54 = !{!55, !56, !57, !1557, !1558, !1559, !1560, !1561, !1562, !1563}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !53, file: !36, line: 124, baseType: !34, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !53, file: !36, line: 125, baseType: !34, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !53, file: !36, line: 131, baseType: !58, size: 64, offset: 128)
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !36, line: 128, size: 64, elements: !59)
!59 = !{!60, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !58, file: !36, line: 129, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !8, line: 66, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !11, line: 143, size: 192, elements: !64)
!64 = !{!65, !73, !74}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !63, file: !11, line: 145, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !8, line: 69, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !11, line: 136, size: 192, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !68, file: !11, line: 137, baseType: !7, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !11, line: 138, baseType: !67, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !11, line: 139, baseType: !67, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !63, file: !11, line: 146, baseType: !66, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !63, file: !11, line: 152, baseType: !61, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !58, file: !36, line: 130, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !8, line: 50, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !79, line: 240, size: 384, elements: !80)
!79 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !78, file: !79, line: 242, baseType: !17, size: 16, flags: DIFlagBitField, extraData: i64 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !78, file: !79, line: 245, baseType: !17, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !78, file: !79, line: 252, baseType: !17, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !78, file: !79, line: 257, baseType: !17, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !78, file: !79, line: 265, baseType: !17, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !78, file: !79, line: 277, baseType: !17, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !78, file: !79, line: 291, baseType: !17, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !78, file: !79, line: 298, baseType: !17, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !78, file: !79, line: 305, baseType: !17, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !78, file: !79, line: 310, baseType: !17, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !78, file: !79, line: 321, baseType: !92, size: 320, offset: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !79, line: 315, size: 320, elements: !93)
!93 = !{!94, !1524, !1526, !1555, !1556}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !92, file: !79, line: 316, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, elements: !115)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !79, line: 183, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !79, line: 166, size: 64, elements: !98)
!98 = !{!99, !101, !102, !106, !107, !117, !246, !258, !261, !325, !1502, !1503, !1514, !1521}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !97, file: !79, line: 168, baseType: !100, size: 32)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !97, file: !79, line: 169, baseType: !17, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !97, file: !79, line: 170, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !97, file: !79, line: 171, baseType: !76, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !97, file: !79, line: 172, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !8, line: 53, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !79, line: 359, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !110, file: !79, line: 360, baseType: !100, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !110, file: !79, line: 361, baseType: !114, size: 64, offset: 64)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !97, file: !79, line: 173, baseType: !118, size: 32)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "machine_mode", file: !119, line: 7, baseType: !17, size: 32, elements: !120)
!119 = !DIFile(filename: "./insn-modes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!121 = !DIEnumerator(name: "VOIDmode", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "BLKmode", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "CCmode", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "CCGCmode", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "CCGOCmode", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "CCNOmode", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "CCAmode", value: 6, isUnsigned: true)
!128 = !DIEnumerator(name: "CCCmode", value: 7, isUnsigned: true)
!129 = !DIEnumerator(name: "CCOmode", value: 8, isUnsigned: true)
!130 = !DIEnumerator(name: "CCSmode", value: 9, isUnsigned: true)
!131 = !DIEnumerator(name: "CCZmode", value: 10, isUnsigned: true)
!132 = !DIEnumerator(name: "CCFPmode", value: 11, isUnsigned: true)
!133 = !DIEnumerator(name: "CCFPUmode", value: 12, isUnsigned: true)
!134 = !DIEnumerator(name: "BImode", value: 13, isUnsigned: true)
!135 = !DIEnumerator(name: "QImode", value: 14, isUnsigned: true)
!136 = !DIEnumerator(name: "HImode", value: 15, isUnsigned: true)
!137 = !DIEnumerator(name: "SImode", value: 16, isUnsigned: true)
!138 = !DIEnumerator(name: "DImode", value: 17, isUnsigned: true)
!139 = !DIEnumerator(name: "TImode", value: 18, isUnsigned: true)
!140 = !DIEnumerator(name: "OImode", value: 19, isUnsigned: true)
!141 = !DIEnumerator(name: "QQmode", value: 20, isUnsigned: true)
!142 = !DIEnumerator(name: "HQmode", value: 21, isUnsigned: true)
!143 = !DIEnumerator(name: "SQmode", value: 22, isUnsigned: true)
!144 = !DIEnumerator(name: "DQmode", value: 23, isUnsigned: true)
!145 = !DIEnumerator(name: "TQmode", value: 24, isUnsigned: true)
!146 = !DIEnumerator(name: "UQQmode", value: 25, isUnsigned: true)
!147 = !DIEnumerator(name: "UHQmode", value: 26, isUnsigned: true)
!148 = !DIEnumerator(name: "USQmode", value: 27, isUnsigned: true)
!149 = !DIEnumerator(name: "UDQmode", value: 28, isUnsigned: true)
!150 = !DIEnumerator(name: "UTQmode", value: 29, isUnsigned: true)
!151 = !DIEnumerator(name: "HAmode", value: 30, isUnsigned: true)
!152 = !DIEnumerator(name: "SAmode", value: 31, isUnsigned: true)
!153 = !DIEnumerator(name: "DAmode", value: 32, isUnsigned: true)
!154 = !DIEnumerator(name: "TAmode", value: 33, isUnsigned: true)
!155 = !DIEnumerator(name: "UHAmode", value: 34, isUnsigned: true)
!156 = !DIEnumerator(name: "USAmode", value: 35, isUnsigned: true)
!157 = !DIEnumerator(name: "UDAmode", value: 36, isUnsigned: true)
!158 = !DIEnumerator(name: "UTAmode", value: 37, isUnsigned: true)
!159 = !DIEnumerator(name: "SFmode", value: 38, isUnsigned: true)
!160 = !DIEnumerator(name: "DFmode", value: 39, isUnsigned: true)
!161 = !DIEnumerator(name: "XFmode", value: 40, isUnsigned: true)
!162 = !DIEnumerator(name: "TFmode", value: 41, isUnsigned: true)
!163 = !DIEnumerator(name: "SDmode", value: 42, isUnsigned: true)
!164 = !DIEnumerator(name: "DDmode", value: 43, isUnsigned: true)
!165 = !DIEnumerator(name: "TDmode", value: 44, isUnsigned: true)
!166 = !DIEnumerator(name: "CQImode", value: 45, isUnsigned: true)
!167 = !DIEnumerator(name: "CHImode", value: 46, isUnsigned: true)
!168 = !DIEnumerator(name: "CSImode", value: 47, isUnsigned: true)
!169 = !DIEnumerator(name: "CDImode", value: 48, isUnsigned: true)
!170 = !DIEnumerator(name: "CTImode", value: 49, isUnsigned: true)
!171 = !DIEnumerator(name: "COImode", value: 50, isUnsigned: true)
!172 = !DIEnumerator(name: "SCmode", value: 51, isUnsigned: true)
!173 = !DIEnumerator(name: "DCmode", value: 52, isUnsigned: true)
!174 = !DIEnumerator(name: "XCmode", value: 53, isUnsigned: true)
!175 = !DIEnumerator(name: "TCmode", value: 54, isUnsigned: true)
!176 = !DIEnumerator(name: "V2QImode", value: 55, isUnsigned: true)
!177 = !DIEnumerator(name: "V4QImode", value: 56, isUnsigned: true)
!178 = !DIEnumerator(name: "V2HImode", value: 57, isUnsigned: true)
!179 = !DIEnumerator(name: "V1SImode", value: 58, isUnsigned: true)
!180 = !DIEnumerator(name: "V8QImode", value: 59, isUnsigned: true)
!181 = !DIEnumerator(name: "V4HImode", value: 60, isUnsigned: true)
!182 = !DIEnumerator(name: "V2SImode", value: 61, isUnsigned: true)
!183 = !DIEnumerator(name: "V1DImode", value: 62, isUnsigned: true)
!184 = !DIEnumerator(name: "V16QImode", value: 63, isUnsigned: true)
!185 = !DIEnumerator(name: "V8HImode", value: 64, isUnsigned: true)
!186 = !DIEnumerator(name: "V4SImode", value: 65, isUnsigned: true)
!187 = !DIEnumerator(name: "V2DImode", value: 66, isUnsigned: true)
!188 = !DIEnumerator(name: "V1TImode", value: 67, isUnsigned: true)
!189 = !DIEnumerator(name: "V32QImode", value: 68, isUnsigned: true)
!190 = !DIEnumerator(name: "V16HImode", value: 69, isUnsigned: true)
!191 = !DIEnumerator(name: "V8SImode", value: 70, isUnsigned: true)
!192 = !DIEnumerator(name: "V4DImode", value: 71, isUnsigned: true)
!193 = !DIEnumerator(name: "V2TImode", value: 72, isUnsigned: true)
!194 = !DIEnumerator(name: "V64QImode", value: 73, isUnsigned: true)
!195 = !DIEnumerator(name: "V32HImode", value: 74, isUnsigned: true)
!196 = !DIEnumerator(name: "V16SImode", value: 75, isUnsigned: true)
!197 = !DIEnumerator(name: "V8DImode", value: 76, isUnsigned: true)
!198 = !DIEnumerator(name: "V4TImode", value: 77, isUnsigned: true)
!199 = !DIEnumerator(name: "V2SFmode", value: 78, isUnsigned: true)
!200 = !DIEnumerator(name: "V4SFmode", value: 79, isUnsigned: true)
!201 = !DIEnumerator(name: "V2DFmode", value: 80, isUnsigned: true)
!202 = !DIEnumerator(name: "V8SFmode", value: 81, isUnsigned: true)
!203 = !DIEnumerator(name: "V4DFmode", value: 82, isUnsigned: true)
!204 = !DIEnumerator(name: "V2TFmode", value: 83, isUnsigned: true)
!205 = !DIEnumerator(name: "V16SFmode", value: 84, isUnsigned: true)
!206 = !DIEnumerator(name: "V8DFmode", value: 85, isUnsigned: true)
!207 = !DIEnumerator(name: "V4TFmode", value: 86, isUnsigned: true)
!208 = !DIEnumerator(name: "MAX_MACHINE_MODE", value: 87, isUnsigned: true)
!209 = !DIEnumerator(name: "MIN_MODE_RANDOM", value: 0, isUnsigned: true)
!210 = !DIEnumerator(name: "MAX_MODE_RANDOM", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "MIN_MODE_CC", value: 2, isUnsigned: true)
!212 = !DIEnumerator(name: "MAX_MODE_CC", value: 12, isUnsigned: true)
!213 = !DIEnumerator(name: "MIN_MODE_INT", value: 14, isUnsigned: true)
!214 = !DIEnumerator(name: "MAX_MODE_INT", value: 19, isUnsigned: true)
!215 = !DIEnumerator(name: "MIN_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "MAX_MODE_PARTIAL_INT", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "MIN_MODE_FRACT", value: 20, isUnsigned: true)
!218 = !DIEnumerator(name: "MAX_MODE_FRACT", value: 24, isUnsigned: true)
!219 = !DIEnumerator(name: "MIN_MODE_UFRACT", value: 25, isUnsigned: true)
!220 = !DIEnumerator(name: "MAX_MODE_UFRACT", value: 29, isUnsigned: true)
!221 = !DIEnumerator(name: "MIN_MODE_ACCUM", value: 30, isUnsigned: true)
!222 = !DIEnumerator(name: "MAX_MODE_ACCUM", value: 33, isUnsigned: true)
!223 = !DIEnumerator(name: "MIN_MODE_UACCUM", value: 34, isUnsigned: true)
!224 = !DIEnumerator(name: "MAX_MODE_UACCUM", value: 37, isUnsigned: true)
!225 = !DIEnumerator(name: "MIN_MODE_FLOAT", value: 38, isUnsigned: true)
!226 = !DIEnumerator(name: "MAX_MODE_FLOAT", value: 41, isUnsigned: true)
!227 = !DIEnumerator(name: "MIN_MODE_DECIMAL_FLOAT", value: 42, isUnsigned: true)
!228 = !DIEnumerator(name: "MAX_MODE_DECIMAL_FLOAT", value: 44, isUnsigned: true)
!229 = !DIEnumerator(name: "MIN_MODE_COMPLEX_INT", value: 45, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_MODE_COMPLEX_INT", value: 50, isUnsigned: true)
!231 = !DIEnumerator(name: "MIN_MODE_COMPLEX_FLOAT", value: 51, isUnsigned: true)
!232 = !DIEnumerator(name: "MAX_MODE_COMPLEX_FLOAT", value: 54, isUnsigned: true)
!233 = !DIEnumerator(name: "MIN_MODE_VECTOR_INT", value: 55, isUnsigned: true)
!234 = !DIEnumerator(name: "MAX_MODE_VECTOR_INT", value: 77, isUnsigned: true)
!235 = !DIEnumerator(name: "MIN_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!236 = !DIEnumerator(name: "MAX_MODE_VECTOR_FRACT", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "MIN_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!238 = !DIEnumerator(name: "MAX_MODE_VECTOR_UFRACT", value: 0, isUnsigned: true)
!239 = !DIEnumerator(name: "MIN_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!240 = !DIEnumerator(name: "MAX_MODE_VECTOR_ACCUM", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "MIN_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!242 = !DIEnumerator(name: "MAX_MODE_VECTOR_UACCUM", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "MIN_MODE_VECTOR_FLOAT", value: 78, isUnsigned: true)
!244 = !DIEnumerator(name: "MAX_MODE_VECTOR_FLOAT", value: 86, isUnsigned: true)
!245 = !DIEnumerator(name: "NUM_MACHINE_MODES", value: 87, isUnsigned: true)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !97, file: !79, line: 174, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !79, line: 133, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 115, size: 32, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !248, file: !79, line: 118, baseType: !17, size: 8, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !248, file: !79, line: 120, baseType: !17, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !248, file: !79, line: 121, baseType: !17, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !248, file: !79, line: 123, baseType: !17, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !248, file: !79, line: 125, baseType: !17, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !248, file: !79, line: 127, baseType: !17, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !248, file: !79, line: 130, baseType: !17, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !248, file: !79, line: 132, baseType: !17, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !97, file: !79, line: 175, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !79, line: 175, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !97, file: !79, line: 176, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !264, line: 75, size: 256, elements: !265)
!264 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!265 = !{!266, !281, !282, !283}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !263, file: !264, line: 76, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !264, line: 68, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !264, line: 63, size: 320, elements: !270)
!270 = !{!271, !273, !274, !275}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !264, line: 64, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !264, line: 65, baseType: !272, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !269, file: !264, line: 66, baseType: !17, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !269, file: !264, line: 67, baseType: !276, size: 128, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !279)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !264, line: 29, baseType: !278)
!278 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!279 = !{!280}
!280 = !DISubrange(count: 2)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !263, file: !264, line: 77, baseType: !267, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !263, file: !264, line: 78, baseType: !17, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !263, file: !264, line: 79, baseType: !284, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !264, line: 49, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !264, line: 45, size: 832, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !286, file: !264, line: 46, baseType: !272, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !286, file: !264, line: 47, baseType: !262, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !286, file: !264, line: 48, baseType: !291, size: 704, offset: 128)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !292, line: 164, size: 704, elements: !293)
!292 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!293 = !{!294, !296, !307, !308, !309, !310, !311, !312, !317, !321, !322, !323, !324}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !291, file: !292, line: 166, baseType: !295, size: 64)
!295 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !291, file: !292, line: 167, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !292, line: 157, size: 192, elements: !299)
!299 = !{!300, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !298, file: !292, line: 159, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !292, line: 160, baseType: !297, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !298, file: !292, line: 161, baseType: !304, size: 32, offset: 128)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 32, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 4)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !291, file: !292, line: 168, baseType: !301, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !291, file: !292, line: 169, baseType: !301, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !291, file: !292, line: 170, baseType: !301, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !291, file: !292, line: 171, baseType: !295, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !291, file: !292, line: 172, baseType: !100, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !291, file: !292, line: 176, baseType: !313, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!297, !316, !295}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !291, file: !292, line: 177, baseType: !318, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !316, !297}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !291, file: !292, line: 178, baseType: !316, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !291, file: !292, line: 179, baseType: !17, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !291, file: !292, line: 180, baseType: !17, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !291, file: !292, line: 184, baseType: !17, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !97, file: !79, line: 177, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !8, line: 56, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !329, line: 3371, size: 1792, elements: !330)
!329 = !DIFile(filename: "./tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!330 = !{!331, !364, !370, !381, !400, !411, !416, !423, !429, !442, !450, !488, !493, !521, !538, !539, !544, !553, !559, !564, !568, !572, !925, !974, !980, !986, !993, !1006, !1020, !1037, !1049, !1071, !1312, !1484}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !328, file: !329, line: 3372, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !329, line: 360, size: 64, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !332, file: !329, line: 361, baseType: !17, size: 16, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !332, file: !329, line: 363, baseType: !17, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !332, file: !329, line: 364, baseType: !17, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !332, file: !329, line: 365, baseType: !17, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !332, file: !329, line: 366, baseType: !17, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !332, file: !329, line: 367, baseType: !17, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !332, file: !329, line: 368, baseType: !17, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !332, file: !329, line: 369, baseType: !17, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !332, file: !329, line: 370, baseType: !17, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !332, file: !329, line: 372, baseType: !17, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !332, file: !329, line: 373, baseType: !17, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !332, file: !329, line: 374, baseType: !17, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !332, file: !329, line: 375, baseType: !17, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !332, file: !329, line: 376, baseType: !17, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !332, file: !329, line: 377, baseType: !17, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !332, file: !329, line: 378, baseType: !17, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !332, file: !329, line: 379, baseType: !17, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !332, file: !329, line: 381, baseType: !17, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !332, file: !329, line: 382, baseType: !17, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !332, file: !329, line: 383, baseType: !17, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !332, file: !329, line: 384, baseType: !17, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !332, file: !329, line: 385, baseType: !17, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !332, file: !329, line: 386, baseType: !17, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !332, file: !329, line: 387, baseType: !17, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !332, file: !329, line: 388, baseType: !17, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !332, file: !329, line: 390, baseType: !17, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !332, file: !329, line: 391, baseType: !17, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !332, file: !329, line: 392, baseType: !17, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !332, file: !329, line: 394, baseType: !17, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !332, file: !329, line: 399, baseType: !17, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !328, file: !329, line: 3373, baseType: !365, size: 192)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !329, line: 402, size: 192, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !365, file: !329, line: 403, baseType: !332, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !365, file: !329, line: 404, baseType: !326, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !329, line: 405, baseType: !326, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !328, file: !329, line: 3374, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !329, line: 1384, size: 320, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !371, file: !329, line: 1385, baseType: !365, size: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !371, file: !329, line: 1386, baseType: !375, size: 128, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !376, line: 58, baseType: !377)
!376 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 54, size: 128, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !377, file: !376, line: 56, baseType: !278, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !377, file: !376, line: 57, baseType: !295, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !328, file: !329, line: 3375, baseType: !382, size: 256)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !329, line: 1397, size: 256, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !382, file: !329, line: 1398, baseType: !365, size: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !382, file: !329, line: 1399, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !388, line: 52, size: 256, elements: !389)
!388 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !{!390, !391, !392, !393, !394, !395, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !387, file: !388, line: 56, baseType: !17, size: 2, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !387, file: !388, line: 57, baseType: !17, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !387, file: !388, line: 58, baseType: !17, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !387, file: !388, line: 59, baseType: !17, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !387, file: !388, line: 60, baseType: !17, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !387, file: !388, line: 61, baseType: !17, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !387, file: !388, line: 62, baseType: !397, size: 192, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 192, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 3)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !328, file: !329, line: 3376, baseType: !401, size: 256)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !329, line: 1408, size: 256, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !401, file: !329, line: 1409, baseType: !365, size: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !401, file: !329, line: 1410, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !407, line: 27, size: 192, elements: !408)
!407 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !407, line: 29, baseType: !375, size: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !406, file: !407, line: 30, baseType: !118, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !328, file: !329, line: 3377, baseType: !412, size: 256)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !329, line: 1437, size: 256, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !412, file: !329, line: 1438, baseType: !365, size: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !412, file: !329, line: 1439, baseType: !326, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !328, file: !329, line: 3378, baseType: !417, size: 256)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !329, line: 1418, size: 256, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !417, file: !329, line: 1419, baseType: !365, size: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !417, file: !329, line: 1420, baseType: !100, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !417, file: !329, line: 1421, baseType: !422, size: 8, offset: 224)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8, elements: !115)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !328, file: !329, line: 3379, baseType: !424, size: 320)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !329, line: 1428, size: 320, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !424, file: !329, line: 1429, baseType: !365, size: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !424, file: !329, line: 1430, baseType: !326, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !424, file: !329, line: 1431, baseType: !326, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !328, file: !329, line: 3380, baseType: !430, size: 320)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !329, line: 1460, size: 320, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !430, file: !329, line: 1461, baseType: !365, size: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !430, file: !329, line: 1462, baseType: !434, size: 128, offset: 192)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !435, line: 31, size: 128, elements: !436)
!435 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!436 = !{!437, !440, !441}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !434, file: !435, line: 32, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !434, file: !435, line: 33, baseType: !17, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !434, file: !435, line: 34, baseType: !17, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !328, file: !329, line: 3381, baseType: !443, size: 384)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !329, line: 2507, size: 384, elements: !444)
!444 = !{!445, !446, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !443, file: !329, line: 2508, baseType: !365, size: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !443, file: !329, line: 2509, baseType: !28, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !443, file: !329, line: 2510, baseType: !17, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !329, line: 2511, baseType: !326, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !443, file: !329, line: 2512, baseType: !326, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !328, file: !329, line: 3382, baseType: !451, size: 896)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !329, line: 2652, size: 896, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !451, file: !329, line: 2653, baseType: !443, size: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !329, line: 2654, baseType: !326, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !451, file: !329, line: 2656, baseType: !17, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !451, file: !329, line: 2658, baseType: !17, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !451, file: !329, line: 2659, baseType: !17, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !451, file: !329, line: 2660, baseType: !17, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !451, file: !329, line: 2661, baseType: !17, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !451, file: !329, line: 2662, baseType: !17, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !451, file: !329, line: 2663, baseType: !17, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !451, file: !329, line: 2664, baseType: !17, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !451, file: !329, line: 2666, baseType: !17, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !451, file: !329, line: 2667, baseType: !17, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !451, file: !329, line: 2668, baseType: !17, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !451, file: !329, line: 2669, baseType: !17, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !451, file: !329, line: 2670, baseType: !17, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !451, file: !329, line: 2671, baseType: !17, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !451, file: !329, line: 2672, baseType: !17, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !451, file: !329, line: 2673, baseType: !17, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !451, file: !329, line: 2674, baseType: !17, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !451, file: !329, line: 2678, baseType: !17, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !451, file: !329, line: 2682, baseType: !17, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !451, file: !329, line: 2685, baseType: !17, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !451, file: !329, line: 2688, baseType: !17, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !451, file: !329, line: 2690, baseType: !17, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !451, file: !329, line: 2692, baseType: !17, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !451, file: !329, line: 2695, baseType: !17, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !451, file: !329, line: 2698, baseType: !17, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !451, file: !329, line: 2703, baseType: !17, size: 32, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !451, file: !329, line: 2705, baseType: !326, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !451, file: !329, line: 2706, baseType: !326, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !451, file: !329, line: 2707, baseType: !326, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !451, file: !329, line: 2708, baseType: !326, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !451, file: !329, line: 2711, baseType: !486, size: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !329, line: 2711, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !328, file: !329, line: 3383, baseType: !489, size: 960)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !329, line: 2756, size: 960, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !489, file: !329, line: 2757, baseType: !451, size: 896)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !489, file: !329, line: 2758, baseType: !76, size: 64, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !328, file: !329, line: 3384, baseType: !494, size: 1472)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !329, line: 3114, size: 1472, elements: !495)
!495 = !{!496, !517, !518, !519, !520}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !329, line: 3115, baseType: !497, size: 1216)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !329, line: 2984, size: 1216, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !497, file: !329, line: 2985, baseType: !489, size: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !497, file: !329, line: 2986, baseType: !326, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !497, file: !329, line: 2987, baseType: !326, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !497, file: !329, line: 2988, baseType: !326, size: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !497, file: !329, line: 2991, baseType: !17, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !497, file: !329, line: 2992, baseType: !17, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !497, file: !329, line: 2993, baseType: !17, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !497, file: !329, line: 2994, baseType: !17, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !497, file: !329, line: 2995, baseType: !17, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !497, file: !329, line: 2996, baseType: !17, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !497, file: !329, line: 2998, baseType: !17, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !497, file: !329, line: 3000, baseType: !17, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !497, file: !329, line: 3002, baseType: !17, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !497, file: !329, line: 3003, baseType: !17, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !497, file: !329, line: 3004, baseType: !17, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !497, file: !329, line: 3005, baseType: !17, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !497, file: !329, line: 3007, baseType: !17, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !497, file: !329, line: 3010, baseType: !17, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !494, file: !329, line: 3117, baseType: !326, size: 64, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !494, file: !329, line: 3119, baseType: !326, size: 64, offset: 1280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !494, file: !329, line: 3121, baseType: !326, size: 64, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !494, file: !329, line: 3123, baseType: !326, size: 64, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !328, file: !329, line: 3385, baseType: !522, size: 1088)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !329, line: 2874, size: 1088, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !522, file: !329, line: 2875, baseType: !489, size: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !522, file: !329, line: 2876, baseType: !76, size: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !522, file: !329, line: 2877, baseType: !527, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !529, line: 172, size: 128, elements: !530)
!529 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!530 = !{!531, !532, !533, !534, !535, !536, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !528, file: !529, line: 174, baseType: !17, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !528, file: !529, line: 178, baseType: !17, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !528, file: !529, line: 183, baseType: !17, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !528, file: !529, line: 187, baseType: !17, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !528, file: !529, line: 192, baseType: !17, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !528, file: !529, line: 195, baseType: !17, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !528, file: !529, line: 199, baseType: !326, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !328, file: !329, line: 3386, baseType: !497, size: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !328, file: !329, line: 3387, baseType: !540, size: 1280)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !329, line: 3093, size: 1280, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !540, file: !329, line: 3094, baseType: !497, size: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !540, file: !329, line: 3095, baseType: !527, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !328, file: !329, line: 3388, baseType: !545, size: 1216)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !329, line: 2824, size: 1216, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !545, file: !329, line: 2825, baseType: !451, size: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !545, file: !329, line: 2827, baseType: !326, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !545, file: !329, line: 2828, baseType: !326, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !545, file: !329, line: 2829, baseType: !326, size: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !545, file: !329, line: 2830, baseType: !326, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !545, file: !329, line: 2831, baseType: !326, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !328, file: !329, line: 3389, baseType: !554, size: 1024)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !329, line: 2850, size: 1024, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !554, file: !329, line: 2851, baseType: !489, size: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !554, file: !329, line: 2852, baseType: !100, size: 32, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !554, file: !329, line: 2853, baseType: !100, size: 32, offset: 992)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !328, file: !329, line: 3390, baseType: !560, size: 1024)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !329, line: 2857, size: 1024, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !329, line: 2858, baseType: !489, size: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !560, file: !329, line: 2859, baseType: !527, size: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !328, file: !329, line: 3391, baseType: !565, size: 960)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !329, line: 2862, size: 960, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !329, line: 2863, baseType: !489, size: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !328, file: !329, line: 3392, baseType: !569, size: 1472)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !329, line: 3304, size: 1472, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !569, file: !329, line: 3305, baseType: !494, size: 1472)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !328, file: !329, line: 3393, baseType: !573, size: 1792)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !329, line: 3248, size: 1792, elements: !574)
!574 = !{!575, !576, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !573, file: !329, line: 3249, baseType: !494, size: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !573, file: !329, line: 3251, baseType: !577, size: 64, offset: 1472)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !579, line: 463, size: 1152, elements: !580)
!579 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!580 = !{!581, !584, !625, !626, !767, !843, !844, !845, !846, !847, !848, !877, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !578, file: !579, line: 464, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !579, line: 464, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !578, file: !579, line: 467, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !36, line: 374, size: 640, elements: !587)
!587 = !{!588, !590, !591, !604, !605, !606, !607, !608, !614, !621, !623, !624}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !586, file: !36, line: 377, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !8, line: 111, baseType: !34)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !586, file: !36, line: 378, baseType: !589, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !586, file: !36, line: 381, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !36, line: 282, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !36, line: 282, size: 128, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !594, file: !36, line: 282, baseType: !597, size: 128)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !36, line: 281, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !36, line: 281, size: 128, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !598, file: !36, line: 281, baseType: !17, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !598, file: !36, line: 281, baseType: !17, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !598, file: !36, line: 281, baseType: !603, size: 64, offset: 64)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 64, elements: !115)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !586, file: !36, line: 384, baseType: !100, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !586, file: !36, line: 387, baseType: !100, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !586, file: !36, line: 390, baseType: !100, size: 32, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !586, file: !36, line: 394, baseType: !592, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !586, file: !36, line: 396, baseType: !609, size: 32, offset: 384)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "profile_status_d", file: !36, line: 363, baseType: !17, size: 32, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIEnumerator(name: "PROFILE_ABSENT", value: 0, isUnsigned: true)
!612 = !DIEnumerator(name: "PROFILE_GUESSED", value: 1, isUnsigned: true)
!613 = !DIEnumerator(name: "PROFILE_READ", value: 2, isUnsigned: true)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !586, file: !36, line: 399, baseType: !615, size: 64, offset: 416)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 64, elements: !279)
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dom_state", file: !36, line: 355, baseType: !17, size: 32, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIEnumerator(name: "DOM_NONE", value: 0, isUnsigned: true)
!619 = !DIEnumerator(name: "DOM_NO_FAST_QUERY", value: 1, isUnsigned: true)
!620 = !DIEnumerator(name: "DOM_OK", value: 2, isUnsigned: true)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !586, file: !36, line: 402, baseType: !622, size: 64, offset: 480)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !279)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !586, file: !36, line: 406, baseType: !100, size: 32, offset: 544)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !586, file: !36, line: 409, baseType: !100, size: 32, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !578, file: !579, line: 470, baseType: !62, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !578, file: !579, line: 473, baseType: !627, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !529, line: 39, size: 1152, elements: !629)
!629 = !{!630, !682, !695, !708, !709, !721, !722, !726, !727, !728, !729, !730}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !628, file: !529, line: 41, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !632, line: 144, baseType: !633)
!632 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !632, line: 100, size: 896, elements: !635)
!635 = !{!636, !644, !649, !654, !656, !659, !660, !661, !662, !663, !668, !670, !671, !676, !681}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !634, file: !632, line: 102, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !632, line: 52, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !632, line: 47, baseType: !17)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !634, file: !632, line: 105, baseType: !645, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !632, line: 59, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!100, !642, !642}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !634, file: !632, line: 108, baseType: !650, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !632, line: 63, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !316}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !634, file: !632, line: 111, baseType: !655, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !634, file: !632, line: 114, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !658, line: 46, baseType: !278)
!658 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!659 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !634, file: !632, line: 117, baseType: !657, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !634, file: !632, line: 120, baseType: !657, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !634, file: !632, line: 124, baseType: !17, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !634, file: !632, line: 128, baseType: !17, size: 32, offset: 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !634, file: !632, line: 131, baseType: !664, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !632, line: 75, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!316, !657, !657}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !634, file: !632, line: 132, baseType: !669, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !632, line: 78, baseType: !651)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !634, file: !632, line: 135, baseType: !316, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !634, file: !632, line: 136, baseType: !672, size: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !632, line: 82, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!316, !316, !657, !657}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !634, file: !632, line: 137, baseType: !677, size: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !632, line: 83, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !316, !316}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !634, file: !632, line: 141, baseType: !17, size: 32, offset: 832)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !628, file: !529, line: 48, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !11, line: 35, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !11, line: 35, size: 128, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !685, file: !11, line: 35, baseType: !688, size: 128)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !11, line: 33, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !11, line: 33, size: 128, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !689, file: !11, line: 33, baseType: !17, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !689, file: !11, line: 33, baseType: !17, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !689, file: !11, line: 33, baseType: !694, size: 64, offset: 64)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !115)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !628, file: !529, line: 51, baseType: !696, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !329, line: 183, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !329, line: 183, size: 128, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !698, file: !329, line: 183, baseType: !701, size: 128)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !329, line: 182, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !329, line: 182, size: 128, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !702, file: !329, line: 182, baseType: !17, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !702, file: !329, line: 182, baseType: !17, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !702, file: !329, line: 182, baseType: !707, size: 64, offset: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, elements: !115)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !628, file: !529, line: 54, baseType: !326, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !628, file: !529, line: 57, baseType: !710, size: 128, offset: 256)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !711, line: 31, size: 128, elements: !712)
!711 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!712 = !{!713, !714, !715, !716, !717, !718, !719}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !710, file: !711, line: 35, baseType: !17, size: 1, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !710, file: !711, line: 39, baseType: !17, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !710, file: !711, line: 42, baseType: !17, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !710, file: !711, line: 46, baseType: !17, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !710, file: !711, line: 50, baseType: !17, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !710, file: !711, line: 53, baseType: !17, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !710, file: !711, line: 56, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !8, line: 47, baseType: !262)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !628, file: !529, line: 60, baseType: !710, size: 128, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !628, file: !529, line: 64, baseType: !723, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !725, line: 33, flags: DIFlagFwdDecl)
!725 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!726 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !628, file: !529, line: 67, baseType: !326, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !628, file: !529, line: 73, baseType: !631, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !628, file: !529, line: 77, baseType: !720, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !628, file: !529, line: 80, baseType: !17, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !628, file: !529, line: 82, baseType: !731, size: 320, offset: 832)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !732, line: 62, size: 320, elements: !733)
!732 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!733 = !{!734, !740, !741, !742, !743, !750}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !731, file: !732, line: 63, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !732, line: 56, size: 128, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !732, line: 57, baseType: !735, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !736, file: !732, line: 58, baseType: !422, size: 8, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !731, file: !732, line: 64, baseType: !17, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !731, file: !732, line: 66, baseType: !17, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !731, file: !732, line: 68, baseType: !6, size: 8, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !731, file: !732, line: 70, baseType: !744, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !732, line: 37, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !732, line: 39, baseType: !744, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !745, file: !732, line: 40, baseType: !749, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !731, file: !732, line: 71, baseType: !751, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !732, line: 45, size: 320, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !732, line: 47, baseType: !751, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !752, file: !732, line: 48, baseType: !756, size: 256, offset: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !329, line: 1883, size: 256, elements: !757)
!757 = !{!758, !760, !761, !766}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !329, line: 1884, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !329, line: 1885, baseType: !759, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !756, file: !329, line: 1891, baseType: !762, size: 64, offset: 128)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !756, file: !329, line: 1891, size: 64, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !762, file: !329, line: 1891, baseType: !7, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !762, file: !329, line: 1891, baseType: !326, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !756, file: !329, line: 1892, baseType: !749, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !578, file: !579, line: 476, baseType: !768, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !770, line: 187, size: 256, elements: !771)
!770 = !DIFile(filename: "./cfgloop.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!771 = !{!772, !773, !841, !842}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !769, file: !770, line: 189, baseType: !100, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !769, file: !770, line: 192, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !770, line: 87, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !770, line: 87, size: 128, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !770, line: 87, baseType: !779, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !770, line: 85, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !770, line: 85, size: 128, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !780, file: !770, line: 85, baseType: !17, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !780, file: !770, line: 85, baseType: !17, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !780, file: !770, line: 85, baseType: !785, size: 64, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 64, elements: !115)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !770, line: 84, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !770, line: 100, size: 1216, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !823, !831, !839, !840}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !788, file: !770, line: 102, baseType: !100, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !788, file: !770, line: 105, baseType: !17, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !788, file: !770, line: 108, baseType: !34, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !788, file: !770, line: 111, baseType: !34, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !788, file: !770, line: 114, baseType: !795, size: 64, offset: 192)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !770, line: 41, size: 64, elements: !796)
!796 = !{!797, !806}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !795, file: !770, line: 42, baseType: !798, size: 32)
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lpt_dec", file: !770, line: 31, baseType: !17, size: 32, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805}
!800 = !DIEnumerator(name: "LPT_NONE", value: 0, isUnsigned: true)
!801 = !DIEnumerator(name: "LPT_PEEL_COMPLETELY", value: 1, isUnsigned: true)
!802 = !DIEnumerator(name: "LPT_PEEL_SIMPLE", value: 2, isUnsigned: true)
!803 = !DIEnumerator(name: "LPT_UNROLL_CONSTANT", value: 3, isUnsigned: true)
!804 = !DIEnumerator(name: "LPT_UNROLL_RUNTIME", value: 4, isUnsigned: true)
!805 = !DIEnumerator(name: "LPT_UNROLL_STUPID", value: 5, isUnsigned: true)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !795, file: !770, line: 43, baseType: !17, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !788, file: !770, line: 117, baseType: !17, size: 32, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !788, file: !770, line: 120, baseType: !17, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !788, file: !770, line: 123, baseType: !774, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !788, file: !770, line: 126, baseType: !787, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !770, line: 129, baseType: !787, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !788, file: !770, line: 132, baseType: !316, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !788, file: !770, line: 139, baseType: !326, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !788, file: !770, line: 143, baseType: !375, size: 128, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !788, file: !770, line: 146, baseType: !375, size: 128, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !788, file: !770, line: 148, baseType: !6, size: 8, offset: 896)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !788, file: !770, line: 149, baseType: !6, size: 8, offset: 904)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !788, file: !770, line: 153, baseType: !819, size: 32, offset: 928)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "loop_estimation", file: !770, line: 91, baseType: !17, size: 32, elements: !820)
!820 = !{!821, !822}
!821 = !DIEnumerator(name: "EST_NOT_COMPUTED", value: 0, isUnsigned: true)
!822 = !DIEnumerator(name: "EST_AVAILABLE", value: 1, isUnsigned: true)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !788, file: !770, line: 156, baseType: !824, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !770, line: 48, size: 320, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !825, file: !770, line: 50, baseType: !7, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !825, file: !770, line: 59, baseType: !375, size: 128, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !825, file: !770, line: 64, baseType: !6, size: 8, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !770, line: 67, baseType: !824, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !788, file: !770, line: 159, baseType: !832, size: 64, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !770, line: 72, size: 256, elements: !834)
!834 = !{!835, !836, !837, !838}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !833, file: !770, line: 74, baseType: !52, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !833, file: !770, line: 77, baseType: !832, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !770, line: 78, baseType: !832, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !833, file: !770, line: 81, baseType: !832, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !788, file: !770, line: 162, baseType: !6, size: 8, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !788, file: !770, line: 166, baseType: !326, size: 64, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !769, file: !770, line: 197, baseType: !631, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !769, file: !770, line: 200, baseType: !787, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !578, file: !579, line: 479, baseType: !631, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !578, file: !579, line: 484, baseType: !326, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !578, file: !579, line: 488, baseType: !326, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !578, file: !579, line: 493, baseType: !326, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !578, file: !579, line: 496, baseType: !326, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !578, file: !579, line: 501, baseType: !849, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !851, line: 2355, size: 576, elements: !852)
!851 = !DIFile(filename: "./config/i386/i386.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!852 = !{!853, !856, !857, !858, !859, !861, !862, !867, !872, !873, !874, !875, !876}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !850, file: !851, line: 2356, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !851, line: 2356, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !850, file: !851, line: 2357, baseType: !103, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !850, file: !851, line: 2358, baseType: !100, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !850, file: !851, line: 2359, baseType: !100, size: 32, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !850, file: !851, line: 2360, baseType: !860, size: 128, offset: 192)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !305)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !850, file: !851, line: 2364, baseType: !100, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !850, file: !851, line: 2367, baseType: !863, size: 128, offset: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !851, line: 2349, size: 128, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !863, file: !851, line: 2351, baseType: !76, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !863, file: !851, line: 2352, baseType: !295, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !850, file: !851, line: 2371, baseType: !868, size: 32, offset: 512)
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "calling_abi", file: !851, line: 474, baseType: !17, size: 32, elements: !869)
!869 = !{!870, !871}
!870 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!871 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !850, file: !851, line: 2374, baseType: !17, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !850, file: !851, line: 2377, baseType: !17, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !850, file: !851, line: 2381, baseType: !17, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !850, file: !851, line: 2392, baseType: !17, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !850, file: !851, line: 2396, baseType: !17, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !578, file: !579, line: 504, baseType: !878, size: 64, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !579, line: 504, flags: DIFlagFwdDecl)
