; ModuleID = 'tree-vectorizer.c'
source_filename = "tree-vectorizer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!530 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!531 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!532 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!533 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!534 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!535 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!536 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!537 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!538 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!539 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!540 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!541 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!542 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!543 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!544 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!545 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!546 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!547 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!548 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!549 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!550 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!551 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!552 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!553 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!554 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!555 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!556 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!557 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!558 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!559 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!572 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!573 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!574 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!579 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!580 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!581 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!582 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!583 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!584 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!585 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!586 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "li_flags", file: !392, line: 498, baseType: !7, size: 32, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIEnumerator(name: "LI_INCLUDE_ROOT", value: 1, isUnsigned: true)
!590 = !DIEnumerator(name: "LI_FROM_INNERMOST", value: 2, isUnsigned: true)
!591 = !DIEnumerator(name: "LI_ONLY_INNERMOST", value: 4, isUnsigned: true)
!592 = !{!5, !593, !595, !946, !2153, !1295, !604, !197}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !594, line: 44, baseType: !7)
!594 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_vec_info", file: !6, line: 245, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_loop_vec_info", file: !6, line: 176, size: 1024, elements: !598)
!598 = !{!599, !1959, !1961, !1962, !1963, !1964, !1965, !1966, !2026, !2027, !2028, !2042, !2103, !2104, !2110, !2112, !2113, !2180}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !597, file: !6, line: 179, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !392, line: 100, size: 1216, elements: !602)
!602 = !{!603, !605, !606, !1923, !1924, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1949, !1957, !1958}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !601, file: !392, line: 102, baseType: !604, size: 32)
!604 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !601, file: !392, line: 105, baseType: !7, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !601, file: !392, line: 108, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !149, line: 217, size: 832, elements: !609)
!609 = !{!610, !1890, !1891, !1892, !1893, !1897, !1898, !1899, !1917, !1918, !1919, !1920, !1921, !1922}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !608, file: !149, line: 219, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !149, line: 151, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !149, line: 151, size: 128, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !149, line: 151, baseType: !616, size: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !149, line: 150, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !149, line: 150, size: 128, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !617, file: !149, line: 150, baseType: !7, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !617, file: !149, line: 150, baseType: !7, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !617, file: !149, line: 150, baseType: !622, size: 64, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 64, elements: !767)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !624, line: 108, baseType: !625)
!624 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !149, line: 122, size: 512, elements: !627)
!627 = !{!628, !629, !630, !1882, !1883, !1884, !1885, !1886, !1887, !1888}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !626, file: !149, line: 124, baseType: !607, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !626, file: !149, line: 125, baseType: !607, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !626, file: !149, line: 131, baseType: !631, size: 64, offset: 128)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !149, line: 128, size: 64, elements: !632)
!632 = !{!633, !1881}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !631, file: !149, line: 129, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !624, line: 66, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !637, line: 143, size: 192, elements: !638)
!637 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!638 = !{!639, !1879, !1880}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !636, file: !637, line: 145, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !624, line: 69, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !637, line: 136, size: 192, elements: !643)
!643 = !{!644, !1877, !1878}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !642, file: !637, line: 137, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !624, line: 58, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !637, line: 737, size: 768, elements: !648)
!648 = !{!649, !1724, !1734, !1740, !1745, !1750, !1757, !1763, !1769, !1774, !1788, !1793, !1799, !1804, !1814, !1819, !1835, !1842, !1849, !1855, !1860, !1866, !1872}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !647, file: !637, line: 738, baseType: !650, size: 256)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !637, line: 271, size: 256, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !665, !666, !667}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !650, file: !637, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !650, file: !637, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !650, file: !637, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !650, file: !637, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !650, file: !637, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !650, file: !637, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !650, file: !637, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !650, file: !637, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !650, file: !637, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !650, file: !637, line: 312, baseType: !7, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !650, file: !637, line: 316, baseType: !663, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !664, line: 58, baseType: !593)
!664 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!665 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !650, file: !637, line: 319, baseType: !7, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !650, file: !637, line: 323, baseType: !607, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !650, file: !637, line: 327, baseType: !668, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !624, line: 56, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !165, line: 3371, size: 1792, elements: !671)
!671 = !{!672, !705, !711, !724, !743, !754, !759, !769, !775, !789, !797, !835, !1013, !1041, !1058, !1059, !1064, !1073, !1079, !1084, !1088, !1092, !1375, !1422, !1428, !1434, !1441, !1454, !1468, !1485, !1497, !1519, !1534, !1706}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !670, file: !165, line: 3372, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !165, line: 360, size: 64, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !673, file: !165, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !673, file: !165, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !673, file: !165, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !673, file: !165, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !673, file: !165, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !673, file: !165, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !673, file: !165, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !673, file: !165, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !673, file: !165, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !673, file: !165, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !673, file: !165, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !673, file: !165, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !673, file: !165, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !673, file: !165, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !673, file: !165, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !673, file: !165, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !673, file: !165, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !673, file: !165, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !673, file: !165, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !673, file: !165, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !673, file: !165, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !673, file: !165, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !673, file: !165, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !673, file: !165, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !673, file: !165, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !673, file: !165, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !673, file: !165, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !673, file: !165, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !673, file: !165, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !673, file: !165, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !165, line: 3373, baseType: !706, size: 192)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !165, line: 402, size: 192, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !706, file: !165, line: 403, baseType: !673, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !706, file: !165, line: 404, baseType: !668, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !165, line: 405, baseType: !668, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !670, file: !165, line: 3374, baseType: !712, size: 320)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !165, line: 1384, size: 320, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !165, line: 1385, baseType: !706, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !165, line: 1386, baseType: !716, size: 128, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !717, line: 58, baseType: !718)
!717 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 54, size: 128, elements: !719)
!719 = !{!720, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !718, file: !717, line: 56, baseType: !721, size: 64)
!721 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !718, file: !717, line: 57, baseType: !723, size: 64, offset: 64)
!723 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !670, file: !165, line: 3375, baseType: !725, size: 256)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !165, line: 1397, size: 256, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !165, line: 1398, baseType: !706, size: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !725, file: !165, line: 1399, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !731, line: 52, size: 256, elements: !732)
!731 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !730, file: !731, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !730, file: !731, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !730, file: !731, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !730, file: !731, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !730, file: !731, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !730, file: !731, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !730, file: !731, line: 62, baseType: !740, size: 192, offset: 64)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 192, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 3)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !670, file: !165, line: 3376, baseType: !744, size: 256)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !165, line: 1408, size: 256, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !744, file: !165, line: 1409, baseType: !706, size: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !744, file: !165, line: 1410, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !750, line: 27, size: 192, elements: !751)
!750 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !750, line: 29, baseType: !716, size: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !749, file: !750, line: 30, baseType: !20, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !670, file: !165, line: 3377, baseType: !755, size: 256)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !165, line: 1437, size: 256, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !165, line: 1438, baseType: !706, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !755, file: !165, line: 1439, baseType: !668, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !670, file: !165, line: 3378, baseType: !760, size: 256)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !165, line: 1418, size: 256, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !165, line: 1419, baseType: !706, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !760, file: !165, line: 1420, baseType: !604, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !760, file: !165, line: 1421, baseType: !765, size: 8, offset: 224)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 8, elements: !767)
!766 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!767 = !{!768}
!768 = !DISubrange(count: 1)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !670, file: !165, line: 3379, baseType: !770, size: 320)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !165, line: 1428, size: 320, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !165, line: 1429, baseType: !706, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !770, file: !165, line: 1430, baseType: !668, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !770, file: !165, line: 1431, baseType: !668, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !670, file: !165, line: 3380, baseType: !776, size: 320)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !165, line: 1460, size: 320, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !165, line: 1461, baseType: !706, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !776, file: !165, line: 1462, baseType: !780, size: 128, offset: 192)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !781, line: 31, size: 128, elements: !782)
!781 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!782 = !{!783, !787, !788}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !780, file: !781, line: 32, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !780, file: !781, line: 33, baseType: !7, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !780, file: !781, line: 34, baseType: !7, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !670, file: !165, line: 3381, baseType: !790, size: 384)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !165, line: 2507, size: 384, elements: !791)
!791 = !{!792, !793, !794, !795, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !165, line: 2508, baseType: !706, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !790, file: !165, line: 2509, baseType: !663, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !790, file: !165, line: 2510, baseType: !7, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !165, line: 2511, baseType: !668, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !790, file: !165, line: 2512, baseType: !668, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !670, file: !165, line: 3382, baseType: !798, size: 896)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !165, line: 2652, size: 896, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !165, line: 2653, baseType: !790, size: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !798, file: !165, line: 2654, baseType: !668, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !798, file: !165, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !798, file: !165, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !798, file: !165, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !798, file: !165, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !798, file: !165, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !798, file: !165, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !798, file: !165, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !798, file: !165, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !798, file: !165, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !798, file: !165, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !798, file: !165, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !798, file: !165, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !798, file: !165, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !798, file: !165, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !798, file: !165, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !798, file: !165, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !798, file: !165, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !798, file: !165, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !798, file: !165, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !798, file: !165, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !798, file: !165, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !798, file: !165, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !798, file: !165, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !798, file: !165, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !798, file: !165, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !798, file: !165, line: 2703, baseType: !7, size: 32, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !798, file: !165, line: 2705, baseType: !668, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !798, file: !165, line: 2706, baseType: !668, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !798, file: !165, line: 2707, baseType: !668, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !798, file: !165, line: 2708, baseType: !668, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !798, file: !165, line: 2711, baseType: !833, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !165, line: 2711, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !670, file: !165, line: 3383, baseType: !836, size: 960)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !165, line: 2756, size: 960, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !836, file: !165, line: 2757, baseType: !798, size: 896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !836, file: !165, line: 2758, baseType: !840, size: 64, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !624, line: 50, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !843, line: 240, size: 384, elements: !844)
!843 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !842, file: !843, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !842, file: !843, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !842, file: !843, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !842, file: !843, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !842, file: !843, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !842, file: !843, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !842, file: !843, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !842, file: !843, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !842, file: !843, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !842, file: !843, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !842, file: !843, line: 321, baseType: !856, size: 320, offset: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !843, line: 315, size: 320, elements: !857)
!857 = !{!858, !980, !982, !1011, !1012}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !856, file: !843, line: 316, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 64, elements: !767)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !843, line: 183, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !843, line: 166, size: 64, elements: !862)
!862 = !{!863, !864, !865, !868, !869, !877, !878, !890, !893, !955, !956, !957, !970, !977}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !861, file: !843, line: 168, baseType: !604, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !861, file: !843, line: 169, baseType: !7, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !861, file: !843, line: 170, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !861, file: !843, line: 171, baseType: !840, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !861, file: !843, line: 172, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !624, line: 53, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !843, line: 359, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !872, file: !843, line: 360, baseType: !604, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !872, file: !843, line: 361, baseType: !876, size: 64, offset: 64)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 64, elements: !767)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !861, file: !843, line: 173, baseType: !20, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !861, file: !843, line: 174, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !843, line: 133, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !843, line: 115, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !880, file: !843, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !880, file: !843, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !880, file: !843, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !880, file: !843, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !880, file: !843, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !880, file: !843, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !880, file: !843, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !880, file: !843, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !861, file: !843, line: 175, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !843, line: 175, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !861, file: !843, line: 176, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !896, line: 75, size: 256, elements: !897)
!896 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!897 = !{!898, !912, !913, !914}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !895, file: !896, line: 76, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !896, line: 68, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !896, line: 63, size: 320, elements: !902)
!902 = !{!903, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !896, line: 64, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !896, line: 65, baseType: !904, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !901, file: !896, line: 66, baseType: !7, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !901, file: !896, line: 67, baseType: !908, size: 128, offset: 192)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, elements: !910)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !896, line: 29, baseType: !721)
!910 = !{!911}
!911 = !DISubrange(count: 2)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !895, file: !896, line: 77, baseType: !899, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !895, file: !896, line: 78, baseType: !7, size: 32, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !895, file: !896, line: 79, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !896, line: 49, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !896, line: 45, size: 832, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !917, file: !896, line: 46, baseType: !904, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !917, file: !896, line: 47, baseType: !894, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !917, file: !896, line: 48, baseType: !922, size: 704, offset: 128)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !923, line: 164, size: 704, elements: !924)
!923 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!924 = !{!925, !926, !937, !938, !939, !940, !941, !942, !947, !951, !952, !953, !954}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !922, file: !923, line: 166, baseType: !723, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !922, file: !923, line: 167, baseType: !927, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !923, line: 157, size: 192, elements: !929)
!929 = !{!930, !932, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !928, file: !923, line: 159, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !928, file: !923, line: 160, baseType: !927, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !928, file: !923, line: 161, baseType: !934, size: 32, offset: 128)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 32, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 4)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !922, file: !923, line: 168, baseType: !931, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !922, file: !923, line: 169, baseType: !931, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !922, file: !923, line: 170, baseType: !931, size: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !922, file: !923, line: 171, baseType: !723, size: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !922, file: !923, line: 172, baseType: !604, size: 32, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !922, file: !923, line: 176, baseType: !943, size: 64, offset: 448)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!927, !946, !723}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !922, file: !923, line: 177, baseType: !948, size: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !946, !927}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !922, file: !923, line: 178, baseType: !946, size: 64, offset: 576)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !922, file: !923, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !922, file: !923, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !922, file: !923, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !861, file: !843, line: 177, baseType: !668, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !861, file: !843, line: 178, baseType: !607, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !861, file: !843, line: 179, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !843, line: 150, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !843, line: 142, size: 320, elements: !961)
!961 = !{!962, !963, !964, !965, !968, !969}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !960, file: !843, line: 144, baseType: !668, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !960, file: !843, line: 145, baseType: !840, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !960, file: !843, line: 146, baseType: !840, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !960, file: !843, line: 147, baseType: !966, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !967, line: 31, baseType: !604)
!967 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!968 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !960, file: !843, line: 148, baseType: !7, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !960, file: !843, line: 149, baseType: !786, size: 8, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !861, file: !843, line: 180, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !843, line: 162, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !843, line: 159, size: 128, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !973, file: !843, line: 160, baseType: !668, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !973, file: !843, line: 161, baseType: !723, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !861, file: !843, line: 181, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !843, line: 181, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !856, file: !843, line: 317, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 64, elements: !767)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !856, file: !843, line: 318, baseType: !983, size: 320)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !843, line: 188, size: 320, elements: !984)
!984 = !{!985, !987, !1010}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !983, file: !843, line: 190, baseType: !986, size: 192)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 192, elements: !741)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !983, file: !843, line: 193, baseType: !988, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !843, line: 206, size: 320, elements: !990)
!990 = !{!991, !995, !996, !997, !1009}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !989, file: !843, line: 208, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !624, line: 62, baseType: !994)
!994 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !624, line: 61, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !989, file: !843, line: 211, baseType: !7, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !989, file: !843, line: 214, baseType: !723, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !989, file: !843, line: 224, baseType: !998, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !843, line: 202, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !843, line: 202, size: 128, elements: !1001)
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1000, file: !843, line: 202, baseType: !1003, size: 128)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !843, line: 200, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !843, line: 200, size: 128, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1004, file: !843, line: 200, baseType: !7, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1004, file: !843, line: 200, baseType: !7, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1004, file: !843, line: 200, baseType: !876, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !989, file: !843, line: 234, baseType: !998, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !843, line: 197, baseType: !723, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !856, file: !843, line: 319, baseType: !730, size: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !856, file: !843, line: 320, baseType: !749, size: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !670, file: !165, line: 3384, baseType: !1014, size: 1472)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !165, line: 3114, size: 1472, elements: !1015)
!1015 = !{!1016, !1037, !1038, !1039, !1040}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !165, line: 3115, baseType: !1017, size: 1216)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !165, line: 2984, size: 1216, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !165, line: 2985, baseType: !836, size: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1017, file: !165, line: 2986, baseType: !668, size: 64, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1017, file: !165, line: 2987, baseType: !668, size: 64, offset: 1024)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1017, file: !165, line: 2988, baseType: !668, size: 64, offset: 1088)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1017, file: !165, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1017, file: !165, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1017, file: !165, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1017, file: !165, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1017, file: !165, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1017, file: !165, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1017, file: !165, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1017, file: !165, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1017, file: !165, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1017, file: !165, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1017, file: !165, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1017, file: !165, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1017, file: !165, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1017, file: !165, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1014, file: !165, line: 3117, baseType: !668, size: 64, offset: 1216)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1014, file: !165, line: 3119, baseType: !668, size: 64, offset: 1280)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1014, file: !165, line: 3121, baseType: !668, size: 64, offset: 1344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1014, file: !165, line: 3123, baseType: !668, size: 64, offset: 1408)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !670, file: !165, line: 3385, baseType: !1042, size: 1088)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !165, line: 2874, size: 1088, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !165, line: 2875, baseType: !836, size: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1042, file: !165, line: 2876, baseType: !840, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1042, file: !165, line: 2877, baseType: !1047, size: 64, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1049, line: 172, size: 128, elements: !1050)
!1049 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1048, file: !1049, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1048, file: !1049, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1048, file: !1049, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1048, file: !1049, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1048, file: !1049, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1048, file: !1049, line: 195, baseType: !7, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1048, file: !1049, line: 199, baseType: !668, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !670, file: !165, line: 3386, baseType: !1017, size: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !670, file: !165, line: 3387, baseType: !1060, size: 1280)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !165, line: 3093, size: 1280, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !165, line: 3094, baseType: !1017, size: 1216)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1060, file: !165, line: 3095, baseType: !1047, size: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !670, file: !165, line: 3388, baseType: !1065, size: 1216)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !165, line: 2824, size: 1216, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1065, file: !165, line: 2825, baseType: !798, size: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1065, file: !165, line: 2827, baseType: !668, size: 64, offset: 896)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1065, file: !165, line: 2828, baseType: !668, size: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1065, file: !165, line: 2829, baseType: !668, size: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1065, file: !165, line: 2830, baseType: !668, size: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1065, file: !165, line: 2831, baseType: !668, size: 64, offset: 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !670, file: !165, line: 3389, baseType: !1074, size: 1024)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !165, line: 2850, size: 1024, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !165, line: 2851, baseType: !836, size: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1074, file: !165, line: 2852, baseType: !604, size: 32, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1074, file: !165, line: 2853, baseType: !604, size: 32, offset: 992)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !670, file: !165, line: 3390, baseType: !1080, size: 1024)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !165, line: 2857, size: 1024, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !165, line: 2858, baseType: !836, size: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1080, file: !165, line: 2859, baseType: !1047, size: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !670, file: !165, line: 3391, baseType: !1085, size: 960)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !165, line: 2862, size: 960, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !165, line: 2863, baseType: !836, size: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !670, file: !165, line: 3392, baseType: !1089, size: 1472)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !165, line: 3304, size: 1472, elements: !1090)
!1090 = !{!1091}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !165, line: 3305, baseType: !1014, size: 1472)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !670, file: !165, line: 3393, baseType: !1093, size: 1792)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !165, line: 3248, size: 1792, elements: !1094)
!1094 = !{!1095, !1096, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !165, line: 3249, baseType: !1014, size: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1093, file: !165, line: 3251, baseType: !1097, size: 64, offset: 1472)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1099, line: 463, size: 1152, elements: !1100)
!1099 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1100 = !{!1101, !1104, !1135, !1136, !1277, !1298, !1299, !1300, !1301, !1302, !1303, !1327, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1098, file: !1099, line: 464, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1099, line: 464, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1098, file: !1099, line: 467, baseType: !1105, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !149, line: 374, size: 640, elements: !1107)
!1107 = !{!1108, !1110, !1111, !1124, !1125, !1126, !1127, !1128, !1129, !1131, !1133, !1134}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1106, file: !149, line: 377, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !624, line: 111, baseType: !607)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1106, file: !149, line: 378, baseType: !1109, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1106, file: !149, line: 381, baseType: !1112, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !149, line: 282, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !149, line: 282, size: 128, elements: !1115)
!1115 = !{!1116}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1114, file: !149, line: 282, baseType: !1117, size: 128)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !149, line: 281, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !149, line: 281, size: 128, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1118, file: !149, line: 281, baseType: !7, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1118, file: !149, line: 281, baseType: !7, size: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1118, file: !149, line: 281, baseType: !1123, size: 64, offset: 64)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 64, elements: !767)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1106, file: !149, line: 384, baseType: !604, size: 32, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1106, file: !149, line: 387, baseType: !604, size: 32, offset: 224)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1106, file: !149, line: 390, baseType: !604, size: 32, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1106, file: !149, line: 394, baseType: !1112, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1106, file: !149, line: 396, baseType: !148, size: 32, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1106, file: !149, line: 399, baseType: !1130, size: 64, offset: 416)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !910)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1106, file: !149, line: 402, baseType: !1132, size: 64, offset: 480)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !910)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1106, file: !149, line: 406, baseType: !604, size: 32, offset: 544)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1106, file: !149, line: 409, baseType: !604, size: 32, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1098, file: !1099, line: 470, baseType: !635, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1098, file: !1099, line: 473, baseType: !1137, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1049, line: 39, size: 1152, elements: !1139)
!1139 = !{!1140, !1192, !1205, !1218, !1219, !1231, !1232, !1236, !1237, !1238, !1239, !1240}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1138, file: !1049, line: 41, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1142, line: 144, baseType: !1143)
!1142 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1142, line: 100, size: 896, elements: !1145)
!1145 = !{!1146, !1154, !1159, !1164, !1166, !1169, !1170, !1171, !1172, !1173, !1178, !1180, !1181, !1186, !1191}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1144, file: !1142, line: 102, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1142, line: 52, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1142, line: 47, baseType: !7)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1144, file: !1142, line: 105, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1142, line: 59, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!604, !1152, !1152}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1144, file: !1142, line: 108, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1142, line: 63, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !946}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1144, file: !1142, line: 111, baseType: !1165, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1142, line: 114, baseType: !1167, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1168, line: 46, baseType: !721)
!1168 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1144, file: !1142, line: 117, baseType: !1167, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1144, file: !1142, line: 120, baseType: !1167, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1144, file: !1142, line: 124, baseType: !7, size: 32, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1144, file: !1142, line: 128, baseType: !7, size: 32, offset: 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1144, file: !1142, line: 131, baseType: !1174, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1142, line: 75, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!946, !1167, !1167}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1144, file: !1142, line: 132, baseType: !1179, size: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1142, line: 78, baseType: !1161)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1144, file: !1142, line: 135, baseType: !946, size: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1144, file: !1142, line: 136, baseType: !1182, size: 64, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1142, line: 82, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!946, !946, !1167, !1167}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1144, file: !1142, line: 137, baseType: !1187, size: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1142, line: 83, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !946, !946}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1144, file: !1142, line: 141, baseType: !7, size: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1138, file: !1049, line: 48, baseType: !1193, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !637, line: 35, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !637, line: 35, size: 128, elements: !1196)
!1196 = !{!1197}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1195, file: !637, line: 35, baseType: !1198, size: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !637, line: 33, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !637, line: 33, size: 128, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1199, file: !637, line: 33, baseType: !7, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1199, file: !637, line: 33, baseType: !7, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1199, file: !637, line: 33, baseType: !1204, size: 64, offset: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, elements: !767)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1138, file: !1049, line: 51, baseType: !1206, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !165, line: 183, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !165, line: 183, size: 128, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1208, file: !165, line: 183, baseType: !1211, size: 128)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !165, line: 182, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !165, line: 182, size: 128, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1212, file: !165, line: 182, baseType: !7, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1212, file: !165, line: 182, baseType: !7, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1212, file: !165, line: 182, baseType: !1217, size: 64, offset: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 64, elements: !767)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1138, file: !1049, line: 54, baseType: !668, size: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1138, file: !1049, line: 57, baseType: !1220, size: 128, offset: 256)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1221, line: 31, size: 128, elements: !1222)
!1221 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1220, file: !1221, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1220, file: !1221, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1220, file: !1221, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1220, file: !1221, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1220, file: !1221, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1220, file: !1221, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1220, file: !1221, line: 56, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !624, line: 47, baseType: !894)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1138, file: !1049, line: 60, baseType: !1220, size: 128, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1138, file: !1049, line: 64, baseType: !1233, size: 64, offset: 512)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1235, line: 33, flags: DIFlagFwdDecl)
!1235 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1138, file: !1049, line: 67, baseType: !668, size: 64, offset: 576)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1138, file: !1049, line: 73, baseType: !1141, size: 64, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1138, file: !1049, line: 77, baseType: !1230, size: 64, offset: 704)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1138, file: !1049, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1138, file: !1049, line: 82, baseType: !1241, size: 320, offset: 832)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1242, line: 62, size: 320, elements: !1243)
!1242 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1243 = !{!1244, !1250, !1251, !1252, !1253, !1260}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1241, file: !1242, line: 63, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1242, line: 56, size: 128, elements: !1247)
!1247 = !{!1248, !1249}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1246, file: !1242, line: 57, baseType: !1245, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1246, file: !1242, line: 58, baseType: !765, size: 8, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1241, file: !1242, line: 64, baseType: !7, size: 32, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1241, file: !1242, line: 66, baseType: !7, size: 32, offset: 96)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1241, file: !1242, line: 68, baseType: !786, size: 8, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1241, file: !1242, line: 70, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1242, line: 37, size: 128, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1255, file: !1242, line: 39, baseType: !1254, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1255, file: !1242, line: 40, baseType: !1259, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1241, file: !1242, line: 71, baseType: !1261, size: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1242, line: 45, size: 320, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1262, file: !1242, line: 47, baseType: !1261, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1262, file: !1242, line: 48, baseType: !1266, size: 256, offset: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !165, line: 1883, size: 256, elements: !1267)
!1267 = !{!1268, !1270, !1271, !1276}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1266, file: !165, line: 1884, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1266, file: !165, line: 1885, baseType: !1269, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1266, file: !165, line: 1891, baseType: !1272, size: 64, offset: 128)
!1272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1266, file: !165, line: 1891, size: 64, elements: !1273)
!1273 = !{!1274, !1275}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1272, file: !165, line: 1891, baseType: !645, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1272, file: !165, line: 1891, baseType: !668, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1266, file: !165, line: 1892, baseType: !1259, size: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1098, file: !1099, line: 476, baseType: !1278, size: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !392, line: 187, size: 256, elements: !1280)
!1280 = !{!1281, !1282, !1296, !1297}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1279, file: !392, line: 189, baseType: !604, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1279, file: !392, line: 192, baseType: !1283, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !392, line: 87, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !392, line: 87, size: 128, elements: !1286)
!1286 = !{!1287}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1285, file: !392, line: 87, baseType: !1288, size: 128)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !392, line: 85, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !392, line: 85, size: 128, elements: !1290)
!1290 = !{!1291, !1292, !1293}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1289, file: !392, line: 85, baseType: !7, size: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1289, file: !392, line: 85, baseType: !7, size: 32, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1289, file: !392, line: 85, baseType: !1294, size: 64, offset: 64)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1295, size: 64, elements: !767)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !392, line: 84, baseType: !600)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1279, file: !392, line: 197, baseType: !1141, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1279, file: !392, line: 200, baseType: !600, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1098, file: !1099, line: 479, baseType: !1141, size: 64, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1098, file: !1099, line: 484, baseType: !668, size: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1098, file: !1099, line: 488, baseType: !668, size: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1098, file: !1099, line: 493, baseType: !668, size: 64, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1098, file: !1099, line: 496, baseType: !668, size: 64, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1098, file: !1099, line: 501, baseType: !1304, size: 64, offset: 640)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !160, line: 2355, size: 576, elements: !1306)
!1306 = !{!1307, !1310, !1311, !1312, !1313, !1315, !1316, !1321, !1322, !1323, !1324, !1325, !1326}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1305, file: !160, line: 2356, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !160, line: 2356, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1305, file: !160, line: 2357, baseType: !866, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1305, file: !160, line: 2358, baseType: !604, size: 32, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1305, file: !160, line: 2359, baseType: !604, size: 32, offset: 160)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1305, file: !160, line: 2360, baseType: !1314, size: 128, offset: 192)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 128, elements: !935)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1305, file: !160, line: 2364, baseType: !604, size: 32, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1305, file: !160, line: 2367, baseType: !1317, size: 128, offset: 384)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !160, line: 2349, size: 128, elements: !1318)
!1318 = !{!1319, !1320}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1317, file: !160, line: 2351, baseType: !840, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1317, file: !160, line: 2352, baseType: !723, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1305, file: !160, line: 2371, baseType: !159, size: 32, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1305, file: !160, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1305, file: !160, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1305, file: !160, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1305, file: !160, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1305, file: !160, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1098, file: !1099, line: 504, baseType: !1328, size: 64, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1099, line: 504, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1098, file: !1099, line: 507, baseType: !1141, size: 64, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1098, file: !1099, line: 510, baseType: !604, size: 32, offset: 832)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1098, file: !1099, line: 513, baseType: !604, size: 32, offset: 864)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1098, file: !1099, line: 516, baseType: !663, size: 32, offset: 896)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1098, file: !1099, line: 519, baseType: !663, size: 32, offset: 928)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1098, file: !1099, line: 522, baseType: !7, size: 32, offset: 960)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1098, file: !1099, line: 523, baseType: !7, size: 32, offset: 992)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1098, file: !1099, line: 528, baseType: !866, size: 64, offset: 1024)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1098, file: !1099, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1098, file: !1099, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1098, file: !1099, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1098, file: !1099, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1098, file: !1099, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1098, file: !1099, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1098, file: !1099, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1098, file: !1099, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1098, file: !1099, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1098, file: !1099, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1098, file: !1099, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1098, file: !1099, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1098, file: !1099, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1098, file: !1099, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1098, file: !1099, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1098, file: !1099, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1093, file: !165, line: 3254, baseType: !668, size: 64, offset: 1536)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1093, file: !165, line: 3257, baseType: !668, size: 64, offset: 1600)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1093, file: !165, line: 3258, baseType: !668, size: 64, offset: 1664)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1093, file: !165, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
