; ModuleID = 'fwprop.c'
source_filename = "fwprop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!764 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!765 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!766 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!767 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!768 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !627, line: 836, baseType: !7, size: 32, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!771 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!772 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!773 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!774 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!775 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!776 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!777 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!778 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!779 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!780 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!781 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!782 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!783 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!784 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!785 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!786 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!787 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!788 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!789 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!790 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!791 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!792 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!793 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!794 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!795 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!796 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!797 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!798 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!799 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!800 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!801 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!802 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtx_class", file: !627, line: 60, baseType: !7, size: 32, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!805 = !DIEnumerator(name: "RTX_COMPARE", value: 0, isUnsigned: true)
!806 = !DIEnumerator(name: "RTX_COMM_COMPARE", value: 1, isUnsigned: true)
!807 = !DIEnumerator(name: "RTX_BIN_ARITH", value: 2, isUnsigned: true)
!808 = !DIEnumerator(name: "RTX_COMM_ARITH", value: 3, isUnsigned: true)
!809 = !DIEnumerator(name: "RTX_UNARY", value: 4, isUnsigned: true)
!810 = !DIEnumerator(name: "RTX_EXTRA", value: 5, isUnsigned: true)
!811 = !DIEnumerator(name: "RTX_MATCH", value: 6, isUnsigned: true)
!812 = !DIEnumerator(name: "RTX_INSN", value: 7, isUnsigned: true)
!813 = !DIEnumerator(name: "RTX_OBJ", value: 8, isUnsigned: true)
!814 = !DIEnumerator(name: "RTX_CONST_OBJ", value: 9, isUnsigned: true)
!815 = !DIEnumerator(name: "RTX_TERNARY", value: 10, isUnsigned: true)
!816 = !DIEnumerator(name: "RTX_BITFIELD_OPS", value: 11, isUnsigned: true)
!817 = !DIEnumerator(name: "RTX_AUTOINC", value: 12, isUnsigned: true)
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 420, baseType: !7, size: 32, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIEnumerator(name: "PR_CAN_APPEAR", value: 1, isUnsigned: true)
!821 = !DIEnumerator(name: "PR_HANDLE_MEM", value: 2, isUnsigned: true)
!822 = !DIEnumerator(name: "PR_OPTIMIZE_FOR_SPEED", value: 4, isUnsigned: true)
!823 = !{!824, !825, !891, !7, !878, !626, !2033, !2041, !2048, !914, !189, !2053, !860, !2054}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !826, line: 47, baseType: !827)
!826 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !829, line: 75, size: 256, elements: !830)
!829 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!830 = !{!831, !846, !847, !848}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !828, file: !829, line: 76, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !829, line: 68, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !829, line: 63, size: 320, elements: !835)
!835 = !{!836, !838, !839, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !829, line: 64, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !834, file: !829, line: 65, baseType: !837, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !834, file: !829, line: 66, baseType: !7, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !834, file: !829, line: 67, baseType: !841, size: 128, offset: 192)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 128, elements: !844)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !829, line: 29, baseType: !843)
!843 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!844 = !{!845}
!845 = !DISubrange(count: 2)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !828, file: !829, line: 77, baseType: !832, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !828, file: !829, line: 78, baseType: !7, size: 32, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !828, file: !829, line: 79, baseType: !849, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !829, line: 49, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !829, line: 45, size: 832, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !851, file: !829, line: 46, baseType: !837, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !851, file: !829, line: 47, baseType: !827, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !851, file: !829, line: 48, baseType: !856, size: 704, offset: 128)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !857, line: 164, size: 704, elements: !858)
!857 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!858 = !{!859, !861, !873, !874, !875, !876, !877, !879, !883, !887, !888, !889, !890}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !856, file: !857, line: 166, baseType: !860, size: 64)
!860 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !856, file: !857, line: 167, baseType: !862, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !857, line: 157, size: 192, elements: !864)
!864 = !{!865, !868, !869}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !863, file: !857, line: 159, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !863, file: !857, line: 160, baseType: !862, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !863, file: !857, line: 161, baseType: !870, size: 32, offset: 128)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 32, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 4)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !856, file: !857, line: 168, baseType: !866, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !856, file: !857, line: 169, baseType: !866, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !856, file: !857, line: 170, baseType: !866, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !856, file: !857, line: 171, baseType: !860, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !856, file: !857, line: 172, baseType: !878, size: 32, offset: 384)
!878 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !856, file: !857, line: 176, baseType: !880, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!862, !824, !860}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !856, file: !857, line: 177, baseType: !884, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !824, !862}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !856, file: !857, line: 178, baseType: !824, size: 64, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !856, file: !857, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !856, file: !857, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !856, file: !857, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_df_ref_heap", file: !3, line: 121, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_df_ref_heap", file: !3, line: 121, size: 128, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !893, file: !3, line: 121, baseType: !896, size: 128)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_df_ref_base", file: !3, line: 120, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_df_ref_base", file: !3, line: 120, size: 128, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !897, file: !3, line: 120, baseType: !7, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !897, file: !3, line: 120, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !897, file: !3, line: 120, baseType: !902, size: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !950)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !574, line: 429, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !574, line: 422, size: 704, elements: !906)
!906 = !{!907, !2015, !2021, !2026}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !905, file: !574, line: 424, baseType: !908, size: 512)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !574, line: 356, size: 512, elements: !909)
!909 = !{!910, !911, !912, !913, !1983, !1989, !2010, !2011, !2012, !2013, !2014}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !908, file: !574, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !574, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !908, file: !574, line: 364, baseType: !878, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !908, file: !574, line: 365, baseType: !914, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !826, line: 50, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !627, line: 240, size: 384, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !916, file: !627, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !916, file: !627, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !916, file: !627, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !916, file: !627, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !916, file: !627, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !916, file: !627, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !916, file: !627, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !916, file: !627, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !916, file: !627, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !916, file: !627, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !916, file: !627, line: 321, baseType: !929, size: 320, offset: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !627, line: 315, size: 320, elements: !930)
!930 = !{!931, !1918, !1920, !1981, !1982}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !929, file: !627, line: 316, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 64, elements: !950)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !627, line: 183, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !627, line: 166, size: 64, elements: !935)
!935 = !{!936, !937, !938, !941, !942, !952, !953, !965, !968, !969, !1896, !1897, !1908, !1915}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !934, file: !627, line: 168, baseType: !878, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !934, file: !627, line: 169, baseType: !7, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !934, file: !627, line: 170, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !934, file: !627, line: 171, baseType: !914, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !934, file: !627, line: 172, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !826, line: 53, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !627, line: 359, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !945, file: !627, line: 360, baseType: !878, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !945, file: !627, line: 361, baseType: !949, size: 64, offset: 64)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 64, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 1)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !934, file: !627, line: 173, baseType: !189, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !934, file: !627, line: 174, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !627, line: 133, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 115, size: 32, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !955, file: !627, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !955, file: !627, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !955, file: !627, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !955, file: !627, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !955, file: !627, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !955, file: !627, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !955, file: !627, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !955, file: !627, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !934, file: !627, line: 175, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !627, line: 175, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !934, file: !627, line: 176, baseType: !827, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !934, file: !627, line: 177, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !826, line: 56, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !347, line: 3371, size: 1792, elements: !973)
!973 = !{!974, !1007, !1013, !1024, !1043, !1054, !1059, !1066, !1072, !1086, !1098, !1136, !1141, !1169, !1177, !1178, !1183, !1192, !1198, !1203, !1207, !1211, !1523, !1572, !1578, !1585, !1592, !1615, !1640, !1657, !1669, !1691, !1706, !1878}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !972, file: !347, line: 3372, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !347, line: 360, size: 64, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !975, file: !347, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !975, file: !347, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !975, file: !347, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !975, file: !347, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !975, file: !347, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !975, file: !347, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !975, file: !347, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !975, file: !347, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !975, file: !347, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !975, file: !347, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !975, file: !347, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !975, file: !347, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !975, file: !347, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !975, file: !347, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !975, file: !347, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !975, file: !347, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !975, file: !347, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !975, file: !347, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !975, file: !347, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !975, file: !347, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !975, file: !347, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !975, file: !347, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !975, file: !347, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !975, file: !347, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !975, file: !347, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !975, file: !347, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !975, file: !347, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !975, file: !347, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !975, file: !347, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !975, file: !347, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !347, line: 3373, baseType: !1008, size: 192)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !347, line: 402, size: 192, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1008, file: !347, line: 403, baseType: !975, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1008, file: !347, line: 404, baseType: !970, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1008, file: !347, line: 405, baseType: !970, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !972, file: !347, line: 3374, baseType: !1014, size: 320)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !347, line: 1384, size: 320, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !347, line: 1385, baseType: !1008, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1014, file: !347, line: 1386, baseType: !1018, size: 128, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1019, line: 58, baseType: !1020)
!1019 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1019, line: 54, size: 128, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1020, file: !1019, line: 56, baseType: !843, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1020, file: !1019, line: 57, baseType: !860, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !972, file: !347, line: 3375, baseType: !1025, size: 256)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !347, line: 1397, size: 256, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !347, line: 1398, baseType: !1008, size: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1025, file: !347, line: 1399, baseType: !1029, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1031, line: 52, size: 256, elements: !1032)
!1031 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1030, file: !1031, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1030, file: !1031, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1030, file: !1031, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1030, file: !1031, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1030, file: !1031, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1030, file: !1031, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1030, file: !1031, line: 62, baseType: !1040, size: 192, offset: 64)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 192, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 3)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !972, file: !347, line: 3376, baseType: !1044, size: 256)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !347, line: 1408, size: 256, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !347, line: 1409, baseType: !1008, size: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1044, file: !347, line: 1410, baseType: !1048, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1050, line: 27, size: 192, elements: !1051)
!1050 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !1050, line: 29, baseType: !1018, size: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1049, file: !1050, line: 30, baseType: !189, size: 32, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !972, file: !347, line: 3377, baseType: !1055, size: 256)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !347, line: 1437, size: 256, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1055, file: !347, line: 1438, baseType: !1008, size: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1055, file: !347, line: 1439, baseType: !970, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !972, file: !347, line: 3378, baseType: !1060, size: 256)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !347, line: 1418, size: 256, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !347, line: 1419, baseType: !1008, size: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1060, file: !347, line: 1420, baseType: !878, size: 32, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1060, file: !347, line: 1421, baseType: !1065, size: 8, offset: 224)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 8, elements: !950)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !972, file: !347, line: 3379, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !347, line: 1428, size: 320, elements: !1068)
!1068 = !{!1069, !1070, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !347, line: 1429, baseType: !1008, size: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1067, file: !347, line: 1430, baseType: !970, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1067, file: !347, line: 1431, baseType: !970, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !972, file: !347, line: 3380, baseType: !1073, size: 320)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !347, line: 1460, size: 320, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !347, line: 1461, baseType: !1008, size: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1073, file: !347, line: 1462, baseType: !1077, size: 128, offset: 192)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1078, line: 31, size: 128, elements: !1079)
!1078 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1079 = !{!1080, !1084, !1085}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1077, file: !1078, line: 32, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1077, file: !1078, line: 33, baseType: !7, size: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1077, file: !1078, line: 34, baseType: !7, size: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !972, file: !347, line: 3381, baseType: !1087, size: 384)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !347, line: 2507, size: 384, elements: !1088)
!1088 = !{!1089, !1090, !1095, !1096, !1097}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !347, line: 2508, baseType: !1008, size: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1087, file: !347, line: 2509, baseType: !1091, size: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1092, line: 58, baseType: !1093)
!1092 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1094, line: 44, baseType: !7)
!1094 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1087, file: !347, line: 2510, baseType: !7, size: 32, offset: 224)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !347, line: 2511, baseType: !970, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1087, file: !347, line: 2512, baseType: !970, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !972, file: !347, line: 3382, baseType: !1099, size: 896)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !347, line: 2652, size: 896, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !347, line: 2653, baseType: !1087, size: 384)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1099, file: !347, line: 2654, baseType: !970, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1099, file: !347, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1099, file: !347, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1099, file: !347, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1099, file: !347, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1099, file: !347, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1099, file: !347, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1099, file: !347, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1099, file: !347, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1099, file: !347, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1099, file: !347, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1099, file: !347, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1099, file: !347, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1099, file: !347, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1099, file: !347, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1099, file: !347, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1099, file: !347, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1099, file: !347, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1099, file: !347, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1099, file: !347, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1099, file: !347, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1099, file: !347, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1099, file: !347, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1099, file: !347, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1099, file: !347, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1099, file: !347, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1099, file: !347, line: 2703, baseType: !7, size: 32, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1099, file: !347, line: 2705, baseType: !970, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1099, file: !347, line: 2706, baseType: !970, size: 64, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1099, file: !347, line: 2707, baseType: !970, size: 64, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1099, file: !347, line: 2708, baseType: !970, size: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1099, file: !347, line: 2711, baseType: !1134, size: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !347, line: 2711, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !972, file: !347, line: 3383, baseType: !1137, size: 960)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !347, line: 2756, size: 960, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !347, line: 2757, baseType: !1099, size: 896)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1137, file: !347, line: 2758, baseType: !914, size: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !972, file: !347, line: 3384, baseType: !1142, size: 1472)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !347, line: 3114, size: 1472, elements: !1143)
!1143 = !{!1144, !1165, !1166, !1167, !1168}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !347, line: 3115, baseType: !1145, size: 1216)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !347, line: 2984, size: 1216, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !347, line: 2985, baseType: !1137, size: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1145, file: !347, line: 2986, baseType: !970, size: 64, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1145, file: !347, line: 2987, baseType: !970, size: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1145, file: !347, line: 2988, baseType: !970, size: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1145, file: !347, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1145, file: !347, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1145, file: !347, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1145, file: !347, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1145, file: !347, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1145, file: !347, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1145, file: !347, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1145, file: !347, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1145, file: !347, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1145, file: !347, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1145, file: !347, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1145, file: !347, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1145, file: !347, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1145, file: !347, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1142, file: !347, line: 3117, baseType: !970, size: 64, offset: 1216)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1142, file: !347, line: 3119, baseType: !970, size: 64, offset: 1280)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1142, file: !347, line: 3121, baseType: !970, size: 64, offset: 1344)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1142, file: !347, line: 3123, baseType: !970, size: 64, offset: 1408)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !972, file: !347, line: 3385, baseType: !1170, size: 1088)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !347, line: 2874, size: 1088, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !347, line: 2875, baseType: !1137, size: 960)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1170, file: !347, line: 2876, baseType: !914, size: 64, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1170, file: !347, line: 2877, baseType: !1175, size: 64, offset: 1024)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !347, line: 2856, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !972, file: !347, line: 3386, baseType: !1145, size: 1216)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !972, file: !347, line: 3387, baseType: !1179, size: 1280)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !347, line: 3093, size: 1280, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1179, file: !347, line: 3094, baseType: !1145, size: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1179, file: !347, line: 3095, baseType: !1175, size: 64, offset: 1216)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !972, file: !347, line: 3388, baseType: !1184, size: 1216)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !347, line: 2824, size: 1216, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1191}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1184, file: !347, line: 2825, baseType: !1099, size: 896)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1184, file: !347, line: 2827, baseType: !970, size: 64, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1184, file: !347, line: 2828, baseType: !970, size: 64, offset: 960)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1184, file: !347, line: 2829, baseType: !970, size: 64, offset: 1024)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1184, file: !347, line: 2830, baseType: !970, size: 64, offset: 1088)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1184, file: !347, line: 2831, baseType: !970, size: 64, offset: 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !972, file: !347, line: 3389, baseType: !1193, size: 1024)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !347, line: 2850, size: 1024, elements: !1194)
!1194 = !{!1195, !1196, !1197}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1193, file: !347, line: 2851, baseType: !1137, size: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1193, file: !347, line: 2852, baseType: !878, size: 32, offset: 960)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1193, file: !347, line: 2853, baseType: !878, size: 32, offset: 992)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !972, file: !347, line: 3390, baseType: !1199, size: 1024)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !347, line: 2857, size: 1024, elements: !1200)
!1200 = !{!1201, !1202}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1199, file: !347, line: 2858, baseType: !1137, size: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1199, file: !347, line: 2859, baseType: !1175, size: 64, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !972, file: !347, line: 3391, baseType: !1204, size: 960)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !347, line: 2862, size: 960, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1204, file: !347, line: 2863, baseType: !1137, size: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !972, file: !347, line: 3392, baseType: !1208, size: 1472)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !347, line: 3304, size: 1472, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !347, line: 3305, baseType: !1142, size: 1472)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !972, file: !347, line: 3393, baseType: !1212, size: 1792)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !347, line: 3248, size: 1792, elements: !1213)
!1213 = !{!1214, !1215, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1212, file: !347, line: 3249, baseType: !1142, size: 1472)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1212, file: !347, line: 3251, baseType: !1216, size: 64, offset: 1472)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1218, line: 463, size: 1152, elements: !1219)
!1218 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1219 = !{!1220, !1223, !1383, !1384, !1387, !1446, !1447, !1448, !1449, !1450, !1451, !1475, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1217, file: !1218, line: 464, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1218, line: 464, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1217, file: !1218, line: 467, baseType: !1224, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !331, line: 374, size: 640, elements: !1226)
!1226 = !{!1227, !1358, !1359, !1372, !1373, !1374, !1375, !1376, !1377, !1379, !1381, !1382}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1225, file: !331, line: 377, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !826, line: 111, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !331, line: 217, size: 832, elements: !1231)
!1231 = !{!1232, !1267, !1268, !1269, !1328, !1332, !1333, !1334, !1352, !1353, !1354, !1355, !1356, !1357}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1230, file: !331, line: 219, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !331, line: 151, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !331, line: 151, size: 128, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1235, file: !331, line: 151, baseType: !1238, size: 128)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !331, line: 150, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !331, line: 150, size: 128, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1239, file: !331, line: 150, baseType: !7, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1239, file: !331, line: 150, baseType: !7, size: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1239, file: !331, line: 150, baseType: !1244, size: 64, offset: 64)
!1244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1245, size: 64, elements: !950)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !826, line: 108, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !331, line: 122, size: 512, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1259, !1260, !1261, !1262, !1263, !1264, !1265}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1247, file: !331, line: 124, baseType: !1229, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1247, file: !331, line: 125, baseType: !1229, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1247, file: !331, line: 131, baseType: !1252, size: 64, offset: 128)
!1252 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !331, line: 128, size: 64, elements: !1253)
!1253 = !{!1254, !1258}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1252, file: !331, line: 129, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !826, line: 66, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !826, line: 65, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1252, file: !331, line: 130, baseType: !914, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1247, file: !331, line: 134, baseType: !824, size: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1247, file: !331, line: 137, baseType: !970, size: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1247, file: !331, line: 138, baseType: !1091, size: 32, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1247, file: !331, line: 142, baseType: !7, size: 32, offset: 352)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1247, file: !331, line: 144, baseType: !878, size: 32, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1247, file: !331, line: 145, baseType: !878, size: 32, offset: 416)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1247, file: !331, line: 146, baseType: !1266, size: 64, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !331, line: 119, baseType: !860)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1230, file: !331, line: 220, baseType: !1233, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1230, file: !331, line: 223, baseType: !824, size: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1230, file: !331, line: 226, baseType: !1270, size: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 100, size: 1216, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277, !1282, !1283, !1284, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1318, !1326, !1327}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1271, file: !318, line: 102, baseType: !878, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1271, file: !318, line: 105, baseType: !7, size: 32, offset: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1271, file: !318, line: 108, baseType: !1229, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1271, file: !318, line: 111, baseType: !1229, size: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1271, file: !318, line: 114, baseType: !1278, size: 64, offset: 192)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !318, line: 41, size: 64, elements: !1279)
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1278, file: !318, line: 42, baseType: !317, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1278, file: !318, line: 43, baseType: !7, size: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1271, file: !318, line: 117, baseType: !7, size: 32, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1271, file: !318, line: 120, baseType: !7, size: 32, offset: 288)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1271, file: !318, line: 123, baseType: !1285, size: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !318, line: 87, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !318, line: 87, size: 128, elements: !1288)
!1288 = !{!1289}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1287, file: !318, line: 87, baseType: !1290, size: 128)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !318, line: 85, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !318, line: 85, size: 128, elements: !1292)
!1292 = !{!1293, !1294, !1295}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1291, file: !318, line: 85, baseType: !7, size: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1291, file: !318, line: 85, baseType: !7, size: 32, offset: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1291, file: !318, line: 85, baseType: !1296, size: 64, offset: 64)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1297, size: 64, elements: !950)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !318, line: 84, baseType: !1270)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1271, file: !318, line: 126, baseType: !1270, size: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1271, file: !318, line: 129, baseType: !1270, size: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1271, file: !318, line: 132, baseType: !824, size: 64, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1271, file: !318, line: 139, baseType: !970, size: 64, offset: 576)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1271, file: !318, line: 143, baseType: !1018, size: 128, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1271, file: !318, line: 146, baseType: !1018, size: 128, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1271, file: !318, line: 148, baseType: !1083, size: 8, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1271, file: !318, line: 149, baseType: !1083, size: 8, offset: 904)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1271, file: !318, line: 153, baseType: !326, size: 32, offset: 928)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1271, file: !318, line: 156, baseType: !1308, size: 64, offset: 960)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !318, line: 48, size: 320, elements: !1310)
!1310 = !{!1311, !1315, !1316, !1317}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1309, file: !318, line: 50, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !826, line: 58, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !826, line: 57, flags: DIFlagFwdDecl)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1309, file: !318, line: 59, baseType: !1018, size: 128, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1309, file: !318, line: 64, baseType: !1083, size: 8, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1309, file: !318, line: 67, baseType: !1308, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1271, file: !318, line: 159, baseType: !1319, size: 64, offset: 1024)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !318, line: 72, size: 256, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1320, file: !318, line: 74, baseType: !1246, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1320, file: !318, line: 77, baseType: !1319, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1320, file: !318, line: 78, baseType: !1319, size: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1320, file: !318, line: 81, baseType: !1319, size: 64, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1271, file: !318, line: 162, baseType: !1083, size: 8, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1271, file: !318, line: 166, baseType: !970, size: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1230, file: !331, line: 229, baseType: !1329, size: 128, offset: 256)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1330, size: 128, elements: !844)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !331, line: 229, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1230, file: !331, line: 232, baseType: !1229, size: 64, offset: 384)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1230, file: !331, line: 233, baseType: !1229, size: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1230, file: !331, line: 238, baseType: !1335, size: 64, offset: 512)
!1335 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !331, line: 235, size: 64, elements: !1336)
!1336 = !{!1337, !1343}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1335, file: !331, line: 236, baseType: !1338, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !331, line: 273, size: 128, elements: !1340)
!1340 = !{!1341, !1342}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1339, file: !331, line: 275, baseType: !1255, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1339, file: !331, line: 278, baseType: !1255, size: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1335, file: !331, line: 237, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !331, line: 259, size: 320, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1345, file: !331, line: 261, baseType: !914, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1345, file: !331, line: 262, baseType: !914, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1345, file: !331, line: 266, baseType: !914, size: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1345, file: !331, line: 267, baseType: !914, size: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1345, file: !331, line: 270, baseType: !878, size: 32, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1230, file: !331, line: 241, baseType: !1266, size: 64, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1230, file: !331, line: 244, baseType: !878, size: 32, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1230, file: !331, line: 247, baseType: !878, size: 32, offset: 672)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1230, file: !331, line: 250, baseType: !878, size: 32, offset: 704)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1230, file: !331, line: 253, baseType: !878, size: 32, offset: 736)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1230, file: !331, line: 256, baseType: !878, size: 32, offset: 768)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1225, file: !331, line: 378, baseType: !1228, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1225, file: !331, line: 381, baseType: !1360, size: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !331, line: 282, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !331, line: 282, size: 128, elements: !1363)
!1363 = !{!1364}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1362, file: !331, line: 282, baseType: !1365, size: 128)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !331, line: 281, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !331, line: 281, size: 128, elements: !1367)
!1367 = !{!1368, !1369, !1370}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1366, file: !331, line: 281, baseType: !7, size: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1366, file: !331, line: 281, baseType: !7, size: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1366, file: !331, line: 281, baseType: !1371, size: 64, offset: 64)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 64, elements: !950)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1225, file: !331, line: 384, baseType: !878, size: 32, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1225, file: !331, line: 387, baseType: !878, size: 32, offset: 224)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1225, file: !331, line: 390, baseType: !878, size: 32, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1225, file: !331, line: 394, baseType: !1360, size: 64, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1225, file: !331, line: 396, baseType: !330, size: 32, offset: 384)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1225, file: !331, line: 399, baseType: !1378, size: 64, offset: 416)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 64, elements: !844)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1225, file: !331, line: 402, baseType: !1380, size: 64, offset: 480)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !844)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1225, file: !331, line: 406, baseType: !878, size: 32, offset: 544)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1225, file: !331, line: 409, baseType: !878, size: 32, offset: 576)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1217, file: !1218, line: 470, baseType: !1256, size: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1217, file: !1218, line: 473, baseType: !1385, size: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1218, line: 166, flags: DIFlagFwdDecl)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1217, file: !1218, line: 476, baseType: !1388, size: 64, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !318, line: 187, size: 256, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1445}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1389, file: !318, line: 189, baseType: !878, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1389, file: !318, line: 192, baseType: !1285, size: 64, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1389, file: !318, line: 197, baseType: !1394, size: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1395, line: 144, baseType: !1396)
!1395 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1395, line: 100, size: 896, elements: !1398)
!1398 = !{!1399, !1407, !1412, !1417, !1419, !1422, !1423, !1424, !1425, !1426, !1431, !1433, !1434, !1439, !1444}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1397, file: !1395, line: 102, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1395, line: 52, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1395, line: 47, baseType: !7)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1397, file: !1395, line: 105, baseType: !1408, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1395, line: 59, baseType: !1409)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!878, !1405, !1405}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1397, file: !1395, line: 108, baseType: !1413, size: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1395, line: 63, baseType: !1414)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !824}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1397, file: !1395, line: 111, baseType: !1418, size: 64, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1397, file: !1395, line: 114, baseType: !1420, size: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1421, line: 46, baseType: !843)
!1421 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1397, file: !1395, line: 117, baseType: !1420, size: 64, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1397, file: !1395, line: 120, baseType: !1420, size: 64, offset: 384)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1397, file: !1395, line: 124, baseType: !7, size: 32, offset: 448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1397, file: !1395, line: 128, baseType: !7, size: 32, offset: 480)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1397, file: !1395, line: 131, baseType: !1427, size: 64, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1395, line: 75, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!824, !1420, !1420}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1397, file: !1395, line: 132, baseType: !1432, size: 64, offset: 576)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1395, line: 78, baseType: !1414)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1397, file: !1395, line: 135, baseType: !824, size: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1397, file: !1395, line: 136, baseType: !1435, size: 64, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1395, line: 82, baseType: !1436)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!824, !824, !1420, !1420}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1397, file: !1395, line: 137, baseType: !1440, size: 64, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1395, line: 83, baseType: !1441)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{null, !824, !824}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1397, file: !1395, line: 141, baseType: !7, size: 32, offset: 832)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1389, file: !318, line: 200, baseType: !1270, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1217, file: !1218, line: 479, baseType: !1394, size: 64, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1217, file: !1218, line: 484, baseType: !970, size: 64, offset: 384)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1217, file: !1218, line: 488, baseType: !970, size: 64, offset: 448)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1217, file: !1218, line: 493, baseType: !970, size: 64, offset: 512)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1217, file: !1218, line: 496, baseType: !970, size: 64, offset: 576)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1217, file: !1218, line: 501, baseType: !1452, size: 64, offset: 640)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !342, line: 2355, size: 576, elements: !1454)
!1454 = !{!1455, !1458, !1459, !1460, !1461, !1463, !1464, !1469, !1470, !1471, !1472, !1473, !1474}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1453, file: !342, line: 2356, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !342, line: 2356, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1453, file: !342, line: 2357, baseType: !939, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1453, file: !342, line: 2358, baseType: !878, size: 32, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1453, file: !342, line: 2359, baseType: !878, size: 32, offset: 160)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1453, file: !342, line: 2360, baseType: !1462, size: 128, offset: 192)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 128, elements: !871)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1453, file: !342, line: 2364, baseType: !878, size: 32, offset: 320)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1453, file: !342, line: 2367, baseType: !1465, size: 128, offset: 384)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !342, line: 2349, size: 128, elements: !1466)
!1466 = !{!1467, !1468}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1465, file: !342, line: 2351, baseType: !914, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1465, file: !342, line: 2352, baseType: !860, size: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1453, file: !342, line: 2371, baseType: !341, size: 32, offset: 512)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1453, file: !342, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1453, file: !342, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1453, file: !342, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1453, file: !342, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1453, file: !342, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1217, file: !1218, line: 504, baseType: !1476, size: 64, offset: 704)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1218, line: 504, flags: DIFlagFwdDecl)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1217, file: !1218, line: 507, baseType: !1394, size: 64, offset: 768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1217, file: !1218, line: 510, baseType: !878, size: 32, offset: 832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1217, file: !1218, line: 513, baseType: !878, size: 32, offset: 864)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1217, file: !1218, line: 516, baseType: !1091, size: 32, offset: 896)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1217, file: !1218, line: 519, baseType: !1091, size: 32, offset: 928)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1217, file: !1218, line: 522, baseType: !7, size: 32, offset: 960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1217, file: !1218, line: 523, baseType: !7, size: 32, offset: 992)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1217, file: !1218, line: 528, baseType: !939, size: 64, offset: 1024)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1217, file: !1218, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1217, file: !1218, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1217, file: !1218, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1217, file: !1218, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1217, file: !1218, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1217, file: !1218, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1217, file: !1218, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1217, file: !1218, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1217, file: !1218, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1217, file: !1218, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1217, file: !1218, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1217, file: !1218, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1217, file: !1218, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1217, file: !1218, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1217, file: !1218, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1217, file: !1218, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1212, file: !347, line: 3254, baseType: !970, size: 64, offset: 1536)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1212, file: !347, line: 3257, baseType: !970, size: 64, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1212, file: !347, line: 3258, baseType: !970, size: 64, offset: 1664)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1212, file: !347, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1212, file: !347, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1212, file: !347, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1212, file: !347, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1212, file: !347, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1212, file: !347, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1212, file: !347, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1212, file: !347, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1212, file: !347, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1212, file: !347, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1212, file: !347, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1212, file: !347, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1212, file: !347, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1212, file: !347, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1212, file: !347, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1212, file: !347, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1212, file: !347, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1212, file: !347, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !347, line: 3394, baseType: !1524, size: 1344)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !347, line: 2279, size: 1344, elements: !1525)
!1525 = !{!1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1551, !1552, !1553, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1524, file: !347, line: 2280, baseType: !1008, size: 192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1524, file: !347, line: 2281, baseType: !970, size: 64, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1524, file: !347, line: 2282, baseType: !970, size: 64, offset: 256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1524, file: !347, line: 2283, baseType: !970, size: 64, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1524, file: !347, line: 2284, baseType: !970, size: 64, offset: 384)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1524, file: !347, line: 2285, baseType: !7, size: 32, offset: 448)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1524, file: !347, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1524, file: !347, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1524, file: !347, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1524, file: !347, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1524, file: !347, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1524, file: !347, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1524, file: !347, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1524, file: !347, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1524, file: !347, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1524, file: !347, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1524, file: !347, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1524, file: !347, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1524, file: !347, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1524, file: !347, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1524, file: !347, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1524, file: !347, line: 2305, baseType: !7, size: 32, offset: 512)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1524, file: !347, line: 2306, baseType: !1549, size: 32, offset: 544)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1550, line: 31, baseType: !878)
!1550 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1524, file: !347, line: 2307, baseType: !970, size: 64, offset: 576)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1524, file: !347, line: 2308, baseType: !970, size: 64, offset: 640)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1524, file: !347, line: 2314, baseType: !1554, size: 64, offset: 704)
!1554 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !347, line: 2309, size: 64, elements: !1555)
!1555 = !{!1556, !1557, !1558}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1554, file: !347, line: 2310, baseType: !878, size: 32)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1554, file: !347, line: 2311, baseType: !939, size: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1554, file: !347, line: 2312, baseType: !1559, size: 64)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1560 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !347, line: 2277, flags: DIFlagFwdDecl)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1524, file: !347, line: 2315, baseType: !970, size: 64, offset: 768)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1524, file: !347, line: 2316, baseType: !970, size: 64, offset: 832)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1524, file: !347, line: 2317, baseType: !970, size: 64, offset: 896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1524, file: !347, line: 2318, baseType: !970, size: 64, offset: 960)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1524, file: !347, line: 2319, baseType: !970, size: 64, offset: 1024)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1524, file: !347, line: 2320, baseType: !970, size: 64, offset: 1088)
