; ModuleID = 'tree-ssa-live.c'
source_filename = "tree-ssa-live.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!296 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!297 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!298 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!299 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!300 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!301 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!302 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!303 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!304 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!305 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!306 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!307 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!308 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!309 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!310 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!311 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!312 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!313 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!314 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!315 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!316 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!317 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!318 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!319 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !282, line: 727, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!322 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!327 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!328 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!329 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!330 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!331 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!332 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!333 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!334 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!335 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!336 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!337 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!338 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!339 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!340 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!341 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!342 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!343 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!344 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!345 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debug_info_level", file: !347, line: 46, baseType: !5, size: 32, elements: !348)
!347 = !DIFile(filename: "./flags.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !{!349, !350, !351, !352}
!349 = !DIEnumerator(name: "DINFO_LEVEL_NONE", value: 0, isUnsigned: true)
!350 = !DIEnumerator(name: "DINFO_LEVEL_TERSE", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "DINFO_LEVEL_NORMAL", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "DINFO_LEVEL_VERBOSE", value: 3, isUnsigned: true)
!353 = !{!354, !3, !1054, !898, !397, !366, !378, !385, !5, !508, !693, !1567, !726, !1090, !1569, !1572, !1579, !1584, !451}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "var_map", file: !355, line: 77, baseType: !356)
!355 = !DIFile(filename: "./tree-ssa-live.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_var_map", file: !355, line: 54, size: 448, elements: !358)
!358 = !{!359, !377, !379, !380, !381, !382, !383, !384}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "var_partition", scope: !357, file: !355, line: 57, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "partition", file: !361, line: 65, baseType: !362)
!361 = !DIFile(filename: "./include/partition.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_def", file: !361, line: 59, size: 256, elements: !364)
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "num_elements", scope: !363, file: !361, line: 62, baseType: !366, size: 32)
!366 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !363, file: !361, line: 64, baseType: !368, size: 192, offset: 64)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 192, elements: !375)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_elem", file: !361, line: 46, size: 192, elements: !370)
!370 = !{!371, !372, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "class_element", scope: !369, file: !361, line: 50, baseType: !366, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !361, line: 53, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "class_count", scope: !369, file: !361, line: 56, baseType: !5, size: 32, offset: 128)
!375 = !{!376}
!376 = !DISubrange(count: 1)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_view", scope: !357, file: !355, line: 60, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "view_to_partition", scope: !357, file: !355, line: 61, baseType: !378, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !357, file: !355, line: 64, baseType: !5, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "partition_size", scope: !357, file: !355, line: 67, baseType: !5, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_basevars", scope: !357, file: !355, line: 70, baseType: !366, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_base_index", scope: !357, file: !355, line: 73, baseType: !378, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "basevars", scope: !357, file: !355, line: 76, baseType: !385, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !4, line: 184, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !4, line: 184, size: 128, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !387, file: !4, line: 184, baseType: !390, size: 128)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !391, file: !4, line: 182, baseType: !5, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !391, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !391, file: !4, line: 182, baseType: !396, size: 64, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 64, elements: !375)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !398, line: 56, baseType: !399)
!398 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !401)
!401 = !{!402, !435, !441, !454, !461, !468, !473, !481, !487, !501, !513, !551, !559, !587, !604, !605, !610, !619, !625, !630, !634, !638, !1216, !1265, !1271, !1277, !1284, !1297, !1311, !1328, !1340, !1362, !1377, !1549}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !400, file: !4, line: 3372, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !403, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !403, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !403, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !403, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !403, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !403, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !403, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !403, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !403, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !403, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !403, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !403, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !403, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !403, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !403, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !403, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !403, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !403, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !403, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !403, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !403, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !403, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !403, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !403, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !403, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !403, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !403, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !403, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !403, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !403, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !400, file: !4, line: 3373, baseType: !436, size: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !436, file: !4, line: 403, baseType: !403, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !436, file: !4, line: 404, baseType: !397, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !4, line: 405, baseType: !397, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !400, file: !4, line: 3374, baseType: !442, size: 320)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !442, file: !4, line: 1385, baseType: !436, size: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !442, file: !4, line: 1386, baseType: !446, size: 128, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !447, line: 58, baseType: !448)
!447 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 54, size: 128, elements: !449)
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !448, file: !447, line: 56, baseType: !451, size: 64)
!451 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !448, file: !447, line: 57, baseType: !453, size: 64, offset: 64)
!453 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !400, file: !4, line: 3375, baseType: !455, size: 256)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !455, file: !4, line: 1398, baseType: !436, size: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !455, file: !4, line: 1399, baseType: !459, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !400, file: !4, line: 3376, baseType: !462, size: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !462, file: !4, line: 1409, baseType: !436, size: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !462, file: !4, line: 1410, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !400, file: !4, line: 3377, baseType: !469, size: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !469, file: !4, line: 1438, baseType: !436, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !469, file: !4, line: 1439, baseType: !397, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !400, file: !4, line: 3378, baseType: !474, size: 256)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !474, file: !4, line: 1419, baseType: !436, size: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !4, line: 1420, baseType: !366, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !474, file: !4, line: 1421, baseType: !479, size: 8, offset: 224)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 8, elements: !375)
!480 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !400, file: !4, line: 3379, baseType: !482, size: 320)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !4, line: 1429, baseType: !436, size: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !482, file: !4, line: 1430, baseType: !397, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !482, file: !4, line: 1431, baseType: !397, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !400, file: !4, line: 3380, baseType: !488, size: 320)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !488, file: !4, line: 1461, baseType: !436, size: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !4, line: 1462, baseType: !492, size: 128, offset: 192)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !493, line: 31, size: 128, elements: !494)
!493 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!494 = !{!495, !499, !500}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !492, file: !493, line: 32, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !492, file: !493, line: 33, baseType: !5, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !492, file: !493, line: 34, baseType: !5, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !400, file: !4, line: 3381, baseType: !502, size: 384)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !503)
!503 = !{!504, !505, !510, !511, !512}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !4, line: 2508, baseType: !436, size: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !502, file: !4, line: 2509, baseType: !506, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !507, line: 58, baseType: !508)
!507 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !509, line: 44, baseType: !5)
!509 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !502, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !4, line: 2511, baseType: !397, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !502, file: !4, line: 2512, baseType: !397, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !400, file: !4, line: 3382, baseType: !514, size: 896)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !4, line: 2653, baseType: !502, size: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !4, line: 2654, baseType: !397, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !514, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !514, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !514, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !514, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !514, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !514, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !514, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !514, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !514, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !514, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !514, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !514, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !514, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !514, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !514, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !514, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !514, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !514, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !514, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !514, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !514, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !514, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !514, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !514, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !514, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !514, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !514, file: !4, line: 2705, baseType: !397, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !514, file: !4, line: 2706, baseType: !397, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !514, file: !4, line: 2707, baseType: !397, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !514, file: !4, line: 2708, baseType: !397, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !514, file: !4, line: 2711, baseType: !549, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !400, file: !4, line: 3383, baseType: !552, size: 960)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !4, line: 2757, baseType: !514, size: 896)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !552, file: !4, line: 2758, baseType: !556, size: 64, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !398, line: 50, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !398, line: 49, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !400, file: !4, line: 3384, baseType: !560, size: 1472)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !561)
!561 = !{!562, !583, !584, !585, !586}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !4, line: 3115, baseType: !563, size: 1216)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !563, file: !4, line: 2985, baseType: !552, size: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !563, file: !4, line: 2986, baseType: !397, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !563, file: !4, line: 2987, baseType: !397, size: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !563, file: !4, line: 2988, baseType: !397, size: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !563, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !563, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !563, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !563, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !563, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !563, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !563, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !563, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !563, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !563, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !563, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !563, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !563, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !563, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !560, file: !4, line: 3117, baseType: !397, size: 64, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !560, file: !4, line: 3119, baseType: !397, size: 64, offset: 1280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !560, file: !4, line: 3121, baseType: !397, size: 64, offset: 1344)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !560, file: !4, line: 3123, baseType: !397, size: 64, offset: 1408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !400, file: !4, line: 3385, baseType: !588, size: 1088)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !4, line: 2875, baseType: !552, size: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !588, file: !4, line: 2876, baseType: !556, size: 64, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !588, file: !4, line: 2877, baseType: !593, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !595, line: 172, size: 128, elements: !596)
!595 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !594, file: !595, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !594, file: !595, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !594, file: !595, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !594, file: !595, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !594, file: !595, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !594, file: !595, line: 195, baseType: !5, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !594, file: !595, line: 199, baseType: !397, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !400, file: !4, line: 3386, baseType: !563, size: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !400, file: !4, line: 3387, baseType: !606, size: 1280)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !606, file: !4, line: 3094, baseType: !563, size: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !606, file: !4, line: 3095, baseType: !593, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !400, file: !4, line: 3388, baseType: !611, size: 1216)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !4, line: 2825, baseType: !514, size: 896)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !611, file: !4, line: 2827, baseType: !397, size: 64, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !611, file: !4, line: 2828, baseType: !397, size: 64, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !611, file: !4, line: 2829, baseType: !397, size: 64, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !611, file: !4, line: 2830, baseType: !397, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !611, file: !4, line: 2831, baseType: !397, size: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !400, file: !4, line: 3389, baseType: !620, size: 1024)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !620, file: !4, line: 2851, baseType: !552, size: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !620, file: !4, line: 2852, baseType: !366, size: 32, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !620, file: !4, line: 2853, baseType: !366, size: 32, offset: 992)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !400, file: !4, line: 3390, baseType: !626, size: 1024)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !4, line: 2858, baseType: !552, size: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !626, file: !4, line: 2859, baseType: !593, size: 64, offset: 960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !400, file: !4, line: 3391, baseType: !631, size: 960)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !632)
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !631, file: !4, line: 2863, baseType: !552, size: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !400, file: !4, line: 3392, baseType: !635, size: 1472)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !635, file: !4, line: 3305, baseType: !560, size: 1472)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !400, file: !4, line: 3393, baseType: !639, size: 1792)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !640)
!640 = !{!641, !642, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !4, line: 3249, baseType: !560, size: 1472)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !639, file: !4, line: 3251, baseType: !643, size: 64, offset: 1472)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !645, line: 463, size: 1152, elements: !646)
!645 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!646 = !{!647, !650, !968, !969, !1136, !1139, !1140, !1141, !1142, !1143, !1144, !1168, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !644, file: !645, line: 464, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !645, line: 464, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !644, file: !645, line: 467, baseType: !651, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !200, line: 374, size: 640, elements: !653)
!653 = !{!654, !943, !944, !957, !958, !959, !960, !961, !962, !964, !966, !967}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !652, file: !200, line: 377, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !398, line: 111, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !200, line: 217, size: 832, elements: !658)
!658 = !{!659, !906, !907, !908, !911, !917, !918, !919, !937, !938, !939, !940, !941, !942}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !657, file: !200, line: 219, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !200, line: 151, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !200, line: 151, size: 128, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !662, file: !200, line: 151, baseType: !665, size: 128)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !200, line: 150, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !200, line: 150, size: 128, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !666, file: !200, line: 150, baseType: !5, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !666, file: !200, line: 150, baseType: !5, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !666, file: !200, line: 150, baseType: !671, size: 64, offset: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !375)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !398, line: 108, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !200, line: 122, size: 512, elements: !675)
!675 = !{!676, !677, !678, !897, !899, !900, !901, !902, !903, !904}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !674, file: !200, line: 124, baseType: !656, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !674, file: !200, line: 125, baseType: !656, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !674, file: !200, line: 131, baseType: !679, size: 64, offset: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !200, line: 128, size: 64, elements: !680)
!680 = !{!681, !896}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !679, file: !200, line: 129, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !398, line: 66, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !282, line: 143, size: 192, elements: !685)
!685 = !{!686, !894, !895}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !684, file: !282, line: 145, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !398, line: 69, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !282, line: 136, size: 192, elements: !690)
!690 = !{!691, !892, !893}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !689, file: !282, line: 137, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !398, line: 58, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !282, line: 737, size: 768, elements: !695)
!695 = !{!696, !713, !745, !751, !756, !761, !768, !774, !780, !785, !799, !804, !810, !815, !827, !832, !850, !857, !864, !870, !875, !881, !887}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !694, file: !282, line: 738, baseType: !697, size: 256)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !282, line: 271, size: 256, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !697, file: !282, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !697, file: !282, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !697, file: !282, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !697, file: !282, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !697, file: !282, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !697, file: !282, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !697, file: !282, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !697, file: !282, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !697, file: !282, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !697, file: !282, line: 312, baseType: !5, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !697, file: !282, line: 316, baseType: !506, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !697, file: !282, line: 319, baseType: !5, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !697, file: !282, line: 323, baseType: !656, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !697, file: !282, line: 327, baseType: !397, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !694, file: !282, line: 739, baseType: !714, size: 448)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !282, line: 350, size: 448, elements: !715)
!715 = !{!716, !744}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !714, file: !282, line: 353, baseType: !717, size: 384)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !282, line: 333, size: 384, elements: !718)
!718 = !{!719, !720, !727}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !717, file: !282, line: 336, baseType: !697, size: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !717, file: !282, line: 343, baseType: !721, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !248, line: 37, size: 128, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !248, line: 39, baseType: !721, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !722, file: !248, line: 40, baseType: !726, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !717, file: !282, line: 344, baseType: !728, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !248, line: 45, size: 320, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !729, file: !248, line: 47, baseType: !728, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !729, file: !248, line: 48, baseType: !733, size: 256, offset: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !734)
!734 = !{!735, !737, !738, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !733, file: !4, line: 1884, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !733, file: !4, line: 1885, baseType: !736, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !733, file: !4, line: 1891, baseType: !739, size: 64, offset: 128)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !4, line: 1891, size: 64, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !739, file: !4, line: 1891, baseType: !692, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !739, file: !4, line: 1891, baseType: !397, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !733, file: !4, line: 1892, baseType: !726, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !714, file: !282, line: 359, baseType: !396, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !694, file: !282, line: 740, baseType: !746, size: 512)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !282, line: 365, size: 512, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !746, file: !282, line: 368, baseType: !717, size: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !746, file: !282, line: 373, baseType: !397, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !746, file: !282, line: 374, baseType: !397, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !694, file: !282, line: 741, baseType: !752, size: 576)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !282, line: 380, size: 576, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !752, file: !282, line: 383, baseType: !746, size: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !752, file: !282, line: 389, baseType: !396, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !694, file: !282, line: 742, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !282, line: 395, size: 320, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !757, file: !282, line: 397, baseType: !697, size: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !757, file: !282, line: 400, baseType: !682, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !694, file: !282, line: 743, baseType: !762, size: 448)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !282, line: 406, size: 448, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !762, file: !282, line: 408, baseType: !697, size: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !762, file: !282, line: 412, baseType: !397, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !762, file: !282, line: 420, baseType: !397, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !762, file: !282, line: 423, baseType: !682, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !694, file: !282, line: 744, baseType: !769, size: 384)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !282, line: 429, size: 384, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !769, file: !282, line: 431, baseType: !697, size: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !769, file: !282, line: 434, baseType: !397, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !769, file: !282, line: 437, baseType: !682, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !694, file: !282, line: 745, baseType: !775, size: 384)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !282, line: 443, size: 384, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !775, file: !282, line: 445, baseType: !697, size: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !775, file: !282, line: 449, baseType: !397, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !775, file: !282, line: 453, baseType: !682, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !694, file: !282, line: 746, baseType: !781, size: 320)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !282, line: 459, size: 320, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !781, file: !282, line: 461, baseType: !697, size: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !781, file: !282, line: 464, baseType: !397, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !694, file: !282, line: 747, baseType: !786, size: 768)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !282, line: 469, size: 768, elements: !787)
!787 = !{!788, !789, !790, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !786, file: !282, line: 471, baseType: !697, size: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !786, file: !282, line: 474, baseType: !5, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !786, file: !282, line: 475, baseType: !5, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !786, file: !282, line: 478, baseType: !397, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !786, file: !282, line: 481, baseType: !793, size: 384, offset: 384)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 384, elements: !375)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !4, line: 1917, size: 384, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !794, file: !4, line: 1920, baseType: !733, size: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !794, file: !4, line: 1921, baseType: !397, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !794, file: !4, line: 1922, baseType: !506, size: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !694, file: !282, line: 748, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !282, line: 487, size: 320, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !800, file: !282, line: 490, baseType: !697, size: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !800, file: !282, line: 494, baseType: !366, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !694, file: !282, line: 749, baseType: !805, size: 384)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !282, line: 500, size: 384, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !805, file: !282, line: 502, baseType: !697, size: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !805, file: !282, line: 506, baseType: !682, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !805, file: !282, line: 510, baseType: !682, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !694, file: !282, line: 750, baseType: !811, size: 320)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !282, line: 529, size: 320, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !811, file: !282, line: 531, baseType: !697, size: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !811, file: !282, line: 540, baseType: !682, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !694, file: !282, line: 751, baseType: !816, size: 704)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !282, line: 546, size: 704, elements: !817)
!817 = !{!818, !819, !822, !823, !824, !825, !826}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !816, file: !282, line: 549, baseType: !746, size: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !816, file: !282, line: 553, baseType: !820, size: 64, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !816, file: !282, line: 557, baseType: !498, size: 8, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !816, file: !282, line: 558, baseType: !498, size: 8, offset: 584)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !816, file: !282, line: 559, baseType: !498, size: 8, offset: 592)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !816, file: !282, line: 560, baseType: !498, size: 8, offset: 600)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !816, file: !282, line: 566, baseType: !396, size: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !694, file: !282, line: 752, baseType: !828, size: 384)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !282, line: 571, size: 384, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !828, file: !282, line: 573, baseType: !757, size: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !282, line: 577, baseType: !397, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !694, file: !282, line: 753, baseType: !833, size: 576)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !282, line: 600, size: 576, elements: !834)
!834 = !{!835, !836, !837, !840, !849}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !833, file: !282, line: 602, baseType: !757, size: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !833, file: !282, line: 605, baseType: !397, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !833, file: !282, line: 609, baseType: !838, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !839, line: 46, baseType: !451)
!839 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!840 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !833, file: !282, line: 612, baseType: !841, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !282, line: 581, size: 320, elements: !843)
!843 = !{!844, !845, !846, !847, !848}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !842, file: !282, line: 583, baseType: !3, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !842, file: !282, line: 586, baseType: !397, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !842, file: !282, line: 589, baseType: !397, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !842, file: !282, line: 592, baseType: !397, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !842, file: !282, line: 595, baseType: !397, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !833, file: !282, line: 616, baseType: !682, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !694, file: !282, line: 754, baseType: !851, size: 512)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !282, line: 622, size: 512, elements: !852)
!852 = !{!853, !854, !855, !856}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !851, file: !282, line: 624, baseType: !757, size: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !851, file: !282, line: 628, baseType: !397, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !851, file: !282, line: 632, baseType: !397, size: 64, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !851, file: !282, line: 636, baseType: !397, size: 64, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !694, file: !282, line: 755, baseType: !858, size: 704)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !282, line: 642, size: 704, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !858, file: !282, line: 644, baseType: !851, size: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !858, file: !282, line: 648, baseType: !397, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !858, file: !282, line: 652, baseType: !397, size: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !858, file: !282, line: 653, baseType: !397, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !694, file: !282, line: 756, baseType: !865, size: 448)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !282, line: 663, size: 448, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !865, file: !282, line: 665, baseType: !757, size: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !865, file: !282, line: 668, baseType: !397, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !865, file: !282, line: 673, baseType: !397, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !694, file: !282, line: 757, baseType: !871, size: 384)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !282, line: 694, size: 384, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !871, file: !282, line: 696, baseType: !757, size: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !871, file: !282, line: 699, baseType: !397, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !694, file: !282, line: 758, baseType: !876, size: 384)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !282, line: 681, size: 384, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !876, file: !282, line: 683, baseType: !697, size: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !876, file: !282, line: 686, baseType: !397, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !876, file: !282, line: 689, baseType: !397, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !694, file: !282, line: 759, baseType: !882, size: 384)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !282, line: 707, size: 384, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !882, file: !282, line: 709, baseType: !697, size: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !882, file: !282, line: 712, baseType: !397, size: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !882, file: !282, line: 712, baseType: !397, size: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !694, file: !282, line: 760, baseType: !888, size: 320)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !282, line: 718, size: 320, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !888, file: !282, line: 720, baseType: !697, size: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !888, file: !282, line: 723, baseType: !397, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !689, file: !282, line: 138, baseType: !688, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !282, line: 139, baseType: !688, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !684, file: !282, line: 146, baseType: !687, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !684, file: !282, line: 152, baseType: !682, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !679, file: !200, line: 130, baseType: !556, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !674, file: !200, line: 134, baseType: !898, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !674, file: !200, line: 137, baseType: !397, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !674, file: !200, line: 138, baseType: !506, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !674, file: !200, line: 142, baseType: !5, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !200, line: 144, baseType: !366, size: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !674, file: !200, line: 145, baseType: !366, size: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !674, file: !200, line: 146, baseType: !905, size: 64, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !200, line: 119, baseType: !453)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !657, file: !200, line: 220, baseType: !660, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !657, file: !200, line: 223, baseType: !898, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !657, file: !200, line: 226, baseType: !909, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !200, line: 185, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !657, file: !200, line: 229, baseType: !912, size: 128, offset: 256)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, elements: !915)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !200, line: 229, flags: DIFlagFwdDecl)
!915 = !{!916}
!916 = !DISubrange(count: 2)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !657, file: !200, line: 232, baseType: !656, size: 64, offset: 384)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !657, file: !200, line: 233, baseType: !656, size: 64, offset: 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !657, file: !200, line: 238, baseType: !920, size: 64, offset: 512)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !200, line: 235, size: 64, elements: !921)
!921 = !{!922, !928}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !920, file: !200, line: 236, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !200, line: 273, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !924, file: !200, line: 275, baseType: !682, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !924, file: !200, line: 278, baseType: !682, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !920, file: !200, line: 237, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !200, line: 259, size: 320, elements: !931)
!931 = !{!932, !933, !934, !935, !936}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !930, file: !200, line: 261, baseType: !556, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !930, file: !200, line: 262, baseType: !556, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !930, file: !200, line: 266, baseType: !556, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !930, file: !200, line: 267, baseType: !556, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !930, file: !200, line: 270, baseType: !366, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !657, file: !200, line: 241, baseType: !905, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !657, file: !200, line: 244, baseType: !366, size: 32, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !657, file: !200, line: 247, baseType: !366, size: 32, offset: 672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !657, file: !200, line: 250, baseType: !366, size: 32, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !657, file: !200, line: 253, baseType: !366, size: 32, offset: 736)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !200, line: 256, baseType: !366, size: 32, offset: 768)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !652, file: !200, line: 378, baseType: !655, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !652, file: !200, line: 381, baseType: !945, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !200, line: 282, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !200, line: 282, size: 128, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !947, file: !200, line: 282, baseType: !950, size: 128)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !200, line: 281, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !200, line: 281, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !951, file: !200, line: 281, baseType: !5, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !951, file: !200, line: 281, baseType: !5, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !951, file: !200, line: 281, baseType: !956, size: 64, offset: 64)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 64, elements: !375)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !652, file: !200, line: 384, baseType: !366, size: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !652, file: !200, line: 387, baseType: !366, size: 32, offset: 224)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !652, file: !200, line: 390, baseType: !366, size: 32, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !652, file: !200, line: 394, baseType: !945, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !652, file: !200, line: 396, baseType: !199, size: 32, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !652, file: !200, line: 399, baseType: !963, size: 64, offset: 416)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !915)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !652, file: !200, line: 402, baseType: !965, size: 64, offset: 480)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !915)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !652, file: !200, line: 406, baseType: !366, size: 32, offset: 544)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !652, file: !200, line: 409, baseType: !366, size: 32, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !644, file: !645, line: 470, baseType: !683, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !644, file: !645, line: 473, baseType: !970, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !595, line: 39, size: 1152, elements: !972)
!972 = !{!973, !1023, !1036, !1042, !1043, !1113, !1114, !1118, !1119, !1120, !1121, !1122}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !971, file: !595, line: 41, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !975, line: 144, baseType: !976)
!975 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !975, line: 100, size: 896, elements: !978)
!978 = !{!979, !987, !992, !997, !999, !1000, !1001, !1002, !1003, !1004, !1009, !1011, !1012, !1017, !1022}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !977, file: !975, line: 102, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !975, line: 52, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !975, line: 47, baseType: !5)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !977, file: !975, line: 105, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !975, line: 59, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!366, !985, !985}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !977, file: !975, line: 108, baseType: !993, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !975, line: 63, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !898}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !977, file: !975, line: 111, baseType: !998, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !977, file: !975, line: 114, baseType: !838, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !977, file: !975, line: 117, baseType: !838, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !977, file: !975, line: 120, baseType: !838, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !977, file: !975, line: 124, baseType: !5, size: 32, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !977, file: !975, line: 128, baseType: !5, size: 32, offset: 480)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !977, file: !975, line: 131, baseType: !1005, size: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !975, line: 75, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!898, !838, !838}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !977, file: !975, line: 132, baseType: !1010, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !975, line: 78, baseType: !994)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !977, file: !975, line: 135, baseType: !898, size: 64, offset: 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !977, file: !975, line: 136, baseType: !1013, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !975, line: 82, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!898, !898, !838, !838}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !977, file: !975, line: 137, baseType: !1018, size: 64, offset: 768)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !975, line: 83, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !898, !898}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !977, file: !975, line: 141, baseType: !5, size: 32, offset: 832)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !971, file: !595, line: 48, baseType: !1024, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !282, line: 35, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !282, line: 35, size: 128, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1026, file: !282, line: 35, baseType: !1029, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !282, line: 33, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !282, line: 33, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !282, line: 33, baseType: !5, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1030, file: !282, line: 33, baseType: !5, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1030, file: !282, line: 33, baseType: !1035, size: 64, offset: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 64, elements: !375)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !971, file: !595, line: 51, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1040)
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1039, file: !4, line: 183, baseType: !390, size: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !971, file: !595, line: 54, baseType: !397, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !971, file: !595, line: 57, baseType: !1044, size: 128, offset: 256)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1045, line: 31, size: 128, elements: !1046)
!1045 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1044, file: !1045, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1044, file: !1045, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1044, file: !1045, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1044, file: !1045, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1044, file: !1045, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1044, file: !1045, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1044, file: !1045, line: 56, baseType: !1054, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !398, line: 47, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1057, line: 75, size: 256, elements: !1058)
!1057 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1058 = !{!1059, !1071, !1072, !1073}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1056, file: !1057, line: 76, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1057, line: 68, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1057, line: 63, size: 320, elements: !1063)
!1063 = !{!1064, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !1057, line: 64, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1062, file: !1057, line: 65, baseType: !1065, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1062, file: !1057, line: 66, baseType: !5, size: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1062, file: !1057, line: 67, baseType: !1069, size: 128, offset: 192)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 128, elements: !915)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1057, line: 29, baseType: !451)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1056, file: !1057, line: 77, baseType: !1060, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1056, file: !1057, line: 78, baseType: !5, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1056, file: !1057, line: 79, baseType: !1074, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1057, line: 49, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1057, line: 45, size: 832, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1076, file: !1057, line: 46, baseType: !1065, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1076, file: !1057, line: 47, baseType: !1055, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1076, file: !1057, line: 48, baseType: !1081, size: 704, offset: 128)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1082, line: 164, size: 704, elements: !1083)
!1082 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1083 = !{!1084, !1085, !1096, !1097, !1098, !1099, !1100, !1101, !1105, !1109, !1110, !1111, !1112}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1081, file: !1082, line: 166, baseType: !453, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1081, file: !1082, line: 167, baseType: !1086, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1082, line: 157, size: 192, elements: !1088)
!1088 = !{!1089, !1091, !1092}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1087, file: !1082, line: 159, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1087, file: !1082, line: 160, baseType: !1086, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1087, file: !1082, line: 161, baseType: !1093, size: 32, offset: 128)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 32, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 4)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1081, file: !1082, line: 168, baseType: !1090, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1081, file: !1082, line: 169, baseType: !1090, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1081, file: !1082, line: 170, baseType: !1090, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1081, file: !1082, line: 171, baseType: !453, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1081, file: !1082, line: 172, baseType: !366, size: 32, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1081, file: !1082, line: 176, baseType: !1102, size: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!1086, !898, !453}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1081, file: !1082, line: 177, baseType: !1106, size: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !898, !1086}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1081, file: !1082, line: 178, baseType: !898, size: 64, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1081, file: !1082, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1081, file: !1082, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1081, file: !1082, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !971, file: !595, line: 60, baseType: !1044, size: 128, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !971, file: !595, line: 64, baseType: !1115, size: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1117, line: 33, flags: DIFlagFwdDecl)
!1117 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !971, file: !595, line: 67, baseType: !397, size: 64, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !971, file: !595, line: 73, baseType: !974, size: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !971, file: !595, line: 77, baseType: !1054, size: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !971, file: !595, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !971, file: !595, line: 82, baseType: !1123, size: 320, offset: 832)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !248, line: 62, size: 320, elements: !1124)
!1124 = !{!1125, !1131, !1132, !1133, !1134, !1135}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1123, file: !248, line: 63, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !248, line: 56, size: 128, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1127, file: !248, line: 57, baseType: !1126, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1127, file: !248, line: 58, baseType: !479, size: 8, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1123, file: !248, line: 64, baseType: !5, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1123, file: !248, line: 66, baseType: !5, size: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1123, file: !248, line: 68, baseType: !498, size: 8, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1123, file: !248, line: 70, baseType: !721, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1123, file: !248, line: 71, baseType: !728, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !644, file: !645, line: 476, baseType: !1137, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !645, line: 476, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !644, file: !645, line: 479, baseType: !974, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !644, file: !645, line: 484, baseType: !397, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !644, file: !645, line: 488, baseType: !397, size: 64, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !644, file: !645, line: 493, baseType: !397, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !644, file: !645, line: 496, baseType: !397, size: 64, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !644, file: !645, line: 501, baseType: !1145, size: 64, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !211, line: 2355, size: 576, elements: !1147)
!1147 = !{!1148, !1151, !1152, !1153, !1154, !1156, !1157, !1162, !1163, !1164, !1165, !1166, !1167}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1146, file: !211, line: 2356, baseType: !1149, size: 64)
