; ModuleID = 'rtl-error.c'
source_filename = "rtl-error.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.diagnostic_context = type { %struct.pretty_print_info*, [12 x i32], i8, i8, [870 x i32], i8, i8, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (%struct.diagnostic_context*, %struct.diagnostic_info*)*, void (i8*, [1 x %struct.__va_list_tag]*)*, %union.tree_node*, %struct.line_map*, i32, i8 }
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque

!223 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!224 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!225 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!226 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!227 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!228 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!229 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!230 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!231 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!232 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!233 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!234 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!235 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!236 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!237 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!238 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!239 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!240 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!241 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!242 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!243 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!244 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!245 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!246 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!247 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!248 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!249 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!250 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!251 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!252 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!253 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!254 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!255 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!256 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!257 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!258 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!259 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!260 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!261 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!262 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!263 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!264 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!265 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!266 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!267 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!268 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!269 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!270 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!271 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!272 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!273 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!274 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!275 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!276 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!277 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!278 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!279 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!280 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!281 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!282 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!283 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!284 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!285 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!286 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!287 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!288 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!289 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!290 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!291 = !{!292, !148}
!292 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!297 = distinct !DISubprogram(name: "error_for_asm", scope: !1, file: !1, line: 82, type: !298, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !452)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300, !327, null}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_rtx", file: !301, line: 51, baseType: !302)
!301 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !149, line: 240, size: 384, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !304, file: !149, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !304, file: !149, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !304, file: !149, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !304, file: !149, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !304, file: !149, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !304, file: !149, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !304, file: !149, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !304, file: !149, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !304, file: !149, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !304, file: !149, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !304, file: !149, line: 321, baseType: !317, size: 320, offset: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !149, line: 315, size: 320, elements: !318)
!318 = !{!319, !394, !396, !427, !440}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !317, file: !149, line: 316, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 64, elements: !341)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !149, line: 183, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !149, line: 166, size: 64, elements: !323)
!323 = !{!324, !325, !326, !330, !333, !343, !344, !356, !359, !362, !366, !369, !383, !391}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !322, file: !149, line: 168, baseType: !292, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !322, file: !149, line: 169, baseType: !5, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !322, file: !149, line: 170, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !322, file: !149, line: 171, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !301, line: 50, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !322, file: !149, line: 172, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !301, line: 53, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !149, line: 359, size: 128, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !336, file: !149, line: 360, baseType: !292, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !336, file: !149, line: 361, baseType: !340, size: 64, offset: 64)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 64, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 1)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !322, file: !149, line: 173, baseType: !3, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !322, file: !149, line: 174, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !149, line: 133, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 115, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !346, file: !149, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !346, file: !149, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !346, file: !149, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !346, file: !149, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !346, file: !149, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !346, file: !149, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !346, file: !149, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !346, file: !149, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !322, file: !149, line: 175, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !149, line: 175, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !322, file: !149, line: 176, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !301, line: 46, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !322, file: !149, line: 177, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !301, line: 56, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !301, line: 55, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !322, file: !149, line: 178, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !301, line: 110, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !322, file: !149, line: 179, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !149, line: 150, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !149, line: 142, size: 320, elements: !373)
!373 = !{!374, !375, !376, !377, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !372, file: !149, line: 144, baseType: !363, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !372, file: !149, line: 145, baseType: !331, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !372, file: !149, line: 146, baseType: !331, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !372, file: !149, line: 147, baseType: !378, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !379, line: 31, baseType: !292)
!379 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!380 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !372, file: !149, line: 148, baseType: !5, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !372, file: !149, line: 149, baseType: !382, size: 8, offset: 256)
!382 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !322, file: !149, line: 180, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !149, line: 162, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !149, line: 159, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !386, file: !149, line: 160, baseType: !363, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !386, file: !149, line: 161, baseType: !390, size: 64, offset: 64)
!390 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !322, file: !149, line: 181, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !149, line: 181, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !317, file: !149, line: 317, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !341)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !317, file: !149, line: 318, baseType: !397, size: 320)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !149, line: 188, size: 320, elements: !398)
!398 = !{!399, !403, !426}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !397, file: !149, line: 190, baseType: !400, size: 192)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 192, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 3)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !397, file: !149, line: 193, baseType: !404, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !149, line: 206, size: 320, elements: !406)
!406 = !{!407, !411, !412, !413, !425}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !405, file: !149, line: 208, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !301, line: 62, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !301, line: 61, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !405, file: !149, line: 211, baseType: !5, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !405, file: !149, line: 214, baseType: !390, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !405, file: !149, line: 224, baseType: !414, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !149, line: 202, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !149, line: 202, size: 128, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !149, line: 202, baseType: !419, size: 128)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !149, line: 200, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !149, line: 200, size: 128, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !420, file: !149, line: 200, baseType: !5, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !420, file: !149, line: 200, baseType: !5, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !420, file: !149, line: 200, baseType: !340, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !405, file: !149, line: 234, baseType: !414, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !397, file: !149, line: 197, baseType: !390, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !317, file: !149, line: 319, baseType: !428, size: 256)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !429, line: 52, size: 256, elements: !430)
!429 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!430 = !{!431, !432, !433, !434, !435, !436, !437}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !428, file: !429, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !428, file: !429, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !428, file: !429, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !428, file: !429, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !428, file: !429, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !428, file: !429, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !428, file: !429, line: 62, baseType: !438, size: 192, offset: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 192, elements: !401)
!439 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !317, file: !149, line: 320, baseType: !441, size: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !442, line: 27, size: 192, elements: !443)
!442 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !{!444, !451}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !442, line: 29, baseType: !445, size: 128)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !446, line: 58, baseType: !447)
!446 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 54, size: 128, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !447, file: !446, line: 56, baseType: !439, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !447, file: !446, line: 57, baseType: !390, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !441, file: !442, line: 30, baseType: !3, size: 32, offset: 128)
!452 = !{}
!453 = !DILocalVariable(name: "insn", arg: 1, scope: !297, file: !1, line: 82, type: !300)
!454 = !DILocation(line: 82, column: 26, scope: !297)
!455 = !DILocalVariable(name: "gmsgid", arg: 2, scope: !297, file: !1, line: 82, type: !327)
!456 = !DILocation(line: 82, column: 44, scope: !297)
!457 = !DILocalVariable(name: "ap", scope: !297, file: !1, line: 84, type: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !459, line: 52, baseType: !460)
!459 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !461, line: 32, baseType: !462)
!461 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 84, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 192, elements: !341)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 84, size: 192, elements: !465)
!465 = !{!466, !467, !468, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !464, file: !1, line: 84, baseType: !5, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !464, file: !1, line: 84, baseType: !5, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !464, file: !1, line: 84, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !464, file: !1, line: 84, baseType: !469, size: 64, offset: 128)
!471 = !DILocation(line: 84, column: 11, scope: !297)
!472 = !DILocation(line: 86, column: 3, scope: !297)
!473 = !DILocation(line: 87, column: 23, scope: !297)
!474 = !DILocation(line: 87, column: 29, scope: !297)
!475 = !DILocation(line: 87, column: 3, scope: !297)
!476 = !DILocation(line: 88, column: 3, scope: !297)
!477 = !DILocation(line: 89, column: 1, scope: !297)
!478 = distinct !DISubprogram(name: "diagnostic_for_asm", scope: !1, file: !1, line: 71, type: !479, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !452)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !300, !327, !481, !482}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_t", file: !133, line: 35, baseType: !132)
!483 = !DILocalVariable(name: "insn", arg: 1, scope: !478, file: !1, line: 71, type: !300)
!484 = !DILocation(line: 71, column: 31, scope: !478)
!485 = !DILocalVariable(name: "msg", arg: 2, scope: !478, file: !1, line: 71, type: !327)
!486 = !DILocation(line: 71, column: 49, scope: !478)
!487 = !DILocalVariable(name: "args_ptr", arg: 3, scope: !478, file: !1, line: 71, type: !481)
!488 = !DILocation(line: 71, column: 63, scope: !478)
!489 = !DILocalVariable(name: "kind", arg: 4, scope: !478, file: !1, line: 72, type: !482)
!490 = !DILocation(line: 72, column: 20, scope: !478)
!491 = !DILocalVariable(name: "diagnostic", scope: !478, file: !1, line: 74, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_info", file: !133, line: 52, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "diagnostic_info", file: !133, line: 40, size: 512, elements: !494)
!494 = !{!495, !511, !512, !513, !514, !515}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !493, file: !133, line: 42, baseType: !496, size: 320)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "text_info", file: !497, line: 39, baseType: !498)
!497 = !DIFile(filename: "./pretty-print.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 32, size: 320, elements: !499)
!499 = !{!500, !501, !502, !503, !509}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "format_spec", scope: !498, file: !497, line: 34, baseType: !327, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "args_ptr", scope: !498, file: !497, line: 35, baseType: !481, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !498, file: !497, line: 36, baseType: !292, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !498, file: !497, line: 37, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !506, line: 58, baseType: !507)
!506 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !508, line: 44, baseType: !5)
!508 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !498, file: !497, line: 38, baseType: !510, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !493, file: !133, line: 43, baseType: !505, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "override_column", scope: !493, file: !133, line: 44, baseType: !5, size: 32, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !493, file: !133, line: 47, baseType: !363, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !493, file: !133, line: 49, baseType: !482, size: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "option_index", scope: !493, file: !133, line: 51, baseType: !292, size: 32, offset: 480)
!516 = !DILocation(line: 74, column: 19, scope: !478)
!517 = !DILocation(line: 76, column: 37, scope: !478)
!518 = !DILocation(line: 76, column: 42, scope: !478)
!519 = !DILocation(line: 77, column: 28, scope: !478)
!520 = !DILocation(line: 77, column: 10, scope: !478)
!521 = !DILocation(line: 77, column: 35, scope: !478)
!522 = !DILocation(line: 76, column: 3, scope: !478)
!523 = !DILocation(line: 78, column: 3, scope: !478)
!524 = !DILocation(line: 79, column: 1, scope: !478)
!525 = distinct !DISubprogram(name: "warning_for_asm", scope: !1, file: !1, line: 92, type: !298, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !452)
!526 = !DILocalVariable(name: "insn", arg: 1, scope: !525, file: !1, line: 92, type: !300)
!527 = !DILocation(line: 92, column: 28, scope: !525)
!528 = !DILocalVariable(name: "gmsgid", arg: 2, scope: !525, file: !1, line: 92, type: !327)
!529 = !DILocation(line: 92, column: 46, scope: !525)
!530 = !DILocalVariable(name: "ap", scope: !525, file: !1, line: 94, type: !458)
!531 = !DILocation(line: 94, column: 11, scope: !525)
!532 = !DILocation(line: 96, column: 3, scope: !525)
!533 = !DILocation(line: 97, column: 23, scope: !525)
!534 = !DILocation(line: 97, column: 29, scope: !525)
!535 = !DILocation(line: 97, column: 3, scope: !525)
!536 = !DILocation(line: 98, column: 3, scope: !525)
!537 = !DILocation(line: 99, column: 1, scope: !525)
!538 = distinct !DISubprogram(name: "_fatal_insn", scope: !1, file: !1, line: 102, type: !539, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !452)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !327, !300, !327, !292, !327}
!541 = !DILocalVariable(name: "msgid", arg: 1, scope: !538, file: !1, line: 102, type: !327)
!542 = !DILocation(line: 102, column: 26, scope: !538)
!543 = !DILocalVariable(name: "insn", arg: 2, scope: !538, file: !1, line: 102, type: !300)
!544 = !DILocation(line: 102, column: 43, scope: !538)
!545 = !DILocalVariable(name: "file", arg: 3, scope: !538, file: !1, line: 102, type: !327)
!546 = !DILocation(line: 102, column: 61, scope: !538)
!547 = !DILocalVariable(name: "line", arg: 4, scope: !538, file: !1, line: 102, type: !292)
!548 = !DILocation(line: 102, column: 71, scope: !538)
!549 = !DILocalVariable(name: "function", arg: 5, scope: !538, file: !1, line: 103, type: !327)
!550 = !DILocation(line: 103, column: 19, scope: !538)
!551 = !DILocation(line: 105, column: 16, scope: !538)
!552 = !DILocation(line: 105, column: 3, scope: !538)
!553 = !DILocation(line: 109, column: 3, scope: !538)
!554 = !DILocation(line: 109, column: 13, scope: !538)
!555 = !DILocation(line: 111, column: 14, scope: !538)
!556 = !DILocation(line: 111, column: 3, scope: !538)
!557 = !DILocation(line: 112, column: 16, scope: !538)
!558 = !DILocation(line: 112, column: 22, scope: !538)
!559 = !DILocation(line: 112, column: 28, scope: !538)
!560 = !DILocation(line: 112, column: 3, scope: !538)
!561 = !DILocation(line: 113, column: 1, scope: !538)
!562 = distinct !DISubprogram(name: "_fatal_insn_not_found", scope: !1, file: !1, line: 116, type: !563, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !452)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !300, !327, !292, !327}
!565 = !DILocalVariable(name: "insn", arg: 1, scope: !562, file: !1, line: 116, type: !300)
!566 = !DILocation(line: 116, column: 34, scope: !562)
!567 = !DILocalVariable(name: "file", arg: 2, scope: !562, file: !1, line: 116, type: !327)
!568 = !DILocation(line: 116, column: 52, scope: !562)
!569 = !DILocalVariable(name: "line", arg: 3, scope: !562, file: !1, line: 116, type: !292)
!570 = !DILocation(line: 116, column: 62, scope: !562)
!571 = !DILocalVariable(name: "function", arg: 4, scope: !562, file: !1, line: 117, type: !327)
