; ModuleID = 'cfglayout.c'
source_filename = "cfglayout.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VEC_int_heap = type { %struct.VEC_int_base }
%struct.VEC_int_base = type { i32, i32, [1 x i32] }
%struct.VEC_tree_gc = type { %struct.VEC_tree_base }
%struct.VEC_tree_base = type { i32, i32, [1 x %union.tree_node*] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }
%struct.lang_decl = type opaque
%struct.rtx_def = type { i32, %union.u }

!728 = !DIEnumerator(name: "NOTE_INSN_BASIC_BLOCK", value: 10, isUnsigned: true)
!729 = !DIEnumerator(name: "NOTE_INSN_SWITCH_TEXT_SECTIONS", value: 11, isUnsigned: true)
!730 = !DIEnumerator(name: "NOTE_INSN_CFA_RESTORE_STATE", value: 12, isUnsigned: true)
!731 = !DIEnumerator(name: "NOTE_INSN_MAX", value: 13, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bb_flags", file: !148, line: 295, baseType: !7, size: 32, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!734 = !DIEnumerator(name: "BB_NEW", value: 1, isUnsigned: true)
!735 = !DIEnumerator(name: "BB_REACHABLE", value: 2, isUnsigned: true)
!736 = !DIEnumerator(name: "BB_IRREDUCIBLE_LOOP", value: 4, isUnsigned: true)
!737 = !DIEnumerator(name: "BB_SUPERBLOCK", value: 8, isUnsigned: true)
!738 = !DIEnumerator(name: "BB_DISABLE_SCHEDULE", value: 16, isUnsigned: true)
!739 = !DIEnumerator(name: "BB_HOT_PARTITION", value: 32, isUnsigned: true)
!740 = !DIEnumerator(name: "BB_COLD_PARTITION", value: 64, isUnsigned: true)
!741 = !DIEnumerator(name: "BB_DUPLICATED", value: 128, isUnsigned: true)
!742 = !DIEnumerator(name: "BB_NON_LOCAL_GOTO_TARGET", value: 256, isUnsigned: true)
!743 = !DIEnumerator(name: "BB_RTL", value: 512, isUnsigned: true)
!744 = !DIEnumerator(name: "BB_FORWARDER_BLOCK", value: 1024, isUnsigned: true)
!745 = !DIEnumerator(name: "BB_NONTHREADABLE_BLOCK", value: 2048, isUnsigned: true)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cdi_direction", file: !148, line: 912, baseType: !7, size: 32, elements: !747)
!747 = !{!748, !749}
!748 = !DIEnumerator(name: "CDI_DOMINATORS", value: 1, isUnsigned: true)
!749 = !DIEnumerator(name: "CDI_POST_DOMINATORS", value: 2, isUnsigned: true)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !574, line: 836, baseType: !7, size: 32, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!752 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!764 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!765 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!766 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!767 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!768 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!769 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!770 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!771 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!772 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!773 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!774 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!775 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!776 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!777 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!778 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!779 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!780 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!781 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!782 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!783 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!784 = !{!573, !785, !928, !1920, !1520, !1933, !7, !938, !817, !890, !840}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !786, line: 111, baseType: !787)
!786 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !789)
!789 = !{!790, !1887, !1888, !1889, !1890, !1894, !1895, !1896, !1914, !1915, !1916, !1917, !1918, !1919}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !788, file: !148, line: 219, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !793, file: !148, line: 151, baseType: !796, size: 128)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !797, file: !148, line: 150, baseType: !7, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !797, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !797, file: !148, line: 150, baseType: !802, size: 64, offset: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 64, elements: !855)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !786, line: 108, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !806)
!806 = !{!807, !808, !809, !1879, !1880, !1881, !1882, !1883, !1884, !1885}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !805, file: !148, line: 124, baseType: !787, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !805, file: !148, line: 125, baseType: !787, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !805, file: !148, line: 131, baseType: !810, size: 64, offset: 128)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !811)
!811 = !{!812, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !810, file: !148, line: 129, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !786, line: 66, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !786, line: 65, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !810, file: !148, line: 130, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !786, line: 50, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !574, line: 240, size: 384, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !819, file: !574, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !819, file: !574, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !819, file: !574, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !819, file: !574, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !819, file: !574, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !819, file: !574, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !819, file: !574, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !819, file: !574, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !819, file: !574, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !819, file: !574, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !819, file: !574, line: 321, baseType: !832, size: 320, offset: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !574, line: 315, size: 320, elements: !833)
!833 = !{!834, !1814, !1816, !1877, !1878}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !832, file: !574, line: 316, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 64, elements: !855)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !574, line: 183, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !574, line: 166, size: 64, elements: !838)
!838 = !{!839, !841, !842, !846, !847, !857, !858, !870, !873, !937, !1792, !1793, !1804, !1811}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !837, file: !574, line: 168, baseType: !840, size: 32)
!840 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !837, file: !574, line: 169, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !837, file: !574, line: 170, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !837, file: !574, line: 171, baseType: !817, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !837, file: !574, line: 172, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !786, line: 53, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !574, line: 359, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !850, file: !574, line: 360, baseType: !840, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !850, file: !574, line: 361, baseType: !854, size: 64, offset: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 64, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 1)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !837, file: !574, line: 173, baseType: !5, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !837, file: !574, line: 174, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !574, line: 133, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 115, size: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !860, file: !574, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !860, file: !574, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !860, file: !574, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !860, file: !574, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !860, file: !574, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !860, file: !574, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !860, file: !574, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !860, file: !574, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !837, file: !574, line: 175, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !574, line: 175, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !837, file: !574, line: 176, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !876, line: 75, size: 256, elements: !877)
!876 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!877 = !{!878, !893, !894, !895}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !875, file: !876, line: 76, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !876, line: 68, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !876, line: 63, size: 320, elements: !882)
!882 = !{!883, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !876, line: 64, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !881, file: !876, line: 65, baseType: !884, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !881, file: !876, line: 66, baseType: !7, size: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !881, file: !876, line: 67, baseType: !888, size: 128, offset: 192)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 128, elements: !891)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !876, line: 29, baseType: !890)
!890 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!891 = !{!892}
!892 = !DISubrange(count: 2)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !875, file: !876, line: 77, baseType: !879, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !875, file: !876, line: 78, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !875, file: !876, line: 79, baseType: !896, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !876, line: 49, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !876, line: 45, size: 832, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !898, file: !876, line: 46, baseType: !884, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !898, file: !876, line: 47, baseType: !874, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !898, file: !876, line: 48, baseType: !903, size: 704, offset: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !904, line: 164, size: 704, elements: !905)
!904 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!905 = !{!906, !908, !919, !920, !921, !922, !923, !924, !929, !933, !934, !935, !936}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !903, file: !904, line: 166, baseType: !907, size: 64)
!907 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !903, file: !904, line: 167, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !904, line: 157, size: 192, elements: !911)
!911 = !{!912, !914, !915}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !910, file: !904, line: 159, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !910, file: !904, line: 160, baseType: !909, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !910, file: !904, line: 161, baseType: !916, size: 32, offset: 128)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 32, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 4)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !903, file: !904, line: 168, baseType: !913, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !903, file: !904, line: 169, baseType: !913, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !903, file: !904, line: 170, baseType: !913, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !903, file: !904, line: 171, baseType: !907, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !903, file: !904, line: 172, baseType: !840, size: 32, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !903, file: !904, line: 176, baseType: !925, size: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!909, !928, !907}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !903, file: !904, line: 177, baseType: !930, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !928, !909}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !903, file: !904, line: 178, baseType: !928, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !903, file: !904, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !903, file: !904, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !903, file: !904, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !837, file: !574, line: 177, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !786, line: 56, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !941)
!941 = !{!942, !975, !981, !992, !1011, !1022, !1027, !1034, !1040, !1054, !1066, !1104, !1109, !1137, !1145, !1146, !1151, !1160, !1166, !1171, !1175, !1179, !1419, !1468, !1474, !1481, !1488, !1511, !1536, !1553, !1565, !1587, !1602, !1774}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !940, file: !164, line: 3372, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !943, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !943, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !943, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !943, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !943, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !943, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !943, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !943, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !943, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !943, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !943, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !943, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !943, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !943, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !943, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !943, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !943, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !943, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !943, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !943, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !943, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !943, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !943, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !943, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !943, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !943, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !943, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !943, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !943, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !943, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !164, line: 3373, baseType: !976, size: 192)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !976, file: !164, line: 403, baseType: !943, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !976, file: !164, line: 404, baseType: !938, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !976, file: !164, line: 405, baseType: !938, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !940, file: !164, line: 3374, baseType: !982, size: 320)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !164, line: 1385, baseType: !976, size: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !982, file: !164, line: 1386, baseType: !986, size: 128, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !987, line: 58, baseType: !988)
!987 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !987, line: 54, size: 128, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !988, file: !987, line: 56, baseType: !890, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !988, file: !987, line: 57, baseType: !907, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !940, file: !164, line: 3375, baseType: !993, size: 256)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !164, line: 1398, baseType: !976, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !993, file: !164, line: 1399, baseType: !997, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !999, line: 52, size: 256, elements: !1000)
!999 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !998, file: !999, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !998, file: !999, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !998, file: !999, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !998, file: !999, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !998, file: !999, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !998, file: !999, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !998, file: !999, line: 62, baseType: !1008, size: 192, offset: 64)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 192, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 3)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !940, file: !164, line: 3376, baseType: !1012, size: 256)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !164, line: 1409, baseType: !976, size: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1012, file: !164, line: 1410, baseType: !1016, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1018, line: 27, size: 192, elements: !1019)
!1018 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1017, file: !1018, line: 29, baseType: !986, size: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1017, file: !1018, line: 30, baseType: !5, size: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !940, file: !164, line: 3377, baseType: !1023, size: 256)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !164, line: 1438, baseType: !976, size: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1023, file: !164, line: 1439, baseType: !938, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !940, file: !164, line: 3378, baseType: !1028, size: 256)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !164, line: 1419, baseType: !976, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1028, file: !164, line: 1420, baseType: !840, size: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1028, file: !164, line: 1421, baseType: !1033, size: 8, offset: 224)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 8, elements: !855)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !940, file: !164, line: 3379, baseType: !1035, size: 320)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !164, line: 1429, baseType: !976, size: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1035, file: !164, line: 1430, baseType: !938, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1035, file: !164, line: 1431, baseType: !938, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !940, file: !164, line: 3380, baseType: !1041, size: 320)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !164, line: 1461, baseType: !976, size: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1041, file: !164, line: 1462, baseType: !1045, size: 128, offset: 192)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1046, line: 31, size: 128, elements: !1047)
!1046 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1047 = !{!1048, !1052, !1053}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1045, file: !1046, line: 32, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1051 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1045, file: !1046, line: 33, baseType: !7, size: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1045, file: !1046, line: 34, baseType: !7, size: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !940, file: !164, line: 3381, baseType: !1055, size: 384)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !1056)
!1056 = !{!1057, !1058, !1063, !1064, !1065}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1055, file: !164, line: 2508, baseType: !976, size: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1055, file: !164, line: 2509, baseType: !1059, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1060, line: 58, baseType: !1061)
!1060 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1062, line: 44, baseType: !7)
!1062 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1055, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1055, file: !164, line: 2511, baseType: !938, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1055, file: !164, line: 2512, baseType: !938, size: 64, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !940, file: !164, line: 3382, baseType: !1067, size: 896)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !164, line: 2653, baseType: !1055, size: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !164, line: 2654, baseType: !938, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1067, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1067, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1067, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1067, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1067, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1067, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1067, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1067, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1067, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1067, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1067, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1067, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1067, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1067, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1067, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1067, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1067, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1067, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1067, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1067, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1067, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1067, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1067, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1067, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1067, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1067, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1067, file: !164, line: 2705, baseType: !938, size: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1067, file: !164, line: 2706, baseType: !938, size: 64, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1067, file: !164, line: 2707, baseType: !938, size: 64, offset: 704)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1067, file: !164, line: 2708, baseType: !938, size: 64, offset: 768)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1067, file: !164, line: 2711, baseType: !1102, size: 64, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !940, file: !164, line: 3383, baseType: !1105, size: 960)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !164, line: 2757, baseType: !1067, size: 896)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1105, file: !164, line: 2758, baseType: !817, size: 64, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !940, file: !164, line: 3384, baseType: !1110, size: 1472)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1111)
!1111 = !{!1112, !1133, !1134, !1135, !1136}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !164, line: 3115, baseType: !1113, size: 1216)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !164, line: 2985, baseType: !1105, size: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1113, file: !164, line: 2986, baseType: !938, size: 64, offset: 960)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1113, file: !164, line: 2987, baseType: !938, size: 64, offset: 1024)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1113, file: !164, line: 2988, baseType: !938, size: 64, offset: 1088)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1113, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1113, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1113, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1113, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1113, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1113, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1113, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1113, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1113, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1113, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1113, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1113, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1113, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1113, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1110, file: !164, line: 3117, baseType: !938, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1110, file: !164, line: 3119, baseType: !938, size: 64, offset: 1280)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1110, file: !164, line: 3121, baseType: !938, size: 64, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1110, file: !164, line: 3123, baseType: !938, size: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !940, file: !164, line: 3385, baseType: !1138, size: 1088)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1139)
!1139 = !{!1140, !1141, !1142}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !164, line: 2875, baseType: !1105, size: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1138, file: !164, line: 2876, baseType: !817, size: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1138, file: !164, line: 2877, baseType: !1143, size: 64, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !940, file: !164, line: 3386, baseType: !1113, size: 1216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !940, file: !164, line: 3387, baseType: !1147, size: 1280)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !164, line: 3094, baseType: !1113, size: 1216)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1147, file: !164, line: 3095, baseType: !1143, size: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !940, file: !164, line: 3388, baseType: !1152, size: 1216)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !164, line: 2825, baseType: !1067, size: 896)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1152, file: !164, line: 2827, baseType: !938, size: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1152, file: !164, line: 2828, baseType: !938, size: 64, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1152, file: !164, line: 2829, baseType: !938, size: 64, offset: 1024)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1152, file: !164, line: 2830, baseType: !938, size: 64, offset: 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1152, file: !164, line: 2831, baseType: !938, size: 64, offset: 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !940, file: !164, line: 3389, baseType: !1161, size: 1024)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !164, line: 2851, baseType: !1105, size: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1161, file: !164, line: 2852, baseType: !840, size: 32, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1161, file: !164, line: 2853, baseType: !840, size: 32, offset: 992)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !940, file: !164, line: 3390, baseType: !1167, size: 1024)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !164, line: 2858, baseType: !1105, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1167, file: !164, line: 2859, baseType: !1143, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !940, file: !164, line: 3391, baseType: !1172, size: 960)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1173)
!1173 = !{!1174}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1172, file: !164, line: 2863, baseType: !1105, size: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !940, file: !164, line: 3392, baseType: !1176, size: 1472)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1177)
!1177 = !{!1178}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1176, file: !164, line: 3305, baseType: !1110, size: 1472)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !940, file: !164, line: 3393, baseType: !1180, size: 1792)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1181)
!1181 = !{!1182, !1183, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1180, file: !164, line: 3249, baseType: !1110, size: 1472)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1180, file: !164, line: 3251, baseType: !1184, size: 64, offset: 1472)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1186, line: 463, size: 1152, elements: !1187)
!1186 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1187 = !{!1188, !1191, !1221, !1222, !1225, !1342, !1343, !1344, !1345, !1346, !1347, !1371, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1185, file: !1186, line: 464, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1186, line: 464, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1185, file: !1186, line: 467, baseType: !1192, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1210, !1211, !1212, !1213, !1214, !1215, !1217, !1219, !1220}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1193, file: !148, line: 377, baseType: !785, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1193, file: !148, line: 378, baseType: !785, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1193, file: !148, line: 381, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1201)
!1201 = !{!1202}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1200, file: !148, line: 282, baseType: !1203, size: 128)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1204, file: !148, line: 281, baseType: !7, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1204, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1204, file: !148, line: 281, baseType: !1209, size: 64, offset: 64)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 64, elements: !855)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1193, file: !148, line: 384, baseType: !840, size: 32, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1193, file: !148, line: 387, baseType: !840, size: 32, offset: 224)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1193, file: !148, line: 390, baseType: !840, size: 32, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1193, file: !148, line: 394, baseType: !1198, size: 64, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1193, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1193, file: !148, line: 399, baseType: !1216, size: 64, offset: 416)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !891)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1193, file: !148, line: 402, baseType: !1218, size: 64, offset: 480)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !891)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1193, file: !148, line: 406, baseType: !840, size: 32, offset: 544)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1193, file: !148, line: 409, baseType: !840, size: 32, offset: 576)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1185, file: !1186, line: 470, baseType: !814, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1185, file: !1186, line: 473, baseType: !1223, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1186, line: 166, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1185, file: !1186, line: 476, baseType: !1226, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1228)
!1228 = !{!1229, !1230, !1289, !1341}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1227, file: !135, line: 189, baseType: !840, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1227, file: !135, line: 192, baseType: !1231, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1234)
!1234 = !{!1235}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1233, file: !135, line: 87, baseType: !1236, size: 128)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1238)
!1238 = !{!1239, !1240, !1241}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1237, file: !135, line: 85, baseType: !7, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1237, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1237, file: !135, line: 85, baseType: !1242, size: 64, offset: 64)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 64, elements: !855)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1279, !1287, !1288}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1245, file: !135, line: 102, baseType: !840, size: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1245, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1245, file: !135, line: 108, baseType: !787, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1245, file: !135, line: 111, baseType: !787, size: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1245, file: !135, line: 114, baseType: !1252, size: 64, offset: 192)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1252, file: !135, line: 42, baseType: !134, size: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1252, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1245, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1245, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1245, file: !135, line: 123, baseType: !1231, size: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1245, file: !135, line: 126, baseType: !1244, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1245, file: !135, line: 129, baseType: !1244, size: 64, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1245, file: !135, line: 132, baseType: !928, size: 64, offset: 512)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1245, file: !135, line: 139, baseType: !938, size: 64, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1245, file: !135, line: 143, baseType: !986, size: 128, offset: 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1245, file: !135, line: 146, baseType: !986, size: 128, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1245, file: !135, line: 148, baseType: !1051, size: 8, offset: 896)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1245, file: !135, line: 149, baseType: !1051, size: 8, offset: 904)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1245, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1245, file: !135, line: 156, baseType: !1269, size: 64, offset: 960)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1271)
!1271 = !{!1272, !1276, !1277, !1278}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1270, file: !135, line: 50, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !786, line: 58, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !786, line: 57, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1270, file: !135, line: 59, baseType: !986, size: 128, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1270, file: !135, line: 64, baseType: !1051, size: 8, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1270, file: !135, line: 67, baseType: !1269, size: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1245, file: !135, line: 159, baseType: !1280, size: 64, offset: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1281, file: !135, line: 74, baseType: !804, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1281, file: !135, line: 77, baseType: !1280, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1281, file: !135, line: 78, baseType: !1280, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1281, file: !135, line: 81, baseType: !1280, size: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1245, file: !135, line: 162, baseType: !1051, size: 8, offset: 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1245, file: !135, line: 166, baseType: !938, size: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1227, file: !135, line: 197, baseType: !1290, size: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1291, line: 144, baseType: !1292)
!1291 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1291, line: 100, size: 896, elements: !1294)
!1294 = !{!1295, !1303, !1308, !1313, !1315, !1318, !1319, !1320, !1321, !1322, !1327, !1329, !1330, !1335, !1340}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1293, file: !1291, line: 102, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1291, line: 52, baseType: !1297)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!1300, !1301}
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1291, line: 47, baseType: !7)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1293, file: !1291, line: 105, baseType: !1304, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1291, line: 59, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!840, !1301, !1301}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1293, file: !1291, line: 108, baseType: !1309, size: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1291, line: 63, baseType: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{null, !928}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1293, file: !1291, line: 111, baseType: !1314, size: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1293, file: !1291, line: 114, baseType: !1316, size: 64, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1317, line: 46, baseType: !890)
!1317 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1293, file: !1291, line: 117, baseType: !1316, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1293, file: !1291, line: 120, baseType: !1316, size: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1293, file: !1291, line: 124, baseType: !7, size: 32, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1293, file: !1291, line: 128, baseType: !7, size: 32, offset: 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1293, file: !1291, line: 131, baseType: !1323, size: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1291, line: 75, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!928, !1316, !1316}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1293, file: !1291, line: 132, baseType: !1328, size: 64, offset: 576)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1291, line: 78, baseType: !1310)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1293, file: !1291, line: 135, baseType: !928, size: 64, offset: 640)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1293, file: !1291, line: 136, baseType: !1331, size: 64, offset: 704)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1291, line: 82, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!928, !928, !1316, !1316}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1293, file: !1291, line: 137, baseType: !1336, size: 64, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1291, line: 83, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !928, !928}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1293, file: !1291, line: 141, baseType: !7, size: 32, offset: 832)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1227, file: !135, line: 200, baseType: !1244, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1185, file: !1186, line: 479, baseType: !1290, size: 64, offset: 320)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1185, file: !1186, line: 484, baseType: !938, size: 64, offset: 384)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1185, file: !1186, line: 488, baseType: !938, size: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1185, file: !1186, line: 493, baseType: !938, size: 64, offset: 512)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1185, file: !1186, line: 496, baseType: !938, size: 64, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1185, file: !1186, line: 501, baseType: !1348, size: 64, offset: 640)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1350)
!1350 = !{!1351, !1354, !1355, !1356, !1357, !1359, !1360, !1365, !1366, !1367, !1368, !1369, !1370}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1349, file: !159, line: 2356, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1349, file: !159, line: 2357, baseType: !843, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1349, file: !159, line: 2358, baseType: !840, size: 32, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1349, file: !159, line: 2359, baseType: !840, size: 32, offset: 160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1349, file: !159, line: 2360, baseType: !1358, size: 128, offset: 192)
!1358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 128, elements: !917)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1349, file: !159, line: 2364, baseType: !840, size: 32, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1349, file: !159, line: 2367, baseType: !1361, size: 128, offset: 384)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1361, file: !159, line: 2351, baseType: !817, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1361, file: !159, line: 2352, baseType: !907, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1349, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1349, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1349, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1349, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1349, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1349, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1185, file: !1186, line: 504, baseType: !1372, size: 64, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1186, line: 504, flags: DIFlagFwdDecl)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1185, file: !1186, line: 507, baseType: !1290, size: 64, offset: 768)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1185, file: !1186, line: 510, baseType: !840, size: 32, offset: 832)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1185, file: !1186, line: 513, baseType: !840, size: 32, offset: 864)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1185, file: !1186, line: 516, baseType: !1059, size: 32, offset: 896)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1185, file: !1186, line: 519, baseType: !1059, size: 32, offset: 928)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1185, file: !1186, line: 522, baseType: !7, size: 32, offset: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1185, file: !1186, line: 523, baseType: !7, size: 32, offset: 992)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1185, file: !1186, line: 528, baseType: !843, size: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1185, file: !1186, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1185, file: !1186, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1185, file: !1186, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1185, file: !1186, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1185, file: !1186, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1185, file: !1186, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1185, file: !1186, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1185, file: !1186, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1185, file: !1186, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1185, file: !1186, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1185, file: !1186, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1185, file: !1186, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1185, file: !1186, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1185, file: !1186, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1185, file: !1186, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1185, file: !1186, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1180, file: !164, line: 3254, baseType: !938, size: 64, offset: 1536)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1180, file: !164, line: 3257, baseType: !938, size: 64, offset: 1600)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1180, file: !164, line: 3258, baseType: !938, size: 64, offset: 1664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1180, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1180, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1180, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1180, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1180, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1180, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1180, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1180, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1180, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1180, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1180, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1180, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1180, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1180, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1180, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1180, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1180, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1180, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !940, file: !164, line: 3394, baseType: !1420, size: 1344)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1447, !1448, !1449, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1420, file: !164, line: 2280, baseType: !976, size: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1420, file: !164, line: 2281, baseType: !938, size: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1420, file: !164, line: 2282, baseType: !938, size: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1420, file: !164, line: 2283, baseType: !938, size: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1420, file: !164, line: 2284, baseType: !938, size: 64, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1420, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1420, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1420, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1420, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1420, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1420, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1420, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1420, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1420, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1420, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1420, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1420, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1420, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1420, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1420, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1420, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1420, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1420, file: !164, line: 2306, baseType: !1445, size: 32, offset: 544)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1446, line: 31, baseType: !840)
!1446 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1420, file: !164, line: 2307, baseType: !938, size: 64, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1420, file: !164, line: 2308, baseType: !938, size: 64, offset: 640)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1420, file: !164, line: 2314, baseType: !1450, size: 64, offset: 704)
!1450 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1451)
!1451 = !{!1452, !1453, !1454}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1450, file: !164, line: 2310, baseType: !840, size: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1450, file: !164, line: 2311, baseType: !843, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1450, file: !164, line: 2312, baseType: !1455, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1420, file: !164, line: 2315, baseType: !938, size: 64, offset: 768)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1420, file: !164, line: 2316, baseType: !938, size: 64, offset: 832)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1420, file: !164, line: 2317, baseType: !938, size: 64, offset: 896)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1420, file: !164, line: 2318, baseType: !938, size: 64, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1420, file: !164, line: 2319, baseType: !938, size: 64, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1420, file: !164, line: 2320, baseType: !938, size: 64, offset: 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1420, file: !164, line: 2321, baseType: !938, size: 64, offset: 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1420, file: !164, line: 2322, baseType: !938, size: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1420, file: !164, line: 2324, baseType: !1466, size: 64, offset: 1280)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !940, file: !164, line: 3395, baseType: !1469, size: 320)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1470)
!1470 = !{!1471, !1472, !1473}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1469, file: !164, line: 1470, baseType: !976, size: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1469, file: !164, line: 1471, baseType: !938, size: 64, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1469, file: !164, line: 1472, baseType: !938, size: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !940, file: !164, line: 3396, baseType: !1475, size: 320)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1476)
!1476 = !{!1477, !1478, !1479}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1475, file: !164, line: 1483, baseType: !976, size: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1475, file: !164, line: 1484, baseType: !840, size: 32, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1475, file: !164, line: 1485, baseType: !1480, size: 64, offset: 256)
!1480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 64, elements: !855)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !940, file: !164, line: 3397, baseType: !1482, size: 384)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !164, line: 1829, size: 384, elements: !1483)
!1483 = !{!1484, !1485, !1486, !1487}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1482, file: !164, line: 1830, baseType: !976, size: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1482, file: !164, line: 1831, baseType: !1059, size: 32, offset: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1482, file: !164, line: 1832, baseType: !938, size: 64, offset: 256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1482, file: !164, line: 1835, baseType: !1480, size: 64, offset: 320)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !940, file: !164, line: 3398, baseType: !1489, size: 704)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !164, line: 1898, size: 704, elements: !1490)
!1490 = !{!1491, !1492, !1493, !1494, !1495, !1498}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1489, file: !164, line: 1899, baseType: !976, size: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1489, file: !164, line: 1902, baseType: !938, size: 64, offset: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1489, file: !164, line: 1905, baseType: !1273, size: 64, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1489, file: !164, line: 1908, baseType: !7, size: 32, offset: 320)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1489, file: !164, line: 1911, baseType: !1496, size: 64, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !164, line: 1876, flags: DIFlagFwdDecl)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1489, file: !164, line: 1914, baseType: !1499, size: 256, offset: 448)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1500)
!1500 = !{!1501, !1503, !1504, !1509}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1499, file: !164, line: 1884, baseType: !1502, size: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1499, file: !164, line: 1885, baseType: !1502, size: 64, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1499, file: !164, line: 1891, baseType: !1505, size: 64, offset: 128)
!1505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1499, file: !164, line: 1891, size: 64, elements: !1506)
!1506 = !{!1507, !1508}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1505, file: !164, line: 1891, baseType: !1273, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1505, file: !164, line: 1891, baseType: !938, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1499, file: !164, line: 1892, baseType: !1510, size: 64, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !940, file: !164, line: 3399, baseType: !1512, size: 704)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !164, line: 2008, size: 704, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517, !1518, !1519, !1531, !1532, !1533, !1534, !1535}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1512, file: !164, line: 2009, baseType: !976, size: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1512, file: !164, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1512, file: !164, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1512, file: !164, line: 2014, baseType: !1059, size: 32, offset: 224)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1512, file: !164, line: 2016, baseType: !938, size: 64, offset: 256)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1512, file: !164, line: 2017, baseType: !1520, size: 64, offset: 320)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1523)
!1523 = !{!1524}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1522, file: !164, line: 183, baseType: !1525, size: 128)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1526)
