; ModuleID = 'c-ppoutput.c'
source_filename = "c-ppoutput.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.3 = type { %struct._IO_FILE*, %struct.cpp_token*, %struct.cpp_token*, i32, i8, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cpp_token = type { i32, i8, i16, %union.cpp_token_u }
%union.cpp_token_u = type { %struct.cpp_string }
%struct.cpp_string = type { i32, i8* }

!65 = !DIEnumerator(name: "CPP_COMPL", value: 14, isUnsigned: true)
!66 = !DIEnumerator(name: "CPP_AND_AND", value: 15, isUnsigned: true)
!67 = !DIEnumerator(name: "CPP_OR_OR", value: 16, isUnsigned: true)
!68 = !DIEnumerator(name: "CPP_QUERY", value: 17, isUnsigned: true)
!69 = !DIEnumerator(name: "CPP_COLON", value: 18, isUnsigned: true)
!70 = !DIEnumerator(name: "CPP_COMMA", value: 19, isUnsigned: true)
!71 = !DIEnumerator(name: "CPP_OPEN_PAREN", value: 20, isUnsigned: true)
!72 = !DIEnumerator(name: "CPP_CLOSE_PAREN", value: 21, isUnsigned: true)
!73 = !DIEnumerator(name: "CPP_EOF", value: 22, isUnsigned: true)
!74 = !DIEnumerator(name: "CPP_EQ_EQ", value: 23, isUnsigned: true)
!75 = !DIEnumerator(name: "CPP_NOT_EQ", value: 24, isUnsigned: true)
!76 = !DIEnumerator(name: "CPP_GREATER_EQ", value: 25, isUnsigned: true)
!77 = !DIEnumerator(name: "CPP_LESS_EQ", value: 26, isUnsigned: true)
!78 = !DIEnumerator(name: "CPP_PLUS_EQ", value: 27, isUnsigned: true)
!79 = !DIEnumerator(name: "CPP_MINUS_EQ", value: 28, isUnsigned: true)
!80 = !DIEnumerator(name: "CPP_MULT_EQ", value: 29, isUnsigned: true)
!81 = !DIEnumerator(name: "CPP_DIV_EQ", value: 30, isUnsigned: true)
!82 = !DIEnumerator(name: "CPP_MOD_EQ", value: 31, isUnsigned: true)
!83 = !DIEnumerator(name: "CPP_AND_EQ", value: 32, isUnsigned: true)
!84 = !DIEnumerator(name: "CPP_OR_EQ", value: 33, isUnsigned: true)
!85 = !DIEnumerator(name: "CPP_XOR_EQ", value: 34, isUnsigned: true)
!86 = !DIEnumerator(name: "CPP_RSHIFT_EQ", value: 35, isUnsigned: true)
!87 = !DIEnumerator(name: "CPP_LSHIFT_EQ", value: 36, isUnsigned: true)
!88 = !DIEnumerator(name: "CPP_HASH", value: 37, isUnsigned: true)
!89 = !DIEnumerator(name: "CPP_PASTE", value: 38, isUnsigned: true)
!90 = !DIEnumerator(name: "CPP_OPEN_SQUARE", value: 39, isUnsigned: true)
!91 = !DIEnumerator(name: "CPP_CLOSE_SQUARE", value: 40, isUnsigned: true)
!92 = !DIEnumerator(name: "CPP_OPEN_BRACE", value: 41, isUnsigned: true)
!93 = !DIEnumerator(name: "CPP_CLOSE_BRACE", value: 42, isUnsigned: true)
!94 = !DIEnumerator(name: "CPP_SEMICOLON", value: 43, isUnsigned: true)
!95 = !DIEnumerator(name: "CPP_ELLIPSIS", value: 44, isUnsigned: true)
!96 = !DIEnumerator(name: "CPP_PLUS_PLUS", value: 45, isUnsigned: true)
!97 = !DIEnumerator(name: "CPP_MINUS_MINUS", value: 46, isUnsigned: true)
!98 = !DIEnumerator(name: "CPP_DEREF", value: 47, isUnsigned: true)
!99 = !DIEnumerator(name: "CPP_DOT", value: 48, isUnsigned: true)
!100 = !DIEnumerator(name: "CPP_SCOPE", value: 49, isUnsigned: true)
!101 = !DIEnumerator(name: "CPP_DEREF_STAR", value: 50, isUnsigned: true)
!102 = !DIEnumerator(name: "CPP_DOT_STAR", value: 51, isUnsigned: true)
!103 = !DIEnumerator(name: "CPP_ATSIGN", value: 52, isUnsigned: true)
!104 = !DIEnumerator(name: "CPP_NAME", value: 53, isUnsigned: true)
!105 = !DIEnumerator(name: "CPP_AT_NAME", value: 54, isUnsigned: true)
!106 = !DIEnumerator(name: "CPP_NUMBER", value: 55, isUnsigned: true)
!107 = !DIEnumerator(name: "CPP_CHAR", value: 56, isUnsigned: true)
!108 = !DIEnumerator(name: "CPP_WCHAR", value: 57, isUnsigned: true)
!109 = !DIEnumerator(name: "CPP_CHAR16", value: 58, isUnsigned: true)
!110 = !DIEnumerator(name: "CPP_CHAR32", value: 59, isUnsigned: true)
!111 = !DIEnumerator(name: "CPP_OTHER", value: 60, isUnsigned: true)
!112 = !DIEnumerator(name: "CPP_STRING", value: 61, isUnsigned: true)
!113 = !DIEnumerator(name: "CPP_WSTRING", value: 62, isUnsigned: true)
!114 = !DIEnumerator(name: "CPP_STRING16", value: 63, isUnsigned: true)
!115 = !DIEnumerator(name: "CPP_STRING32", value: 64, isUnsigned: true)
!116 = !DIEnumerator(name: "CPP_UTF8STRING", value: 65, isUnsigned: true)
!117 = !DIEnumerator(name: "CPP_OBJC_STRING", value: 66, isUnsigned: true)
!118 = !DIEnumerator(name: "CPP_HEADER_NAME", value: 67, isUnsigned: true)
!119 = !DIEnumerator(name: "CPP_COMMENT", value: 68, isUnsigned: true)
!120 = !DIEnumerator(name: "CPP_MACRO_ARG", value: 69, isUnsigned: true)
!121 = !DIEnumerator(name: "CPP_PRAGMA", value: 70, isUnsigned: true)
!122 = !DIEnumerator(name: "CPP_PRAGMA_EOL", value: 71, isUnsigned: true)
!123 = !DIEnumerator(name: "CPP_PADDING", value: 72, isUnsigned: true)
!124 = !DIEnumerator(name: "N_TTYPES", value: 73, isUnsigned: true)
!125 = !DIEnumerator(name: "CPP_LAST_EQ", value: 13, isUnsigned: true)
!126 = !DIEnumerator(name: "CPP_FIRST_DIGRAPH", value: 37, isUnsigned: true)
!127 = !DIEnumerator(name: "CPP_LAST_PUNCTUATOR", value: 52, isUnsigned: true)
!128 = !DIEnumerator(name: "CPP_LAST_CPP_OP", value: 26, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "node_type", file: !6, line: 584, baseType: !7, size: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "NT_VOID", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "NT_MACRO", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "NT_ASSERTION", value: 2, isUnsigned: true)
!134 = !{!135, !136, !138, !140, !143}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "macro_queue", file: !3, line: 54, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macro_queue", file: !3, line: 48, size: 128, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !3, line: 50, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !145, file: !3, line: 51, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!151 = !{!0, !152, !154}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "define_queue", scope: !2, file: !3, line: 55, type: !143, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "undef_queue", scope: !2, file: !3, line: 55, type: !143, isLocal: true, isDefinition: true)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 36, size: 256, elements: !157)
!157 = !{!158, !219, !300, !301, !302, !303}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "outf", scope: !156, file: !3, line: 38, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !161, line: 7, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !163, line: 49, size: 1728, elements: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!164 = !{!165, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !181, !183, !184, !185, !189, !191, !193, !197, !200, !202, !205, !208, !209, !210, !214, !215}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !162, file: !163, line: 51, baseType: !166, size: 32)
!166 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !162, file: !163, line: 54, baseType: !150, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !162, file: !163, line: 55, baseType: !150, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !162, file: !163, line: 56, baseType: !150, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !162, file: !163, line: 57, baseType: !150, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !162, file: !163, line: 58, baseType: !150, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !162, file: !163, line: 59, baseType: !150, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !162, file: !163, line: 60, baseType: !150, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !162, file: !163, line: 61, baseType: !150, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !162, file: !163, line: 64, baseType: !150, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !162, file: !163, line: 65, baseType: !150, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !162, file: !163, line: 66, baseType: !150, size: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !162, file: !163, line: 68, baseType: !179, size: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !163, line: 36, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !162, file: !163, line: 70, baseType: !182, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !162, file: !163, line: 72, baseType: !166, size: 32, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !162, file: !163, line: 73, baseType: !166, size: 32, offset: 928)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !162, file: !163, line: 74, baseType: !186, size: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !187, line: 152, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!188 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !162, file: !163, line: 77, baseType: !190, size: 16, offset: 1024)
!190 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !162, file: !163, line: 78, baseType: !192, size: 8, offset: 1040)
!192 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !162, file: !163, line: 79, baseType: !194, size: 8, offset: 1048)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 1)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !162, file: !163, line: 81, baseType: !198, size: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !163, line: 43, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !162, file: !163, line: 89, baseType: !201, size: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !187, line: 153, baseType: !188)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !162, file: !163, line: 91, baseType: !203, size: 64, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !163, line: 37, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !162, file: !163, line: 92, baseType: !206, size: 64, offset: 1280)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !163, line: 38, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !162, file: !163, line: 93, baseType: !182, size: 64, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !162, file: !163, line: 94, baseType: !135, size: 64, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !162, file: !163, line: 95, baseType: !211, size: 64, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !212, line: 46, baseType: !213)
!212 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!213 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !162, file: !163, line: 96, baseType: !166, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !162, file: !163, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !3, line: 39, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_token", file: !6, line: 34, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_token", file: !6, line: 212, size: 192, elements: !224)
!224 = !{!225, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "src_loc", scope: !223, file: !6, line: 213, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !43, line: 44, baseType: !7)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !6, line: 214, baseType: !7, size: 8, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !6, line: 215, baseType: !190, size: 16, offset: 48)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !6, line: 237, baseType: !230, size: 128, offset: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_token_u", file: !6, line: 217, size: 128, elements: !231)
!231 = !{!232, !288, !289, !294, !298, !299}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !230, file: !6, line: 220, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_identifier", file: !6, line: 201, size: 64, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !233, file: !6, line: 207, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_hashnode", file: !6, line: 36, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_hashnode", file: !6, line: 644, size: 256, elements: !239)
!239 = !{!240, !247, !248, !249, !250, !251, !252}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !238, file: !6, line: 645, baseType: !241, size: 128)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !242, line: 31, size: 128, elements: !243)
!242 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !{!244, !245, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !241, file: !242, line: 32, baseType: !138, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !241, file: !242, line: 33, baseType: !7, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !241, file: !242, line: 34, baseType: !7, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "is_directive", scope: !238, file: !6, line: 646, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "directive_index", scope: !238, file: !6, line: 647, baseType: !7, size: 7, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rid_code", scope: !238, file: !6, line: 650, baseType: !137, size: 8, offset: 136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !6, line: 651, baseType: !7, size: 6, offset: 144, flags: DIFlagBitField, extraData: i64 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !6, line: 652, baseType: !7, size: 10, offset: 150, flags: DIFlagBitField, extraData: i64 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !6, line: 654, baseType: !253, size: 64, offset: 192)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_cpp_hashnode_value", file: !6, line: 633, size: 64, elements: !254)
!254 = !{!255, !278, !286, !287}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !253, file: !6, line: 635, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_macro", file: !6, line: 37, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro", file: !259, line: 36, size: 256, elements: !260)
!259 = !DIFile(filename: "./cpp-id-data.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !263, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !258, file: !259, line: 42, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !258, file: !259, line: 51, baseType: !264, size: 64, offset: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cpp_macro_u", file: !259, line: 47, size: 64, elements: !265)
!265 = !{!266, !268}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !264, file: !259, line: 49, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !264, file: !259, line: 50, baseType: !138, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !258, file: !259, line: 54, baseType: !226, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !258, file: !259, line: 57, baseType: !7, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "paramc", scope: !258, file: !259, line: 60, baseType: !190, size: 16, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fun_like", scope: !258, file: !259, line: 63, baseType: !7, size: 1, offset: 208, flags: DIFlagBitField, extraData: i64 208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "variadic", scope: !258, file: !259, line: 66, baseType: !7, size: 1, offset: 209, flags: DIFlagBitField, extraData: i64 208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "syshdr", scope: !258, file: !259, line: 69, baseType: !7, size: 1, offset: 210, flags: DIFlagBitField, extraData: i64 208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !258, file: !259, line: 72, baseType: !7, size: 1, offset: 211, flags: DIFlagBitField, extraData: i64 208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !258, file: !259, line: 75, baseType: !7, size: 1, offset: 212, flags: DIFlagBitField, extraData: i64 208)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "extra_tokens", scope: !258, file: !259, line: 80, baseType: !7, size: 1, offset: 213, flags: DIFlagBitField, extraData: i64 208)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "answers", scope: !253, file: !6, line: 637, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "answer", file: !259, line: 28, size: 320, elements: !281)
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !259, line: 29, baseType: !279, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !280, file: !259, line: 30, baseType: !7, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !280, file: !259, line: 31, baseType: !285, size: 192, offset: 128)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 192, elements: !195)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "builtin", scope: !253, file: !6, line: 639, baseType: !5, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !253, file: !6, line: 641, baseType: !190, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !230, file: !6, line: 223, baseType: !267, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !230, file: !6, line: 226, baseType: !290, size: 128)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_string", file: !6, line: 162, size: 128, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !290, file: !6, line: 163, baseType: !7, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !290, file: !6, line: 164, baseType: !138, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "macro_arg", scope: !230, file: !6, line: 229, baseType: !295, size: 32)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_macro_arg", file: !6, line: 195, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arg_no", scope: !295, file: !6, line: 197, baseType: !7, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "token_no", scope: !230, file: !6, line: 233, baseType: !7, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pragma", scope: !230, file: !6, line: 236, baseType: !7, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !156, file: !3, line: 40, baseType: !220, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "src_line", scope: !156, file: !3, line: 41, baseType: !166, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !156, file: !3, line: 42, baseType: !137, size: 8, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "first_time", scope: !156, file: !3, line: 43, baseType: !137, size: 8, offset: 232)
!304 = !{i32 7, !"Dwarf Version", i32 4}
!305 = !{i32 2, !"Debug Info Version", i32 3}
!306 = !{i32 1, !"wchar_size", i32 4}
!307 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!308 = distinct !DISubprogram(name: "preprocess_file", scope: !3, file: !3, line: 87, type: !309, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !831)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_reader", file: !6, line: 31, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_reader", file: !314, line: 322, size: 10112, elements: !315)
!314 = !DIFile(filename: "./internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!315 = !{!316, !388, !389, !406, !436, !437, !447, !448, !449, !477, !479, !483, !484, !485, !486, !487, !488, !489, !490, !491, !540, !541, !544, !545, !577, !578, !579, !582, !583, !584, !585, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !611, !612, !613, !616, !696, !722, !725, !726, !789, !796, !797, !804, !805, !806, !807, !810, !811, !824}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !313, file: !314, line: 325, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_buffer", file: !6, line: 32, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_buffer", file: !314, line: 249, size: 1472, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !333, !334, !335, !336, !338, !341, !342, !345, !346, !347, !348, !349, !350, !375}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !319, file: !314, line: 251, baseType: !138, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "line_base", scope: !319, file: !314, line: 252, baseType: !138, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !319, file: !314, line: 253, baseType: !138, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !319, file: !314, line: 255, baseType: !138, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !319, file: !314, line: 256, baseType: !138, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "notes", scope: !319, file: !314, line: 258, baseType: !327, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_line_note", file: !314, line: 235, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_line_note", file: !314, line: 236, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !329, file: !314, line: 239, baseType: !138, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !314, line: 245, baseType: !7, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cur_note", scope: !319, file: !314, line: 259, baseType: !7, size: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "notes_used", scope: !319, file: !314, line: 260, baseType: !7, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "notes_cap", scope: !319, file: !314, line: 261, baseType: !7, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !314, line: 263, baseType: !337, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !319, file: !314, line: 267, baseType: !339, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_file", file: !6, line: 42, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !319, file: !314, line: 271, baseType: !138, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "if_stack", scope: !319, file: !314, line: 275, baseType: !343, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "if_stack", file: !314, line: 275, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "need_line", scope: !319, file: !314, line: 278, baseType: !137, size: 8, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "warned_cplusplus_comments", scope: !319, file: !314, line: 284, baseType: !7, size: 1, offset: 776, flags: DIFlagBitField, extraData: i64 776)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "from_stage3", scope: !319, file: !314, line: 289, baseType: !7, size: 1, offset: 777, flags: DIFlagBitField, extraData: i64 776)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "return_at_eof", scope: !319, file: !314, line: 294, baseType: !7, size: 1, offset: 778, flags: DIFlagBitField, extraData: i64 776)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !319, file: !314, line: 298, baseType: !137, size: 8, offset: 784)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !319, file: !314, line: 302, baseType: !351, size: 512, offset: 832)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_dir", file: !6, line: 523, size: 512, elements: !352)
!352 = !{!353, !355, !356, !357, !358, !359, !360, !362, !368, !372}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !6, line: 526, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !6, line: 529, baseType: !150, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !351, file: !6, line: 530, baseType: !7, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !351, file: !6, line: 534, baseType: !137, size: 8, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "user_supplied_p", scope: !351, file: !6, line: 537, baseType: !137, size: 8, offset: 168)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "canonical_name", scope: !351, file: !6, line: 541, baseType: !150, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name_map", scope: !351, file: !6, line: 545, baseType: !361, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "construct", scope: !351, file: !6, line: 551, baseType: !363, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!150, !140, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_dir", file: !6, line: 39, baseType: !351)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !351, file: !6, line: 555, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !370, line: 47, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !187, line: 148, baseType: !213)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !351, file: !6, line: 556, baseType: !373, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !370, line: 59, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !187, line: 145, baseType: !213)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "input_cset_desc", scope: !319, file: !314, line: 306, baseType: !376, size: 128, offset: 1344)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cset_converter", file: !314, line: 47, size: 128, elements: !377)
!377 = !{!378, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !376, file: !314, line: 49, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "convert_f", file: !314, line: 45, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!137, !383, !138, !211, !384}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !314, line: 33, baseType: !166)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_strbuf", file: !314, line: 43, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !376, file: !314, line: 50, baseType: !383, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !376, file: !314, line: 51, baseType: !166, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "overlaid_buffer", scope: !313, file: !314, line: 328, baseType: !317, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !314, line: 331, baseType: !390, size: 160, offset: 128)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lexer_state", file: !314, line: 177, size: 160, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "in_directive", scope: !390, file: !314, line: 180, baseType: !137, size: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "directive_wants_padding", scope: !390, file: !314, line: 185, baseType: !137, size: 8, offset: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "skipping", scope: !390, file: !314, line: 188, baseType: !137, size: 8, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "angled_headers", scope: !390, file: !314, line: 191, baseType: !137, size: 8, offset: 24)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "in_expression", scope: !390, file: !314, line: 194, baseType: !137, size: 8, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "save_comments", scope: !390, file: !314, line: 198, baseType: !137, size: 8, offset: 40)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "va_args_ok", scope: !390, file: !314, line: 201, baseType: !137, size: 8, offset: 48)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned_ok", scope: !390, file: !314, line: 204, baseType: !137, size: 8, offset: 56)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prevent_expansion", scope: !390, file: !314, line: 207, baseType: !137, size: 8, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parsing_args", scope: !390, file: !314, line: 210, baseType: !137, size: 8, offset: 72)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "discarding_output", scope: !390, file: !314, line: 214, baseType: !137, size: 8, offset: 80)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "skip_eval", scope: !390, file: !314, line: 217, baseType: !7, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "in_deferred_pragma", scope: !390, file: !314, line: 220, baseType: !137, size: 8, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pragma_allow_expansion", scope: !390, file: !314, line: 223, baseType: !137, size: 8, offset: 136)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "line_table", scope: !313, file: !314, line: 334, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_maps", file: !43, line: 74, size: 448, elements: !409)
!409 = !{!410, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !408, file: !43, line: 75, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line_map", file: !43, line: 61, size: 192, elements: !413)
!413 = !{!414, !415, !417, !418, !419, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "to_file", scope: !412, file: !43, line: 62, baseType: !140, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "to_line", scope: !412, file: !43, line: 63, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenum_type", file: !43, line: 39, baseType: !7)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "start_location", scope: !412, file: !43, line: 64, baseType: !226, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "included_from", scope: !412, file: !43, line: 65, baseType: !166, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !412, file: !43, line: 66, baseType: !7, size: 8, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sysp", scope: !412, file: !43, line: 68, baseType: !137, size: 8, offset: 168)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "column_bits", scope: !412, file: !43, line: 70, baseType: !7, size: 8, offset: 176, flags: DIFlagBitField, extraData: i64 176)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !408, file: !43, line: 76, baseType: !7, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !408, file: !43, line: 77, baseType: !7, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !408, file: !43, line: 79, baseType: !7, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "last_listed", scope: !408, file: !43, line: 84, baseType: !166, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !408, file: !43, line: 87, baseType: !7, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "trace_includes", scope: !408, file: !43, line: 90, baseType: !137, size: 8, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "highest_location", scope: !408, file: !43, line: 93, baseType: !226, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "highest_line", scope: !408, file: !43, line: 96, baseType: !226, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "max_column_hint", scope: !408, file: !43, line: 100, baseType: !7, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reallocator", scope: !408, file: !43, line: 104, baseType: !432, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "line_map_realloc", file: !43, line: 47, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!135, !135, !211}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "directive_line", scope: !313, file: !314, line: 337, baseType: !226, size: 32, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "a_buff", scope: !313, file: !314, line: 340, baseType: !438, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpp_buff", file: !314, line: 99, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_buff", file: !314, line: 100, size: 256, elements: !441)
!441 = !{!442, !444, !445, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !314, line: 102, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !440, file: !314, line: 103, baseType: !136, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !440, file: !314, line: 103, baseType: !136, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !440, file: !314, line: 103, baseType: !136, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "u_buff", scope: !313, file: !314, line: 341, baseType: !438, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "free_buffs", scope: !313, file: !314, line: 342, baseType: !438, size: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "base_context", scope: !313, file: !314, line: 345, baseType: !450, size: 448, offset: 640)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_context", file: !314, line: 142, size: 448, elements: !451)
!451 = !{!452, !455, !456, !474, !475, !476}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !314, line: 145, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_context", file: !314, line: 141, baseType: !450)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !314, line: 145, baseType: !453, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !450, file: !314, line: 164, baseType: !457, size: 128, offset: 128)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !314, line: 147, size: 128, elements: !458)
!458 = !{!459, !469}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "iso", scope: !457, file: !314, line: 156, baseType: !460, size: 128)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !314, line: 152, size: 128, elements: !461)
!461 = !{!462, !468}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !460, file: !314, line: 154, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "utoken", file: !314, line: 121, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !463, file: !314, line: 123, baseType: !220, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ptoken", scope: !463, file: !314, line: 124, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !460, file: !314, line: 155, baseType: !463, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "trad", scope: !457, file: !314, line: 163, baseType: !470, size: 128)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !314, line: 159, size: 128, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !470, file: !314, line: 161, baseType: !138, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit", scope: !470, file: !314, line: 162, baseType: !138, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !450, file: !314, line: 168, baseType: !438, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !450, file: !314, line: 171, baseType: !236, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "direct_p", scope: !450, file: !314, line: 174, baseType: !137, size: 8, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !313, file: !314, line: 346, baseType: !478, size: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "directive", scope: !313, file: !314, line: 349, baseType: !480, size: 64, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "directive", file: !314, line: 40, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "directive_result", scope: !313, file: !314, line: 352, baseType: !222, size: 192, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "invocation_location", scope: !313, file: !314, line: 356, baseType: !226, size: 32, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "set_invocation_location", scope: !313, file: !314, line: 360, baseType: !137, size: 8, offset: 1440)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "quote_include", scope: !313, file: !314, line: 363, baseType: !354, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bracket_include", scope: !313, file: !314, line: 364, baseType: !354, size: 64, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "no_search_path", scope: !313, file: !314, line: 365, baseType: !351, size: 512, offset: 1600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "all_files", scope: !313, file: !314, line: 368, baseType: !339, size: 64, offset: 2112)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "main_file", scope: !313, file: !314, line: 370, baseType: !339, size: 64, offset: 2176)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash", scope: !313, file: !314, line: 373, baseType: !492, size: 64, offset: 2240)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !494, line: 100, size: 896, elements: !495)
!494 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !{!496, !504, !509, !514, !516, !517, !518, !519, !520, !521, !526, !528, !529, !534, !539}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !493, file: !494, line: 102, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !494, line: 52, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !494, line: 47, baseType: !7)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !493, file: !494, line: 105, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !494, line: 59, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!166, !502, !502}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !493, file: !494, line: 108, baseType: !510, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !494, line: 63, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !135}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !493, file: !494, line: 111, baseType: !515, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !493, file: !494, line: 114, baseType: !211, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !493, file: !494, line: 117, baseType: !211, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !493, file: !494, line: 120, baseType: !211, size: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !493, file: !494, line: 124, baseType: !7, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !493, file: !494, line: 128, baseType: !7, size: 32, offset: 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !493, file: !494, line: 131, baseType: !522, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !494, line: 75, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!135, !211, !211}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !493, file: !494, line: 132, baseType: !527, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !494, line: 78, baseType: !511)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !493, file: !494, line: 135, baseType: !135, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !493, file: !494, line: 136, baseType: !530, size: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !494, line: 82, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!135, !135, !211, !211}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !493, file: !494, line: 137, baseType: !535, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !494, line: 83, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !135, !135}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !493, file: !494, line: 141, baseType: !7, size: 32, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dir_hash", scope: !313, file: !314, line: 374, baseType: !492, size: 64, offset: 2304)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "file_hash_entries", scope: !313, file: !314, line: 375, baseType: !542, size: 64, offset: 2368)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "file_hash_entry_pool", file: !314, line: 375, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_hash", scope: !313, file: !314, line: 378, baseType: !492, size: 64, offset: 2432)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nonexistent_file_ob", scope: !313, file: !314, line: 379, baseType: !546, size: 704, offset: 2496)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !547, line: 164, size: 704, elements: !548)
!547 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !{!549, !550, !560, !561, !562, !563, !564, !565, !569, !573, !574, !575, !576}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !546, file: !547, line: 166, baseType: !188, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !546, file: !547, line: 167, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !547, line: 157, size: 192, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !552, file: !547, line: 159, baseType: !150, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !552, file: !547, line: 160, baseType: !551, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !552, file: !547, line: 161, baseType: !557, size: 32, offset: 128)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 4)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !546, file: !547, line: 168, baseType: !150, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !546, file: !547, line: 169, baseType: !150, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !546, file: !547, line: 170, baseType: !150, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !546, file: !547, line: 171, baseType: !188, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !546, file: !547, line: 172, baseType: !166, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !546, file: !547, line: 176, baseType: !566, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!551, !135, !188}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !546, file: !547, line: 177, baseType: !570, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !135, !551}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !546, file: !547, line: 178, baseType: !135, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !546, file: !547, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !546, file: !547, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !546, file: !547, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "quote_ignores_source_dir", scope: !313, file: !314, line: 383, baseType: !137, size: 8, offset: 3200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "seen_once_only", scope: !313, file: !314, line: 387, baseType: !137, size: 8, offset: 3208)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mi_cmacro", scope: !313, file: !314, line: 390, baseType: !580, size: 64, offset: 3264)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mi_ind_cmacro", scope: !313, file: !314, line: 391, baseType: !580, size: 64, offset: 3328)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mi_valid", scope: !313, file: !314, line: 392, baseType: !137, size: 8, offset: 3392)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cur_token", scope: !313, file: !314, line: 395, baseType: !267, size: 64, offset: 3456)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "base_run", scope: !313, file: !314, line: 396, baseType: !586, size: 256, offset: 3520)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "tokenrun", file: !314, line: 128, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenrun", file: !314, line: 129, size: 256, elements: !588)
!588 = !{!589, !591, !592, !593}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !314, line: 131, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !587, file: !314, line: 131, baseType: !590, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !587, file: !314, line: 132, baseType: !267, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !587, file: !314, line: 132, baseType: !267, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cur_run", scope: !313, file: !314, line: 396, baseType: !590, size: 64, offset: 3776)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lookaheads", scope: !313, file: !314, line: 397, baseType: !7, size: 32, offset: 3840)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "keep_tokens", scope: !313, file: !314, line: 400, baseType: !7, size: 32, offset: 3872)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer", scope: !313, file: !314, line: 403, baseType: !136, size: 64, offset: 3904)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "macro_buffer_len", scope: !313, file: !314, line: 404, baseType: !7, size: 32, offset: 3968)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_cset_desc", scope: !313, file: !314, line: 408, baseType: !376, size: 128, offset: 4032)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_cset_desc", scope: !313, file: !314, line: 412, baseType: !376, size: 128, offset: 4160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "char16_cset_desc", scope: !313, file: !314, line: 416, baseType: !376, size: 128, offset: 4288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "char32_cset_desc", scope: !313, file: !314, line: 420, baseType: !376, size: 128, offset: 4416)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "wide_cset_desc", scope: !313, file: !314, line: 424, baseType: !376, size: 128, offset: 4544)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !313, file: !314, line: 427, baseType: !138, size: 64, offset: 4672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !313, file: !314, line: 428, baseType: !138, size: 64, offset: 4736)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_paste", scope: !313, file: !314, line: 431, baseType: !222, size: 192, offset: 4800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !313, file: !314, line: 432, baseType: !222, size: 192, offset: 4992)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !313, file: !314, line: 435, baseType: !609, size: 64, offset: 5184)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !6, line: 685, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hash_ob", scope: !313, file: !314, line: 439, baseType: !546, size: 704, offset: 5248)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_ob", scope: !313, file: !314, line: 443, baseType: !546, size: 704, offset: 5952)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pragmas", scope: !313, file: !314, line: 447, baseType: !614, size: 64, offset: 6656)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "pragma_entry", file: !314, line: 447, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !313, file: !314, line: 450, baseType: !617, size: 1088, offset: 6720)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_callbacks", file: !6, line: 472, size: 1088, elements: !618)
!618 = !{!619, !623, !629, !633, !637, !641, !642, !649, !653, !657, !661, !667, !671, !688, !689, !690, !692}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "line_change", scope: !617, file: !6, line: 475, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !311, !220, !166}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "file_change", scope: !617, file: !6, line: 481, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !311, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dir_change", scope: !617, file: !6, line: 483, baseType: !630, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !311, !140}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !617, file: !6, line: 484, baseType: !634, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !311, !7, !138, !140, !166, !467}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "define", scope: !617, file: !6, line: 486, baseType: !638, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !311, !7, !236}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "undef", scope: !617, file: !6, line: 487, baseType: !638, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !617, file: !6, line: 488, baseType: !643, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !311, !7, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_string", file: !6, line: 35, baseType: !290)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "def_pragma", scope: !617, file: !6, line: 489, baseType: !650, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !311, !7}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "valid_pch", scope: !617, file: !6, line: 490, baseType: !654, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!166, !311, !140, !166}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "read_pch", scope: !617, file: !6, line: 491, baseType: !658, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !311, !140, !166, !140}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "missing_header", scope: !617, file: !6, line: 492, baseType: !662, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "missing_header_cb", file: !6, line: 469, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!140, !311, !140, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "macro_to_expand", scope: !617, file: !6, line: 496, baseType: !668, size: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!236, !311, !220}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !617, file: !6, line: 500, baseType: !672, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!137, !311, !166, !226, !7, !140, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !677, line: 52, baseType: !678)
!677 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !679, line: 32, baseType: !680)
!679 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !681)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 192, elements: !195)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !682, file: !3, baseType: !7, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !682, file: !3, baseType: !7, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !682, file: !3, baseType: !135, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !682, file: !3, baseType: !135, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "used_define", scope: !617, file: !6, line: 506, baseType: !638, size: 64, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "used_undef", scope: !617, file: !6, line: 507, baseType: !638, size: 64, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "before_define", scope: !617, file: !6, line: 510, baseType: !691, size: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !617, file: !6, line: 513, baseType: !693, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !311, !226, !236}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !313, file: !314, line: 453, baseType: !697, size: 64, offset: 7808)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !242, line: 46, size: 1152, elements: !699)
!699 = !{!700, !701, !705, !711, !715, !716, !717, !719, !720, !721}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !698, file: !242, line: 49, baseType: !546, size: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !698, file: !242, line: 51, baseType: !702, size: 64, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !242, line: 41, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !698, file: !242, line: 53, baseType: !706, size: 64, offset: 768)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!703, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !242, line: 40, baseType: !698)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !698, file: !242, line: 56, baseType: !712, size: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!135, !211}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !698, file: !242, line: 58, baseType: !7, size: 32, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !698, file: !242, line: 59, baseType: !7, size: 32, offset: 928)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pfile", scope: !698, file: !242, line: 62, baseType: !718, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !698, file: !242, line: 65, baseType: !7, size: 32, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !698, file: !242, line: 66, baseType: !7, size: 32, offset: 1056)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "entries_owned", scope: !698, file: !242, line: 69, baseType: !137, size: 8, offset: 1088)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "op_stack", scope: !313, file: !314, line: 456, baseType: !723, size: 64, offset: 7872)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "op", file: !314, line: 42, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "op_limit", scope: !313, file: !314, line: 456, baseType: !723, size: 64, offset: 7936)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !313, file: !314, line: 459, baseType: !727, size: 1024, offset: 8000)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_options", file: !6, line: 279, size: 1024, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tabstop", scope: !727, file: !6, line: 282, baseType: !7, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !727, file: !6, line: 285, baseType: !19, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus", scope: !727, file: !6, line: 288, baseType: !137, size: 8, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cplusplus_comments", scope: !727, file: !6, line: 291, baseType: !137, size: 8, offset: 72)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "objc", scope: !727, file: !6, line: 296, baseType: !137, size: 8, offset: 80)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments", scope: !727, file: !6, line: 299, baseType: !137, size: 8, offset: 88)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "discard_comments_in_macro_exp", scope: !727, file: !6, line: 303, baseType: !137, size: 8, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "trigraphs", scope: !727, file: !6, line: 306, baseType: !137, size: 8, offset: 104)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "digraphs", scope: !727, file: !6, line: 309, baseType: !137, size: 8, offset: 112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "extended_numbers", scope: !727, file: !6, line: 312, baseType: !137, size: 8, offset: 120)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "uliterals", scope: !727, file: !6, line: 315, baseType: !137, size: 8, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "print_include_names", scope: !727, file: !6, line: 318, baseType: !137, size: 8, offset: 136)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "warn_deprecated", scope: !727, file: !6, line: 321, baseType: !137, size: 8, offset: 144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "warn_comments", scope: !727, file: !6, line: 324, baseType: !137, size: 8, offset: 152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "warn_missing_include_dirs", scope: !727, file: !6, line: 328, baseType: !137, size: 8, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "warn_trigraphs", scope: !727, file: !6, line: 331, baseType: !137, size: 8, offset: 168)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "warn_multichar", scope: !727, file: !6, line: 334, baseType: !137, size: 8, offset: 176)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "warn_traditional", scope: !727, file: !6, line: 338, baseType: !137, size: 8, offset: 184)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "warn_long_long", scope: !727, file: !6, line: 341, baseType: !137, size: 8, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "warn_endif_labels", scope: !727, file: !6, line: 344, baseType: !137, size: 8, offset: 200)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "warn_num_sign_change", scope: !727, file: !6, line: 348, baseType: !137, size: 8, offset: 208)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "warn_variadic_macros", scope: !727, file: !6, line: 352, baseType: !137, size: 8, offset: 216)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "warn_builtin_macro_redefined", scope: !727, file: !6, line: 356, baseType: !137, size: 8, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !727, file: !6, line: 360, baseType: !137, size: 8, offset: 232)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dollars_in_ident", scope: !727, file: !6, line: 363, baseType: !137, size: 8, offset: 240)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "extended_identifiers", scope: !727, file: !6, line: 366, baseType: !137, size: 8, offset: 248)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "warn_dollars", scope: !727, file: !6, line: 370, baseType: !137, size: 8, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "warn_undef", scope: !727, file: !6, line: 373, baseType: !137, size: 8, offset: 264)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "warn_unused_macros", scope: !727, file: !6, line: 376, baseType: !137, size: 8, offset: 272)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "c99", scope: !727, file: !6, line: 379, baseType: !137, size: 8, offset: 280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !727, file: !6, line: 382, baseType: !137, size: 8, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pedantic", scope: !727, file: !6, line: 385, baseType: !137, size: 8, offset: 296)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "preprocessed", scope: !727, file: !6, line: 389, baseType: !137, size: 8, offset: 304)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "show_column", scope: !727, file: !6, line: 392, baseType: !137, size: 8, offset: 312)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "operator_names", scope: !727, file: !6, line: 395, baseType: !137, size: 8, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "warn_cxx_operator_names", scope: !727, file: !6, line: 398, baseType: !137, size: 8, offset: 328)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "traditional", scope: !727, file: !6, line: 401, baseType: !137, size: 8, offset: 336)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "narrow_charset", scope: !727, file: !6, line: 404, baseType: !140, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "wide_charset", scope: !727, file: !6, line: 407, baseType: !140, size: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "input_charset", scope: !727, file: !6, line: 410, baseType: !140, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "warn_normalize", scope: !727, file: !6, line: 414, baseType: !31, size: 32, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "warn_invalid_pch", scope: !727, file: !6, line: 417, baseType: !137, size: 8, offset: 608)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "restore_pch_deps", scope: !727, file: !6, line: 420, baseType: !137, size: 8, offset: 616)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "deps", scope: !727, file: !6, line: 441, baseType: !773, size: 64, offset: 640)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !6, line: 423, size: 64, elements: !774)
!774 = !{!775, !776, !777, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !773, file: !6, line: 426, baseType: !37, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "missing_files", scope: !773, file: !6, line: 429, baseType: !137, size: 8, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "phony_targets", scope: !773, file: !6, line: 433, baseType: !137, size: 8, offset: 40)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_main_file", scope: !773, file: !6, line: 436, baseType: !137, size: 8, offset: 48)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "need_preprocessor_output", scope: !773, file: !6, line: 440, baseType: !137, size: 8, offset: 56)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !727, file: !6, line: 447, baseType: !211, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "char_precision", scope: !727, file: !6, line: 447, baseType: !211, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "int_precision", scope: !727, file: !6, line: 447, baseType: !211, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "wchar_precision", scope: !727, file: !6, line: 447, baseType: !211, size: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_char", scope: !727, file: !6, line: 450, baseType: !137, size: 8, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_wchar", scope: !727, file: !6, line: 450, baseType: !137, size: 8, offset: 968)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_big_endian", scope: !727, file: !6, line: 454, baseType: !137, size: 8, offset: 976)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stdc_0_in_system_headers", scope: !727, file: !6, line: 457, baseType: !137, size: 8, offset: 984)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "directives_only", scope: !727, file: !6, line: 460, baseType: !137, size: 8, offset: 992)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "spec_nodes", scope: !313, file: !314, line: 463, baseType: !790, size: 256, offset: 9024)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spec_nodes", file: !314, line: 227, size: 256, elements: !791)
!791 = !{!792, !793, !794, !795}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "n_defined", scope: !790, file: !314, line: 229, baseType: !236, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "n_true", scope: !790, file: !314, line: 230, baseType: !236, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "n_false", scope: !790, file: !314, line: 231, baseType: !236, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "n__VA_ARGS__", scope: !790, file: !314, line: 232, baseType: !236, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "our_hashtable", scope: !313, file: !314, line: 466, baseType: !137, size: 8, offset: 9280)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !313, file: !314, line: 475, baseType: !798, size: 256, offset: 9344)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !313, file: !314, line: 469, size: 256, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !798, file: !314, line: 471, baseType: !136, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !798, file: !314, line: 472, baseType: !136, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !798, file: !314, line: 473, baseType: !136, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !798, file: !314, line: 474, baseType: !226, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "saved_cur", scope: !313, file: !314, line: 478, baseType: !138, size: 64, offset: 9600)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "saved_rlimit", scope: !313, file: !314, line: 478, baseType: !138, size: 64, offset: 9664)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "saved_line_base", scope: !313, file: !314, line: 478, baseType: !138, size: 64, offset: 9728)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "savedstate", scope: !313, file: !314, line: 482, baseType: !808, size: 64, offset: 9792)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpp_savedstate", file: !314, line: 482, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !313, file: !314, line: 485, baseType: !7, size: 32, offset: 9856)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !313, file: !314, line: 488, baseType: !812, size: 128, offset: 9920)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment_table", file: !6, line: 901, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 891, size: 128, elements: !814)
!814 = !{!815, !822, !823}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !813, file: !6, line: 894, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpp_comment", file: !6, line: 887, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 880, size: 128, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !818, file: !6, line: 883, baseType: !150, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sloc", scope: !818, file: !6, line: 886, baseType: !226, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !813, file: !6, line: 897, baseType: !166, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !813, file: !6, line: 900, baseType: !166, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_macros", scope: !313, file: !314, line: 491, baseType: !825, size: 64, offset: 10048)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_pragma_macro", file: !314, line: 310, size: 192, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !314, line: 312, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !314, line: 314, baseType: !150, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !826, file: !314, line: 316, baseType: !256, size: 64, offset: 128)
!831 = !{}
!832 = !DILocalVariable(name: "pfile", arg: 1, scope: !308, file: !3, line: 87, type: !311)
!833 = !DILocation(line: 87, column: 30, scope: !308)
!834 = !DILocation(line: 91, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !308, file: !3, line: 91, column: 7)
!836 = !DILocation(line: 91, column: 7, scope: !308)
!837 = !DILocation(line: 94, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !835, file: !3, line: 92, column: 5)
!839 = !DILocation(line: 94, column: 14, scope: !838)
!840 = !DILocation(line: 94, column: 21, scope: !838)
!841 = !DILocation(line: 94, column: 29, scope: !838)
!842 = !DILocation(line: 95, column: 21, scope: !838)
!843 = !DILocation(line: 95, column: 2, scope: !838)
!844 = distinct !{!844, !837, !845}
!845 = !DILocation(line: 95, column: 26, scope: !838)
!846 = !DILocation(line: 96, column: 26, scope: !838)
!847 = !DILocation(line: 96, column: 7, scope: !838)
!848 = !DILocation(line: 97, column: 5, scope: !838)
!849 = !DILocation(line: 98, column: 29, scope: !850)
!850 = distinct !DILexicalBlock(scope: !835, file: !3, line: 98, column: 12)
!851 = !DILocation(line: 98, column: 12, scope: !850)
!852 = !DILocation(line: 98, column: 37, scope: !850)
!853 = !DILocation(line: 98, column: 12, scope: !835)
!854 = !DILocation(line: 99, column: 33, scope: !850)
!855 = !DILocation(line: 99, column: 5, scope: !850)
!856 = !DILocation(line: 100, column: 29, scope: !857)
!857 = distinct !DILexicalBlock(scope: !850, file: !3, line: 100, column: 12)
!858 = !DILocation(line: 100, column: 12, scope: !857)
!859 = !DILocation(line: 100, column: 37, scope: !857)
!860 = !DILocation(line: 101, column: 5, scope: !857)
!861 = !DILocation(line: 101, column: 26, scope: !857)
!862 = !DILocation(line: 101, column: 9, scope: !857)
!863 = !DILocation(line: 101, column: 34, scope: !857)
!864 = !DILocation(line: 100, column: 12, scope: !850)
!865 = !DILocation(line: 102, column: 44, scope: !857)
!866 = !DILocation(line: 102, column: 5, scope: !857)
!867 = !DILocation(line: 104, column: 28, scope: !857)
!868 = !DILocation(line: 104, column: 5, scope: !857)
!869 = !DILocation(line: 107, column: 7, scope: !870)
!870 = distinct !DILexicalBlock(scope: !308, file: !3, line: 107, column: 7)
!871 = !DILocation(line: 107, column: 24, scope: !870)
!872 = !DILocation(line: 107, column: 7, scope: !308)
!873 = !DILocation(line: 108, column: 29, scope: !870)
!874 = !DILocation(line: 108, column: 5, scope: !870)
!875 = !DILocation(line: 111, column: 13, scope: !876)
!876 = distinct !DILexicalBlock(scope: !308, file: !3, line: 111, column: 7)
!877 = !DILocation(line: 111, column: 7, scope: !876)
!878 = !DILocation(line: 111, column: 7, scope: !308)
!879 = !DILocation(line: 112, column: 23, scope: !876)
!880 = !DILocation(line: 112, column: 5, scope: !876)
!881 = !DILocation(line: 113, column: 1, scope: !308)
!882 = distinct !DISubprogram(name: "scan_translation_unit_trad", scope: !3, file: !3, line: 291, type: !309, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !831)
!883 = !DILocalVariable(name: "pfile", arg: 1, scope: !882, file: !3, line: 291, type: !311)
!884 = !DILocation(line: 291, column: 41, scope: !882)
!885 = !DILocation(line: 293, column: 3, scope: !882)
!886 = !DILocation(line: 293, column: 39, scope: !882)
!887 = !DILocation(line: 293, column: 10, scope: !882)
!888 = !DILocalVariable(name: "len", scope: !889, file: !3, line: 295, type: !211)
!889 = distinct !DILexicalBlock(scope: !882, file: !3, line: 294, column: 5)
!890 = !DILocation(line: 295, column: 14, scope: !889)
!891 = !DILocation(line: 295, column: 20, scope: !889)
!892 = !DILocation(line: 295, column: 27, scope: !889)
!893 = !DILocation(line: 295, column: 31, scope: !889)
!894 = !DILocation(line: 295, column: 37, scope: !889)
!895 = !DILocation(line: 295, column: 44, scope: !889)
!896 = !DILocation(line: 295, column: 48, scope: !889)
!897 = !DILocation(line: 295, column: 35, scope: !889)
!898 = !DILocation(line: 296, column: 25, scope: !889)
!899 = !DILocation(line: 296, column: 32, scope: !889)
!900 = !DILocation(line: 296, column: 36, scope: !889)
!901 = !DILocation(line: 296, column: 7, scope: !889)
!902 = !DILocation(line: 297, column: 15, scope: !889)
!903 = !DILocation(line: 297, column: 22, scope: !889)
!904 = !DILocation(line: 297, column: 26, scope: !889)
!905 = !DILocation(line: 297, column: 35, scope: !889)
!906 = !DILocation(line: 297, column: 46, scope: !889)
!907 = !DILocation(line: 297, column: 7, scope: !889)
!908 = !DILocation(line: 298, column: 21, scope: !889)
!909 = !DILocation(line: 299, column: 12, scope: !910)
!910 = distinct !DILexicalBlock(scope: !889, file: !3, line: 299, column: 11)
!911 = !DILocation(line: 299, column: 11, scope: !889)
!912 = !DILocation(line: 300, column: 24, scope: !910)
!913 = !DILocation(line: 300, column: 31, scope: !910)
!914 = !DILocation(line: 300, column: 35, scope: !910)
!915 = !DILocation(line: 300, column: 41, scope: !910)
!916 = !DILocation(line: 300, column: 2, scope: !910)
!917 = distinct !{!917, !885, !918}
!918 = !DILocation(line: 301, column: 5, scope: !882)
!919 = !DILocation(line: 302, column: 1, scope: !882)
!920 = distinct !DISubprogram(name: "scan_translation_unit_directives_only", scope: !3, file: !3, line: 270, type: !309, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !831)
!921 = !DILocalVariable(name: "pfile", arg: 1, scope: !920, file: !3, line: 270, type: !311)
!922 = !DILocation(line: 270, column: 52, scope: !920)
!923 = !DILocalVariable(name: "cb", scope: !920, file: !3, line: 272, type: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpp_dir_only_callbacks", file: !314, line: 612, size: 128, elements: !925)
!925 = !{!926, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "print_lines", scope: !924, file: !314, line: 615, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !166, !502, !211}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_print_line", scope: !924, file: !314, line: 616, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !226}
!934 = !DILocation(line: 272, column: 34, scope: !920)
!935 = !DILocation(line: 274, column: 6, scope: !920)
!936 = !DILocation(line: 274, column: 18, scope: !920)
!937 = !DILocation(line: 275, column: 6, scope: !920)
!938 = !DILocation(line: 275, column: 23, scope: !920)
!939 = !DILocation(line: 277, column: 29, scope: !920)
!940 = !DILocation(line: 277, column: 3, scope: !920)
!941 = !DILocation(line: 278, column: 1, scope: !920)
!942 = distinct !DISubprogram(name: "scan_translation_unit", scope: !3, file: !3, line: 166, type: !309, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !831)
!943 = !DILocalVariable(name: "pfile", arg: 1, scope: !942, file: !3, line: 166, type: !311)
!944 = !DILocation(line: 166, column: 36, scope: !942)
!945 = !DILocalVariable(name: "avoid_paste", scope: !942, file: !3, line: 168, type: !137)
!946 = !DILocation(line: 168, column: 8, scope: !942)
!947 = !DILocalVariable(name: "do_line_adjustments", scope: !942, file: !3, line: 169, type: !137)
!948 = !DILocation(line: 169, column: 8, scope: !942)
!949 = !DILocation(line: 170, column: 24, scope: !942)
!950 = !DILocation(line: 170, column: 7, scope: !942)
!951 = !DILocation(line: 170, column: 35, scope: !942)
!952 = !DILocation(line: 170, column: 40, scope: !942)
!953 = !DILocation(line: 171, column: 7, scope: !942)
!954 = !DILocation(line: 171, column: 11, scope: !942)
!955 = !DILocation(line: 171, column: 10, scope: !942)
!956 = !DILocation(line: 0, scope: !942)
!957 = !DILocalVariable(name: "in_pragma", scope: !942, file: !3, line: 172, type: !137)
!958 = !DILocation(line: 172, column: 8, scope: !942)
!959 = !DILocation(line: 174, column: 16, scope: !942)
!960 = !DILocation(line: 175, column: 3, scope: !942)
!961 = !DILocalVariable(name: "loc", scope: !962, file: !3, line: 177, type: !226)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 176, column: 5)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 175, column: 3)
!964 = distinct !DILexicalBlock(scope: !942, file: !3, line: 175, column: 3)
!965 = !DILocation(line: 177, column: 23, scope: !962)
!966 = !DILocalVariable(name: "token", scope: !962, file: !3, line: 178, type: !220)
!967 = !DILocation(line: 178, column: 24, scope: !962)
!968 = !DILocation(line: 178, column: 61, scope: !962)
!969 = !DILocation(line: 178, column: 32, scope: !962)
!970 = !DILocation(line: 180, column: 11, scope: !971)
!971 = distinct !DILexicalBlock(scope: !962, file: !3, line: 180, column: 11)
!972 = !DILocation(line: 180, column: 18, scope: !971)
!973 = !DILocation(line: 180, column: 23, scope: !971)
!974 = !DILocation(line: 180, column: 11, scope: !962)
!975 = !DILocation(line: 182, column: 16, scope: !976)
!976 = distinct !DILexicalBlock(scope: !971, file: !3, line: 181, column: 2)
!977 = !DILocation(line: 183, column: 14, scope: !978)
!978 = distinct !DILexicalBlock(scope: !976, file: !3, line: 183, column: 8)
!979 = !DILocation(line: 183, column: 21, scope: !978)
!980 = !DILocation(line: 184, column: 8, scope: !978)
!981 = !DILocation(line: 184, column: 20, scope: !978)
!982 = !DILocation(line: 184, column: 28, scope: !978)
!983 = !DILocation(line: 184, column: 14, scope: !978)
!984 = !DILocation(line: 184, column: 34, scope: !978)
!985 = !DILocation(line: 185, column: 5, scope: !978)
!986 = !DILocation(line: 185, column: 8, scope: !978)
!987 = !DILocation(line: 185, column: 15, scope: !978)
!988 = !DILocation(line: 185, column: 19, scope: !978)
!989 = !DILocation(line: 185, column: 26, scope: !978)
!990 = !DILocation(line: 183, column: 8, scope: !976)
!991 = !DILocation(line: 186, column: 21, scope: !978)
!992 = !DILocation(line: 186, column: 28, scope: !978)
