; ModuleID = 'lto-wpa-fixup.c'
source_filename = "lto-wpa-fixup.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }

!542 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!543 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!544 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!545 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!546 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!547 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!548 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!549 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!550 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!551 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!552 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!553 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!554 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!555 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!556 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!557 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!558 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!559 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!572 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!573 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!574 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!579 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!580 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!581 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!582 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !584, line: 256, baseType: !7, size: 32, elements: !585)
!584 = !DIFile(filename: "./lto-streamer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!586 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!587 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!588 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!589 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!590 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!591 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!592 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!593 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!594 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!595 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!596 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 272, baseType: !7, size: 32, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606}
!599 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE", value: 0, isUnsigned: true)
!600 = !DIEnumerator(name: "LTO_DECL_STREAM_FIELD_DECL", value: 1, isUnsigned: true)
!601 = !DIEnumerator(name: "LTO_DECL_STREAM_FN_DECL", value: 2, isUnsigned: true)
!602 = !DIEnumerator(name: "LTO_DECL_STREAM_VAR_DECL", value: 3, isUnsigned: true)
!603 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE_DECL", value: 4, isUnsigned: true)
!604 = !DIEnumerator(name: "LTO_DECL_STREAM_NAMESPACE_DECL", value: 5, isUnsigned: true)
!605 = !DIEnumerator(name: "LTO_DECL_STREAM_LABEL_DECL", value: 6, isUnsigned: true)
!606 = !DIEnumerator(name: "LTO_N_DECL_STREAMS", value: 7, isUnsigned: true)
!607 = !{!134, !608, !7}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !135, line: 184, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !135, line: 184, size: 128, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !610, file: !135, line: 184, baseType: !613, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !614, file: !135, line: 182, baseType: !7, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !614, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !614, file: !135, line: 182, baseType: !619, size: 64, offset: 64)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 64, elements: !721)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !621, line: 56, baseType: !622)
!621 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !624)
!624 = !{!625, !658, !664, !677, !696, !707, !712, !723, !729, !743, !755, !793, !1255, !1283, !1300, !1301, !1306, !1315, !1321, !1326, !1330, !1334, !1567, !1614, !1620, !1626, !1633, !1646, !1660, !1677, !1689, !1711, !1726, !1898}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !623, file: !135, line: 3372, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !626, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !626, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !626, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !626, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !626, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !626, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !626, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !626, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !626, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !626, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !626, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !626, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !626, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !626, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !626, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !626, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !626, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !626, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !626, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !626, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !626, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !626, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !626, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !626, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !626, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !626, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !626, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !626, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !626, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !626, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !623, file: !135, line: 3373, baseType: !659, size: 192)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !659, file: !135, line: 403, baseType: !626, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !659, file: !135, line: 404, baseType: !620, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !659, file: !135, line: 405, baseType: !620, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !623, file: !135, line: 3374, baseType: !665, size: 320)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !135, line: 1385, baseType: !659, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !665, file: !135, line: 1386, baseType: !669, size: 128, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !670, line: 58, baseType: !671)
!670 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 54, size: 128, elements: !672)
!672 = !{!673, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !671, file: !670, line: 56, baseType: !674, size: 64)
!674 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !671, file: !670, line: 57, baseType: !676, size: 64, offset: 64)
!676 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !623, file: !135, line: 3375, baseType: !678, size: 256)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !678, file: !135, line: 1398, baseType: !659, size: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !678, file: !135, line: 1399, baseType: !682, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !684, line: 52, size: 256, elements: !685)
!684 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!685 = !{!686, !687, !688, !689, !690, !691, !692}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !683, file: !684, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !683, file: !684, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !683, file: !684, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !683, file: !684, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !683, file: !684, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !683, file: !684, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !683, file: !684, line: 62, baseType: !693, size: 192, offset: 64)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 192, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 3)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !623, file: !135, line: 3376, baseType: !697, size: 256)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !135, line: 1409, baseType: !659, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !697, file: !135, line: 1410, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !703, line: 27, size: 192, elements: !704)
!703 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !702, file: !703, line: 29, baseType: !669, size: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !702, file: !703, line: 30, baseType: !5, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !623, file: !135, line: 3377, baseType: !708, size: 256)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !135, line: 1438, baseType: !659, size: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !708, file: !135, line: 1439, baseType: !620, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !623, file: !135, line: 3378, baseType: !713, size: 256)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !714)
!714 = !{!715, !716, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !135, line: 1419, baseType: !659, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !713, file: !135, line: 1420, baseType: !717, size: 32, offset: 192)
!717 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !713, file: !135, line: 1421, baseType: !719, size: 8, offset: 224)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 8, elements: !721)
!720 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!721 = !{!722}
!722 = !DISubrange(count: 1)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !623, file: !135, line: 3379, baseType: !724, size: 320)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !724, file: !135, line: 1429, baseType: !659, size: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !724, file: !135, line: 1430, baseType: !620, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !724, file: !135, line: 1431, baseType: !620, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !623, file: !135, line: 3380, baseType: !730, size: 320)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !730, file: !135, line: 1461, baseType: !659, size: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !730, file: !135, line: 1462, baseType: !734, size: 128, offset: 192)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !735, line: 31, size: 128, elements: !736)
!735 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!736 = !{!737, !741, !742}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !734, file: !735, line: 32, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !734, file: !735, line: 33, baseType: !7, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !734, file: !735, line: 34, baseType: !7, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !623, file: !135, line: 3381, baseType: !744, size: 384)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !745)
!745 = !{!746, !747, !752, !753, !754}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !744, file: !135, line: 2508, baseType: !659, size: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !744, file: !135, line: 2509, baseType: !748, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !749, line: 58, baseType: !750)
!749 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !751, line: 44, baseType: !7)
!751 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !744, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !135, line: 2511, baseType: !620, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !744, file: !135, line: 2512, baseType: !620, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !623, file: !135, line: 3382, baseType: !756, size: 896)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !135, line: 2653, baseType: !744, size: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !756, file: !135, line: 2654, baseType: !620, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !756, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !756, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !756, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !756, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !756, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !756, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !756, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !756, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !756, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !756, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !756, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !756, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !756, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !756, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !756, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !756, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !756, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !756, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !756, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !756, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !756, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !756, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !756, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !756, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !756, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !756, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !756, file: !135, line: 2705, baseType: !620, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !756, file: !135, line: 2706, baseType: !620, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !756, file: !135, line: 2707, baseType: !620, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !756, file: !135, line: 2708, baseType: !620, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !756, file: !135, line: 2711, baseType: !791, size: 64, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !623, file: !135, line: 3383, baseType: !794, size: 960)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !135, line: 2757, baseType: !756, size: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !794, file: !135, line: 2758, baseType: !798, size: 64, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !621, line: 50, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !801, line: 240, size: 384, elements: !802)
!801 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !800, file: !801, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !800, file: !801, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !800, file: !801, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !800, file: !801, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !800, file: !801, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !800, file: !801, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !800, file: !801, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !800, file: !801, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !800, file: !801, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !800, file: !801, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !800, file: !801, line: 321, baseType: !814, size: 320, offset: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !801, line: 315, size: 320, elements: !815)
!815 = !{!816, !1222, !1224, !1253, !1254}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !814, file: !801, line: 316, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 64, elements: !721)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !801, line: 183, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !801, line: 166, size: 64, elements: !820)
!820 = !{!821, !822, !823, !826, !827, !835, !836, !848, !851, !913, !914, !1199, !1212, !1219}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !819, file: !801, line: 168, baseType: !717, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !819, file: !801, line: 169, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !819, file: !801, line: 170, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !819, file: !801, line: 171, baseType: !798, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !819, file: !801, line: 172, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !621, line: 53, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !801, line: 359, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !830, file: !801, line: 360, baseType: !717, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !830, file: !801, line: 361, baseType: !834, size: 64, offset: 64)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 64, elements: !721)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !819, file: !801, line: 173, baseType: !5, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !819, file: !801, line: 174, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !801, line: 133, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !801, line: 115, size: 32, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !838, file: !801, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !838, file: !801, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !838, file: !801, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !838, file: !801, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !838, file: !801, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !838, file: !801, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !838, file: !801, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !838, file: !801, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !819, file: !801, line: 175, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !801, line: 175, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !819, file: !801, line: 176, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !854, line: 75, size: 256, elements: !855)
!854 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!855 = !{!856, !870, !871, !872}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !853, file: !854, line: 76, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !854, line: 68, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !854, line: 63, size: 320, elements: !860)
!860 = !{!861, !863, !864, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !854, line: 64, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !859, file: !854, line: 65, baseType: !862, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !859, file: !854, line: 66, baseType: !7, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !859, file: !854, line: 67, baseType: !866, size: 128, offset: 192)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 128, elements: !868)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !854, line: 29, baseType: !674)
!868 = !{!869}
!869 = !DISubrange(count: 2)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !853, file: !854, line: 77, baseType: !857, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !853, file: !854, line: 78, baseType: !7, size: 32, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !853, file: !854, line: 79, baseType: !873, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !854, line: 49, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !854, line: 45, size: 832, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !875, file: !854, line: 46, baseType: !862, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !875, file: !854, line: 47, baseType: !852, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !875, file: !854, line: 48, baseType: !880, size: 704, offset: 128)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !881, line: 164, size: 704, elements: !882)
!881 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!882 = !{!883, !884, !895, !896, !897, !898, !899, !900, !905, !909, !910, !911, !912}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !880, file: !881, line: 166, baseType: !676, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !880, file: !881, line: 167, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !881, line: 157, size: 192, elements: !887)
!887 = !{!888, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !886, file: !881, line: 159, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !886, file: !881, line: 160, baseType: !885, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !886, file: !881, line: 161, baseType: !892, size: 32, offset: 128)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 32, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 4)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !880, file: !881, line: 168, baseType: !889, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !880, file: !881, line: 169, baseType: !889, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !880, file: !881, line: 170, baseType: !889, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !880, file: !881, line: 171, baseType: !676, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !880, file: !881, line: 172, baseType: !717, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !880, file: !881, line: 176, baseType: !901, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!885, !904, !676}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !880, file: !881, line: 177, baseType: !906, size: 64, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !904, !885}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !880, file: !881, line: 178, baseType: !904, size: 64, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !880, file: !881, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !880, file: !881, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !880, file: !881, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !819, file: !801, line: 177, baseType: !620, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !819, file: !801, line: 178, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !917)
!917 = !{!918, !1164, !1165, !1166, !1169, !1173, !1174, !1175, !1193, !1194, !1195, !1196, !1197, !1198}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !916, file: !330, line: 219, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !921, file: !330, line: 151, baseType: !924, size: 128)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !925, file: !330, line: 150, baseType: !7, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !925, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !925, file: !330, line: 150, baseType: !930, size: 64, offset: 64)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 64, elements: !721)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !621, line: 108, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !934)
!934 = !{!935, !936, !937, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !933, file: !330, line: 124, baseType: !915, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !933, file: !330, line: 125, baseType: !915, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !933, file: !330, line: 131, baseType: !938, size: 64, offset: 128)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !939)
!939 = !{!940, !1155}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !938, file: !330, line: 129, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !621, line: 66, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !944, line: 143, size: 192, elements: !945)
!944 = !DIFile(filename: "./gimple.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!945 = !{!946, !1153, !1154}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !943, file: !944, line: 145, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !621, line: 69, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !944, line: 136, size: 192, elements: !950)
!950 = !{!951, !1151, !1152}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !949, file: !944, line: 137, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !621, line: 58, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !944, line: 737, size: 768, elements: !955)
!955 = !{!956, !973, !1006, !1012, !1017, !1022, !1029, !1035, !1041, !1046, !1060, !1065, !1071, !1076, !1086, !1091, !1109, !1116, !1123, !1129, !1134, !1140, !1146}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !954, file: !944, line: 738, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !944, line: 271, size: 256, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !957, file: !944, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !957, file: !944, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !957, file: !944, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !957, file: !944, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !957, file: !944, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !957, file: !944, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !957, file: !944, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !957, file: !944, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !957, file: !944, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !957, file: !944, line: 312, baseType: !7, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !957, file: !944, line: 316, baseType: !748, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !957, file: !944, line: 319, baseType: !7, size: 32, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !957, file: !944, line: 323, baseType: !915, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !957, file: !944, line: 327, baseType: !620, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !954, file: !944, line: 739, baseType: !974, size: 448)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !944, line: 350, size: 448, elements: !975)
!975 = !{!976, !1005}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !974, file: !944, line: 353, baseType: !977, size: 384)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !944, line: 333, size: 384, elements: !978)
!978 = !{!979, !980, !988}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !977, file: !944, line: 336, baseType: !957, size: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !977, file: !944, line: 343, baseType: !981, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !983, line: 37, size: 128, elements: !984)
!983 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !983, line: 39, baseType: !981, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !982, file: !983, line: 40, baseType: !987, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !977, file: !944, line: 344, baseType: !989, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !983, line: 45, size: 320, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !983, line: 47, baseType: !989, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !990, file: !983, line: 48, baseType: !994, size: 256, offset: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !995)
!995 = !{!996, !998, !999, !1004}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !994, file: !135, line: 1884, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !135, line: 1885, baseType: !997, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !994, file: !135, line: 1891, baseType: !1000, size: 64, offset: 128)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !994, file: !135, line: 1891, size: 64, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1000, file: !135, line: 1891, baseType: !952, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1000, file: !135, line: 1891, baseType: !620, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !994, file: !135, line: 1892, baseType: !987, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !974, file: !944, line: 359, baseType: !619, size: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !954, file: !944, line: 740, baseType: !1007, size: 512)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !944, line: 365, size: 512, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1007, file: !944, line: 368, baseType: !977, size: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1007, file: !944, line: 373, baseType: !620, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1007, file: !944, line: 374, baseType: !620, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !954, file: !944, line: 741, baseType: !1013, size: 576)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !944, line: 380, size: 576, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1013, file: !944, line: 383, baseType: !1007, size: 512)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1013, file: !944, line: 389, baseType: !619, size: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !954, file: !944, line: 742, baseType: !1018, size: 320)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !944, line: 395, size: 320, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1018, file: !944, line: 397, baseType: !957, size: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1018, file: !944, line: 400, baseType: !941, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !954, file: !944, line: 743, baseType: !1023, size: 448)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !944, line: 406, size: 448, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1023, file: !944, line: 408, baseType: !957, size: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1023, file: !944, line: 412, baseType: !620, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1023, file: !944, line: 420, baseType: !620, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1023, file: !944, line: 423, baseType: !941, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !954, file: !944, line: 744, baseType: !1030, size: 384)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !944, line: 429, size: 384, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1030, file: !944, line: 431, baseType: !957, size: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1030, file: !944, line: 434, baseType: !620, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1030, file: !944, line: 437, baseType: !941, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !954, file: !944, line: 745, baseType: !1036, size: 384)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !944, line: 443, size: 384, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1036, file: !944, line: 445, baseType: !957, size: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1036, file: !944, line: 449, baseType: !620, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1036, file: !944, line: 453, baseType: !941, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !954, file: !944, line: 746, baseType: !1042, size: 320)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !944, line: 459, size: 320, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1042, file: !944, line: 461, baseType: !957, size: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1042, file: !944, line: 464, baseType: !620, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !954, file: !944, line: 747, baseType: !1047, size: 768)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !944, line: 469, size: 768, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1047, file: !944, line: 471, baseType: !957, size: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1047, file: !944, line: 474, baseType: !7, size: 32, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1047, file: !944, line: 475, baseType: !7, size: 32, offset: 288)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1047, file: !944, line: 478, baseType: !620, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1047, file: !944, line: 481, baseType: !1054, size: 384, offset: 384)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 384, elements: !721)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1056)
!1056 = !{!1057, !1058, !1059}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1055, file: !135, line: 1920, baseType: !994, size: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1055, file: !135, line: 1921, baseType: !620, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1055, file: !135, line: 1922, baseType: !748, size: 32, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !954, file: !944, line: 748, baseType: !1061, size: 320)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !944, line: 487, size: 320, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1061, file: !944, line: 490, baseType: !957, size: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1061, file: !944, line: 494, baseType: !717, size: 32, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !954, file: !944, line: 749, baseType: !1066, size: 384)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !944, line: 500, size: 384, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1066, file: !944, line: 502, baseType: !957, size: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1066, file: !944, line: 506, baseType: !941, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1066, file: !944, line: 510, baseType: !941, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !954, file: !944, line: 750, baseType: !1072, size: 320)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !944, line: 529, size: 320, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1072, file: !944, line: 531, baseType: !957, size: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1072, file: !944, line: 540, baseType: !941, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !954, file: !944, line: 751, baseType: !1077, size: 704)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !944, line: 546, size: 704, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1077, file: !944, line: 549, baseType: !1007, size: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1077, file: !944, line: 553, baseType: !824, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1077, file: !944, line: 557, baseType: !740, size: 8, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1077, file: !944, line: 558, baseType: !740, size: 8, offset: 584)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1077, file: !944, line: 559, baseType: !740, size: 8, offset: 592)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1077, file: !944, line: 560, baseType: !740, size: 8, offset: 600)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1077, file: !944, line: 566, baseType: !619, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !954, file: !944, line: 752, baseType: !1087, size: 384)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !944, line: 571, size: 384, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1087, file: !944, line: 573, baseType: !1018, size: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !944, line: 577, baseType: !620, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !954, file: !944, line: 753, baseType: !1092, size: 576)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !944, line: 600, size: 576, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1099, !1108}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1092, file: !944, line: 602, baseType: !1018, size: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1092, file: !944, line: 605, baseType: !620, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1092, file: !944, line: 609, baseType: !1097, size: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1098, line: 46, baseType: !674)
!1098 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1092, file: !944, line: 612, baseType: !1100, size: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !944, line: 581, size: 320, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1101, file: !944, line: 583, baseType: !134, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1101, file: !944, line: 586, baseType: !620, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1101, file: !944, line: 589, baseType: !620, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1101, file: !944, line: 592, baseType: !620, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1101, file: !944, line: 595, baseType: !620, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1092, file: !944, line: 616, baseType: !941, size: 64, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !954, file: !944, line: 754, baseType: !1110, size: 512)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !944, line: 622, size: 512, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1110, file: !944, line: 624, baseType: !1018, size: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1110, file: !944, line: 628, baseType: !620, size: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1110, file: !944, line: 632, baseType: !620, size: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1110, file: !944, line: 636, baseType: !620, size: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !954, file: !944, line: 755, baseType: !1117, size: 704)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !944, line: 642, size: 704, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1117, file: !944, line: 644, baseType: !1110, size: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1117, file: !944, line: 648, baseType: !620, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1117, file: !944, line: 652, baseType: !620, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1117, file: !944, line: 653, baseType: !620, size: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !954, file: !944, line: 756, baseType: !1124, size: 448)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !944, line: 663, size: 448, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1124, file: !944, line: 665, baseType: !1018, size: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1124, file: !944, line: 668, baseType: !620, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1124, file: !944, line: 673, baseType: !620, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !954, file: !944, line: 757, baseType: !1130, size: 384)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !944, line: 694, size: 384, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1130, file: !944, line: 696, baseType: !1018, size: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1130, file: !944, line: 699, baseType: !620, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !954, file: !944, line: 758, baseType: !1135, size: 384)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !944, line: 681, size: 384, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1135, file: !944, line: 683, baseType: !957, size: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1135, file: !944, line: 686, baseType: !620, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1135, file: !944, line: 689, baseType: !620, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !954, file: !944, line: 759, baseType: !1141, size: 384)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !944, line: 707, size: 384, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1141, file: !944, line: 709, baseType: !957, size: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1141, file: !944, line: 712, baseType: !620, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1141, file: !944, line: 712, baseType: !620, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !954, file: !944, line: 760, baseType: !1147, size: 320)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !944, line: 718, size: 320, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1147, file: !944, line: 720, baseType: !957, size: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1147, file: !944, line: 723, baseType: !620, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !949, file: !944, line: 138, baseType: !948, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !944, line: 139, baseType: !948, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !943, file: !944, line: 146, baseType: !947, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !943, file: !944, line: 152, baseType: !941, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !938, file: !330, line: 130, baseType: !798, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !933, file: !330, line: 134, baseType: !904, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !933, file: !330, line: 137, baseType: !620, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !933, file: !330, line: 138, baseType: !748, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !933, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !933, file: !330, line: 144, baseType: !717, size: 32, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !933, file: !330, line: 145, baseType: !717, size: 32, offset: 416)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !933, file: !330, line: 146, baseType: !1163, size: 64, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !676)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !916, file: !330, line: 220, baseType: !919, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !916, file: !330, line: 223, baseType: !904, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !916, file: !330, line: 226, baseType: !1167, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !916, file: !330, line: 229, baseType: !1170, size: 128, offset: 256)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1171, size: 128, elements: !868)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !916, file: !330, line: 232, baseType: !915, size: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !916, file: !330, line: 233, baseType: !915, size: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !916, file: !330, line: 238, baseType: !1176, size: 64, offset: 512)
!1176 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1177)
!1177 = !{!1178, !1184}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1176, file: !330, line: 236, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1181)
!1181 = !{!1182, !1183}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1180, file: !330, line: 275, baseType: !941, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1180, file: !330, line: 278, baseType: !941, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1176, file: !330, line: 237, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1186, file: !330, line: 261, baseType: !798, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1186, file: !330, line: 262, baseType: !798, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1186, file: !330, line: 266, baseType: !798, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1186, file: !330, line: 267, baseType: !798, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1186, file: !330, line: 270, baseType: !717, size: 32, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !916, file: !330, line: 241, baseType: !1163, size: 64, offset: 576)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !916, file: !330, line: 244, baseType: !717, size: 32, offset: 640)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !916, file: !330, line: 247, baseType: !717, size: 32, offset: 672)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !916, file: !330, line: 250, baseType: !717, size: 32, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !916, file: !330, line: 253, baseType: !717, size: 32, offset: 736)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !916, file: !330, line: 256, baseType: !717, size: 32, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !819, file: !801, line: 179, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !801, line: 150, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !801, line: 142, size: 320, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1210, !1211}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1202, file: !801, line: 144, baseType: !620, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1202, file: !801, line: 145, baseType: !798, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !801, line: 146, baseType: !798, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1202, file: !801, line: 147, baseType: !1208, size: 32, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1209, line: 31, baseType: !717)
!1209 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1202, file: !801, line: 148, baseType: !7, size: 32, offset: 224)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1202, file: !801, line: 149, baseType: !740, size: 8, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !819, file: !801, line: 180, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !801, line: 162, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !801, line: 159, size: 128, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1215, file: !801, line: 160, baseType: !620, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1215, file: !801, line: 161, baseType: !676, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !819, file: !801, line: 181, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !801, line: 181, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !814, file: !801, line: 317, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 64, elements: !721)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !814, file: !801, line: 318, baseType: !1225, size: 320)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !801, line: 188, size: 320, elements: !1226)
!1226 = !{!1227, !1229, !1252}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1225, file: !801, line: 190, baseType: !1228, size: 192)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 192, elements: !694)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1225, file: !801, line: 193, baseType: !1230, size: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !801, line: 206, size: 320, elements: !1232)
!1232 = !{!1233, !1237, !1238, !1239, !1251}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1231, file: !801, line: 208, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !621, line: 62, baseType: !1236)
!1236 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !621, line: 61, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1231, file: !801, line: 211, baseType: !7, size: 32, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !801, line: 214, baseType: !676, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1231, file: !801, line: 224, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !801, line: 202, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !801, line: 202, size: 128, elements: !1243)
!1243 = !{!1244}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1242, file: !801, line: 202, baseType: !1245, size: 128)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !801, line: 200, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !801, line: 200, size: 128, elements: !1247)
!1247 = !{!1248, !1249, !1250}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1246, file: !801, line: 200, baseType: !7, size: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1246, file: !801, line: 200, baseType: !7, size: 32, offset: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1246, file: !801, line: 200, baseType: !834, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1231, file: !801, line: 234, baseType: !1240, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1225, file: !801, line: 197, baseType: !676, size: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !814, file: !801, line: 319, baseType: !683, size: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !814, file: !801, line: 320, baseType: !702, size: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !623, file: !135, line: 3384, baseType: !1256, size: 1472)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1257)
!1257 = !{!1258, !1279, !1280, !1281, !1282}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1256, file: !135, line: 3115, baseType: !1259, size: 1216)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1259, file: !135, line: 2985, baseType: !794, size: 960)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1259, file: !135, line: 2986, baseType: !620, size: 64, offset: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1259, file: !135, line: 2987, baseType: !620, size: 64, offset: 1024)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1259, file: !135, line: 2988, baseType: !620, size: 64, offset: 1088)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1259, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1259, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1259, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1259, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1259, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1259, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1259, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1259, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1259, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1259, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1259, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1259, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1259, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1259, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1256, file: !135, line: 3117, baseType: !620, size: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1256, file: !135, line: 3119, baseType: !620, size: 64, offset: 1280)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1256, file: !135, line: 3121, baseType: !620, size: 64, offset: 1344)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1256, file: !135, line: 3123, baseType: !620, size: 64, offset: 1408)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !623, file: !135, line: 3385, baseType: !1284, size: 1088)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1285)
!1285 = !{!1286, !1287, !1288}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1284, file: !135, line: 2875, baseType: !794, size: 960)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1284, file: !135, line: 2876, baseType: !798, size: 64, offset: 960)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1284, file: !135, line: 2877, baseType: !1289, size: 64, offset: 1024)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1291, line: 172, size: 128, elements: !1292)
!1291 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1290, file: !1291, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1290, file: !1291, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1290, file: !1291, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1290, file: !1291, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1290, file: !1291, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1290, file: !1291, line: 195, baseType: !7, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1290, file: !1291, line: 199, baseType: !620, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !623, file: !135, line: 3386, baseType: !1259, size: 1216)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !623, file: !135, line: 3387, baseType: !1302, size: 1280)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1303)
!1303 = !{!1304, !1305}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1302, file: !135, line: 3094, baseType: !1259, size: 1216)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1302, file: !135, line: 3095, baseType: !1289, size: 64, offset: 1216)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !623, file: !135, line: 3388, baseType: !1307, size: 1216)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1308)
!1308 = !{!1309, !1310, !1311, !1312, !1313, !1314}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1307, file: !135, line: 2825, baseType: !756, size: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1307, file: !135, line: 2827, baseType: !620, size: 64, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1307, file: !135, line: 2828, baseType: !620, size: 64, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1307, file: !135, line: 2829, baseType: !620, size: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1307, file: !135, line: 2830, baseType: !620, size: 64, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1307, file: !135, line: 2831, baseType: !620, size: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !623, file: !135, line: 3389, baseType: !1316, size: 1024)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1317)
!1317 = !{!1318, !1319, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1316, file: !135, line: 2851, baseType: !794, size: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1316, file: !135, line: 2852, baseType: !717, size: 32, offset: 960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1316, file: !135, line: 2853, baseType: !717, size: 32, offset: 992)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !623, file: !135, line: 3390, baseType: !1322, size: 1024)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1323)
!1323 = !{!1324, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1322, file: !135, line: 2858, baseType: !794, size: 960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1322, file: !135, line: 2859, baseType: !1289, size: 64, offset: 960)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !623, file: !135, line: 3391, baseType: !1327, size: 960)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1328)
!1328 = !{!1329}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !135, line: 2863, baseType: !794, size: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !623, file: !135, line: 3392, baseType: !1331, size: 1472)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1332)
!1332 = !{!1333}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1331, file: !135, line: 3305, baseType: !1256, size: 1472)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !623, file: !135, line: 3393, baseType: !1335, size: 1792)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1336)
!1336 = !{!1337, !1338, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1335, file: !135, line: 3249, baseType: !1256, size: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1335, file: !135, line: 3251, baseType: !1339, size: 64, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1341, line: 463, size: 1152, elements: !1342)
!1341 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1342 = !{!1343, !1346, !1377, !1378, !1487, !1490, !1491, !1492, !1493, !1494, !1495, !1519, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1340, file: !1341, line: 464, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1341, line: 464, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1340, file: !1341, line: 467, baseType: !1347, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1349)
!1349 = !{!1350, !1352, !1353, !1366, !1367, !1368, !1369, !1370, !1371, !1373, !1375, !1376}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1348, file: !330, line: 377, baseType: !1351, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !621, line: 111, baseType: !915)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1348, file: !330, line: 378, baseType: !1351, size: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1348, file: !330, line: 381, baseType: !1354, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1357)
!1357 = !{!1358}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1356, file: !330, line: 282, baseType: !1359, size: 128)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1361)
!1361 = !{!1362, !1363, !1364}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1360, file: !330, line: 281, baseType: !7, size: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1360, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1360, file: !330, line: 281, baseType: !1365, size: 64, offset: 64)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1351, size: 64, elements: !721)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1348, file: !330, line: 384, baseType: !717, size: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1348, file: !330, line: 387, baseType: !717, size: 32, offset: 224)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1348, file: !330, line: 390, baseType: !717, size: 32, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1348, file: !330, line: 394, baseType: !1354, size: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1348, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1348, file: !330, line: 399, baseType: !1372, size: 64, offset: 416)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !868)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1348, file: !330, line: 402, baseType: !1374, size: 64, offset: 480)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !868)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1348, file: !330, line: 406, baseType: !717, size: 32, offset: 544)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1348, file: !330, line: 409, baseType: !717, size: 32, offset: 576)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1340, file: !1341, line: 470, baseType: !942, size: 64, offset: 128)
