; ModuleID = 'alloc-pool.c'
source_filename = "alloc-pool.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.alloc_pool_def = type { i8*, i64, %struct.alloc_pool_list_def*, i8*, i64, i64, i64, i64, %struct.alloc_pool_list_def*, i64, i64 }
%struct.alloc_pool_list_def = type { %struct.alloc_pool_list_def* }
%struct.allocation_object_def = type { %union.anon }
%union.anon = type { i8* }

@.str = private unnamed_addr constant [13 x i8] c"alloc-pool.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"?\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.alloc_pool_def* @create_alloc_pool(i8* %name, i64 %size, i64 %num) #0 !dbg !50 {
entry:
  %name.addr = alloca i8*, align 8
  %size.addr = alloca i64, align 8
  %num.addr = alloca i64, align 8
  %pool = alloca %struct.alloc_pool_def*, align 8
  %header_size = alloca i64, align 8
  store i8* %name, i8** %name.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %name.addr, metadata !54, metadata !DIExpression()), !dbg !55
  store i64 %size, i64* %size.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %size.addr, metadata !56, metadata !DIExpression()), !dbg !57
  store i64 %num, i64* %num.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %num.addr, metadata !58, metadata !DIExpression()), !dbg !59

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "alloc-pool.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !31, !23, !17, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_def", file: !6, line: 32, size: 704, elements: !7)
!6 = !DIFile(filename: "./alloc-pool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !{!8, !12, !16, !22, !24, !25, !26, !27, !28, !29, !30}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !6, line: 34, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "elts_per_block", scope: !5, file: !6, line: 38, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 46, baseType: !15)
!14 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!15 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "returned_free_list", scope: !5, file: !6, line: 41, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool_list", file: !6, line: 30, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_pool_list_def", file: !6, line: 26, size: 64, elements: !20)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !6, line: 28, baseType: !18, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_free_list", scope: !5, file: !6, line: 45, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "virgin_elts_remaining", scope: !5, file: !6, line: 49, baseType: !13, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "elts_allocated", scope: !5, file: !6, line: 51, baseType: !13, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "elts_free", scope: !5, file: !6, line: 52, baseType: !13, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_allocated", scope: !5, file: !6, line: 53, baseType: !13, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "block_list", scope: !5, file: !6, line: 54, baseType: !17, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !5, file: !6, line: 55, baseType: !13, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "elt_size", scope: !5, file: !6, line: 56, baseType: !13, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation_object", file: !1, line: 49, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocation_object_def", file: !1, line: 30, size: 64, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !34, file: !1, line: 48, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !1, line: 37, size: 64, elements: !38)
!38 = !{!39, !43, !44}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !1, line: 40, baseType: !40, size: 8)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 1)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "align_p", scope: !37, file: !1, line: 46, baseType: !23, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "align_i", scope: !37, file: !1, line: 47, baseType: !45, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !{i32 7, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 4}
!49 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!50 = distinct !DISubprogram(name: "create_alloc_pool", scope: !1, file: !1, line: 132, type: !51, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !9, !13, !13}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_pool", file: !6, line: 58, baseType: !4)
!54 = !DILocalVariable(name: "name", arg: 1, scope: !50, file: !1, line: 132, type: !9)
!55 = !DILocation(line: 132, column: 32, scope: !50)
!56 = !DILocalVariable(name: "size", arg: 2, scope: !50, file: !1, line: 132, type: !13)
!57 = !DILocation(line: 132, column: 45, scope: !50)
!58 = !DILocalVariable(name: "num", arg: 3, scope: !50, file: !1, line: 132, type: !13)
!59 = !DILocation(line: 132, column: 58, scope: !50)
!60 = !DILocalVariable(name: "pool", scope: !50, file: !1, line: 134, type: !53)
!61 = !DILocation(line: 134, column: 14, scope: !50)
!62 = !DILocalVariable(name: "header_size", scope: !50, file: !1, line: 135, type: !13)
!63 = !DILocation(line: 135, column: 10, scope: !50)
!64 = !DILocation(line: 140, column: 3, scope: !50)
!65 = !DILocation(line: 143, column: 7, scope: !66)
!66 = distinct !DILexicalBlock(scope: !50, file: !1, line: 143, column: 7)
!67 = !DILocation(line: 143, column: 12, scope: !66)
!68 = !DILocation(line: 143, column: 7, scope: !50)
!69 = !DILocation(line: 144, column: 10, scope: !66)
!70 = !DILocation(line: 144, column: 5, scope: !66)
!71 = !DILocation(line: 147, column: 10, scope: !50)
!72 = !DILocation(line: 147, column: 8, scope: !50)
!73 = !DILocation(line: 155, column: 3, scope: !50)
!74 = !DILocation(line: 158, column: 10, scope: !50)
!75 = !DILocation(line: 158, column: 8, scope: !50)
!76 = !DILocation(line: 161, column: 34, scope: !50)
!77 = !DILocation(line: 161, column: 3, scope: !50)
!78 = !DILocation(line: 161, column: 9, scope: !50)
!79 = !DILocation(line: 161, column: 14, scope: !50)
!80 = !DILocation(line: 167, column: 20, scope: !50)
!81 = !DILocation(line: 167, column: 3, scope: !50)
!82 = !DILocation(line: 167, column: 9, scope: !50)
!83 = !DILocation(line: 167, column: 18, scope: !50)
!84 = !DILocation(line: 168, column: 26, scope: !50)
!85 = !DILocation(line: 168, column: 3, scope: !50)
!86 = !DILocation(line: 168, column: 9, scope: !50)
!87 = !DILocation(line: 168, column: 24, scope: !50)
!88 = !DILocation(line: 171, column: 15, scope: !50)
!89 = !DILocation(line: 173, column: 23, scope: !50)
