; ModuleID = 'ira-conflicts.c'
source_filename = "ira-conflicts.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ira_loop_tree_node = type { %struct.basic_block_def*, %struct.loop*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, i32, i8, %struct.ira_allocno**, i8, [27 x i32], %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!701 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!702 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!703 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!704 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!705 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!706 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!707 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!708 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!709 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!710 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!711 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!712 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!718 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !727, line: 36, baseType: !7, size: 32, elements: !728)
!727 = !DIFile(filename: "./machmode.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!729 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!730 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!731 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!732 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!733 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!734 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!735 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!736 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!737 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!738 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!739 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!740 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!741 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!742 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!743 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!744 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!745 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!746 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!747 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "op_type", file: !749, line: 25, baseType: !7, size: 32, elements: !750)
!749 = !DIFile(filename: "./recog.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !{!751, !752, !753}
!751 = !DIEnumerator(name: "OP_IN", value: 0, isUnsigned: true)
!752 = !DIEnumerator(name: "OP_OUT", value: 1, isUnsigned: true)
!753 = !DIEnumerator(name: "OP_INOUT", value: 2, isUnsigned: true)
!754 = !{!755, !758, !196, !759, !761, !1970, !768, !1971, !760, !7, !426, !773, !757, !726, !1972, !5}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !756, line: 42, baseType: !757)
!756 = !DIFile(filename: "./hard-reg-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ira_allocno_t", file: !763, line: 63, baseType: !764)
!763 = !DIFile(filename: "./ira-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ira_allocno", file: !763, line: 232, size: 1984, elements: !766)
!766 = !{!767, !769, !770, !771, !772, !1872, !1873, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1922, !1923, !1924, !1925, !1926, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !765, file: !763, line: 237, baseType: !768, size: 32)
!768 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "regno", scope: !765, file: !763, line: 239, baseType: !768, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !765, file: !763, line: 242, baseType: !5, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "hard_regno", scope: !765, file: !763, line: 249, baseType: !768, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !765, file: !763, line: 251, baseType: !773, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !774, line: 50, baseType: !775)
!774 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !427, line: 240, size: 384, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !776, file: !427, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !776, file: !427, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !776, file: !427, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !776, file: !427, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !776, file: !427, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !776, file: !427, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !776, file: !427, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !776, file: !427, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !776, file: !427, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !776, file: !427, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !776, file: !427, line: 321, baseType: !789, size: 320, offset: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !427, line: 315, size: 320, elements: !790)
!790 = !{!791, !1839, !1841, !1870, !1871}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !789, file: !427, line: 316, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 64, elements: !811)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !427, line: 183, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !427, line: 166, size: 64, elements: !795)
!795 = !{!796, !797, !798, !802, !803, !813, !814, !826, !829, !890, !1817, !1818, !1829, !1836}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !794, file: !427, line: 168, baseType: !768, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !794, file: !427, line: 169, baseType: !7, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !794, file: !427, line: 170, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !794, file: !427, line: 171, baseType: !773, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !794, file: !427, line: 172, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !774, line: 53, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !427, line: 359, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !806, file: !427, line: 360, baseType: !768, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !806, file: !427, line: 361, baseType: !810, size: 64, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 64, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 1)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !794, file: !427, line: 173, baseType: !5, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !794, file: !427, line: 174, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !427, line: 133, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 115, size: 32, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !816, file: !427, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !816, file: !427, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !816, file: !427, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !816, file: !427, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !816, file: !427, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !816, file: !427, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !816, file: !427, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !816, file: !427, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !794, file: !427, line: 175, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !427, line: 175, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !794, file: !427, line: 176, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !832, line: 75, size: 256, elements: !833)
!832 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!833 = !{!834, !848, !849, !850}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !831, file: !832, line: 76, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !832, line: 68, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !832, line: 63, size: 320, elements: !838)
!838 = !{!839, !841, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !832, line: 64, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !837, file: !832, line: 65, baseType: !840, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !832, line: 66, baseType: !7, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !837, file: !832, line: 67, baseType: !844, size: 128, offset: 192)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 128, elements: !846)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !832, line: 29, baseType: !757)
!846 = !{!847}
!847 = !DISubrange(count: 2)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !831, file: !832, line: 77, baseType: !835, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !831, file: !832, line: 78, baseType: !7, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !831, file: !832, line: 79, baseType: !851, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !832, line: 49, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !832, line: 45, size: 832, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !853, file: !832, line: 46, baseType: !840, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !853, file: !832, line: 47, baseType: !830, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !853, file: !832, line: 48, baseType: !858, size: 704, offset: 128)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !859, line: 164, size: 704, elements: !860)
!859 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!860 = !{!861, !862, !873, !874, !875, !876, !877, !878, !882, !886, !887, !888, !889}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !858, file: !859, line: 166, baseType: !760, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !858, file: !859, line: 167, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !859, line: 157, size: 192, elements: !865)
!865 = !{!866, !868, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !864, file: !859, line: 159, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !864, file: !859, line: 160, baseType: !863, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !864, file: !859, line: 161, baseType: !870, size: 32, offset: 128)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 32, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 4)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !858, file: !859, line: 168, baseType: !867, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !858, file: !859, line: 169, baseType: !867, size: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !858, file: !859, line: 170, baseType: !867, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !858, file: !859, line: 171, baseType: !760, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !858, file: !859, line: 172, baseType: !768, size: 32, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !858, file: !859, line: 176, baseType: !879, size: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!863, !758, !760}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !858, file: !859, line: 177, baseType: !883, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !758, !863}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !858, file: !859, line: 178, baseType: !758, size: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !858, file: !859, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !858, file: !859, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !858, file: !859, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !794, file: !427, line: 177, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !774, line: 56, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !894)
!894 = !{!895, !928, !934, !945, !964, !975, !980, !987, !993, !1007, !1019, !1057, !1062, !1090, !1098, !1099, !1104, !1113, !1119, !1124, !1128, !1132, !1444, !1493, !1499, !1506, !1513, !1536, !1561, !1578, !1590, !1612, !1627, !1799}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !893, file: !164, line: 3372, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !896, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !896, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !896, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !896, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !896, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !896, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !896, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !896, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !896, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !896, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !896, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !896, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !896, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !896, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !896, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !896, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !896, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !896, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !896, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !896, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !896, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !896, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !896, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !896, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !896, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !896, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !896, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !896, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !896, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !896, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !164, line: 3373, baseType: !929, size: 192)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !164, line: 403, baseType: !896, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !929, file: !164, line: 404, baseType: !891, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !929, file: !164, line: 405, baseType: !891, size: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !893, file: !164, line: 3374, baseType: !935, size: 320)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !935, file: !164, line: 1385, baseType: !929, size: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !935, file: !164, line: 1386, baseType: !939, size: 128, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !940, line: 58, baseType: !941)
!940 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !940, line: 54, size: 128, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !941, file: !940, line: 56, baseType: !757, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !941, file: !940, line: 57, baseType: !760, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !893, file: !164, line: 3375, baseType: !946, size: 256)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !164, line: 1398, baseType: !929, size: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !946, file: !164, line: 1399, baseType: !950, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !952, line: 52, size: 256, elements: !953)
!952 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!953 = !{!954, !955, !956, !957, !958, !959, !960}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !951, file: !952, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !951, file: !952, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !951, file: !952, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !951, file: !952, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !951, file: !952, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !951, file: !952, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !951, file: !952, line: 62, baseType: !961, size: 192, offset: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 192, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 3)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !893, file: !164, line: 3376, baseType: !965, size: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !965, file: !164, line: 1409, baseType: !929, size: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !965, file: !164, line: 1410, baseType: !969, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !971, line: 27, size: 192, elements: !972)
!971 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !970, file: !971, line: 29, baseType: !939, size: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !970, file: !971, line: 30, baseType: !5, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !893, file: !164, line: 3377, baseType: !976, size: 256)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !164, line: 1438, baseType: !929, size: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !976, file: !164, line: 1439, baseType: !891, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !893, file: !164, line: 3378, baseType: !981, size: 256)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !164, line: 1419, baseType: !929, size: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !981, file: !164, line: 1420, baseType: !768, size: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !981, file: !164, line: 1421, baseType: !986, size: 8, offset: 224)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 8, elements: !811)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !893, file: !164, line: 3379, baseType: !988, size: 320)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !164, line: 1429, baseType: !929, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !988, file: !164, line: 1430, baseType: !891, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !988, file: !164, line: 1431, baseType: !891, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !893, file: !164, line: 3380, baseType: !994, size: 320)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !994, file: !164, line: 1461, baseType: !929, size: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !994, file: !164, line: 1462, baseType: !998, size: 128, offset: 192)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !999, line: 31, size: 128, elements: !1000)
!999 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = !{!1001, !1005, !1006}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !998, file: !999, line: 32, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !998, file: !999, line: 33, baseType: !7, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !998, file: !999, line: 34, baseType: !7, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !893, file: !164, line: 3381, baseType: !1008, size: 384)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !1009)
!1009 = !{!1010, !1011, !1016, !1017, !1018}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1008, file: !164, line: 2508, baseType: !929, size: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1008, file: !164, line: 2509, baseType: !1012, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1013, line: 58, baseType: !1014)
!1013 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1015, line: 44, baseType: !7)
!1015 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1008, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !164, line: 2511, baseType: !891, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1008, file: !164, line: 2512, baseType: !891, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !893, file: !164, line: 3382, baseType: !1020, size: 896)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !164, line: 2653, baseType: !1008, size: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1020, file: !164, line: 2654, baseType: !891, size: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1020, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1020, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1020, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1020, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1020, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1020, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1020, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1020, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1020, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1020, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1020, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1020, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1020, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1020, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1020, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1020, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1020, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1020, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1020, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1020, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1020, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1020, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1020, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1020, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1020, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1020, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1020, file: !164, line: 2705, baseType: !891, size: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1020, file: !164, line: 2706, baseType: !891, size: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1020, file: !164, line: 2707, baseType: !891, size: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1020, file: !164, line: 2708, baseType: !891, size: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1020, file: !164, line: 2711, baseType: !1055, size: 64, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !893, file: !164, line: 3383, baseType: !1058, size: 960)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !164, line: 2757, baseType: !1020, size: 896)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1058, file: !164, line: 2758, baseType: !773, size: 64, offset: 896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !893, file: !164, line: 3384, baseType: !1063, size: 1472)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1064)
!1064 = !{!1065, !1086, !1087, !1088, !1089}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !164, line: 3115, baseType: !1066, size: 1216)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !164, line: 2985, baseType: !1058, size: 960)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1066, file: !164, line: 2986, baseType: !891, size: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1066, file: !164, line: 2987, baseType: !891, size: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1066, file: !164, line: 2988, baseType: !891, size: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1066, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1066, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1066, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1066, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1066, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1066, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1066, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1066, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1066, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1066, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1066, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1066, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1066, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1066, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1063, file: !164, line: 3117, baseType: !891, size: 64, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1063, file: !164, line: 3119, baseType: !891, size: 64, offset: 1280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1063, file: !164, line: 3121, baseType: !891, size: 64, offset: 1344)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1063, file: !164, line: 3123, baseType: !891, size: 64, offset: 1408)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !893, file: !164, line: 3385, baseType: !1091, size: 1088)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !164, line: 2875, baseType: !1058, size: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1091, file: !164, line: 2876, baseType: !773, size: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1091, file: !164, line: 2877, baseType: !1096, size: 64, offset: 1024)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !893, file: !164, line: 3386, baseType: !1066, size: 1216)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !893, file: !164, line: 3387, baseType: !1100, size: 1280)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !164, line: 3094, baseType: !1066, size: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1100, file: !164, line: 3095, baseType: !1096, size: 64, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !893, file: !164, line: 3388, baseType: !1105, size: 1216)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !164, line: 2825, baseType: !1020, size: 896)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1105, file: !164, line: 2827, baseType: !891, size: 64, offset: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1105, file: !164, line: 2828, baseType: !891, size: 64, offset: 960)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1105, file: !164, line: 2829, baseType: !891, size: 64, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1105, file: !164, line: 2830, baseType: !891, size: 64, offset: 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1105, file: !164, line: 2831, baseType: !891, size: 64, offset: 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !893, file: !164, line: 3389, baseType: !1114, size: 1024)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !164, line: 2851, baseType: !1058, size: 960)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1114, file: !164, line: 2852, baseType: !768, size: 32, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1114, file: !164, line: 2853, baseType: !768, size: 32, offset: 992)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !893, file: !164, line: 3390, baseType: !1120, size: 1024)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !164, line: 2858, baseType: !1058, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1120, file: !164, line: 2859, baseType: !1096, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !893, file: !164, line: 3391, baseType: !1125, size: 960)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !164, line: 2863, baseType: !1058, size: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !893, file: !164, line: 3392, baseType: !1129, size: 1472)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1130)
!1130 = !{!1131}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1129, file: !164, line: 3305, baseType: !1063, size: 1472)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !893, file: !164, line: 3393, baseType: !1133, size: 1792)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1134)
!1134 = !{!1135, !1136, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !164, line: 3249, baseType: !1063, size: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1133, file: !164, line: 3251, baseType: !1137, size: 64, offset: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1139, line: 463, size: 1152, elements: !1140)
!1139 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1140 = !{!1141, !1144, !1304, !1305, !1308, !1367, !1368, !1369, !1370, !1371, !1372, !1396, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1138, file: !1139, line: 464, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1139, line: 464, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1138, file: !1139, line: 467, baseType: !1145, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !1147)
!1147 = !{!1148, !1279, !1280, !1293, !1294, !1295, !1296, !1297, !1298, !1300, !1302, !1303}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1146, file: !148, line: 377, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !774, line: 111, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !1152)
!1152 = !{!1153, !1188, !1189, !1190, !1249, !1253, !1254, !1255, !1273, !1274, !1275, !1276, !1277, !1278}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1151, file: !148, line: 219, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1156, file: !148, line: 151, baseType: !1159, size: 128)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1160, file: !148, line: 150, baseType: !7, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1160, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1160, file: !148, line: 150, baseType: !1165, size: 64, offset: 64)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1166, size: 64, elements: !811)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !774, line: 108, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1168, file: !148, line: 124, baseType: !1150, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1168, file: !148, line: 125, baseType: !1150, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1168, file: !148, line: 131, baseType: !1173, size: 64, offset: 128)
!1173 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !1174)
!1174 = !{!1175, !1179}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1173, file: !148, line: 129, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !774, line: 66, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !774, line: 65, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1173, file: !148, line: 130, baseType: !773, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1168, file: !148, line: 134, baseType: !758, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1168, file: !148, line: 137, baseType: !891, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1168, file: !148, line: 138, baseType: !1012, size: 32, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1168, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !148, line: 144, baseType: !768, size: 32, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1168, file: !148, line: 145, baseType: !768, size: 32, offset: 416)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1168, file: !148, line: 146, baseType: !1187, size: 64, offset: 448)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !760)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1151, file: !148, line: 220, baseType: !1154, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1151, file: !148, line: 223, baseType: !758, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1151, file: !148, line: 226, baseType: !1191, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1203, !1204, !1205, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1239, !1247, !1248}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1192, file: !135, line: 102, baseType: !768, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1192, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1192, file: !135, line: 108, baseType: !1150, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1192, file: !135, line: 111, baseType: !1150, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1192, file: !135, line: 114, baseType: !1199, size: 64, offset: 192)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1200)
!1200 = !{!1201, !1202}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1199, file: !135, line: 42, baseType: !134, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1199, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1192, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1192, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1192, file: !135, line: 123, baseType: !1206, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1208, file: !135, line: 87, baseType: !1211, size: 128)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1212, file: !135, line: 85, baseType: !7, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1212, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1212, file: !135, line: 85, baseType: !1217, size: 64, offset: 64)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 64, elements: !811)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !1191)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1192, file: !135, line: 126, baseType: !1191, size: 64, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1192, file: !135, line: 129, baseType: !1191, size: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1192, file: !135, line: 132, baseType: !758, size: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1192, file: !135, line: 139, baseType: !891, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1192, file: !135, line: 143, baseType: !939, size: 128, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1192, file: !135, line: 146, baseType: !939, size: 128, offset: 768)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1192, file: !135, line: 148, baseType: !1004, size: 8, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1192, file: !135, line: 149, baseType: !1004, size: 8, offset: 904)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1192, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1192, file: !135, line: 156, baseType: !1229, size: 64, offset: 960)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1231)
!1231 = !{!1232, !1236, !1237, !1238}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1230, file: !135, line: 50, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !774, line: 58, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !774, line: 57, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1230, file: !135, line: 59, baseType: !939, size: 128, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1230, file: !135, line: 64, baseType: !1004, size: 8, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1230, file: !135, line: 67, baseType: !1229, size: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1192, file: !135, line: 159, baseType: !1240, size: 64, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1241, file: !135, line: 74, baseType: !1167, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1241, file: !135, line: 77, baseType: !1240, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1241, file: !135, line: 78, baseType: !1240, size: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1241, file: !135, line: 81, baseType: !1240, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1192, file: !135, line: 162, baseType: !1004, size: 8, offset: 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1192, file: !135, line: 166, baseType: !891, size: 64, offset: 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1151, file: !148, line: 229, baseType: !1250, size: 128, offset: 256)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1251, size: 128, elements: !846)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1151, file: !148, line: 232, baseType: !1150, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1151, file: !148, line: 233, baseType: !1150, size: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1151, file: !148, line: 238, baseType: !1256, size: 64, offset: 512)
!1256 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1257)
!1257 = !{!1258, !1264}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1256, file: !148, line: 236, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1260, file: !148, line: 275, baseType: !1176, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1260, file: !148, line: 278, baseType: !1176, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1256, file: !148, line: 237, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1266, file: !148, line: 261, baseType: !773, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1266, file: !148, line: 262, baseType: !773, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1266, file: !148, line: 266, baseType: !773, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1266, file: !148, line: 267, baseType: !773, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1266, file: !148, line: 270, baseType: !768, size: 32, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1151, file: !148, line: 241, baseType: !1187, size: 64, offset: 576)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1151, file: !148, line: 244, baseType: !768, size: 32, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1151, file: !148, line: 247, baseType: !768, size: 32, offset: 672)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1151, file: !148, line: 250, baseType: !768, size: 32, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1151, file: !148, line: 253, baseType: !768, size: 32, offset: 736)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !148, line: 256, baseType: !768, size: 32, offset: 768)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1146, file: !148, line: 378, baseType: !1149, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1146, file: !148, line: 381, baseType: !1281, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1284)
!1284 = !{!1285}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1283, file: !148, line: 282, baseType: !1286, size: 128)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1287, file: !148, line: 281, baseType: !7, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1287, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1287, file: !148, line: 281, baseType: !1292, size: 64, offset: 64)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 64, elements: !811)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1146, file: !148, line: 384, baseType: !768, size: 32, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1146, file: !148, line: 387, baseType: !768, size: 32, offset: 224)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1146, file: !148, line: 390, baseType: !768, size: 32, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1146, file: !148, line: 394, baseType: !1281, size: 64, offset: 320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1146, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1146, file: !148, line: 399, baseType: !1299, size: 64, offset: 416)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !846)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1146, file: !148, line: 402, baseType: !1301, size: 64, offset: 480)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !846)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1146, file: !148, line: 406, baseType: !768, size: 32, offset: 544)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1146, file: !148, line: 409, baseType: !768, size: 32, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1138, file: !1139, line: 470, baseType: !1177, size: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1138, file: !1139, line: 473, baseType: !1306, size: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1139, line: 166, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1138, file: !1139, line: 476, baseType: !1309, size: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1366}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1310, file: !135, line: 189, baseType: !768, size: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1310, file: !135, line: 192, baseType: !1206, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1310, file: !135, line: 197, baseType: !1315, size: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1316, line: 144, baseType: !1317)
!1316 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1316, line: 100, size: 896, elements: !1319)
!1319 = !{!1320, !1328, !1333, !1338, !1340, !1343, !1344, !1345, !1346, !1347, !1352, !1354, !1355, !1360, !1365}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1318, file: !1316, line: 102, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1316, line: 52, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!1325, !1326}
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1316, line: 47, baseType: !7)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1318, file: !1316, line: 105, baseType: !1329, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1316, line: 59, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!768, !1326, !1326}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1318, file: !1316, line: 108, baseType: !1334, size: 64, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1316, line: 63, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{null, !758}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1318, file: !1316, line: 111, baseType: !1339, size: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1318, file: !1316, line: 114, baseType: !1341, size: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1342, line: 46, baseType: !757)
!1342 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1318, file: !1316, line: 117, baseType: !1341, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1318, file: !1316, line: 120, baseType: !1341, size: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1318, file: !1316, line: 124, baseType: !7, size: 32, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1318, file: !1316, line: 128, baseType: !7, size: 32, offset: 480)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1318, file: !1316, line: 131, baseType: !1348, size: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1316, line: 75, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!758, !1341, !1341}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1318, file: !1316, line: 132, baseType: !1353, size: 64, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1316, line: 78, baseType: !1335)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1318, file: !1316, line: 135, baseType: !758, size: 64, offset: 640)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1318, file: !1316, line: 136, baseType: !1356, size: 64, offset: 704)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1316, line: 82, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!758, !758, !1341, !1341}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1318, file: !1316, line: 137, baseType: !1361, size: 64, offset: 768)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1316, line: 83, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !758, !758}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1318, file: !1316, line: 141, baseType: !7, size: 32, offset: 832)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1310, file: !135, line: 200, baseType: !1191, size: 64, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1138, file: !1139, line: 479, baseType: !1315, size: 64, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1138, file: !1139, line: 484, baseType: !891, size: 64, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1138, file: !1139, line: 488, baseType: !891, size: 64, offset: 448)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1138, file: !1139, line: 493, baseType: !891, size: 64, offset: 512)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1138, file: !1139, line: 496, baseType: !891, size: 64, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1138, file: !1139, line: 501, baseType: !1373, size: 64, offset: 640)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1375)
!1375 = !{!1376, !1379, !1380, !1381, !1382, !1384, !1385, !1390, !1391, !1392, !1393, !1394, !1395}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1374, file: !159, line: 2356, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1374, file: !159, line: 2357, baseType: !799, size: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1374, file: !159, line: 2358, baseType: !768, size: 32, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1374, file: !159, line: 2359, baseType: !768, size: 32, offset: 160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1374, file: !159, line: 2360, baseType: !1383, size: 128, offset: 192)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 128, elements: !871)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1374, file: !159, line: 2364, baseType: !768, size: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1374, file: !159, line: 2367, baseType: !1386, size: 128, offset: 384)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1386, file: !159, line: 2351, baseType: !773, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1386, file: !159, line: 2352, baseType: !760, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1374, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1374, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1374, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1374, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1374, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1374, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1138, file: !1139, line: 504, baseType: !1397, size: 64, offset: 704)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1139, line: 504, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1138, file: !1139, line: 507, baseType: !1315, size: 64, offset: 768)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1138, file: !1139, line: 510, baseType: !768, size: 32, offset: 832)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1138, file: !1139, line: 513, baseType: !768, size: 32, offset: 864)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1138, file: !1139, line: 516, baseType: !1012, size: 32, offset: 896)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1138, file: !1139, line: 519, baseType: !1012, size: 32, offset: 928)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1138, file: !1139, line: 522, baseType: !7, size: 32, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1138, file: !1139, line: 523, baseType: !7, size: 32, offset: 992)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1138, file: !1139, line: 528, baseType: !799, size: 64, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1138, file: !1139, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1138, file: !1139, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1138, file: !1139, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1138, file: !1139, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1138, file: !1139, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1138, file: !1139, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1138, file: !1139, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1138, file: !1139, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1138, file: !1139, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1138, file: !1139, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1138, file: !1139, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1138, file: !1139, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1138, file: !1139, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1138, file: !1139, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1138, file: !1139, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1138, file: !1139, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1133, file: !164, line: 3254, baseType: !891, size: 64, offset: 1536)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1133, file: !164, line: 3257, baseType: !891, size: 64, offset: 1600)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1133, file: !164, line: 3258, baseType: !891, size: 64, offset: 1664)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1133, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1133, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1133, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1133, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1133, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1133, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1133, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1133, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1133, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1133, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1133, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1133, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1133, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1133, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1133, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1133, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1133, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1133, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !893, file: !164, line: 3394, baseType: !1445, size: 1344)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1472, !1473, !1474, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1445, file: !164, line: 2280, baseType: !929, size: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1445, file: !164, line: 2281, baseType: !891, size: 64, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1445, file: !164, line: 2282, baseType: !891, size: 64, offset: 256)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1445, file: !164, line: 2283, baseType: !891, size: 64, offset: 320)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1445, file: !164, line: 2284, baseType: !891, size: 64, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1445, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1445, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1445, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1445, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1445, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1445, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1445, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1445, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1445, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1445, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1445, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1445, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1445, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1445, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1445, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1445, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1445, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1445, file: !164, line: 2306, baseType: !1470, size: 32, offset: 544)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1471, line: 31, baseType: !768)
!1471 = !DIFile(filename: "./alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1445, file: !164, line: 2307, baseType: !891, size: 64, offset: 576)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1445, file: !164, line: 2308, baseType: !891, size: 64, offset: 640)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1445, file: !164, line: 2314, baseType: !1475, size: 64, offset: 704)
!1475 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1476)
!1476 = !{!1477, !1478, !1479}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1475, file: !164, line: 2310, baseType: !768, size: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1475, file: !164, line: 2311, baseType: !799, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1475, file: !164, line: 2312, baseType: !1480, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1445, file: !164, line: 2315, baseType: !891, size: 64, offset: 768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1445, file: !164, line: 2316, baseType: !891, size: 64, offset: 832)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1445, file: !164, line: 2317, baseType: !891, size: 64, offset: 896)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1445, file: !164, line: 2318, baseType: !891, size: 64, offset: 960)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1445, file: !164, line: 2319, baseType: !891, size: 64, offset: 1024)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1445, file: !164, line: 2320, baseType: !891, size: 64, offset: 1088)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1445, file: !164, line: 2321, baseType: !891, size: 64, offset: 1152)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1445, file: !164, line: 2322, baseType: !891, size: 64, offset: 1216)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1445, file: !164, line: 2324, baseType: !1491, size: 64, offset: 1280)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !893, file: !164, line: 3395, baseType: !1494, size: 320)
