; ModuleID = 'fibheap.c'
source_filename = "fibheap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.fibheap = type { i64, %struct.fibnode*, %struct.fibnode* }
%struct.fibnode = type { %struct.fibnode*, %struct.fibnode*, %struct.fibnode*, %struct.fibnode*, i64, i8*, i32 }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [33 x i8] c"Can't force minimum on fibheap.\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.fibheap* @fibheap_new() #0 !dbg !35 {
entry:
  %call = call i8* @xcalloc(i64 1, i64 24), !dbg !38
  %0 = bitcast i8* %call to %struct.fibheap*, !dbg !39
  ret %struct.fibheap* %0, !dbg !40
}

declare dso_local i8* @xcalloc(i64, i64) #1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.fibnode* @fibheap_insert(%struct.fibheap* %heap, i64 %key, i8* %data) #0 !dbg !41 {
entry:
  %heap.addr = alloca %struct.fibheap*, align 8
  %key.addr = alloca i64, align 8
  %data.addr = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "fibheap.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !25, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheap_t", file: !5, line: 57, baseType: !6)
!5 = !DIFile(filename: "./include/fibheap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibheap", file: !5, line: 52, size: 192, elements: !8)
!8 = !{!9, !13, !29}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !7, file: !5, line: 54, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 46, baseType: !12)
!11 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !7, file: !5, line: 55, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibnode", file: !5, line: 59, size: 448, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !24, !26, !28}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !15, file: !5, line: 61, baseType: !14, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !15, file: !5, line: 62, baseType: !14, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !15, file: !5, line: 63, baseType: !14, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !15, file: !5, line: 64, baseType: !14, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !15, file: !5, line: 65, baseType: !22, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheapkey_t", file: !5, line: 50, baseType: !23)
!23 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !5, line: 66, baseType: !25, size: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !15, file: !5, line: 71, baseType: !27, size: 31, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !15, file: !5, line: 72, baseType: !27, size: 1, offset: 415, flags: DIFlagBitField, extraData: i64 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !7, file: !5, line: 56, baseType: !14, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibnode_t", file: !5, line: 74, baseType: !14)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "fibheap_new", scope: !1, file: !1, line: 57, type: !36, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!4}
!38 = !DILocation(line: 59, column: 22, scope: !35)
!39 = !DILocation(line: 59, column: 10, scope: !35)
!40 = !DILocation(line: 59, column: 3, scope: !35)
!41 = distinct !DISubprogram(name: "fibheap_insert", scope: !1, file: !1, line: 98, type: !42, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{!30, !4, !22, !25}
!44 = !DILocalVariable(name: "heap", arg: 1, scope: !41, file: !1, line: 98, type: !4)
!45 = !DILocation(line: 98, column: 27, scope: !41)
!46 = !DILocalVariable(name: "key", arg: 2, scope: !41, file: !1, line: 98, type: !22)
!47 = !DILocation(line: 98, column: 46, scope: !41)
!48 = !DILocalVariable(name: "data", arg: 3, scope: !41, file: !1, line: 98, type: !25)
!49 = !DILocation(line: 98, column: 57, scope: !41)
!50 = !DILocalVariable(name: "node", scope: !41, file: !1, line: 100, type: !30)
!51 = !DILocation(line: 100, column: 13, scope: !41)
!52 = !DILocation(line: 103, column: 10, scope: !41)
!53 = !DILocation(line: 103, column: 8, scope: !41)
!54 = !DILocation(line: 106, column: 16, scope: !41)
!55 = !DILocation(line: 106, column: 3, scope: !41)
!56 = !DILocation(line: 106, column: 9, scope: !41)
!57 = !DILocation(line: 106, column: 14, scope: !41)
!58 = !DILocation(line: 107, column: 15, scope: !41)
!59 = !DILocation(line: 107, column: 3, scope: !41)
!60 = !DILocation(line: 107, column: 9, scope: !41)
!61 = !DILocation(line: 107, column: 13, scope: !41)
!62 = !DILocation(line: 110, column: 21, scope: !41)
!63 = !DILocation(line: 110, column: 27, scope: !41)
!64 = !DILocation(line: 110, column: 3, scope: !41)
!65 = !DILocation(line: 114, column: 7, scope: !66)
!66 = distinct !DILexicalBlock(scope: !41, file: !1, line: 114, column: 7)
!67 = !DILocation(line: 114, column: 13, scope: !66)
!68 = !DILocation(line: 114, column: 17, scope: !66)
!69 = !DILocation(line: 114, column: 25, scope: !66)
!70 = !DILocation(line: 114, column: 28, scope: !66)
!71 = !DILocation(line: 114, column: 34, scope: !66)
!72 = !DILocation(line: 114, column: 40, scope: !66)
!73 = !DILocation(line: 114, column: 46, scope: !66)
!74 = !DILocation(line: 114, column: 51, scope: !66)
!75 = !DILocation(line: 114, column: 38, scope: !66)
!76 = !DILocation(line: 114, column: 7, scope: !41)
!77 = !DILocation(line: 115, column: 17, scope: !66)
!78 = !DILocation(line: 115, column: 5, scope: !66)
!79 = !DILocation(line: 115, column: 11, scope: !66)
!80 = !DILocation(line: 115, column: 15, scope: !66)
!81 = !DILocation(line: 117, column: 3, scope: !41)
!82 = !DILocation(line: 117, column: 9, scope: !41)
!83 = !DILocation(line: 117, column: 14, scope: !41)
!84 = !DILocation(line: 119, column: 10, scope: !41)
!85 = !DILocation(line: 119, column: 3, scope: !41)
!86 = distinct !DISubprogram(name: "fibnode_new", scope: !1, file: !1, line: 64, type: !87, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!87 = !DISubroutineType(types: !88)
!88 = !{!30}
!89 = !DILocalVariable(name: "node", scope: !86, file: !1, line: 66, type: !30)
!90 = !DILocation(line: 66, column: 13, scope: !86)
!91 = !DILocation(line: 68, column: 22, scope: !86)
!92 = !DILocation(line: 68, column: 10, scope: !86)
