; ModuleID = 'decimal32.c'
source_filename = "decimal32.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.decimal32 = type { [4 x i8] }
%struct.decNumber = type { i32, i32, i8, [3 x i16] }
%struct.decContext = type { i32, i32, i32, i32, i32, i32, i8 }
%union.anon = type { i32 }
%union.anon.0 = type { i32 }

@BIN2DPD = external dso_local constant [1000 x i16], align 16
@COMBMSD = external dso_local constant [32 x i32], align 16
@COMBEXP = external dso_local constant [32 x i32], align 16
@.str = private unnamed_addr constant [4 x i8] c"Inf\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"inity\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"NaN\00", align 1
@BIN2CHAR = external dso_local constant [4001 x i8], align 16
@DPD2BIN = external dso_local constant [1024 x i16], align 16

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.decimal32* @__dpd32FromNumber(%struct.decimal32* %d32, %struct.decNumber* %dn, %struct.decContext* %set) #0 !dbg !31 {
entry:
  %d32.addr = alloca %struct.decimal32*, align 8
  %dn.addr = alloca %struct.decNumber*, align 8
  %set.addr = alloca %struct.decContext*, align 8
  %status = alloca i32, align 4
  %ae = alloca i32, align 4
  %dw = alloca %struct.decNumber, align 4
  %dc = alloca %struct.decContext, align 4
  %comb = alloca i32, align 4
  %exp = alloca i32, align 4
  %uiwork = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "decimal32.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rounding", file: !4, line: 69, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./decContext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "DEC_ROUND_CEILING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DEC_ROUND_UP", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "DEC_ROUND_HALF_UP", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "DEC_ROUND_HALF_EVEN", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "DEC_ROUND_HALF_DOWN", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "DEC_ROUND_DOWN", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "DEC_ROUND_FLOOR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "DEC_ROUND_05UP", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "DEC_ROUND_MAX", value: 8, isUnsigned: true)
!16 = !{!17, !21, !22, !26}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !5)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 26, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !20, line: 41, baseType: !25)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{i32 7, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!31 = distinct !DISubprogram(name: "__dpd32FromNumber", scope: !1, file: !1, line: 115, type: !32, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !73)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !34, !46, !62}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "decimal32", file: !36, line: 64, baseType: !37)
!36 = !DIFile(filename: "./decimal32.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 62, size: 32, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !37, file: !36, line: 63, baseType: !40, size: 32)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !44)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !43)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !{!45}
!45 = !DISubrange(count: 4)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "decNumber", file: !49, line: 84, baseType: !50)
!49 = !DIFile(filename: "./decNumber.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 77, size: 128, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !50, file: !49, line: 78, baseType: !22, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !50, file: !49, line: 79, baseType: !22, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !50, file: !49, line: 81, baseType: !41, size: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lsu", scope: !50, file: !49, line: 83, baseType: !56, size: 48, offset: 80)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 48, elements: !60)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !59)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "decContext", file: !4, line: 93, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 82, size: 224, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !64, file: !4, line: 83, baseType: !22, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !64, file: !4, line: 84, baseType: !22, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !64, file: !4, line: 85, baseType: !22, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !64, file: !4, line: 86, baseType: !3, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !64, file: !4, line: 87, baseType: !17, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !64, file: !4, line: 88, baseType: !17, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !64, file: !4, line: 89, baseType: !41, size: 8, offset: 192)
!73 = !{}
!74 = !DILocalVariable(name: "d32", arg: 1, scope: !31, file: !1, line: 115, type: !34)
!75 = !DILocation(line: 115, column: 44, scope: !31)
!76 = !DILocalVariable(name: "dn", arg: 2, scope: !31, file: !1, line: 115, type: !46)
!77 = !DILocation(line: 115, column: 66, scope: !31)
!78 = !DILocalVariable(name: "set", arg: 3, scope: !31, file: !1, line: 116, type: !62)
!79 = !DILocation(line: 116, column: 22, scope: !31)
!80 = !DILocalVariable(name: "status", scope: !31, file: !1, line: 117, type: !17)
!81 = !DILocation(line: 117, column: 8, scope: !31)
!82 = !DILocalVariable(name: "ae", scope: !31, file: !1, line: 118, type: !22)
!83 = !DILocation(line: 118, column: 7, scope: !31)
!84 = !DILocalVariable(name: "dw", scope: !31, file: !1, line: 119, type: !48)
!85 = !DILocation(line: 119, column: 14, scope: !31)
!86 = !DILocalVariable(name: "dc", scope: !31, file: !1, line: 120, type: !63)
!87 = !DILocation(line: 120, column: 14, scope: !31)
!88 = !DILocalVariable(name: "comb", scope: !31, file: !1, line: 121, type: !17)
!89 = !DILocation(line: 121, column: 8, scope: !31)
!90 = !DILocalVariable(name: "exp", scope: !31, file: !1, line: 121, type: !17)
!91 = !DILocation(line: 121, column: 14, scope: !31)
!92 = !DILocalVariable(name: "uiwork", scope: !31, file: !1, line: 122, type: !17)
!93 = !DILocation(line: 122, column: 8, scope: !31)
!94 = !DILocalVariable(name: "targ", scope: !31, file: !1, line: 123, type: !17)
!95 = !DILocation(line: 123, column: 8, scope: !31)
!96 = !DILocation(line: 130, column: 6, scope: !31)
!97 = !DILocation(line: 130, column: 10, scope: !31)
!98 = !DILocation(line: 130, column: 19, scope: !31)
!99 = !DILocation(line: 130, column: 23, scope: !31)
!100 = !DILocation(line: 130, column: 18, scope: !31)
!101 = !DILocation(line: 130, column: 29, scope: !31)
!102 = !DILocation(line: 130, column: 5, scope: !31)
!103 = !DILocation(line: 131, column: 7, scope: !104)
!104 = distinct !DILexicalBlock(scope: !31, file: !1, line: 131, column: 7)
!105 = !DILocation(line: 131, column: 11, scope: !104)
!106 = !DILocation(line: 131, column: 17, scope: !104)
!107 = !DILocation(line: 132, column: 4, scope: !104)
!108 = !DILocation(line: 132, column: 7, scope: !104)
!109 = !DILocation(line: 132, column: 9, scope: !104)
!110 = !DILocation(line: 133, column: 4, scope: !104)
!111 = !DILocation(line: 133, column: 7, scope: !104)
!112 = !DILocation(line: 133, column: 9, scope: !104)
!113 = !DILocation(line: 131, column: 7, scope: !31)
!114 = !DILocation(line: 134, column: 5, scope: !115)
!115 = distinct !DILexicalBlock(scope: !104, file: !1, line: 133, column: 26)
!116 = !DILocation(line: 135, column: 14, scope: !115)
!117 = !DILocation(line: 135, column: 19, scope: !115)
!118 = !DILocation(line: 135, column: 8, scope: !115)
!119 = !DILocation(line: 135, column: 13, scope: !115)
!120 = !DILocation(line: 136, column: 24, scope: !115)
!121 = !DILocation(line: 136, column: 5, scope: !115)
!122 = !DILocation(line: 138, column: 14, scope: !115)
!123 = !DILocation(line: 138, column: 18, scope: !115)
!124 = !DILocation(line: 138, column: 22, scope: !115)
!125 = !DILocation(line: 138, column: 8, scope: !115)
!126 = !DILocation(line: 138, column: 12, scope: !115)
!127 = !DILocation(line: 139, column: 15, scope: !115)
!128 = !DILocation(line: 139, column: 11, scope: !115)
!129 = !DILocation(line: 140, column: 7, scope: !115)
!130 = !DILocation(line: 141, column: 5, scope: !115)
!131 = !DILocation(line: 143, column: 7, scope: !132)
!132 = distinct !DILexicalBlock(scope: !31, file: !1, line: 143, column: 7)
!133 = !DILocation(line: 143, column: 11, scope: !132)
!134 = !DILocation(line: 143, column: 15, scope: !132)
!135 = !DILocation(line: 143, column: 7, scope: !31)
!136 = !DILocation(line: 144, column: 9, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 144, column: 9)
