; ModuleID = 'ipa-inline.c'
source_filename = "ipa-inline.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cgraph_node = type { %union.tree_node*, %struct.cgraph_edge*, %struct.cgraph_edge*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.cgraph_node*, %struct.htab*, i8*, %struct.VEC_ipa_opt_pass_heap*, %struct.cgraph_local_info, %struct.cgraph_global_info, %struct.cgraph_rtl_info, %struct.cgraph_clone_info, %struct.cgraph_thunk_info, i64, i32, i32, i32, i16 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }

!1018 = !DIEnumerator(name: "gt_e_P15interface_tuple4htab", value: 175, isUnsigned: true)
!1019 = !DIEnumerator(name: "gt_e_P16volatilized_type4htab", value: 176, isUnsigned: true)
!1020 = !DIEnumerator(name: "gt_e_P17string_descriptor4htab", value: 177, isUnsigned: true)
!1021 = !DIEnumerator(name: "gt_e_P14type_assertion4htab", value: 178, isUnsigned: true)
!1022 = !DIEnumerator(name: "gt_e_P18treetreehash_entry4htab", value: 179, isUnsigned: true)
!1023 = !DIEnumerator(name: "gt_e_P17module_htab_entry4htab", value: 180, isUnsigned: true)
!1024 = !DIEnumerator(name: "gt_e_P21pending_abstract_type4htab", value: 181, isUnsigned: true)
!1025 = !DIEnumerator(name: "gt_e_P10spec_entry4htab", value: 182, isUnsigned: true)
!1026 = !DIEnumerator(name: "gt_e_P16cxx_int_tree_map4htab", value: 183, isUnsigned: true)
!1027 = !DIEnumerator(name: "gt_e_P17named_label_entry4htab", value: 184, isUnsigned: true)
!1028 = !DIEnumerator(name: "gt_e_P12tree_int_map4htab", value: 185, isUnsigned: true)
!1029 = !DIEnumerator(name: "gt_e_P20lto_symtab_entry_def4htab", value: 186, isUnsigned: true)
!1030 = !DIEnumerator(name: "gt_e_IP9tree_node12splay_tree_s", value: 187, isUnsigned: true)
!1031 = !DIEnumerator(name: "gt_e_P9tree_nodeP9tree_node12splay_tree_s", value: 188, isUnsigned: true)
!1032 = !DIEnumerator(name: "gt_e_P12varpool_node4htab", value: 189, isUnsigned: true)
!1033 = !DIEnumerator(name: "gt_e_P13scev_info_str4htab", value: 190, isUnsigned: true)
!1034 = !DIEnumerator(name: "gt_e_P23constant_descriptor_rtx4htab", value: 191, isUnsigned: true)
!1035 = !DIEnumerator(name: "gt_e_P24constant_descriptor_tree4htab", value: 192, isUnsigned: true)
!1036 = !DIEnumerator(name: "gt_e_P12object_block4htab", value: 193, isUnsigned: true)
!1037 = !DIEnumerator(name: "gt_e_P7section4htab", value: 194, isUnsigned: true)
!1038 = !DIEnumerator(name: "gt_e_P17tree_priority_map4htab", value: 195, isUnsigned: true)
!1039 = !DIEnumerator(name: "gt_e_P8tree_map4htab", value: 196, isUnsigned: true)
!1040 = !DIEnumerator(name: "gt_e_P9type_hash4htab", value: 197, isUnsigned: true)
!1041 = !DIEnumerator(name: "gt_e_P13libfunc_entry4htab", value: 198, isUnsigned: true)
!1042 = !DIEnumerator(name: "gt_e_P23temp_slot_address_entry4htab", value: 199, isUnsigned: true)
!1043 = !DIEnumerator(name: "gt_e_P15throw_stmt_node4htab", value: 200, isUnsigned: true)
!1044 = !DIEnumerator(name: "gt_e_P9reg_attrs4htab", value: 201, isUnsigned: true)
!1045 = !DIEnumerator(name: "gt_e_P9mem_attrs4htab", value: 202, isUnsigned: true)
!1046 = !DIEnumerator(name: "gt_e_P7rtx_def4htab", value: 203, isUnsigned: true)
!1047 = !DIEnumerator(name: "gt_e_SP9tree_node12splay_tree_s", value: 204, isUnsigned: true)
!1048 = !DIEnumerator(name: "gt_e_P10vcall_insn4htab", value: 205, isUnsigned: true)
!1049 = !DIEnumerator(name: "gt_e_P16var_loc_list_def4htab", value: 206, isUnsigned: true)
!1050 = !DIEnumerator(name: "gt_e_P10die_struct4htab", value: 207, isUnsigned: true)
!1051 = !DIEnumerator(name: "gt_e_P15dwarf_file_data4htab", value: 208, isUnsigned: true)
!1052 = !DIEnumerator(name: "gt_e_P20indirect_string_node4htab", value: 209, isUnsigned: true)
!1053 = !DIEnumerator(name: "gt_e_P11cgraph_node4htab", value: 210, isUnsigned: true)
!1054 = !DIEnumerator(name: "gt_e_II12splay_tree_s", value: 211, isUnsigned: true)
!1055 = !DIEnumerator(name: "gt_e_P27cgraph_node_set_element_def4htab", value: 212, isUnsigned: true)
!1056 = !DIEnumerator(name: "gt_e_P11cgraph_edge4htab", value: 213, isUnsigned: true)
!1057 = !DIEnumerator(name: "gt_e_P9loop_exit4htab", value: 214, isUnsigned: true)
!1058 = !DIEnumerator(name: "gt_e_P24types_used_by_vars_entry4htab", value: 215, isUnsigned: true)
!1059 = !DIEnumerator(name: "gt_e_P9tree_node4htab", value: 216, isUnsigned: true)
!1060 = !DIEnumerator(name: "gt_types_enum_last", value: 217, isUnsigned: true)
!1061 = !{!1062, !1064, !729, !1065, !1068, !1069, !134, !795, !1132, !2462, !1254, !1762, !1108, !2464, !2470, !2694, !2695, !2696, !1063, !2709, !7, !2723, !2768}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !1063)
!1063 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1064 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1066, line: 46, baseType: !1067)
!1066 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1067 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1070, line: 47, baseType: !1071)
!1070 = !DIFile(filename: "./coretypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1073, line: 75, size: 256, elements: !1074)
!1073 = !DIFile(filename: "./bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1074 = !{!1075, !1089, !1090, !1091}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1072, file: !1073, line: 76, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1073, line: 68, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1073, line: 63, size: 320, elements: !1079)
!1079 = !{!1080, !1082, !1083, !1084}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1078, file: !1073, line: 64, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1078, file: !1073, line: 65, baseType: !1081, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1078, file: !1073, line: 66, baseType: !7, size: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1078, file: !1073, line: 67, baseType: !1085, size: 128, offset: 192)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 128, elements: !1087)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1073, line: 29, baseType: !1067)
!1087 = !{!1088}
!1088 = !DISubrange(count: 2)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1072, file: !1073, line: 77, baseType: !1076, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1072, file: !1073, line: 78, baseType: !7, size: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1072, file: !1073, line: 79, baseType: !1092, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1073, line: 49, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1073, line: 45, size: 832, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1094, file: !1073, line: 46, baseType: !1081, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1094, file: !1073, line: 47, baseType: !1071, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1094, file: !1073, line: 48, baseType: !1099, size: 704, offset: 128)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1100, line: 164, size: 704, elements: !1101)
!1100 = !DIFile(filename: "./include/obstack.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1101 = !{!1102, !1103, !1115, !1116, !1117, !1118, !1119, !1120, !1124, !1128, !1129, !1130, !1131}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1099, file: !1100, line: 166, baseType: !1063, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1099, file: !1100, line: 167, baseType: !1104, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1100, line: 157, size: 192, elements: !1106)
!1106 = !{!1107, !1110, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1105, file: !1100, line: 159, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1105, file: !1100, line: 160, baseType: !1104, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1105, file: !1100, line: 161, baseType: !1112, size: 32, offset: 128)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 32, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 4)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1099, file: !1100, line: 168, baseType: !1108, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1099, file: !1100, line: 169, baseType: !1108, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1099, file: !1100, line: 170, baseType: !1108, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1099, file: !1100, line: 171, baseType: !1063, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1099, file: !1100, line: 172, baseType: !1064, size: 32, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1099, file: !1100, line: 176, baseType: !1121, size: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!1104, !1068, !1063}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1099, file: !1100, line: 177, baseType: !1125, size: 64, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !1068, !1104}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1099, file: !1100, line: 178, baseType: !1068, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1099, file: !1100, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1099, file: !1100, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1099, file: !1100, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !757, line: 737, size: 768, elements: !1134)
!1134 = !{!1135, !2309, !2319, !2325, !2330, !2335, !2342, !2348, !2354, !2359, !2373, !2378, !2384, !2389, !2399, !2404, !2420, !2427, !2434, !2440, !2445, !2451, !2457}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1133, file: !757, line: 738, baseType: !1136, size: 256)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !757, line: 271, size: 256, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1153, !1154, !2308}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1136, file: !757, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1136, file: !757, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1136, file: !757, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1136, file: !757, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1136, file: !757, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1136, file: !757, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1136, file: !757, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1136, file: !757, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1136, file: !757, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1136, file: !757, line: 312, baseType: !7, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1136, file: !757, line: 316, baseType: !1149, size: 32, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1150, line: 58, baseType: !1151)
!1150 = !DIFile(filename: "./input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1152, line: 44, baseType: !7)
!1152 = !DIFile(filename: "./line-map.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1136, file: !757, line: 319, baseType: !7, size: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1136, file: !757, line: 323, baseType: !1155, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !1157)
!1157 = !{!1158, !2273, !2274, !2275, !2278, !2282, !2283, !2284, !2302, !2303, !2304, !2305, !2306, !2307}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1156, file: !337, line: 219, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1161, file: !337, line: 151, baseType: !1164, size: 128)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1165, file: !337, line: 150, baseType: !7, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1165, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1165, file: !337, line: 150, baseType: !1170, size: 64, offset: 64)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1171, size: 64, elements: !1234)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1070, line: 108, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !1174)
!1174 = !{!1175, !1176, !1177, !2266, !2267, !2268, !2269, !2270, !2271, !2272}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1173, file: !337, line: 124, baseType: !1155, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1173, file: !337, line: 125, baseType: !1155, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1173, file: !337, line: 131, baseType: !1178, size: 64, offset: 128)
!1178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !1179)
!1179 = !{!1180, !1196}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1178, file: !337, line: 129, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1070, line: 66, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !757, line: 143, size: 192, elements: !1184)
!1184 = !{!1185, !1194, !1195}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1183, file: !757, line: 145, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1070, line: 69, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !757, line: 136, size: 192, elements: !1189)
!1189 = !{!1190, !1192, !1193}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1188, file: !757, line: 137, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1070, line: 58, baseType: !1132)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1188, file: !757, line: 138, baseType: !1187, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1188, file: !757, line: 139, baseType: !1187, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1183, file: !757, line: 146, baseType: !1186, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1183, file: !757, line: 152, baseType: !1181, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1178, file: !337, line: 130, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1070, line: 50, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1200, line: 240, size: 384, elements: !1201)
!1200 = !DIFile(filename: "./rtl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1199, file: !1200, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1199, file: !1200, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1199, file: !1200, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1199, file: !1200, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1199, file: !1200, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1199, file: !1200, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1199, file: !1200, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1199, file: !1200, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1199, file: !1200, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1199, file: !1200, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1199, file: !1200, line: 321, baseType: !1213, size: 320, offset: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1200, line: 315, size: 320, elements: !1214)
!1214 = !{!1215, !2233, !2235, !2264, !2265}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1213, file: !1200, line: 316, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 64, elements: !1234)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1200, line: 183, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1200, line: 166, size: 64, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1225, !1226, !1236, !1237, !1249, !1252, !1253, !2211, !2212, !2223, !2230}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1218, file: !1200, line: 168, baseType: !1064, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1218, file: !1200, line: 169, baseType: !7, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1218, file: !1200, line: 170, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1218, file: !1200, line: 171, baseType: !1197, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1218, file: !1200, line: 172, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1070, line: 53, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1200, line: 359, size: 128, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1229, file: !1200, line: 360, baseType: !1064, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1229, file: !1200, line: 361, baseType: !1233, size: 64, offset: 64)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 64, elements: !1234)
!1234 = !{!1235}
!1235 = !DISubrange(count: 1)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1218, file: !1200, line: 173, baseType: !5, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1218, file: !1200, line: 174, baseType: !1238, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1200, line: 133, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1200, line: 115, size: 32, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1239, file: !1200, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1239, file: !1200, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1239, file: !1200, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1239, file: !1200, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1239, file: !1200, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1239, file: !1200, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1239, file: !1200, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1239, file: !1200, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1218, file: !1200, line: 175, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1200, line: 175, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1218, file: !1200, line: 176, baseType: !1071, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1218, file: !1200, line: 177, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1070, line: 56, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1257)
!1257 = !{!1258, !1291, !1297, !1308, !1327, !1338, !1343, !1350, !1356, !1370, !1378, !1416, !1421, !1449, !1466, !1467, !1472, !1481, !1487, !1492, !1496, !1500, !1860, !1909, !1915, !1921, !1928, !1941, !1955, !1972, !1984, !2006, !2021, !2193}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1256, file: !135, line: 3372, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1259, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1259, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1259, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1259, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1259, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1259, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1259, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1259, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1259, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1259, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1259, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1259, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1259, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1259, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1259, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1259, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1259, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1259, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1259, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1259, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1259, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1259, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1259, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1259, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1259, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1259, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1259, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1259, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1259, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1259, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1256, file: !135, line: 3373, baseType: !1292, size: 192)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1293)
!1293 = !{!1294, !1295, !1296}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1292, file: !135, line: 403, baseType: !1259, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1292, file: !135, line: 404, baseType: !1254, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1292, file: !135, line: 405, baseType: !1254, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1256, file: !135, line: 3374, baseType: !1298, size: 320)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1299)
!1299 = !{!1300, !1301}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1298, file: !135, line: 1385, baseType: !1292, size: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1298, file: !135, line: 1386, baseType: !1302, size: 128, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1303, line: 58, baseType: !1304)
!1303 = !DIFile(filename: "./double-int.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1303, line: 54, size: 128, elements: !1305)
!1305 = !{!1306, !1307}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1304, file: !1303, line: 56, baseType: !1067, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1304, file: !1303, line: 57, baseType: !1063, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1256, file: !135, line: 3375, baseType: !1309, size: 256)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1310)
!1310 = !{!1311, !1312}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1309, file: !135, line: 1398, baseType: !1292, size: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1309, file: !135, line: 1399, baseType: !1313, size: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1315, line: 52, size: 256, elements: !1316)
!1315 = !DIFile(filename: "./real.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1314, file: !1315, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1314, file: !1315, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1314, file: !1315, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1314, file: !1315, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1314, file: !1315, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1314, file: !1315, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1314, file: !1315, line: 62, baseType: !1324, size: 192, offset: 64)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 192, elements: !1325)
!1325 = !{!1326}
!1326 = !DISubrange(count: 3)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1256, file: !135, line: 3376, baseType: !1328, size: 256)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !135, line: 1409, baseType: !1292, size: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1328, file: !135, line: 1410, baseType: !1332, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1334, line: 27, size: 192, elements: !1335)
!1334 = !DIFile(filename: "./fixed-value.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1333, file: !1334, line: 29, baseType: !1302, size: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1333, file: !1334, line: 30, baseType: !5, size: 32, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1256, file: !135, line: 3377, baseType: !1339, size: 256)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1340)
!1340 = !{!1341, !1342}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1339, file: !135, line: 1438, baseType: !1292, size: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1339, file: !135, line: 1439, baseType: !1254, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1256, file: !135, line: 3378, baseType: !1344, size: 256)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1345)
!1345 = !{!1346, !1347, !1348}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1344, file: !135, line: 1419, baseType: !1292, size: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1344, file: !135, line: 1420, baseType: !1064, size: 32, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1344, file: !135, line: 1421, baseType: !1349, size: 8, offset: 224)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 8, elements: !1234)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1256, file: !135, line: 3379, baseType: !1351, size: 320)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1351, file: !135, line: 1429, baseType: !1292, size: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1351, file: !135, line: 1430, baseType: !1254, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1351, file: !135, line: 1431, baseType: !1254, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1256, file: !135, line: 3380, baseType: !1357, size: 320)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1358)
!1358 = !{!1359, !1360}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1357, file: !135, line: 1461, baseType: !1292, size: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1357, file: !135, line: 1462, baseType: !1361, size: 128, offset: 192)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1362, line: 31, size: 128, elements: !1363)
!1362 = !DIFile(filename: "./symtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1363 = !{!1364, !1368, !1369}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1361, file: !1362, line: 32, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1367 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1361, file: !1362, line: 33, baseType: !7, size: 32, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1361, file: !1362, line: 34, baseType: !7, size: 32, offset: 96)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1256, file: !135, line: 3381, baseType: !1371, size: 384)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1371, file: !135, line: 2508, baseType: !1292, size: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1371, file: !135, line: 2509, baseType: !1149, size: 32, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1371, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !135, line: 2511, baseType: !1254, size: 64, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1371, file: !135, line: 2512, baseType: !1254, size: 64, offset: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1256, file: !135, line: 3382, baseType: !1379, size: 896)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1380)
!1380 = !{!1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1379, file: !135, line: 2653, baseType: !1371, size: 384)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1379, file: !135, line: 2654, baseType: !1254, size: 64, offset: 384)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1379, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1379, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1379, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1379, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1379, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1379, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1379, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1379, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1379, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1379, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1379, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1379, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1379, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1379, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1379, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1379, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1379, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1379, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1379, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1379, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1379, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1379, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1379, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1379, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1379, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1379, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1379, file: !135, line: 2705, baseType: !1254, size: 64, offset: 576)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1379, file: !135, line: 2706, baseType: !1254, size: 64, offset: 640)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1379, file: !135, line: 2707, baseType: !1254, size: 64, offset: 704)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1379, file: !135, line: 2708, baseType: !1254, size: 64, offset: 768)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1379, file: !135, line: 2711, baseType: !1414, size: 64, offset: 832)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1256, file: !135, line: 3383, baseType: !1417, size: 960)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1418)
!1418 = !{!1419, !1420}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1417, file: !135, line: 2757, baseType: !1379, size: 896)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1417, file: !135, line: 2758, baseType: !1197, size: 64, offset: 896)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1256, file: !135, line: 3384, baseType: !1422, size: 1472)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1423)
!1423 = !{!1424, !1445, !1446, !1447, !1448}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1422, file: !135, line: 3115, baseType: !1425, size: 1216)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1425, file: !135, line: 2985, baseType: !1417, size: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1425, file: !135, line: 2986, baseType: !1254, size: 64, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1425, file: !135, line: 2987, baseType: !1254, size: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1425, file: !135, line: 2988, baseType: !1254, size: 64, offset: 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1425, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1425, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1425, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1425, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1425, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1425, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1425, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1425, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1425, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1425, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1425, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1425, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1425, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1425, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1422, file: !135, line: 3117, baseType: !1254, size: 64, offset: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1422, file: !135, line: 3119, baseType: !1254, size: 64, offset: 1280)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1422, file: !135, line: 3121, baseType: !1254, size: 64, offset: 1344)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1422, file: !135, line: 3123, baseType: !1254, size: 64, offset: 1408)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1256, file: !135, line: 3385, baseType: !1450, size: 1088)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1451)
!1451 = !{!1452, !1453, !1454}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !135, line: 2875, baseType: !1417, size: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1450, file: !135, line: 2876, baseType: !1197, size: 64, offset: 960)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1450, file: !135, line: 2877, baseType: !1455, size: 64, offset: 1024)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1457, line: 172, size: 128, elements: !1458)
!1457 = !DIFile(filename: "./tree-flow.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1458 = !{!1459, !1460, !1461, !1462, !1463, !1464, !1465}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1456, file: !1457, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1456, file: !1457, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1456, file: !1457, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1456, file: !1457, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1456, file: !1457, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1456, file: !1457, line: 195, baseType: !7, size: 32, offset: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1456, file: !1457, line: 199, baseType: !1254, size: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1256, file: !135, line: 3386, baseType: !1425, size: 1216)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1256, file: !135, line: 3387, baseType: !1468, size: 1280)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1469)
!1469 = !{!1470, !1471}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1468, file: !135, line: 3094, baseType: !1425, size: 1216)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1468, file: !135, line: 3095, baseType: !1455, size: 64, offset: 1216)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1256, file: !135, line: 3388, baseType: !1473, size: 1216)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1479, !1480}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1473, file: !135, line: 2825, baseType: !1379, size: 896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1473, file: !135, line: 2827, baseType: !1254, size: 64, offset: 896)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1473, file: !135, line: 2828, baseType: !1254, size: 64, offset: 960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1473, file: !135, line: 2829, baseType: !1254, size: 64, offset: 1024)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1473, file: !135, line: 2830, baseType: !1254, size: 64, offset: 1088)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1473, file: !135, line: 2831, baseType: !1254, size: 64, offset: 1152)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1256, file: !135, line: 3389, baseType: !1482, size: 1024)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1483)
!1483 = !{!1484, !1485, !1486}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1482, file: !135, line: 2851, baseType: !1417, size: 960)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1482, file: !135, line: 2852, baseType: !1064, size: 32, offset: 960)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1482, file: !135, line: 2853, baseType: !1064, size: 32, offset: 992)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1256, file: !135, line: 3390, baseType: !1488, size: 1024)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1489)
!1489 = !{!1490, !1491}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1488, file: !135, line: 2858, baseType: !1417, size: 960)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1488, file: !135, line: 2859, baseType: !1455, size: 64, offset: 960)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1256, file: !135, line: 3391, baseType: !1493, size: 960)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1494)
!1494 = !{!1495}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1493, file: !135, line: 2863, baseType: !1417, size: 960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1256, file: !135, line: 3392, baseType: !1497, size: 1472)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1498)
!1498 = !{!1499}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !135, line: 3305, baseType: !1422, size: 1472)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1256, file: !135, line: 3393, baseType: !1501, size: 1792)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1502)
!1502 = !{!1503, !1504, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1501, file: !135, line: 3249, baseType: !1422, size: 1472)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1501, file: !135, line: 3251, baseType: !1505, size: 64, offset: 1472)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1507, line: 463, size: 1152, elements: !1508)
!1507 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1508 = !{!1509, !1671, !1702, !1703, !1780, !1783, !1784, !1785, !1786, !1787, !1788, !1812, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1506, file: !1507, line: 464, baseType: !1510, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1512)
!1512 = !{!1513, !1562, !1575, !1589, !1639, !1652}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1511, file: !330, line: 197, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1515)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1517)
!1517 = !{!1518, !1519, !1520, !1521, !1522, !1523, !1550, !1559, !1560, !1561}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1516, file: !330, line: 119, baseType: !1515, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1516, file: !330, line: 122, baseType: !1515, size: 64, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1516, file: !330, line: 123, baseType: !1515, size: 64, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1516, file: !330, line: 126, baseType: !1064, size: 32, offset: 192)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1516, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1516, file: !330, line: 165, baseType: !1524, size: 192, offset: 256)
!1524 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1525)
!1525 = !{!1526, !1539, !1545}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1524, file: !330, line: 137, baseType: !1527, size: 128)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1528)
!1528 = !{!1529, !1538}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1527, file: !330, line: 135, baseType: !1530, size: 64)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536, !1537}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1531, file: !330, line: 96, baseType: !1530, size: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1531, file: !330, line: 97, baseType: !1530, size: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1531, file: !330, line: 101, baseType: !1254, size: 64, offset: 128)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1531, file: !330, line: 106, baseType: !1254, size: 64, offset: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1531, file: !330, line: 111, baseType: !1254, size: 64, offset: 256)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1527, file: !330, line: 136, baseType: !1530, size: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1524, file: !330, line: 151, baseType: !1540, size: 192)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1541)
!1541 = !{!1542, !1543, !1544}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1540, file: !330, line: 141, baseType: !1254, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1540, file: !330, line: 145, baseType: !1254, size: 64, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1540, file: !330, line: 150, baseType: !1064, size: 32, offset: 128)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1524, file: !330, line: 164, baseType: !1546, size: 128)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !330, line: 153, size: 128, elements: !1547)
!1547 = !{!1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1546, file: !330, line: 161, baseType: !1254, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1546, file: !330, line: 163, baseType: !1149, size: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1516, file: !330, line: 168, baseType: !1551, size: 64, offset: 448)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !330, line: 67, size: 320, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557, !1558}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1552, file: !330, line: 70, baseType: !1551, size: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1552, file: !330, line: 73, baseType: !1515, size: 64, offset: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1552, file: !330, line: 78, baseType: !1254, size: 64, offset: 128)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1552, file: !330, line: 85, baseType: !1197, size: 64, offset: 192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1552, file: !330, line: 88, baseType: !1064, size: 32, offset: 256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1516, file: !330, line: 173, baseType: !1197, size: 64, offset: 512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1516, file: !330, line: 173, baseType: !1197, size: 64, offset: 576)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1516, file: !330, line: 177, baseType: !1367, size: 8, offset: 640)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1511, file: !330, line: 200, baseType: !1563, size: 64, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !330, line: 185, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !330, line: 185, size: 128, elements: !1566)
!1566 = !{!1567}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1565, file: !330, line: 185, baseType: !1568, size: 128)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !330, line: 184, baseType: !1569)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !330, line: 184, size: 128, elements: !1570)
!1570 = !{!1571, !1572, !1573}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1569, file: !330, line: 184, baseType: !7, size: 32)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1569, file: !330, line: 184, baseType: !7, size: 32, offset: 32)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1569, file: !330, line: 184, baseType: !1574, size: 64, offset: 64)
!1574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1514, size: 64, elements: !1234)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1511, file: !330, line: 203, baseType: !1576, size: 64, offset: 128)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !330, line: 189, size: 128, elements: !1579)
!1579 = !{!1580}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1578, file: !330, line: 189, baseType: !1581, size: 128)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !330, line: 188, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !330, line: 188, size: 128, elements: !1583)
!1583 = !{!1584, !1585, !1586}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1582, file: !330, line: 188, baseType: !7, size: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1582, file: !330, line: 188, baseType: !7, size: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1582, file: !330, line: 188, baseType: !1587, size: 64, offset: 64)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1588, size: 64, elements: !1234)
!1588 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !330, line: 180, baseType: !1551)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1511, file: !330, line: 207, baseType: !1590, size: 64, offset: 192)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1591, line: 144, baseType: !1592)
!1591 = !DIFile(filename: "./include/hashtab.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1591, line: 100, size: 896, elements: !1594)
!1594 = !{!1595, !1603, !1608, !1613, !1615, !1616, !1617, !1618, !1619, !1620, !1625, !1627, !1628, !1633, !1638}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1593, file: !1591, line: 102, baseType: !1596, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1591, line: 52, baseType: !1597)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!1600, !1601}
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1591, line: 47, baseType: !7)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1593, file: !1591, line: 105, baseType: !1604, size: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1591, line: 59, baseType: !1605)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!1064, !1601, !1601}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1593, file: !1591, line: 108, baseType: !1609, size: 64, offset: 128)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1591, line: 63, baseType: !1610)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{null, !1068}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1593, file: !1591, line: 111, baseType: !1614, size: 64, offset: 192)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1593, file: !1591, line: 114, baseType: !1065, size: 64, offset: 256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1593, file: !1591, line: 117, baseType: !1065, size: 64, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1593, file: !1591, line: 120, baseType: !1065, size: 64, offset: 384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1593, file: !1591, line: 124, baseType: !7, size: 32, offset: 448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1593, file: !1591, line: 128, baseType: !7, size: 32, offset: 480)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1593, file: !1591, line: 131, baseType: !1621, size: 64, offset: 512)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1591, line: 75, baseType: !1622)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!1068, !1065, !1065}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1593, file: !1591, line: 132, baseType: !1626, size: 64, offset: 576)
!1626 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1591, line: 78, baseType: !1610)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1593, file: !1591, line: 135, baseType: !1068, size: 64, offset: 640)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1593, file: !1591, line: 136, baseType: !1629, size: 64, offset: 704)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1591, line: 82, baseType: !1630)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!1068, !1068, !1065, !1065}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1593, file: !1591, line: 137, baseType: !1634, size: 64, offset: 768)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1591, line: 83, baseType: !1635)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1068, !1068}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1593, file: !1591, line: 141, baseType: !7, size: 32, offset: 832)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1511, file: !330, line: 211, baseType: !1640, size: 64, offset: 256)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1643)
!1643 = !{!1644}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1642, file: !135, line: 183, baseType: !1645, size: 128)
!1645 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1646)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1647)
!1647 = !{!1648, !1649, !1650}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1646, file: !135, line: 182, baseType: !7, size: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1646, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1646, file: !135, line: 182, baseType: !1651, size: 64, offset: 64)
!1651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1254, size: 64, elements: !1234)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1511, file: !330, line: 220, baseType: !1653, size: 64, offset: 320)
!1653 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !330, line: 217, size: 64, elements: !1654)
!1654 = !{!1655, !1656}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1653, file: !330, line: 218, baseType: !1640, size: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1653, file: !330, line: 219, baseType: !1657, size: 64)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1659, line: 29, baseType: !1660)
!1659 = !DIFile(filename: "./vecprim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1659, line: 29, size: 96, elements: !1661)
!1661 = !{!1662}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1660, file: !1659, line: 29, baseType: !1663, size: 96)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1659, line: 27, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1659, line: 27, size: 96, elements: !1665)
!1665 = !{!1666, !1667, !1668}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1664, file: !1659, line: 27, baseType: !7, size: 32)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1664, file: !1659, line: 27, baseType: !7, size: 32, offset: 32)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1664, file: !1659, line: 27, baseType: !1669, size: 8, offset: 64)
!1669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1670, size: 8, elements: !1234)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1659, line: 26, baseType: !1367)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1506, file: !1507, line: 467, baseType: !1672, size: 64, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !337, line: 374, size: 640, elements: !1674)
!1674 = !{!1675, !1677, !1678, !1691, !1692, !1693, !1694, !1695, !1696, !1698, !1700, !1701}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1673, file: !337, line: 377, baseType: !1676, size: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1070, line: 111, baseType: !1155)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1673, file: !337, line: 378, baseType: !1676, size: 64, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1673, file: !337, line: 381, baseType: !1679, size: 64, offset: 128)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !337, line: 282, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !337, line: 282, size: 128, elements: !1682)
!1682 = !{!1683}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1681, file: !337, line: 282, baseType: !1684, size: 128)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !337, line: 281, baseType: !1685)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !337, line: 281, size: 128, elements: !1686)
!1686 = !{!1687, !1688, !1689}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1685, file: !337, line: 281, baseType: !7, size: 32)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1685, file: !337, line: 281, baseType: !7, size: 32, offset: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1685, file: !337, line: 281, baseType: !1690, size: 64, offset: 64)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1676, size: 64, elements: !1234)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1673, file: !337, line: 384, baseType: !1064, size: 32, offset: 192)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1673, file: !337, line: 387, baseType: !1064, size: 32, offset: 224)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1673, file: !337, line: 390, baseType: !1064, size: 32, offset: 256)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1673, file: !337, line: 394, baseType: !1679, size: 64, offset: 320)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1673, file: !337, line: 396, baseType: !336, size: 32, offset: 384)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1673, file: !337, line: 399, baseType: !1697, size: 64, offset: 416)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, elements: !1087)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1673, file: !337, line: 402, baseType: !1699, size: 64, offset: 480)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1087)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1673, file: !337, line: 406, baseType: !1064, size: 32, offset: 544)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1673, file: !337, line: 409, baseType: !1064, size: 32, offset: 576)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1506, file: !1507, line: 470, baseType: !1182, size: 64, offset: 128)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1506, file: !1507, line: 473, baseType: !1704, size: 64, offset: 192)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1457, line: 39, size: 1152, elements: !1706)
!1706 = !{!1707, !1708, !1721, !1722, !1723, !1734, !1735, !1739, !1740, !1741, !1742, !1743}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1705, file: !1457, line: 41, baseType: !1590, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1705, file: !1457, line: 48, baseType: !1709, size: 64, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !757, line: 35, baseType: !1711)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !757, line: 35, size: 128, elements: !1712)
!1712 = !{!1713}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1711, file: !757, line: 35, baseType: !1714, size: 128)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !757, line: 33, baseType: !1715)
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !757, line: 33, size: 128, elements: !1716)
!1716 = !{!1717, !1718, !1719}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1715, file: !757, line: 33, baseType: !7, size: 32)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1715, file: !757, line: 33, baseType: !7, size: 32, offset: 32)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1715, file: !757, line: 33, baseType: !1720, size: 64, offset: 64)
!1720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 64, elements: !1234)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1705, file: !1457, line: 51, baseType: !1640, size: 64, offset: 128)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1705, file: !1457, line: 54, baseType: !1254, size: 64, offset: 192)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1705, file: !1457, line: 57, baseType: !1724, size: 128, offset: 256)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1725, line: 31, size: 128, elements: !1726)
!1725 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1726 = !{!1727, !1728, !1729, !1730, !1731, !1732, !1733}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1724, file: !1725, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1724, file: !1725, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1724, file: !1725, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1724, file: !1725, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1724, file: !1725, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1724, file: !1725, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1724, file: !1725, line: 56, baseType: !1069, size: 64, offset: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1705, file: !1457, line: 60, baseType: !1724, size: 128, offset: 384)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1705, file: !1457, line: 64, baseType: !1736, size: 64, offset: 512)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1738, line: 33, flags: DIFlagFwdDecl)
!1738 = !DIFile(filename: "./pointer-set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1705, file: !1457, line: 67, baseType: !1254, size: 64, offset: 576)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1705, file: !1457, line: 73, baseType: !1590, size: 64, offset: 640)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1705, file: !1457, line: 77, baseType: !1069, size: 64, offset: 704)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1705, file: !1457, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1705, file: !1457, line: 82, baseType: !1744, size: 320, offset: 832)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1745, line: 62, size: 320, elements: !1746)
!1745 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!1746 = !{!1747, !1753, !1754, !1755, !1756, !1763}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1744, file: !1745, line: 63, baseType: !1748, size: 64)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64)
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1745, line: 56, size: 128, elements: !1750)
!1750 = !{!1751, !1752}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1749, file: !1745, line: 57, baseType: !1748, size: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1749, file: !1745, line: 58, baseType: !1349, size: 8, offset: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1744, file: !1745, line: 64, baseType: !7, size: 32, offset: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1744, file: !1745, line: 66, baseType: !7, size: 32, offset: 96)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1744, file: !1745, line: 68, baseType: !1367, size: 8, offset: 128)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1744, file: !1745, line: 70, baseType: !1757, size: 64, offset: 192)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1745, line: 37, size: 128, elements: !1759)
!1759 = !{!1760, !1761}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1758, file: !1745, line: 39, baseType: !1757, size: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1758, file: !1745, line: 40, baseType: !1762, size: 64, offset: 64)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1744, file: !1745, line: 71, baseType: !1764, size: 64, offset: 256)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1745, line: 45, size: 320, elements: !1766)
!1766 = !{!1767, !1768}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1765, file: !1745, line: 47, baseType: !1764, size: 64)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1765, file: !1745, line: 48, baseType: !1769, size: 256, offset: 64)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1770)
!1770 = !{!1771, !1773, !1774, !1779}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1769, file: !135, line: 1884, baseType: !1772, size: 64)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1769, file: !135, line: 1885, baseType: !1772, size: 64, offset: 64)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1769, file: !135, line: 1891, baseType: !1775, size: 64, offset: 128)
!1775 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1769, file: !135, line: 1891, size: 64, elements: !1776)
!1776 = !{!1777, !1778}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1775, file: !135, line: 1891, baseType: !1191, size: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1775, file: !135, line: 1891, baseType: !1254, size: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1769, file: !135, line: 1892, baseType: !1762, size: 64, offset: 192)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1506, file: !1507, line: 476, baseType: !1781, size: 64, offset: 256)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64)
!1782 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1507, line: 476, flags: DIFlagFwdDecl)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1506, file: !1507, line: 479, baseType: !1590, size: 64, offset: 320)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1506, file: !1507, line: 484, baseType: !1254, size: 64, offset: 384)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1506, file: !1507, line: 488, baseType: !1254, size: 64, offset: 448)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1506, file: !1507, line: 493, baseType: !1254, size: 64, offset: 512)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1506, file: !1507, line: 496, baseType: !1254, size: 64, offset: 576)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1506, file: !1507, line: 501, baseType: !1789, size: 64, offset: 640)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !348, line: 2355, size: 576, elements: !1791)
!1791 = !{!1792, !1795, !1796, !1797, !1798, !1800, !1801, !1806, !1807, !1808, !1809, !1810, !1811}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1790, file: !348, line: 2356, baseType: !1793, size: 64)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64)
!1794 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !348, line: 2356, flags: DIFlagFwdDecl)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1790, file: !348, line: 2357, baseType: !1223, size: 64, offset: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1790, file: !348, line: 2358, baseType: !1064, size: 32, offset: 128)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1790, file: !348, line: 2359, baseType: !1064, size: 32, offset: 160)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1790, file: !348, line: 2360, baseType: !1799, size: 128, offset: 192)
!1799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 128, elements: !1113)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1790, file: !348, line: 2364, baseType: !1064, size: 32, offset: 320)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1790, file: !348, line: 2367, baseType: !1802, size: 128, offset: 384)
!1802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !348, line: 2349, size: 128, elements: !1803)
!1803 = !{!1804, !1805}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1802, file: !348, line: 2351, baseType: !1197, size: 64)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1802, file: !348, line: 2352, baseType: !1063, size: 64, offset: 64)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1790, file: !348, line: 2371, baseType: !347, size: 32, offset: 512)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1790, file: !348, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1790, file: !348, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1790, file: !348, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1790, file: !348, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1790, file: !348, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1506, file: !1507, line: 504, baseType: !1813, size: 64, offset: 704)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64)
!1814 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1507, line: 504, flags: DIFlagFwdDecl)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1506, file: !1507, line: 507, baseType: !1590, size: 64, offset: 768)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1506, file: !1507, line: 510, baseType: !1064, size: 32, offset: 832)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1506, file: !1507, line: 513, baseType: !1064, size: 32, offset: 864)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1506, file: !1507, line: 516, baseType: !1149, size: 32, offset: 896)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1506, file: !1507, line: 519, baseType: !1149, size: 32, offset: 928)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1506, file: !1507, line: 522, baseType: !7, size: 32, offset: 960)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1506, file: !1507, line: 523, baseType: !7, size: 32, offset: 992)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1506, file: !1507, line: 528, baseType: !1223, size: 64, offset: 1024)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1506, file: !1507, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1506, file: !1507, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1506, file: !1507, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1506, file: !1507, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1506, file: !1507, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1506, file: !1507, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
