; ModuleID = 'sreal.c'
source_filename = "sreal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.sreal = type { i64, i32 }

@.str = private unnamed_addr constant [13 x i8] c"(%lu * 2^%d)\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"sreal.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"?\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @dump_sreal(%struct._IO_FILE* %file, %struct.sreal* %x) #0 !dbg !9 {
entry:
  %file.addr = alloca %struct._IO_FILE*, align 8
  %x.addr = alloca %struct.sreal*, align 8
  store %struct._IO_FILE* %file, %struct._IO_FILE** %file.addr, align 8
  call void @llvm.dbg.declare(metadata %struct._IO_FILE** %file.addr, metadata !81, metadata !DIExpression()), !dbg !82
  store %struct.sreal* %x, %struct.sreal** %x.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.sreal** %x.addr, metadata !83, metadata !DIExpression()), !dbg !84
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** %file.addr, align 8, !dbg !85

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "sreal.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "dump_sreal", scope: !1, file: !1, line: 65, type: !10, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !74}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 7, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !16, line: 49, size: 1728, elements: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!17 = !{!18, !20, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !36, !38, !39, !40, !44, !46, !48, !52, !55, !57, !60, !63, !64, !66, !69, !70}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !16, line: 51, baseType: !19, size: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !15, file: !16, line: 54, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !15, file: !16, line: 55, baseType: !21, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !15, file: !16, line: 56, baseType: !21, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !15, file: !16, line: 57, baseType: !21, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !15, file: !16, line: 58, baseType: !21, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !15, file: !16, line: 59, baseType: !21, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !15, file: !16, line: 60, baseType: !21, size: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !15, file: !16, line: 61, baseType: !21, size: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !15, file: !16, line: 64, baseType: !21, size: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !15, file: !16, line: 65, baseType: !21, size: 64, offset: 640)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !15, file: !16, line: 66, baseType: !21, size: 64, offset: 704)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !15, file: !16, line: 68, baseType: !34, size: 64, offset: 768)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !16, line: 36, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !15, file: !16, line: 70, baseType: !37, size: 64, offset: 832)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !15, file: !16, line: 72, baseType: !19, size: 32, offset: 896)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !16, line: 73, baseType: !19, size: 32, offset: 928)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !15, file: !16, line: 74, baseType: !41, size: 64, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !42, line: 152, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !15, file: !16, line: 77, baseType: !45, size: 16, offset: 1024)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !15, file: !16, line: 78, baseType: !47, size: 8, offset: 1040)
!47 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !15, file: !16, line: 79, baseType: !49, size: 8, offset: 1048)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !16, line: 81, baseType: !53, size: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !16, line: 43, baseType: null)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !16, line: 89, baseType: !56, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !42, line: 153, baseType: !43)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !15, file: !16, line: 91, baseType: !58, size: 64, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !16, line: 37, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !15, file: !16, line: 92, baseType: !61, size: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !16, line: 38, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !15, file: !16, line: 93, baseType: !37, size: 64, offset: 1344)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !15, file: !16, line: 94, baseType: !65, size: 64, offset: 1408)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !15, file: !16, line: 95, baseType: !67, size: 64, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 46, baseType: !4)
!68 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !15, file: !16, line: 96, baseType: !19, size: 32, offset: 1536)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !15, file: !16, line: 98, baseType: !71, size: 160, offset: 1568)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 20)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "sreal", file: !76, line: 53, baseType: !77)
!76 = !DIFile(filename: "./sreal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/502.gcc_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sreal", file: !76, line: 44, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !77, file: !76, line: 50, baseType: !4, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !77, file: !76, line: 52, baseType: !19, size: 32, offset: 64)
!81 = !DILocalVariable(name: "file", arg: 1, scope: !9, file: !1, line: 65, type: !12)
!82 = !DILocation(line: 65, column: 19, scope: !9)
!83 = !DILocalVariable(name: "x", arg: 2, scope: !9, file: !1, line: 65, type: !74)
!84 = !DILocation(line: 65, column: 32, scope: !9)
!85 = !DILocation(line: 72, column: 12, scope: !9)
!86 = !DILocation(line: 72, column: 63, scope: !9)
!87 = !DILocation(line: 72, column: 66, scope: !9)
!88 = !DILocation(line: 72, column: 71, scope: !9)
!89 = !DILocation(line: 72, column: 74, scope: !9)
!90 = !DILocation(line: 72, column: 3, scope: !9)
!91 = !DILocation(line: 74, column: 1, scope: !9)
!92 = distinct !DISubprogram(name: "sreal_init", scope: !1, file: !1, line: 270, type: !93, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!93 = !DISubroutineType(types: !94)
!94 = !{!74, !74, !4, !19}
!95 = !DILocalVariable(name: "r", arg: 1, scope: !92, file: !1, line: 270, type: !74)
!96 = !DILocation(line: 270, column: 20, scope: !92)
!97 = !DILocalVariable(name: "sig", arg: 2, scope: !92, file: !1, line: 270, type: !4)
!98 = !DILocation(line: 270, column: 46, scope: !92)
!99 = !DILocalVariable(name: "exp", arg: 3, scope: !92, file: !1, line: 270, type: !19)
!100 = !DILocation(line: 270, column: 62, scope: !92)
!101 = !DILocation(line: 277, column: 12, scope: !92)
!102 = !DILocation(line: 277, column: 3, scope: !92)
!103 = !DILocation(line: 277, column: 6, scope: !92)
!104 = !DILocation(line: 277, column: 10, scope: !92)
!105 = !DILocation(line: 278, column: 12, scope: !92)
!106 = !DILocation(line: 278, column: 3, scope: !92)
!107 = !DILocation(line: 278, column: 6, scope: !92)
!108 = !DILocation(line: 278, column: 10, scope: !92)
!109 = !DILocation(line: 280, column: 14, scope: !92)
!110 = !DILocation(line: 280, column: 3, scope: !92)
!111 = !DILocation(line: 281, column: 10, scope: !92)
!112 = !DILocation(line: 281, column: 3, scope: !92)
!113 = distinct !DISubprogram(name: "normalize", scope: !1, file: !1, line: 134, type: !114, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !74}
!116 = !DILocalVariable(name: "x", arg: 1, scope: !113, file: !1, line: 134, type: !74)
!117 = !DILocation(line: 134, column: 19, scope: !113)
!118 = !DILocation(line: 218, column: 7, scope: !119)
!119 = distinct !DILexicalBlock(scope: !113, file: !1, line: 218, column: 7)
!120 = !DILocation(line: 218, column: 10, scope: !119)
!121 = !DILocation(line: 218, column: 14, scope: !119)
!122 = !DILocation(line: 218, column: 7, scope: !113)
!123 = !DILocation(line: 220, column: 7, scope: !124)
!124 = distinct !DILexicalBlock(scope: !119, file: !1, line: 219, column: 5)
!125 = !DILocation(line: 220, column: 10, scope: !124)
!126 = !DILocation(line: 220, column: 14, scope: !124)
!127 = !DILocation(line: 221, column: 5, scope: !124)
!128 = !DILocation(line: 222, column: 12, scope: !129)
!129 = distinct !DILexicalBlock(scope: !119, file: !1, line: 222, column: 12)
!130 = !DILocation(line: 222, column: 15, scope: !129)
!131 = !DILocation(line: 222, column: 19, scope: !129)
!132 = !DILocation(line: 222, column: 12, scope: !119)
!133 = !DILocation(line: 224, column: 7, scope: !134)
!134 = distinct !DILexicalBlock(scope: !129, file: !1, line: 223, column: 5)
!135 = !DILocation(line: 226, column: 4, scope: !136)
!136 = distinct !DILexicalBlock(scope: !134, file: !1, line: 225, column: 2)
!137 = !DILocation(line: 226, column: 7, scope: !136)
!138 = !DILocation(line: 226, column: 11, scope: !136)
!139 = !DILocation(line: 227, column: 4, scope: !136)
!140 = !DILocation(line: 227, column: 7, scope: !136)
!141 = !DILocation(line: 227, column: 10, scope: !136)
!142 = !DILocation(line: 228, column: 2, scope: !136)
!143 = !DILocation(line: 229, column: 14, scope: !134)
