; ModuleID = 'output.c'
source_filename = "output.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"()\0A\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"***\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"%.0f\0A\00", align 1

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "output.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "write_circulations", scope: !1, file: !1, line: 31, type: !10, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !17, !19}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !15, line: 44, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !21, line: 206, baseType: !22)
!21 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !21, line: 181, size: 5184, elements: !23)
!23 = !{!24, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !48, !50, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !22, file: !21, line: 183, baseType: !25, size: 1600)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1600, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 200)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !22, file: !21, line: 184, baseType: !25, size: 1600, offset: 1600)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !22, file: !21, line: 185, baseType: !12, size: 64, offset: 3200)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !22, file: !21, line: 185, baseType: !12, size: 64, offset: 3264)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !22, file: !21, line: 186, baseType: !12, size: 64, offset: 3328)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !22, file: !21, line: 186, baseType: !12, size: 64, offset: 3392)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !22, file: !21, line: 186, baseType: !12, size: 64, offset: 3456)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !22, file: !21, line: 186, baseType: !12, size: 64, offset: 3520)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !22, file: !21, line: 187, baseType: !12, size: 64, offset: 3584)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !22, file: !21, line: 187, baseType: !12, size: 64, offset: 3648)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !22, file: !21, line: 189, baseType: !12, size: 64, offset: 3712)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !22, file: !21, line: 190, baseType: !12, size: 64, offset: 3776)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !22, file: !21, line: 191, baseType: !12, size: 64, offset: 3840)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !22, file: !21, line: 192, baseType: !12, size: 64, offset: 3904)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !22, file: !21, line: 193, baseType: !12, size: 64, offset: 3968)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !22, file: !21, line: 194, baseType: !12, size: 64, offset: 4032)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !22, file: !21, line: 195, baseType: !12, size: 64, offset: 4096)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !22, file: !21, line: 196, baseType: !12, size: 64, offset: 4160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !22, file: !21, line: 197, baseType: !12, size: 64, offset: 4224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !22, file: !21, line: 198, baseType: !47, size: 64, offset: 4288)
!47 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !22, file: !21, line: 199, baseType: !49, size: 64, offset: 4352)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !21, line: 98, baseType: !12)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !22, file: !21, line: 200, baseType: !51, size: 64, offset: 4416)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !21, line: 135, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !21, line: 149, size: 832, elements: !54)
!54 = !{!55, !56, !58, !59, !60, !61, !62, !78, !79, !80, !81, !82, !83, !84}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !53, file: !21, line: 151, baseType: !49, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !53, file: !21, line: 152, baseType: !57, size: 32, offset: 64)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !53, file: !21, line: 153, baseType: !51, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !53, file: !21, line: 154, baseType: !51, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !53, file: !21, line: 155, baseType: !51, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !53, file: !21, line: 156, baseType: !51, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !53, file: !21, line: 157, baseType: !63, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !21, line: 138, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !21, line: 168, size: 576, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !73, !74, !75, !77}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !21, line: 170, baseType: !57, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !65, file: !21, line: 171, baseType: !49, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !65, file: !21, line: 172, baseType: !51, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !65, file: !21, line: 172, baseType: !51, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !65, file: !21, line: 173, baseType: !72, size: 16, offset: 256)
!72 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !65, file: !21, line: 174, baseType: !63, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !65, file: !21, line: 174, baseType: !63, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !65, file: !21, line: 175, baseType: !76, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !21, line: 97, baseType: !12)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !65, file: !21, line: 176, baseType: !49, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !53, file: !21, line: 158, baseType: !63, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !53, file: !21, line: 158, baseType: !63, size: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !53, file: !21, line: 159, baseType: !63, size: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !53, file: !21, line: 160, baseType: !76, size: 64, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !53, file: !21, line: 161, baseType: !12, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !53, file: !21, line: 162, baseType: !57, size: 32, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !53, file: !21, line: 163, baseType: !57, size: 32, offset: 800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !22, file: !21, line: 200, baseType: !51, size: 64, offset: 4480)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !22, file: !21, line: 201, baseType: !63, size: 64, offset: 4544)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !22, file: !21, line: 201, baseType: !63, size: 64, offset: 4608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !22, file: !21, line: 201, baseType: !63, size: 64, offset: 4672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !22, file: !21, line: 202, baseType: !63, size: 64, offset: 4736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !22, file: !21, line: 202, baseType: !63, size: 64, offset: 4800)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !22, file: !21, line: 203, baseType: !12, size: 64, offset: 4864)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !22, file: !21, line: 204, baseType: !12, size: 64, offset: 4928)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !22, file: !21, line: 205, baseType: !12, size: 64, offset: 4992)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !22, file: !21, line: 205, baseType: !12, size: 64, offset: 5056)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !22, file: !21, line: 205, baseType: !12, size: 64, offset: 5120)
!96 = !DILocalVariable(name: "outfile", arg: 1, scope: !9, file: !1, line: 32, type: !17)
!97 = !DILocation(line: 32, column: 26, scope: !9)
!98 = !DILocalVariable(name: "net", arg: 2, scope: !9, file: !1, line: 33, type: !19)
!99 = !DILocation(line: 33, column: 31, scope: !9)
!100 = !DILocalVariable(name: "out", scope: !9, file: !1, line: 41, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !103, line: 7, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !124, !125, !126, !128, !130, !132, !136, !139, !141, !144, !147, !148, !149, !153, !154}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !104, file: !105, line: 51, baseType: !57, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !104, file: !105, line: 54, baseType: !17, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !104, file: !105, line: 55, baseType: !17, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !104, file: !105, line: 56, baseType: !17, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !104, file: !105, line: 57, baseType: !17, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !104, file: !105, line: 58, baseType: !17, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !104, file: !105, line: 59, baseType: !17, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !104, file: !105, line: 60, baseType: !17, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !104, file: !105, line: 61, baseType: !17, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !104, file: !105, line: 64, baseType: !17, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !104, file: !105, line: 65, baseType: !17, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !104, file: !105, line: 66, baseType: !17, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !104, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !105, line: 36, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !104, file: !105, line: 70, baseType: !123, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !104, file: !105, line: 72, baseType: !57, size: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !104, file: !105, line: 73, baseType: !57, size: 32, offset: 928)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !104, file: !105, line: 74, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 152, baseType: !16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !104, file: !105, line: 77, baseType: !129, size: 16, offset: 1024)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !104, file: !105, line: 78, baseType: !131, size: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !104, file: !105, line: 79, baseType: !133, size: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !104, file: !105, line: 81, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !105, line: 43, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !104, file: !105, line: 89, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 153, baseType: !16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !104, file: !105, line: 91, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !105, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !104, file: !105, line: 92, baseType: !145, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !105, line: 38, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !104, file: !105, line: 93, baseType: !123, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !104, file: !105, line: 94, baseType: !4, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !104, file: !105, line: 95, baseType: !150, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 46, baseType: !152)
!151 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!152 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !104, file: !105, line: 96, baseType: !57, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !104, file: !105, line: 98, baseType: !155, size: 160, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DILocation(line: 41, column: 9, scope: !9)
!159 = !DILocalVariable(name: "block", scope: !9, file: !1, line: 42, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !21, line: 137, baseType: !65)
!162 = !DILocation(line: 42, column: 10, scope: !9)
!163 = !DILocalVariable(name: "arc", scope: !9, file: !1, line: 43, type: !160)
!164 = !DILocation(line: 43, column: 10, scope: !9)
!165 = !DILocalVariable(name: "arc2", scope: !9, file: !1, line: 44, type: !160)
!166 = !DILocation(line: 44, column: 10, scope: !9)
!167 = !DILocalVariable(name: "first_impl", scope: !9, file: !1, line: 45, type: !160)
!168 = !DILocation(line: 45, column: 10, scope: !9)
!169 = !DILocation(line: 45, column: 23, scope: !9)
!170 = !DILocation(line: 45, column: 28, scope: !9)
!171 = !DILocation(line: 45, column: 40, scope: !9)
!172 = !DILocation(line: 45, column: 45, scope: !9)
!173 = !DILocation(line: 45, column: 38, scope: !9)
!174 = !DILocation(line: 47, column: 21, scope: !175)
!175 = distinct !DILexicalBlock(scope: !9, file: !1, line: 47, column: 6)
!176 = !DILocation(line: 47, column: 14, scope: !175)
!177 = !DILocation(line: 47, column: 12, scope: !175)
!178 = !DILocation(line: 47, column: 37, scope: !175)
!179 = !DILocation(line: 47, column: 6, scope: !9)
!180 = !DILocation(line: 48, column: 5, scope: !175)
!181 = !DILocation(line: 50, column: 28, scope: !9)
!182 = !DILocation(line: 50, column: 3, scope: !9)
!183 = !DILocation(line: 52, column: 16, scope: !184)
!184 = distinct !DILexicalBlock(scope: !9, file: !1, line: 52, column: 3)
!185 = !DILocation(line: 52, column: 21, scope: !184)
!186 = !DILocation(line: 52, column: 27, scope: !184)
!187 = !DILocation(line: 52, column: 32, scope: !184)
!188 = !DILocation(line: 52, column: 35, scope: !184)
!189 = !DILocation(line: 52, column: 14, scope: !184)
!190 = !DILocation(line: 52, column: 8, scope: !184)
!191 = !DILocation(line: 52, column: 45, scope: !192)
!192 = distinct !DILexicalBlock(scope: !184, file: !1, line: 52, column: 3)
!193 = !DILocation(line: 52, column: 3, scope: !184)
!194 = !DILocation(line: 54, column: 9, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !1, line: 54, column: 9)
!196 = distinct !DILexicalBlock(scope: !192, file: !1, line: 53, column: 3)
!197 = !DILocation(line: 54, column: 16, scope: !195)
!198 = !DILocation(line: 54, column: 9, scope: !196)
!199 = !DILocation(line: 56, column: 16, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !1, line: 55, column: 5)
!201 = !DILocation(line: 56, column: 7, scope: !200)
!202 = !DILocation(line: 58, column: 13, scope: !200)
!203 = !DILocation(line: 58, column: 11, scope: !200)
!204 = !DILocation(line: 59, column: 7, scope: !200)
!205 = !DILocation(line: 59, column: 14, scope: !200)
!206 = !DILocation(line: 61, column: 13, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 61, column: 13)
!208 = distinct !DILexicalBlock(scope: !200, file: !1, line: 60, column: 7)
!209 = !DILocation(line: 61, column: 20, scope: !207)
!210 = !DILocation(line: 61, column: 17, scope: !207)
!211 = !DILocation(line: 61, column: 13, scope: !208)
!212 = !DILocation(line: 62, column: 20, scope: !207)
!213 = !DILocation(line: 62, column: 11, scope: !207)
!214 = !DILocation(line: 64, column: 18, scope: !208)
!215 = !DILocation(line: 64, column: 33, scope: !208)
!216 = !DILocation(line: 64, column: 38, scope: !208)
!217 = !DILocation(line: 64, column: 44, scope: !208)
!218 = !DILocation(line: 64, column: 31, scope: !208)
!219 = !DILocation(line: 64, column: 9, scope: !208)
!220 = !DILocation(line: 65, column: 16, scope: !208)
