; ModuleID = 'pstart.c'
source_filename = "pstart.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }

; Function Attrs: noinline nounwind uwtable
define dso_local i64 @primal_start_artificial(%struct.network* %net) #0 !dbg !16 {
entry:
  %net.addr = alloca %struct.network*, align 8
  %node = alloca %struct.node*, align 8
  %root = alloca %struct.node*, align 8
  %arc = alloca %struct.arc*, align 8
  %i = alloca i32, align 4
  store %struct.network* %net, %struct.network** %net.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.network** %net.addr, metadata !94, metadata !DIExpression()), !dbg !95
  call void @llvm.dbg.declare(metadata %struct.node** %node, metadata !96, metadata !DIExpression()), !dbg !99
  call void @llvm.dbg.declare(metadata %struct.node** %root, metadata !100, metadata !DIExpression()), !dbg !101

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "pstart.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !6, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !5, line: 98, baseType: !6)
!5 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !7, line: 27, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !9, line: 44, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !5, line: 97, baseType: !6)
!12 = !{i32 7, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!16 = distinct !DISubprogram(name: "primal_start_artificial", scope: !1, file: !1, line: 30, type: !17, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!6, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !5, line: 206, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !5, line: 181, size: 5184, elements: !22)
!22 = !{!23, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !48, !49, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !21, file: !5, line: 183, baseType: !24, size: 1600)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1600, elements: !26)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !{!27}
!27 = !DISubrange(count: 200)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !21, file: !5, line: 184, baseType: !24, size: 1600, offset: 1600)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !21, file: !5, line: 185, baseType: !6, size: 64, offset: 3200)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !21, file: !5, line: 185, baseType: !6, size: 64, offset: 3264)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !21, file: !5, line: 186, baseType: !6, size: 64, offset: 3328)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !21, file: !5, line: 186, baseType: !6, size: 64, offset: 3392)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !21, file: !5, line: 186, baseType: !6, size: 64, offset: 3456)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !21, file: !5, line: 186, baseType: !6, size: 64, offset: 3520)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !21, file: !5, line: 187, baseType: !6, size: 64, offset: 3584)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !21, file: !5, line: 187, baseType: !6, size: 64, offset: 3648)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !21, file: !5, line: 189, baseType: !6, size: 64, offset: 3712)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !21, file: !5, line: 190, baseType: !6, size: 64, offset: 3776)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !21, file: !5, line: 191, baseType: !6, size: 64, offset: 3840)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !21, file: !5, line: 192, baseType: !6, size: 64, offset: 3904)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !21, file: !5, line: 193, baseType: !6, size: 64, offset: 3968)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !21, file: !5, line: 194, baseType: !6, size: 64, offset: 4032)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !21, file: !5, line: 195, baseType: !6, size: 64, offset: 4096)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !21, file: !5, line: 196, baseType: !6, size: 64, offset: 4160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !21, file: !5, line: 197, baseType: !6, size: 64, offset: 4224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !21, file: !5, line: 198, baseType: !47, size: 64, offset: 4288)
!47 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !21, file: !5, line: 199, baseType: !4, size: 64, offset: 4352)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !21, file: !5, line: 200, baseType: !50, size: 64, offset: 4416)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !5, line: 135, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !5, line: 149, size: 832, elements: !53)
!53 = !{!54, !55, !57, !58, !59, !60, !61, !76, !77, !78, !79, !80, !81, !82}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !52, file: !5, line: 151, baseType: !4, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !52, file: !5, line: 152, baseType: !56, size: 32, offset: 64)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !52, file: !5, line: 153, baseType: !50, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !52, file: !5, line: 154, baseType: !50, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !52, file: !5, line: 155, baseType: !50, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !52, file: !5, line: 156, baseType: !50, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !52, file: !5, line: 157, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !5, line: 138, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !5, line: 168, size: 576, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !72, !73, !74, !75}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !5, line: 170, baseType: !56, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !64, file: !5, line: 171, baseType: !4, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !64, file: !5, line: 172, baseType: !50, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !64, file: !5, line: 172, baseType: !50, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !64, file: !5, line: 173, baseType: !71, size: 16, offset: 256)
!71 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !64, file: !5, line: 174, baseType: !62, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !64, file: !5, line: 174, baseType: !62, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !64, file: !5, line: 175, baseType: !11, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !64, file: !5, line: 176, baseType: !4, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !52, file: !5, line: 158, baseType: !62, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !52, file: !5, line: 158, baseType: !62, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !52, file: !5, line: 159, baseType: !62, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !52, file: !5, line: 160, baseType: !11, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !52, file: !5, line: 161, baseType: !6, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !52, file: !5, line: 162, baseType: !56, size: 32, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !52, file: !5, line: 163, baseType: !56, size: 32, offset: 800)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !21, file: !5, line: 200, baseType: !50, size: 64, offset: 4480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !21, file: !5, line: 201, baseType: !62, size: 64, offset: 4544)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !21, file: !5, line: 201, baseType: !62, size: 64, offset: 4608)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !21, file: !5, line: 201, baseType: !62, size: 64, offset: 4672)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !21, file: !5, line: 202, baseType: !62, size: 64, offset: 4736)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !21, file: !5, line: 202, baseType: !62, size: 64, offset: 4800)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !21, file: !5, line: 203, baseType: !6, size: 64, offset: 4864)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !21, file: !5, line: 204, baseType: !6, size: 64, offset: 4928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !21, file: !5, line: 205, baseType: !6, size: 64, offset: 4992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !21, file: !5, line: 205, baseType: !6, size: 64, offset: 5056)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !21, file: !5, line: 205, baseType: !6, size: 64, offset: 5120)
!94 = !DILocalVariable(name: "net", arg: 1, scope: !16, file: !1, line: 30, type: !19)
!95 = !DILocation(line: 30, column: 42, scope: !16)
!96 = !DILocalVariable(name: "node", scope: !16, file: !1, line: 36, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !5, line: 134, baseType: !52)
!99 = !DILocation(line: 36, column: 13, scope: !16)
!100 = !DILocalVariable(name: "root", scope: !16, file: !1, line: 36, type: !97)
!101 = !DILocation(line: 36, column: 20, scope: !16)
!102 = !DILocalVariable(name: "arc", scope: !16, file: !1, line: 37, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !5, line: 137, baseType: !64)
!105 = !DILocation(line: 37, column: 12, scope: !16)
!106 = !DILocalVariable(name: "i", scope: !16, file: !1, line: 38, type: !56)
!107 = !DILocation(line: 38, column: 9, scope: !16)
!108 = !DILocation(line: 40, column: 19, scope: !16)
!109 = !DILocation(line: 40, column: 24, scope: !16)
!110 = !DILocation(line: 40, column: 17, scope: !16)
!111 = !DILocation(line: 40, column: 10, scope: !16)
!112 = !DILocation(line: 40, column: 35, scope: !16)
!113 = !DILocation(line: 41, column: 5, scope: !16)
!114 = !DILocation(line: 41, column: 11, scope: !16)
!115 = !DILocation(line: 41, column: 21, scope: !16)
!116 = !DILocation(line: 42, column: 5, scope: !16)
!117 = !DILocation(line: 42, column: 11, scope: !16)
!118 = !DILocation(line: 42, column: 16, scope: !16)
!119 = !DILocation(line: 43, column: 19, scope: !16)
!120 = !DILocation(line: 43, column: 5, scope: !16)
!121 = !DILocation(line: 43, column: 11, scope: !16)
!122 = !DILocation(line: 43, column: 17, scope: !16)
!123 = !DILocation(line: 44, column: 5, scope: !16)
!124 = !DILocation(line: 44, column: 11, scope: !16)
!125 = !DILocation(line: 44, column: 19, scope: !16)
!126 = !DILocation(line: 45, column: 5, scope: !16)
!127 = !DILocation(line: 45, column: 11, scope: !16)
!128 = !DILocation(line: 45, column: 24, scope: !16)
!129 = !DILocation(line: 46, column: 20, scope: !16)
!130 = !DILocation(line: 46, column: 25, scope: !16)
!131 = !DILocation(line: 46, column: 28, scope: !16)
!132 = !DILocation(line: 46, column: 5, scope: !16)
!133 = !DILocation(line: 46, column: 11, scope: !16)
!134 = !DILocation(line: 46, column: 17, scope: !16)
!135 = !DILocation(line: 47, column: 5, scope: !16)
!136 = !DILocation(line: 47, column: 11, scope: !16)
!137 = !DILocation(line: 47, column: 23, scope: !16)
!138 = !DILocation(line: 48, column: 5, scope: !16)
!139 = !DILocation(line: 48, column: 11, scope: !16)
!140 = !DILocation(line: 48, column: 21, scope: !16)
!141 = !DILocation(line: 49, column: 5, scope: !16)
!142 = !DILocation(line: 49, column: 11, scope: !16)
!143 = !DILocation(line: 49, column: 16, scope: !16)
!144 = !DILocation(line: 51, column: 11, scope: !16)
!145 = !DILocation(line: 51, column: 16, scope: !16)
!146 = !DILocation(line: 51, column: 9, scope: !16)
!147 = !DILocation(line: 55, column: 12, scope: !148)
!148 = distinct !DILexicalBlock(scope: !16, file: !1, line: 55, column: 5)
!149 = !DILocation(line: 55, column: 10, scope: !148)
!150 = !DILocation(line: 55, column: 17, scope: !151)
!151 = distinct !DILexicalBlock(scope: !148, file: !1, line: 55, column: 5)
!152 = !DILocation(line: 55, column: 21, scope: !151)
!153 = !DILocation(line: 55, column: 26, scope: !151)
!154 = !DILocation(line: 55, column: 19, scope: !151)
!155 = !DILocation(line: 55, column: 5, scope: !148)
!156 = !DILocation(line: 56, column: 13, scope: !157)
!157 = distinct !DILexicalBlock(scope: !151, file: !1, line: 56, column: 13)
!158 = !DILocation(line: 56, column: 17, scope: !157)
!159 = !DILocation(line: 56, column: 20, scope: !157)
!160 = !DILocation(line: 56, column: 26, scope: !157)
