; ModuleID = 'pbeampp.c'
source_filename = "pbeampp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.basket = type { %struct.arc*, i64, i64, i64 }

@full_group_end_arc = internal global %struct.arc* null, align 8, !dbg !0

; Function Attrs: noinline nounwind uwtable
define dso_local void @set_static_vars(%struct.network* %net, %struct.arc* %arcs) #0 !dbg !59 {
entry:
  %net.addr = alloca %struct.network*, align 8
  %arcs.addr = alloca %struct.arc*, align 8
  store %struct.network* %net, %struct.network** %net.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.network** %net.addr, metadata !104, metadata !DIExpression()), !dbg !105
  store %struct.arc* %arcs, %struct.arc** %arcs.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.arc** %arcs.addr, metadata !106, metadata !DIExpression()), !dbg !107

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "full_group_end_arc", scope: !2, file: !3, line: 30, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "pbeampp.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!12 = !{!0}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !15, line: 137, baseType: !16)
!15 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !15, line: 168, size: 576, elements: !17)
!17 = !{!18, !19, !26, !48, !49, !51, !52, !53, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !16, file: !15, line: 170, baseType: !9, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !16, file: !15, line: 171, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !15, line: 98, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !22, line: 27, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!25 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !16, file: !15, line: 172, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !15, line: 135, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !15, line: 149, size: 832, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !40, !41, !42, !43, !45, !46, !47}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !29, file: !15, line: 151, baseType: !20, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !29, file: !15, line: 152, baseType: !9, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !29, file: !15, line: 153, baseType: !27, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !29, file: !15, line: 154, baseType: !27, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !29, file: !15, line: 155, baseType: !27, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !29, file: !15, line: 156, baseType: !27, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !29, file: !15, line: 157, baseType: !38, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !15, line: 138, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !29, file: !15, line: 158, baseType: !38, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !29, file: !15, line: 158, baseType: !38, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !29, file: !15, line: 159, baseType: !38, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !29, file: !15, line: 160, baseType: !44, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !15, line: 97, baseType: !21)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !29, file: !15, line: 161, baseType: !21, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !29, file: !15, line: 162, baseType: !9, size: 32, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !29, file: !15, line: 163, baseType: !9, size: 32, offset: 800)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !16, file: !15, line: 172, baseType: !27, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !16, file: !15, line: 173, baseType: !50, size: 16, offset: 256)
!50 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !16, file: !15, line: 174, baseType: !38, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !16, file: !15, line: 174, baseType: !38, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !16, file: !15, line: 175, baseType: !44, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !16, file: !15, line: 176, baseType: !20, size: 64, offset: 512)
!55 = !{i32 7, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!59 = distinct !DISubprogram(name: "set_static_vars", scope: !3, file: !3, line: 33, type: !60, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !13}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !15, line: 206, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !15, line: 181, size: 5184, elements: !65)
!65 = !{!66, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !64, file: !15, line: 183, baseType: !67, size: 1600)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1600, elements: !69)
!68 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!69 = !{!70}
!70 = !DISubrange(count: 200)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !64, file: !15, line: 184, baseType: !67, size: 1600, offset: 1600)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !64, file: !15, line: 185, baseType: !21, size: 64, offset: 3200)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !64, file: !15, line: 185, baseType: !21, size: 64, offset: 3264)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !64, file: !15, line: 186, baseType: !21, size: 64, offset: 3328)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !64, file: !15, line: 186, baseType: !21, size: 64, offset: 3392)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !64, file: !15, line: 186, baseType: !21, size: 64, offset: 3456)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !64, file: !15, line: 186, baseType: !21, size: 64, offset: 3520)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !64, file: !15, line: 187, baseType: !21, size: 64, offset: 3584)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !64, file: !15, line: 187, baseType: !21, size: 64, offset: 3648)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !64, file: !15, line: 189, baseType: !21, size: 64, offset: 3712)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !64, file: !15, line: 190, baseType: !21, size: 64, offset: 3776)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !64, file: !15, line: 191, baseType: !21, size: 64, offset: 3840)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !64, file: !15, line: 192, baseType: !21, size: 64, offset: 3904)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !64, file: !15, line: 193, baseType: !21, size: 64, offset: 3968)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !64, file: !15, line: 194, baseType: !21, size: 64, offset: 4032)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !64, file: !15, line: 195, baseType: !21, size: 64, offset: 4096)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !64, file: !15, line: 196, baseType: !21, size: 64, offset: 4160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !64, file: !15, line: 197, baseType: !21, size: 64, offset: 4224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !64, file: !15, line: 198, baseType: !90, size: 64, offset: 4288)
!90 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !64, file: !15, line: 199, baseType: !20, size: 64, offset: 4352)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !64, file: !15, line: 200, baseType: !27, size: 64, offset: 4416)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !64, file: !15, line: 200, baseType: !27, size: 64, offset: 4480)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !64, file: !15, line: 201, baseType: !38, size: 64, offset: 4544)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !64, file: !15, line: 201, baseType: !38, size: 64, offset: 4608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !64, file: !15, line: 201, baseType: !38, size: 64, offset: 4672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !64, file: !15, line: 202, baseType: !38, size: 64, offset: 4736)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !64, file: !15, line: 202, baseType: !38, size: 64, offset: 4800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !64, file: !15, line: 203, baseType: !21, size: 64, offset: 4864)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !64, file: !15, line: 204, baseType: !21, size: 64, offset: 4928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !64, file: !15, line: 205, baseType: !21, size: 64, offset: 4992)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !64, file: !15, line: 205, baseType: !21, size: 64, offset: 5056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !64, file: !15, line: 205, baseType: !21, size: 64, offset: 5120)
!104 = !DILocalVariable(name: "net", arg: 1, scope: !59, file: !3, line: 33, type: !62)
!105 = !DILocation(line: 33, column: 33, scope: !59)
!106 = !DILocalVariable(name: "arcs", arg: 2, scope: !59, file: !3, line: 33, type: !13)
!107 = !DILocation(line: 33, column: 45, scope: !59)
!108 = !DILocation(line: 40, column: 24, scope: !59)
!109 = !DILocation(line: 40, column: 31, scope: !59)
!110 = !DILocation(line: 40, column: 36, scope: !59)
!111 = !DILocation(line: 40, column: 50, scope: !59)
!112 = !DILocation(line: 40, column: 55, scope: !59)
!113 = !DILocation(line: 40, column: 48, scope: !59)
!114 = !DILocation(line: 40, column: 29, scope: !59)
!115 = !DILocation(line: 40, column: 22, scope: !59)
!116 = !DILocation(line: 41, column: 1, scope: !59)
!117 = distinct !DISubprogram(name: "bea_is_dual_infeasible", scope: !3, file: !3, line: 46, type: !118, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!118 = !DISubroutineType(types: !119)
!119 = !{!9, !13, !20}
!120 = !DILocalVariable(name: "arc", arg: 1, scope: !117, file: !3, line: 46, type: !13)
!121 = !DILocation(line: 46, column: 36, scope: !117)
!122 = !DILocalVariable(name: "red_cost", arg: 2, scope: !117, file: !3, line: 46, type: !20)
!123 = !DILocation(line: 46, column: 48, scope: !117)
!124 = !DILocation(line: 53, column: 17, scope: !117)
!125 = !DILocation(line: 53, column: 26, scope: !117)
!126 = !DILocation(line: 53, column: 30, scope: !117)
!127 = !DILocation(line: 53, column: 33, scope: !117)
!128 = !DILocation(line: 53, column: 38, scope: !117)
!129 = !DILocation(line: 53, column: 44, scope: !117)
!130 = !DILocation(line: 54, column: 13, scope: !117)
!131 = !DILocation(line: 54, column: 17, scope: !117)
!132 = !DILocation(line: 54, column: 26, scope: !117)
!133 = !DILocation(line: 54, column: 30, scope: !117)
!134 = !DILocation(line: 54, column: 33, scope: !117)
!135 = !DILocation(line: 54, column: 38, scope: !117)
!136 = !DILocation(line: 54, column: 44, scope: !117)
!137 = !DILocation(line: 0, scope: !117)
!138 = !DILocation(line: 53, column: 5, scope: !117)
!139 = distinct !DISubprogram(name: "cost_compare", scope: !3, file: !3, line: 61, type: !140, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!140 = !DISubroutineType(types: !141)
!141 = !{!9, !142, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !15, line: 146, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !15, line: 140, size: 256, elements: !146)
!146 = !{!147, !148, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !145, file: !15, line: 142, baseType: !13, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !145, file: !15, line: 143, baseType: !20, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !145, file: !15, line: 144, baseType: !20, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !145, file: !15, line: 145, baseType: !21, size: 64, offset: 192)
!151 = !DILocalVariable(name: "b1", arg: 1, scope: !139, file: !3, line: 61, type: !142)
!152 = !DILocation(line: 61, column: 28, scope: !139)
!153 = !DILocalVariable(name: "b2", arg: 2, scope: !139, file: !3, line: 61, type: !142)
!154 = !DILocation(line: 61, column: 41, scope: !139)
!155 = !DILocation(line: 68, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !139, file: !3, line: 68, column: 7)
!157 = !DILocation(line: 68, column: 8, scope: !156)
!158 = !DILocation(line: 68, column: 14, scope: !156)
!159 = !DILocation(line: 68, column: 27, scope: !156)
!160 = !DILocation(line: 68, column: 26, scope: !156)
!161 = !DILocation(line: 68, column: 32, scope: !156)
!162 = !DILocation(line: 68, column: 23, scope: !156)
!163 = !DILocation(line: 68, column: 7, scope: !139)
!164 = !DILocation(line: 69, column: 5, scope: !156)
!165 = !DILocation(line: 70, column: 9, scope: !166)
!166 = distinct !DILexicalBlock(scope: !139, file: !3, line: 70, column: 7)
!167 = !DILocation(line: 70, column: 8, scope: !166)
!168 = !DILocation(line: 70, column: 14, scope: !166)
!169 = !DILocation(line: 70, column: 27, scope: !166)
!170 = !DILocation(line: 70, column: 26, scope: !166)
!171 = !DILocation(line: 70, column: 32, scope: !166)
!172 = !DILocation(line: 70, column: 23, scope: !166)
!173 = !DILocation(line: 70, column: 7, scope: !139)
!174 = !DILocation(line: 71, column: 5, scope: !166)
!175 = !DILocation(line: 72, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !139, file: !3, line: 72, column: 7)
!177 = !DILocation(line: 72, column: 8, scope: !176)
!178 = !DILocation(line: 72, column: 14, scope: !176)
!179 = !DILocation(line: 72, column: 17, scope: !176)
!180 = !DILocation(line: 72, column: 24, scope: !176)
!181 = !DILocation(line: 72, column: 23, scope: !176)
!182 = !DILocation(line: 72, column: 29, scope: !176)
!183 = !DILocation(line: 72, column: 32, scope: !176)
!184 = !DILocation(line: 72, column: 20, scope: !176)
!185 = !DILocation(line: 72, column: 7, scope: !139)
!186 = !DILocation(line: 73, column: 5, scope: !176)
!187 = !DILocation(line: 75, column: 5, scope: !176)
!188 = !DILocation(line: 76, column: 1, scope: !139)
!189 = distinct !DISubprogram(name: "primal_bea_mpp", scope: !3, file: !3, line: 80, type: !190, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!190 = !DISubroutineType(types: !191)
!191 = !{!143, !21, !13, !13, !192, !142, !9, !193, !21, !21, !21}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!194 = !DILocalVariable(name: "m", arg: 1, scope: !189, file: !3, line: 80, type: !21)
!195 = !DILocation(line: 80, column: 30, scope: !189)
!196 = !DILocalVariable(name: "arcs", arg: 2, scope: !189, file: !3, line: 80, type: !13)
!197 = !DILocation(line: 80, column: 41, scope: !189)
!198 = !DILocalVariable(name: "stop_arcs", arg: 3, scope: !189, file: !3, line: 80, type: !13)
!199 = !DILocation(line: 80, column: 54, scope: !189)
!200 = !DILocalVariable(name: "basket_sizes", arg: 4, scope: !189, file: !3, line: 81, type: !192)
!201 = !DILocation(line: 81, column: 33, scope: !189)
!202 = !DILocalVariable(name: "perm", arg: 5, scope: !189, file: !3, line: 81, type: !142)
!203 = !DILocation(line: 81, column: 56, scope: !189)
!204 = !DILocalVariable(name: "thread", arg: 6, scope: !189, file: !3, line: 81, type: !9)
!205 = !DILocation(line: 81, column: 66, scope: !189)
!206 = !DILocalVariable(name: "end_arc", arg: 7, scope: !189, file: !3, line: 81, type: !193)
!207 = !DILocation(line: 81, column: 82, scope: !189)
!208 = !DILocalVariable(name: "step", arg: 8, scope: !189, file: !3, line: 81, type: !21)
!209 = !DILocation(line: 81, column: 96, scope: !189)
!210 = !DILocalVariable(name: "num_threads", arg: 9, scope: !189, file: !3, line: 81, type: !21)
