; ModuleID = 'mcf.c'
source_filename = "mcf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }

@.str = private unnamed_addr constant [34 x i8] c"active arcs                : %ld\0A\00", align 1
@net = common dso_local global %struct.network zeroinitializer, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [34 x i8] c"simplex iterations         : %ld\0A\00", align 1
@.str.2 = private unnamed_addr constant [36 x i8] c"objective value            : %0.0f\0A\00", align 1
@.str.3 = private unnamed_addr constant [29 x i8] c"not enough memory, exit(-1)\0A\00", align 1
@.str.4 = private unnamed_addr constant [34 x i8] c"erased arcs                : %ld\0A\00", align 1
@.str.5 = private unnamed_addr constant [34 x i8] c"new implicit arcs          : %ld\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "net", scope: !2, file: !3, line: 30, type: !18, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "mcf.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !13, !14, !8}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !7, line: 98, baseType: !8)
!7 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !11, line: 44, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 46, baseType: !16)
!15 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!16 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!17 = !{!0}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !7, line: 206, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !7, line: 181, size: 5184, elements: !20)
!20 = !{!21, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !46, !47, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !19, file: !7, line: 183, baseType: !22, size: 1600)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1600, elements: !24)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{!25}
!25 = !DISubrange(count: 200)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !19, file: !7, line: 184, baseType: !22, size: 1600, offset: 1600)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !19, file: !7, line: 185, baseType: !8, size: 64, offset: 3200)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !19, file: !7, line: 185, baseType: !8, size: 64, offset: 3264)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !19, file: !7, line: 186, baseType: !8, size: 64, offset: 3328)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !19, file: !7, line: 186, baseType: !8, size: 64, offset: 3392)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !19, file: !7, line: 186, baseType: !8, size: 64, offset: 3456)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !19, file: !7, line: 186, baseType: !8, size: 64, offset: 3520)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !19, file: !7, line: 187, baseType: !8, size: 64, offset: 3584)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !19, file: !7, line: 187, baseType: !8, size: 64, offset: 3648)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !19, file: !7, line: 189, baseType: !8, size: 64, offset: 3712)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !19, file: !7, line: 190, baseType: !8, size: 64, offset: 3776)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !19, file: !7, line: 191, baseType: !8, size: 64, offset: 3840)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !19, file: !7, line: 192, baseType: !8, size: 64, offset: 3904)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !19, file: !7, line: 193, baseType: !8, size: 64, offset: 3968)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !19, file: !7, line: 194, baseType: !8, size: 64, offset: 4032)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !19, file: !7, line: 195, baseType: !8, size: 64, offset: 4096)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !19, file: !7, line: 196, baseType: !8, size: 64, offset: 4160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !19, file: !7, line: 197, baseType: !8, size: 64, offset: 4224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !19, file: !7, line: 198, baseType: !45, size: 64, offset: 4288)
!45 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !19, file: !7, line: 199, baseType: !6, size: 64, offset: 4352)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !19, file: !7, line: 200, baseType: !48, size: 64, offset: 4416)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !51)
!51 = !{!52, !53, !55, !56, !57, !58, !59, !75, !76, !77, !78, !79, !80, !81}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !50, file: !7, line: 151, baseType: !6, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !50, file: !7, line: 152, baseType: !54, size: 32, offset: 64)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !50, file: !7, line: 153, baseType: !48, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !50, file: !7, line: 154, baseType: !48, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !50, file: !7, line: 155, baseType: !48, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !50, file: !7, line: 156, baseType: !48, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !50, file: !7, line: 157, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !70, !71, !72, !74}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !62, file: !7, line: 170, baseType: !54, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !62, file: !7, line: 171, baseType: !6, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !62, file: !7, line: 172, baseType: !48, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !62, file: !7, line: 172, baseType: !48, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !62, file: !7, line: 173, baseType: !69, size: 16, offset: 256)
!69 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !62, file: !7, line: 174, baseType: !60, size: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !62, file: !7, line: 174, baseType: !60, size: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !62, file: !7, line: 175, baseType: !73, size: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !7, line: 97, baseType: !8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !62, file: !7, line: 176, baseType: !6, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !50, file: !7, line: 158, baseType: !60, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !50, file: !7, line: 158, baseType: !60, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !50, file: !7, line: 159, baseType: !60, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !50, file: !7, line: 160, baseType: !73, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !50, file: !7, line: 161, baseType: !8, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !50, file: !7, line: 162, baseType: !54, size: 32, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !50, file: !7, line: 163, baseType: !54, size: 32, offset: 800)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !19, file: !7, line: 200, baseType: !48, size: 64, offset: 4480)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !19, file: !7, line: 201, baseType: !60, size: 64, offset: 4544)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !19, file: !7, line: 201, baseType: !60, size: 64, offset: 4608)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !19, file: !7, line: 201, baseType: !60, size: 64, offset: 4672)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !19, file: !7, line: 202, baseType: !60, size: 64, offset: 4736)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !19, file: !7, line: 202, baseType: !60, size: 64, offset: 4800)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !19, file: !7, line: 203, baseType: !8, size: 64, offset: 4864)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !19, file: !7, line: 204, baseType: !8, size: 64, offset: 4928)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !19, file: !7, line: 205, baseType: !8, size: 64, offset: 4992)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !19, file: !7, line: 205, baseType: !8, size: 64, offset: 5056)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !19, file: !7, line: 205, baseType: !8, size: 64, offset: 5120)
!93 = !{i32 7, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{i32 1, !"wchar_size", i32 4}
!96 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!97 = distinct !DISubprogram(name: "global_opt", scope: !3, file: !3, line: 37, type: !98, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!98 = !DISubroutineType(types: !99)
!99 = !{!8}
!100 = !DILocalVariable(name: "new_arcs", scope: !97, file: !3, line: 42, type: !8)
!101 = !DILocation(line: 42, column: 8, scope: !97)
!102 = !DILocalVariable(name: "residual_nb_it", scope: !97, file: !3, line: 43, type: !8)
!103 = !DILocation(line: 43, column: 8, scope: !97)
!104 = !DILocation(line: 46, column: 12, scope: !97)
!105 = !DILocation(line: 48, column: 3, scope: !97)
!106 = !DILocation(line: 48, column: 10, scope: !97)
!107 = !DILocation(line: 51, column: 63, scope: !108)
!108 = distinct !DILexicalBlock(scope: !97, file: !3, line: 49, column: 3)
!109 = !DILocation(line: 51, column: 5, scope: !108)
!110 = !DILocation(line: 54, column: 5, scope: !108)
!111 = !DILocation(line: 57, column: 63, scope: !108)
!112 = !DILocation(line: 57, column: 5, scope: !108)
!113 = !DILocation(line: 58, column: 53, scope: !108)
!114 = !DILocation(line: 58, column: 5, scope: !108)
!115 = !DILocation(line: 67, column: 13, scope: !116)
!116 = distinct !DILexicalBlock(scope: !108, file: !3, line: 67, column: 9)
!117 = !DILocation(line: 67, column: 9, scope: !116)
!118 = !DILocation(line: 67, column: 9, scope: !108)
!119 = !DILocation(line: 69, column: 18, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !3, line: 68, column: 5)
!121 = !DILocation(line: 69, column: 16, scope: !120)
!122 = !DILocation(line: 71, column: 12, scope: !123)
!123 = distinct !DILexicalBlock(scope: !120, file: !3, line: 71, column: 12)
!124 = !DILocation(line: 71, column: 21, scope: !123)
!125 = !DILocation(line: 71, column: 12, scope: !120)
!126 = !DILocation(line: 74, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !3, line: 72, column: 7)
!128 = !DILocation(line: 77, column: 9, scope: !127)
!129 = !DILocation(line: 80, column: 11, scope: !130)
!130 = distinct !DILexicalBlock(scope: !120, file: !3, line: 80, column: 11)
!131 = !DILocation(line: 80, column: 11, scope: !120)
!132 = !DILocation(line: 81, column: 63, scope: !130)
!133 = !DILocation(line: 81, column: 9, scope: !130)
!134 = !DILocation(line: 83, column: 5, scope: !120)
!135 = !DILocation(line: 86, column: 58, scope: !136)
!136 = distinct !DILexicalBlock(scope: !116, file: !3, line: 85, column: 5)
!137 = !DILocation(line: 86, column: 7, scope: !136)
!138 = !DILocation(line: 90, column: 16, scope: !108)
!139 = !DILocation(line: 90, column: 14, scope: !108)
!140 = !DILocation(line: 93, column: 9, scope: !141)
!141 = distinct !DILexicalBlock(scope: !108, file: !3, line: 93, column: 9)
!142 = !DILocation(line: 93, column: 9, scope: !108)
!143 = !DILocation(line: 94, column: 61, scope: !141)
!144 = !DILocation(line: 94, column: 7, scope: !141)
!145 = !DILocation(line: 97, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !108, file: !3, line: 97, column: 9)
!147 = !DILocation(line: 97, column: 18, scope: !146)
!148 = !DILocation(line: 97, column: 9, scope: !108)
!149 = !DILocation(line: 100, column: 7, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !3, line: 98, column: 5)
!151 = !DILocation(line: 103, column: 7, scope: !150)
!152 = !DILocation(line: 110, column: 19, scope: !108)
!153 = distinct !{!153, !105, !154}
!154 = !DILocation(line: 111, column: 3, scope: !97)
!155 = !DILocation(line: 113, column: 17, scope: !97)
!156 = !DILocation(line: 113, column: 15, scope: !97)
!157 = !DILocation(line: 114, column: 55, scope: !97)
