; ModuleID = 'implicit.c'
source_filename = "implicit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }
%struct.list_elem = type { %struct.arc*, %struct.list_elem* }

@.str = private unnamed_addr constant [31 x i8] c"network %s: not enough memory\0A\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "implicit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !47, !48, !36, !14, !5, !50, !57, !15, !58}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 138, baseType: !8)
!7 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 168, size: 576, elements: !10)
!10 = !{!11, !13, !20, !40, !41, !43, !44, !45, !46}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !7, line: 170, baseType: !12, size: 32)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !9, file: !7, line: 171, baseType: !14, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !7, line: 98, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 27, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !18, line: 44, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!19 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !9, file: !7, line: 172, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 135, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 149, size: 832, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !37, !38, !39}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !23, file: !7, line: 151, baseType: !14, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !23, file: !7, line: 152, baseType: !12, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !23, file: !7, line: 153, baseType: !21, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !23, file: !7, line: 154, baseType: !21, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !23, file: !7, line: 155, baseType: !21, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !23, file: !7, line: 156, baseType: !21, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !23, file: !7, line: 157, baseType: !6, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !23, file: !7, line: 158, baseType: !6, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !23, file: !7, line: 158, baseType: !6, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !23, file: !7, line: 159, baseType: !6, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !23, file: !7, line: 160, baseType: !36, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !7, line: 97, baseType: !15)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !23, file: !7, line: 161, baseType: !15, size: 64, offset: 704)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !23, file: !7, line: 162, baseType: !12, size: 32, offset: 768)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !23, file: !7, line: 163, baseType: !12, size: 32, offset: 800)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !9, file: !7, line: 172, baseType: !21, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !9, file: !7, line: 173, baseType: !42, size: 16, offset: 256)
!42 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !9, file: !7, line: 174, baseType: !6, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !9, file: !7, line: 174, baseType: !6, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !9, file: !7, line: 175, baseType: !36, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !9, file: !7, line: 176, baseType: !14, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 137, baseType: !9)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_elem", file: !7, line: 212, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_elem", file: !7, line: 208, size: 128, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "arc", scope: !52, file: !7, line: 210, baseType: !48, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !7, line: 211, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!12, !61, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!63 = !{i32 7, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 4}
!66 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!67 = distinct !DISubprogram(name: "refreshArcPointers", scope: !1, file: !1, line: 48, type: !68, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!68 = !DISubroutineType(types: !69)
!69 = !{!15, !70, !112, !48}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !7, line: 206, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !7, line: 181, size: 5184, elements: !73)
!73 = !{!74, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !72, file: !7, line: 183, baseType: !75, size: 1600)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1600, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !{!78}
!78 = !DISubrange(count: 200)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !72, file: !7, line: 184, baseType: !75, size: 1600, offset: 1600)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !72, file: !7, line: 185, baseType: !15, size: 64, offset: 3200)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !72, file: !7, line: 185, baseType: !15, size: 64, offset: 3264)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !72, file: !7, line: 186, baseType: !15, size: 64, offset: 3328)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !72, file: !7, line: 186, baseType: !15, size: 64, offset: 3392)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !72, file: !7, line: 186, baseType: !15, size: 64, offset: 3456)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !72, file: !7, line: 186, baseType: !15, size: 64, offset: 3520)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !72, file: !7, line: 187, baseType: !15, size: 64, offset: 3584)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !72, file: !7, line: 187, baseType: !15, size: 64, offset: 3648)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !72, file: !7, line: 189, baseType: !15, size: 64, offset: 3712)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !72, file: !7, line: 190, baseType: !15, size: 64, offset: 3776)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !72, file: !7, line: 191, baseType: !15, size: 64, offset: 3840)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !72, file: !7, line: 192, baseType: !15, size: 64, offset: 3904)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !72, file: !7, line: 193, baseType: !15, size: 64, offset: 3968)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !72, file: !7, line: 194, baseType: !15, size: 64, offset: 4032)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !72, file: !7, line: 195, baseType: !15, size: 64, offset: 4096)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !72, file: !7, line: 196, baseType: !15, size: 64, offset: 4160)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !72, file: !7, line: 197, baseType: !15, size: 64, offset: 4224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !72, file: !7, line: 198, baseType: !98, size: 64, offset: 4288)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !72, file: !7, line: 199, baseType: !14, size: 64, offset: 4352)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !72, file: !7, line: 200, baseType: !21, size: 64, offset: 4416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !72, file: !7, line: 200, baseType: !21, size: 64, offset: 4480)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !72, file: !7, line: 201, baseType: !6, size: 64, offset: 4544)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !72, file: !7, line: 201, baseType: !6, size: 64, offset: 4608)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !72, file: !7, line: 201, baseType: !6, size: 64, offset: 4672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !72, file: !7, line: 202, baseType: !6, size: 64, offset: 4736)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !72, file: !7, line: 202, baseType: !6, size: 64, offset: 4800)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !72, file: !7, line: 203, baseType: !15, size: 64, offset: 4864)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !72, file: !7, line: 204, baseType: !15, size: 64, offset: 4928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !72, file: !7, line: 205, baseType: !15, size: 64, offset: 4992)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !72, file: !7, line: 205, baseType: !15, size: 64, offset: 5056)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !72, file: !7, line: 205, baseType: !15, size: 64, offset: 5120)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!15, !70, !15}
!115 = !DILocalVariable(name: "net", arg: 1, scope: !67, file: !1, line: 48, type: !70)
!116 = !DILocation(line: 48, column: 36, scope: !67)
!117 = !DILocalVariable(name: "getPos", arg: 2, scope: !67, file: !1, line: 48, type: !112)
!118 = !DILocation(line: 48, column: 48, scope: !67)
!119 = !DILocalVariable(name: "sorted_array", arg: 3, scope: !67, file: !1, line: 48, type: !48)
!120 = !DILocation(line: 48, column: 83, scope: !67)
!121 = !DILocalVariable(name: "node", scope: !67, file: !1, line: 56, type: !21)
!122 = !DILocation(line: 56, column: 10, scope: !67)
!123 = !DILocalVariable(name: "i", scope: !67, file: !1, line: 57, type: !15)
!124 = !DILocation(line: 57, column: 8, scope: !67)
!125 = !DILocation(line: 62, column: 12, scope: !126)
!126 = distinct !DILexicalBlock(scope: !67, file: !1, line: 62, column: 5)
!127 = !DILocation(line: 62, column: 10, scope: !126)
!128 = !DILocation(line: 62, column: 17, scope: !129)
!129 = distinct !DILexicalBlock(scope: !126, file: !1, line: 62, column: 5)
!130 = !DILocation(line: 62, column: 22, scope: !129)
!131 = !DILocation(line: 62, column: 27, scope: !129)
!132 = !DILocation(line: 62, column: 19, scope: !129)
!133 = !DILocation(line: 62, column: 5, scope: !126)
!134 = !DILocation(line: 63, column: 14, scope: !135)
!135 = distinct !DILexicalBlock(scope: !129, file: !1, line: 62, column: 35)
!136 = !DILocation(line: 63, column: 19, scope: !135)
!137 = !DILocation(line: 63, column: 27, scope: !135)
!138 = !DILocation(line: 63, column: 25, scope: !135)
!139 = !DILocation(line: 63, column: 12, scope: !135)
!140 = !DILocation(line: 64, column: 11, scope: !141)
!141 = distinct !DILexicalBlock(scope: !135, file: !1, line: 64, column: 11)
!142 = !DILocation(line: 64, column: 17, scope: !141)
!143 = !DILocation(line: 64, column: 27, scope: !141)
!144 = !DILocation(line: 64, column: 30, scope: !141)
!145 = !DILocation(line: 64, column: 36, scope: !141)
!146 = !DILocation(line: 64, column: 47, scope: !141)
!147 = !DILocation(line: 64, column: 50, scope: !141)
!148 = !DILocation(line: 64, column: 11, scope: !135)
!149 = !DILocation(line: 65, column: 30, scope: !141)
!150 = !DILocation(line: 65, column: 43, scope: !141)
!151 = !DILocation(line: 65, column: 50, scope: !141)
!152 = !DILocation(line: 65, column: 55, scope: !141)
!153 = !DILocation(line: 65, column: 61, scope: !141)
!154 = !DILocation(line: 65, column: 72, scope: !141)
!155 = !DILocation(line: 65, column: 11, scope: !141)
!156 = !DILocation(line: 65, column: 17, scope: !141)
!157 = !DILocation(line: 65, column: 27, scope: !141)
!158 = !DILocation(line: 66, column: 11, scope: !159)
!159 = distinct !DILexicalBlock(scope: !135, file: !1, line: 66, column: 11)
!160 = !DILocation(line: 66, column: 17, scope: !159)
!161 = !DILocation(line: 66, column: 25, scope: !159)
!162 = !DILocation(line: 66, column: 28, scope: !159)
!163 = !DILocation(line: 66, column: 34, scope: !159)
!164 = !DILocation(line: 66, column: 43, scope: !159)
!165 = !DILocation(line: 66, column: 46, scope: !159)
!166 = !DILocation(line: 66, column: 11, scope: !135)
!167 = !DILocation(line: 67, column: 28, scope: !159)
!168 = !DILocation(line: 67, column: 41, scope: !159)
!169 = !DILocation(line: 67, column: 48, scope: !159)
!170 = !DILocation(line: 67, column: 53, scope: !159)
!171 = !DILocation(line: 67, column: 59, scope: !159)
!172 = !DILocation(line: 67, column: 68, scope: !159)
!173 = !DILocation(line: 67, column: 11, scope: !159)
!174 = !DILocation(line: 67, column: 17, scope: !159)
!175 = !DILocation(line: 67, column: 25, scope: !159)
!176 = !DILocation(line: 68, column: 11, scope: !177)
!177 = distinct !DILexicalBlock(scope: !135, file: !1, line: 68, column: 11)
!178 = !DILocation(line: 68, column: 17, scope: !177)
