; ModuleID = 'treeup.c'
source_filename = "treeup.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }

; Function Attrs: noinline nounwind uwtable
define dso_local void @update_tree(i64 %cycle_ori, i64 %new_orientation, i64 %delta, i64 %new_flow, %struct.node* %iplus, %struct.node* %jplus, %struct.node* %iminus, %struct.node* %jminus, %struct.node* %w, %struct.arc* %bea, i64 %sigma, i64 %feas_tol) #0 !dbg !7 {
entry:
  %cycle_ori.addr = alloca i64, align 8
  %new_orientation.addr = alloca i64, align 8
  %delta.addr = alloca i64, align 8
  %new_flow.addr = alloca i64, align 8
  %iplus.addr = alloca %struct.node*, align 8
  %jplus.addr = alloca %struct.node*, align 8
  %iminus.addr = alloca %struct.node*, align 8
  %jminus.addr = alloca %struct.node*, align 8
  %w.addr = alloca %struct.node*, align 8
  %bea.addr = alloca %struct.arc*, align 8
  %sigma.addr = alloca i64, align 8
  %feas_tol.addr = alloca i64, align 8
  %basic_arc_temp = alloca %struct.arc*, align 8
  %new_basic_arc = alloca %struct.arc*, align 8
  %father = alloca %struct.node*, align 8
  %temp = alloca %struct.node*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "treeup.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!7 = distinct !DISubprogram(name: "update_tree", scope: !1, file: !1, line: 30, type: !8, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !15, !15, !17, !17, !17, !17, !17, !53, !22, !15}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !13, line: 44, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!14 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !16, line: 97, baseType: !10)
!16 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !16, line: 134, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !16, line: 149, size: 832, elements: !20)
!20 = !{!21, !23, !25, !28, !29, !30, !31, !46, !47, !48, !49, !50, !51, !52}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !19, file: !16, line: 151, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !16, line: 98, baseType: !10)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !19, file: !16, line: 152, baseType: !24, size: 32, offset: 64)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !19, file: !16, line: 153, baseType: !26, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !16, line: 135, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !19, file: !16, line: 154, baseType: !26, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !19, file: !16, line: 155, baseType: !26, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !19, file: !16, line: 156, baseType: !26, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !19, file: !16, line: 157, baseType: !32, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !16, line: 138, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !16, line: 168, size: 576, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !42, !43, !44, !45}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !34, file: !16, line: 170, baseType: !24, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !34, file: !16, line: 171, baseType: !22, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !34, file: !16, line: 172, baseType: !26, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !34, file: !16, line: 172, baseType: !26, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !34, file: !16, line: 173, baseType: !41, size: 16, offset: 256)
!41 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !34, file: !16, line: 174, baseType: !32, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !34, file: !16, line: 174, baseType: !32, size: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !34, file: !16, line: 175, baseType: !15, size: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !34, file: !16, line: 176, baseType: !22, size: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !19, file: !16, line: 158, baseType: !32, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !19, file: !16, line: 158, baseType: !32, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !19, file: !16, line: 159, baseType: !32, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !19, file: !16, line: 160, baseType: !15, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !19, file: !16, line: 161, baseType: !10, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !19, file: !16, line: 162, baseType: !24, size: 32, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !19, file: !16, line: 163, baseType: !24, size: 32, offset: 800)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !16, line: 137, baseType: !34)
!55 = !DILocalVariable(name: "cycle_ori", arg: 1, scope: !7, file: !1, line: 31, type: !10)
!56 = !DILocation(line: 31, column: 23, scope: !7)
!57 = !DILocalVariable(name: "new_orientation", arg: 2, scope: !7, file: !1, line: 32, type: !10)
!58 = !DILocation(line: 32, column: 23, scope: !7)
!59 = !DILocalVariable(name: "delta", arg: 3, scope: !7, file: !1, line: 33, type: !15)
!60 = !DILocation(line: 33, column: 25, scope: !7)
!61 = !DILocalVariable(name: "new_flow", arg: 4, scope: !7, file: !1, line: 34, type: !15)
!62 = !DILocation(line: 34, column: 25, scope: !7)
!63 = !DILocalVariable(name: "iplus", arg: 5, scope: !7, file: !1, line: 35, type: !17)
!64 = !DILocation(line: 35, column: 26, scope: !7)
!65 = !DILocalVariable(name: "jplus", arg: 6, scope: !7, file: !1, line: 36, type: !17)
!66 = !DILocation(line: 36, column: 26, scope: !7)
!67 = !DILocalVariable(name: "iminus", arg: 7, scope: !7, file: !1, line: 37, type: !17)
!68 = !DILocation(line: 37, column: 26, scope: !7)
!69 = !DILocalVariable(name: "jminus", arg: 8, scope: !7, file: !1, line: 38, type: !17)
!70 = !DILocation(line: 38, column: 26, scope: !7)
!71 = !DILocalVariable(name: "w", arg: 9, scope: !7, file: !1, line: 39, type: !17)
!72 = !DILocation(line: 39, column: 26, scope: !7)
!73 = !DILocalVariable(name: "bea", arg: 10, scope: !7, file: !1, line: 40, type: !53)
!74 = !DILocation(line: 40, column: 25, scope: !7)
!75 = !DILocalVariable(name: "sigma", arg: 11, scope: !7, file: !1, line: 41, type: !22)
!76 = !DILocation(line: 41, column: 25, scope: !7)
!77 = !DILocalVariable(name: "feas_tol", arg: 12, scope: !7, file: !1, line: 42, type: !15)
!78 = !DILocation(line: 42, column: 25, scope: !7)
!79 = !DILocalVariable(name: "basic_arc_temp", scope: !7, file: !1, line: 59, type: !53)
!80 = !DILocation(line: 59, column: 15, scope: !7)
!81 = !DILocalVariable(name: "new_basic_arc", scope: !7, file: !1, line: 60, type: !53)
!82 = !DILocation(line: 60, column: 15, scope: !7)
!83 = !DILocalVariable(name: "father", scope: !7, file: !1, line: 61, type: !17)
!84 = !DILocation(line: 61, column: 15, scope: !7)
!85 = !DILocalVariable(name: "temp", scope: !7, file: !1, line: 62, type: !17)
!86 = !DILocation(line: 62, column: 15, scope: !7)
!87 = !DILocalVariable(name: "new_pred", scope: !7, file: !1, line: 63, type: !17)
!88 = !DILocation(line: 63, column: 15, scope: !7)
!89 = !DILocalVariable(name: "orientation_temp", scope: !7, file: !1, line: 64, type: !10)
!90 = !DILocation(line: 64, column: 14, scope: !7)
!91 = !DILocalVariable(name: "depth_temp", scope: !7, file: !1, line: 65, type: !10)
!92 = !DILocation(line: 65, column: 14, scope: !7)
!93 = !DILocalVariable(name: "depth_iminus", scope: !7, file: !1, line: 66, type: !10)
!94 = !DILocation(line: 66, column: 14, scope: !7)
!95 = !DILocalVariable(name: "new_depth", scope: !7, file: !1, line: 67, type: !10)
!96 = !DILocation(line: 67, column: 14, scope: !7)
!97 = !DILocalVariable(name: "flow_temp", scope: !7, file: !1, line: 68, type: !15)
!98 = !DILocation(line: 68, column: 14, scope: !7)
!99 = !DILocation(line: 72, column: 10, scope: !100)
!100 = distinct !DILexicalBlock(scope: !7, file: !1, line: 72, column: 9)
!101 = !DILocation(line: 72, column: 15, scope: !100)
!102 = !DILocation(line: 72, column: 23, scope: !100)
!103 = !DILocation(line: 72, column: 20, scope: !100)
!104 = !DILocation(line: 72, column: 29, scope: !100)
!105 = !DILocation(line: 72, column: 32, scope: !100)
!106 = !DILocation(line: 72, column: 38, scope: !100)
!107 = !DILocation(line: 72, column: 43, scope: !100)
!108 = !DILocation(line: 73, column: 10, scope: !100)
!109 = !DILocation(line: 73, column: 15, scope: !100)
!110 = !DILocation(line: 73, column: 23, scope: !100)
