; ModuleID = 'mcfutil.c'
source_filename = "mcfutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i32, i64, %struct.node*, %struct.node*, i16, %struct.arc*, %struct.arc*, i64, i64 }

@old_group = internal global i64 0, align 8, !dbg !0
@old_Arc = internal global i64 0, align 8, !dbg !54
@.str = private unnamed_addr constant [13 x i8] c"ORG_COST: %f\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"PRIMAL NETWORK SIMPLEX: \00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"artificial arc with nonzero flow, node %d (%ld)\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "old_group", scope: !2, file: !3, line: 121, type: !14, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !53, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "mcfutil.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !50, !41, !52, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !9, line: 134, baseType: !10)
!9 = !DIFile(filename: "./defines.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/505.mcf_r/build/build_base_ld-loop-ext-m64.0000")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !9, line: 149, size: 832, elements: !11)
!11 = !{!12, !19, !21, !24, !25, !26, !27, !43, !44, !45, !46, !47, !48, !49}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !10, file: !9, line: 151, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !9, line: 98, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 27, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !17, line: 44, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!18 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !10, file: !9, line: 152, baseType: !20, size: 32, offset: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !10, file: !9, line: 153, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !9, line: 135, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !10, file: !9, line: 154, baseType: !22, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !10, file: !9, line: 155, baseType: !22, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !10, file: !9, line: 156, baseType: !22, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !10, file: !9, line: 157, baseType: !28, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !9, line: 138, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !9, line: 168, size: 576, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !38, !39, !40, !42}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !30, file: !9, line: 170, baseType: !20, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !30, file: !9, line: 171, baseType: !13, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !30, file: !9, line: 172, baseType: !22, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !30, file: !9, line: 172, baseType: !22, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !30, file: !9, line: 173, baseType: !37, size: 16, offset: 256)
!37 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !30, file: !9, line: 174, baseType: !28, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !30, file: !9, line: 174, baseType: !28, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !30, file: !9, line: 175, baseType: !41, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !9, line: 97, baseType: !14)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !30, file: !9, line: 176, baseType: !13, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !10, file: !9, line: 158, baseType: !28, size: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !10, file: !9, line: 158, baseType: !28, size: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !10, file: !9, line: 159, baseType: !28, size: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !10, file: !9, line: 160, baseType: !41, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !10, file: !9, line: 161, baseType: !14, size: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !10, file: !9, line: 162, baseType: !20, size: 32, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !10, file: !9, line: 163, baseType: !20, size: 32, offset: 800)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !9, line: 137, baseType: !30)
!52 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!53 = !{!0, !54}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "old_Arc", scope: !2, file: !3, line: 122, type: !14, isLocal: true, isDefinition: true)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!60 = distinct !DISubprogram(name: "refresh_neighbour_lists", scope: !3, file: !3, line: 27, type: !61, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !104}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !9, line: 206, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !9, line: 181, size: 5184, elements: !66)
!66 = !{!67, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !65, file: !9, line: 183, baseType: !68, size: 1600)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1600, elements: !70)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !{!71}
!71 = !DISubrange(count: 200)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !65, file: !9, line: 184, baseType: !68, size: 1600, offset: 1600)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !65, file: !9, line: 185, baseType: !14, size: 64, offset: 3200)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !65, file: !9, line: 185, baseType: !14, size: 64, offset: 3264)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !65, file: !9, line: 186, baseType: !14, size: 64, offset: 3328)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !65, file: !9, line: 186, baseType: !14, size: 64, offset: 3392)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !65, file: !9, line: 186, baseType: !14, size: 64, offset: 3456)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !65, file: !9, line: 186, baseType: !14, size: 64, offset: 3520)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !65, file: !9, line: 187, baseType: !14, size: 64, offset: 3584)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !65, file: !9, line: 187, baseType: !14, size: 64, offset: 3648)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !65, file: !9, line: 189, baseType: !14, size: 64, offset: 3712)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !65, file: !9, line: 190, baseType: !14, size: 64, offset: 3776)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !65, file: !9, line: 191, baseType: !14, size: 64, offset: 3840)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !65, file: !9, line: 192, baseType: !14, size: 64, offset: 3904)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !65, file: !9, line: 193, baseType: !14, size: 64, offset: 3968)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !65, file: !9, line: 194, baseType: !14, size: 64, offset: 4032)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !65, file: !9, line: 195, baseType: !14, size: 64, offset: 4096)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !65, file: !9, line: 196, baseType: !14, size: 64, offset: 4160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !65, file: !9, line: 197, baseType: !14, size: 64, offset: 4224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !65, file: !9, line: 198, baseType: !52, size: 64, offset: 4288)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !65, file: !9, line: 199, baseType: !13, size: 64, offset: 4352)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !65, file: !9, line: 200, baseType: !22, size: 64, offset: 4416)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !65, file: !9, line: 200, baseType: !22, size: 64, offset: 4480)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !65, file: !9, line: 201, baseType: !28, size: 64, offset: 4544)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !65, file: !9, line: 201, baseType: !28, size: 64, offset: 4608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sorted_arcs", scope: !65, file: !9, line: 201, baseType: !28, size: 64, offset: 4672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !65, file: !9, line: 202, baseType: !28, size: 64, offset: 4736)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !65, file: !9, line: 202, baseType: !28, size: 64, offset: 4800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !65, file: !9, line: 203, baseType: !14, size: 64, offset: 4864)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !65, file: !9, line: 204, baseType: !14, size: 64, offset: 4928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nr_group", scope: !65, file: !9, line: 205, baseType: !14, size: 64, offset: 4992)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "full_groups", scope: !65, file: !9, line: 205, baseType: !14, size: 64, offset: 5056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !65, file: !9, line: 205, baseType: !14, size: 64, offset: 5120)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!14, !63, !14}
!107 = !DILocalVariable(name: "net", arg: 1, scope: !60, file: !3, line: 27, type: !63)
!108 = !DILocation(line: 27, column: 42, scope: !60)
!109 = !DILocalVariable(name: "getPos", arg: 2, scope: !60, file: !3, line: 27, type: !104)
!110 = !DILocation(line: 27, column: 54, scope: !60)
!111 = !DILocalVariable(name: "node", scope: !60, file: !3, line: 33, type: !7)
!112 = !DILocation(line: 33, column: 13, scope: !60)
!113 = !DILocalVariable(name: "arc", scope: !60, file: !3, line: 34, type: !50)
!114 = !DILocation(line: 34, column: 12, scope: !60)
!115 = !DILocalVariable(name: "stop", scope: !60, file: !3, line: 35, type: !6)
!116 = !DILocation(line: 35, column: 11, scope: !60)
!117 = !DILocalVariable(name: "i", scope: !60, file: !3, line: 36, type: !20)
!118 = !DILocation(line: 36, column: 9, scope: !60)
!119 = !DILocation(line: 39, column: 12, scope: !60)
!120 = !DILocation(line: 39, column: 17, scope: !60)
!121 = !DILocation(line: 39, column: 10, scope: !60)
!122 = !DILocation(line: 40, column: 25, scope: !123)
!123 = distinct !DILexicalBlock(scope: !60, file: !3, line: 40, column: 5)
!124 = !DILocation(line: 40, column: 30, scope: !123)
!125 = !DILocation(line: 40, column: 17, scope: !123)
!126 = !DILocation(line: 40, column: 15, scope: !123)
!127 = !DILocation(line: 40, column: 10, scope: !123)
!128 = !DILocation(line: 40, column: 42, scope: !129)
!129 = distinct !DILexicalBlock(scope: !123, file: !3, line: 40, column: 5)
!130 = !DILocation(line: 40, column: 59, scope: !129)
!131 = !DILocation(line: 40, column: 49, scope: !129)
!132 = !DILocation(line: 40, column: 47, scope: !129)
!133 = !DILocation(line: 40, column: 5, scope: !123)
!134 = !DILocation(line: 42, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !129, file: !3, line: 41, column: 5)
!136 = !DILocation(line: 42, column: 15, scope: !135)
!137 = !DILocation(line: 42, column: 23, scope: !135)
!138 = !DILocation(line: 43, column: 9, scope: !135)
!139 = !DILocation(line: 43, column: 15, scope: !135)
!140 = !DILocation(line: 43, column: 24, scope: !135)
!141 = !DILocation(line: 44, column: 5, scope: !135)
!142 = !DILocation(line: 40, column: 69, scope: !129)
!143 = !DILocation(line: 40, column: 5, scope: !129)
!144 = distinct !{!144, !133, !145}
!145 = !DILocation(line: 44, column: 5, scope: !123)
!146 = !DILocation(line: 47, column: 11, scope: !60)
!147 = !DILocation(line: 47, column: 16, scope: !60)
!148 = !DILocation(line: 47, column: 9, scope: !60)
!149 = !DILocation(line: 48, column: 12, scope: !150)
!150 = distinct !DILexicalBlock(scope: !60, file: !3, line: 48, column: 5)
!151 = !DILocation(line: 48, column: 10, scope: !150)
!152 = !DILocation(line: 48, column: 17, scope: !153)
!153 = distinct !DILexicalBlock(scope: !150, file: !3, line: 48, column: 5)
!154 = !DILocation(line: 48, column: 21, scope: !153)
!155 = !DILocation(line: 48, column: 26, scope: !153)
!156 = !DILocation(line: 48, column: 19, scope: !153)
!157 = !DILocation(line: 48, column: 5, scope: !150)
!158 = !DILocation(line: 50, column: 24, scope: !159)
!159 = distinct !DILexicalBlock(scope: !153, file: !3, line: 49, column: 5)
!160 = !DILocation(line: 50, column: 29, scope: !159)
!161 = !DILocation(line: 50, column: 35, scope: !159)
!162 = !DILocation(line: 50, column: 9, scope: !159)
!163 = !DILocation(line: 50, column: 14, scope: !159)
!164 = !DILocation(line: 50, column: 22, scope: !159)
!165 = !DILocation(line: 51, column: 31, scope: !159)
!166 = !DILocation(line: 51, column: 9, scope: !159)
!167 = !DILocation(line: 51, column: 14, scope: !159)
!168 = !DILocation(line: 51, column: 20, scope: !159)
!169 = !DILocation(line: 51, column: 29, scope: !159)
!170 = !DILocation(line: 52, column: 23, scope: !159)
