; ModuleID = 'Patch.C'
source_filename = "Patch.C"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%class.Patch = type <{ i32, [4 x i8], %struct.CompAtom*, %struct.CompAtomExt*, %class.Vector*, %class.Vector*, %class.Vector*, i32, [4 x i8] }>
%struct.CompAtom = type { %class.Vector, float, i16, i8, i8 }
%class.Vector = type { double, double, double }
%struct.CompAtomExt = type { i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%class.Molecule = type { %class.ObjectArena*, %class.ExclusionCheck*, i32**, i32**, i32, i32, i32* }
%class.ObjectArena = type opaque
%class.ExclusionCheck = type { i32, i32, i8* }

$_ZN6VectoraSERKd = comdat any

$_ZN8CompAtomC2Ev = comdat any

$_ZN6VectorC2Ev = comdat any

$_ZNK8Molecule11atomvdwtypeEi = comdat any

@.str = private unnamed_addr constant [13 x i8] c"PATCH_BEGIN\0A\00", align 1
@.str.1 = private unnamed_addr constant [21 x i8] c"Missing PATCH_BEGIN\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"numAtoms read error\0A\00", align 1

!369 = !DISubprogram(name: "exception_ptr", scope: !363, file: !364, line: 84, type: !370, scopeLine: 84, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372, !368}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!373 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !363, file: !364, line: 86, type: !374, scopeLine: 86, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !372}
!376 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !363, file: !364, line: 87, type: !374, scopeLine: 87, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !363, file: !364, line: 89, type: !378, scopeLine: 89, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!368, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!382 = !DISubprogram(name: "exception_ptr", scope: !363, file: !364, line: 97, type: !374, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!383 = !DISubprogram(name: "exception_ptr", scope: !363, file: !364, line: 99, type: !384, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !372, !386}
!386 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !381, size: 64)
!387 = !DISubprogram(name: "exception_ptr", scope: !363, file: !364, line: 102, type: !388, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !372, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !5, file: !391, line: 264, baseType: !392)
!391 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h", directory: "")
!392 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!393 = !DISubprogram(name: "exception_ptr", scope: !363, file: !364, line: 106, type: !394, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !372, !396}
!396 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !363, size: 64)
!397 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !363, file: !364, line: 119, type: !398, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!400, !372, !386}
!400 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !363, size: 64)
!401 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !363, file: !364, line: 123, type: !402, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!400, !372, !396}
!404 = !DISubprogram(name: "~exception_ptr", scope: !363, file: !364, line: 130, type: !374, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !363, file: !364, line: 133, type: !406, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !372, !400}
!408 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !363, file: !364, line: 145, type: !409, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !380}
!411 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!412 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !363, file: !364, line: 154, type: !413, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !380}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !5, file: !418, line: 88, flags: DIFlagFwdDecl)
!418 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/typeinfo", directory: "")
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !365, entity: !420, file: !364, line: 74)
!420 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !5, file: !364, line: 70, type: !421, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !363}
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !424, file: !426, line: 127)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !7, line: 62, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!426 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !428, file: !426, line: 128)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !7, line: 70, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !430, identifier: "_ZTS6ldiv_t")
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !429, file: !7, line: 68, baseType: !235, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !429, file: !7, line: 69, baseType: !235, size: 64, offset: 64)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !434, file: !426, line: 130)
!434 = !DISubprogram(name: "abort", scope: !7, file: !7, line: 591, type: !435, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{null}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !438, file: !426, line: 134)
!438 = !DISubprogram(name: "atexit", scope: !7, file: !7, line: 595, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!10, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !443, file: !426, line: 137)
!443 = !DISubprogram(name: "at_quick_exit", scope: !7, file: !7, line: 600, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !445, file: !426, line: 140)
!445 = !DISubprogram(name: "atof", scope: !7, file: !7, line: 101, type: !252, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !447, file: !426, line: 141)
!447 = !DISubprogram(name: "atoi", scope: !7, file: !7, line: 104, type: !448, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!10, !254}
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !451, file: !426, line: 142)
!451 = !DISubprogram(name: "atol", scope: !7, file: !7, line: 107, type: !452, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DISubroutineType(types: !453)
!453 = !{!235, !254}
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !455, file: !426, line: 143)
!455 = !DISubprogram(name: "bsearch", scope: !7, file: !7, line: 820, type: !456, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{!368, !458, !458, !460, !460, !463}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!462 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !7, line: 808, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!10, !458, !458}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !468, file: !426, line: 144)
!468 = !DISubprogram(name: "calloc", scope: !7, file: !7, line: 542, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!368, !460, !460}
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !472, file: !426, line: 145)
!472 = !DISubprogram(name: "div", scope: !7, file: !7, line: 852, type: !473, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!424, !10, !10}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !476, file: !426, line: 146)
!476 = !DISubprogram(name: "exit", scope: !7, file: !7, line: 617, type: !477, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !10}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !480, file: !426, line: 147)
!480 = !DISubprogram(name: "free", scope: !7, file: !7, line: 565, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !368}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !484, file: !426, line: 148)
!484 = !DISubprogram(name: "getenv", scope: !7, file: !7, line: 634, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !254}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !489, file: !426, line: 149)
!489 = !DISubprogram(name: "labs", scope: !7, file: !7, line: 841, type: !490, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DISubroutineType(types: !491)
!491 = !{!235, !235}
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !493, file: !426, line: 150)
!493 = !DISubprogram(name: "ldiv", scope: !7, file: !7, line: 854, type: !494, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{!428, !235, !235}
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !497, file: !426, line: 151)
!497 = !DISubprogram(name: "malloc", scope: !7, file: !7, line: 539, type: !498, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DISubroutineType(types: !499)
!499 = !{!368, !460}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !501, file: !426, line: 153)
!501 = !DISubprogram(name: "mblen", scope: !7, file: !7, line: 922, type: !502, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!10, !254, !460}
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !505, file: !426, line: 154)
!505 = !DISubprogram(name: "mbstowcs", scope: !7, file: !7, line: 933, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!460, !508, !511, !460}
!508 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!511 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !254)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !513, file: !426, line: 155)
!513 = !DISubprogram(name: "mbtowc", scope: !7, file: !7, line: 925, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!10, !508, !511, !460}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !517, file: !426, line: 157)
!517 = !DISubprogram(name: "qsort", scope: !7, file: !7, line: 830, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !368, !460, !460, !463}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !521, file: !426, line: 160)
!521 = !DISubprogram(name: "quick_exit", scope: !7, file: !7, line: 623, type: !477, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !523, file: !426, line: 163)
!523 = !DISubprogram(name: "rand", scope: !7, file: !7, line: 453, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{!10}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !527, file: !426, line: 164)
!527 = !DISubprogram(name: "realloc", scope: !7, file: !7, line: 550, type: !528, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DISubroutineType(types: !529)
!529 = !{!368, !368, !460}
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !531, file: !426, line: 165)
!531 = !DISubprogram(name: "srand", scope: !7, file: !7, line: 455, type: !532, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !534}
!534 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !536, file: !426, line: 166)
!536 = !DISubprogram(name: "strtod", scope: !7, file: !7, line: 117, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!17, !511, !539}
!539 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !542, file: !426, line: 167)
!542 = !DISubprogram(name: "strtol", scope: !7, file: !7, line: 176, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!235, !511, !539, !10}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !546, file: !426, line: 168)
!546 = !DISubprogram(name: "strtoul", scope: !7, file: !7, line: 180, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!462, !511, !539, !10}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !550, file: !426, line: 169)
!550 = !DISubprogram(name: "system", scope: !7, file: !7, line: 784, type: !448, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !552, file: !426, line: 171)
!552 = !DISubprogram(name: "wcstombs", scope: !7, file: !7, line: 936, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!460, !555, !556, !460}
!555 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !487)
!556 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !560, file: !426, line: 172)
!560 = !DISubprogram(name: "wctomb", scope: !7, file: !7, line: 929, type: !561, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!10, !487, !510}
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !565, file: !426, line: 200)
!564 = !DINamespace(name: "__gnu_cxx", scope: null)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !7, line: 80, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !567, identifier: "_ZTS7lldiv_t")
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !566, file: !7, line: 78, baseType: !198, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !566, file: !7, line: 79, baseType: !198, size: 64, offset: 64)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !571, file: !426, line: 206)
!571 = !DISubprogram(name: "_Exit", scope: !7, file: !7, line: 629, type: !477, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !573, file: !426, line: 210)
!573 = !DISubprogram(name: "llabs", scope: !7, file: !7, line: 844, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!198, !198}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !577, file: !426, line: 216)
!577 = !DISubprogram(name: "lldiv", scope: !7, file: !7, line: 858, type: !578, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!565, !198, !198}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !581, file: !426, line: 227)
!581 = !DISubprogram(name: "atoll", scope: !7, file: !7, line: 112, type: !582, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DISubroutineType(types: !583)
!583 = !{!198, !254}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !585, file: !426, line: 228)
!585 = !DISubprogram(name: "strtoll", scope: !7, file: !7, line: 200, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!198, !511, !539, !10}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !589, file: !426, line: 229)
!589 = !DISubprogram(name: "strtoull", scope: !7, file: !7, line: 205, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!592, !511, !539, !10}
!592 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !594, file: !426, line: 231)
!594 = !DISubprogram(name: "strtof", scope: !7, file: !7, line: 123, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!76, !511, !539}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !564, entity: !598, file: !426, line: 232)
!598 = !DISubprogram(name: "strtold", scope: !7, file: !7, line: 126, type: !599, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!87, !511, !539}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !565, file: !426, line: 240)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !571, file: !426, line: 242)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !573, file: !426, line: 244)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !605, file: !426, line: 245)
!605 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !564, file: !426, line: 213, type: !578, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !577, file: !426, line: 246)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !581, file: !426, line: 248)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !594, file: !426, line: 249)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !585, file: !426, line: 250)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !589, file: !426, line: 251)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !598, file: !426, line: 252)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !434, file: !613, line: 38)
!613 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !438, file: !613, line: 39)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !476, file: !613, line: 40)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !443, file: !613, line: 43)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !521, file: !613, line: 46)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !424, file: !613, line: 51)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !428, file: !613, line: 52)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !352, file: !613, line: 54)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !445, file: !613, line: 55)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !447, file: !613, line: 56)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !451, file: !613, line: 57)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !455, file: !613, line: 58)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !468, file: !613, line: 59)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !605, file: !613, line: 60)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !480, file: !613, line: 61)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !484, file: !613, line: 62)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !489, file: !613, line: 63)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !493, file: !613, line: 64)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !497, file: !613, line: 65)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !501, file: !613, line: 67)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !505, file: !613, line: 68)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !513, file: !613, line: 69)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !517, file: !613, line: 71)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !523, file: !613, line: 72)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !527, file: !613, line: 73)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !531, file: !613, line: 74)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !536, file: !613, line: 75)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !542, file: !613, line: 76)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !546, file: !613, line: 77)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !550, file: !613, line: 78)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !552, file: !613, line: 80)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !560, file: !613, line: 81)
!645 = !{i32 7, !"Dwarf Version", i32 4}
!646 = !{i32 2, !"Debug Info Version", i32 3}
!647 = !{i32 1, !"wchar_size", i32 4}
!648 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!649 = distinct !DISubprogram(name: "Patch", linkageName: "_ZN5PatchC2Ev", scope: !650, file: !1, line: 11, type: !754, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !761, retainedNodes: !2)
!650 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Patch", file: !651, line: 16, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !652, identifier: "_ZTS5Patch")
!651 = !DIFile(filename: "./Patch.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!652 = !{!653, !654, !741, !748, !750, !751, !752, !753, !757, !760, !761, !762, !763}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "numAtoms", scope: !650, file: !651, line: 19, baseType: !10, size: 32, flags: DIFlagPublic)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !650, file: !651, line: 21, baseType: !655, size: 64, offset: 64, flags: DIFlagPublic)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CompAtom", file: !657, line: 50, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !658, identifier: "_ZTS8CompAtom")
!657 = !DIFile(filename: "./NamdTypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!658 = !{!659, !732, !734, !736, !738, !739, !740}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !656, file: !657, line: 51, baseType: !660, size: 192)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Position", file: !657, line: 18, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector", file: !662, line: 24, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !663, identifier: "_ZTS6Vector")
!662 = !DIFile(filename: "./Vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!663 = !{!664, !667, !668, !669, !673, !676, !679, !698, !702, !708, !711, !712, !715, !716, !720, !721, !724, !725, !728}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !661, file: !662, line: 26, baseType: !665, size: 64, flags: DIFlagPublic)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "BigReal", file: !666, line: 65, baseType: !17)
!666 = !DIFile(filename: "./common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!667 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !661, file: !662, line: 26, baseType: !665, size: 64, offset: 64, flags: DIFlagPublic)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !661, file: !662, line: 26, baseType: !665, size: 64, offset: 128, flags: DIFlagPublic)
!669 = !DISubprogram(name: "Vector", scope: !661, file: !662, line: 28, type: !670, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!673 = !DISubprogram(name: "Vector", scope: !661, file: !662, line: 31, type: !674, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !672, !665, !665, !665}
!676 = !DISubprogram(name: "Vector", scope: !661, file: !662, line: 34, type: !677, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !672, !665}
!679 = !DISubprogram(name: "Vector", scope: !661, file: !662, line: 37, type: !680, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !672, !682}
!682 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FloatVector", file: !662, line: 16, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !685, identifier: "_ZTS11FloatVector")
!685 = !{!686, !687, !688, !689, !693}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !684, file: !662, line: 18, baseType: !76, size: 32, flags: DIFlagPublic)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !684, file: !662, line: 18, baseType: !76, size: 32, offset: 32, flags: DIFlagPublic)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !684, file: !662, line: 18, baseType: !76, size: 32, offset: 64, flags: DIFlagPublic)
!689 = !DISubprogram(name: "FloatVector", scope: !684, file: !662, line: 19, type: !690, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!693 = !DISubprogram(name: "FloatVector", scope: !684, file: !662, line: 20, type: !694, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !692, !696}
!696 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!698 = !DISubprogram(name: "operator[]", linkageName: "_ZN6VectorixEi", scope: !661, file: !662, line: 39, type: !699, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!699 = !DISubroutineType(types: !700)
!700 = !{!701, !672, !10}
!701 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !665, size: 64)
!702 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectoraSERKd", scope: !661, file: !662, line: 48, type: !703, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !672, !706}
!705 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !661, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!708 = !DISubprogram(name: "operator+=", linkageName: "_ZN6VectorpLERKS_", scope: !661, file: !662, line: 56, type: !709, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !672, !696}
!711 = !DISubprogram(name: "operator-=", linkageName: "_ZN6VectormIERKS_", scope: !661, file: !662, line: 63, type: !709, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!712 = !DISubprogram(name: "operator*=", linkageName: "_ZN6VectormLERKd", scope: !661, file: !662, line: 70, type: !713, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !672, !706}
!715 = !DISubprogram(name: "operator/=", linkageName: "_ZN6VectordVERKd", scope: !661, file: !662, line: 77, type: !713, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!716 = !DISubprogram(name: "length", linkageName: "_ZNK6Vector6lengthEv", scope: !661, file: !662, line: 125, type: !717, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!665, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!720 = !DISubprogram(name: "length2", linkageName: "_ZNK6Vector7length2Ev", scope: !661, file: !662, line: 129, type: !717, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!721 = !DISubprogram(name: "unit", linkageName: "_ZNK6Vector4unitEv", scope: !661, file: !662, line: 134, type: !722, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!722 = !DISubroutineType(types: !723)
!723 = !{!661, !719}
!724 = !DISubprogram(name: "cross", linkageName: "_ZN6Vector5crossERKS_", scope: !661, file: !662, line: 164, type: !709, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!725 = !DISubprogram(name: "dot", linkageName: "_ZN6Vector3dotERKS_", scope: !661, file: !662, line: 174, type: !726, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{!665, !672, !696}
!728 = !DISubprogram(name: "set", linkageName: "_ZN6Vector3setEPKc", scope: !661, file: !662, line: 180, type: !729, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !672, !254}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !666, line: 83, baseType: !10)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "charge", scope: !656, file: !657, line: 52, baseType: !733, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "Charge", file: !657, line: 30, baseType: !76)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vdwType", scope: !656, file: !657, line: 53, baseType: !735, size: 16, offset: 224)
!735 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !656, file: !657, line: 54, baseType: !737, size: 8, offset: 240)
!737 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nonbondedGroupSize", scope: !656, file: !657, line: 55, baseType: !534, size: 3, offset: 248, flags: DIFlagBitField, extraData: i64 248)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "hydrogenGroupSize", scope: !656, file: !657, line: 56, baseType: !534, size: 4, offset: 251, flags: DIFlagBitField, extraData: i64 248)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "isWater", scope: !656, file: !657, line: 57, baseType: !534, size: 1, offset: 255, flags: DIFlagBitField, extraData: i64 248)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "atomsExt", scope: !650, file: !651, line: 22, baseType: !742, size: 64, offset: 128, flags: DIFlagPublic)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CompAtomExt", file: !657, line: 76, size: 32, flags: DIFlagTypePassByValue, elements: !744, identifier: "_ZTS11CompAtomExt")
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !743, file: !657, line: 84, baseType: !10, size: 30, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "atomFixed", scope: !743, file: !657, line: 85, baseType: !534, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "groupFixed", scope: !743, file: !657, line: 86, baseType: !534, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "f_nbond", scope: !650, file: !651, line: 24, baseType: !749, size: 64, offset: 192, flags: DIFlagPublic)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "f_slow", scope: !650, file: !651, line: 25, baseType: !749, size: 64, offset: 256, flags: DIFlagPublic)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "p_orig", scope: !650, file: !651, line: 26, baseType: !749, size: 64, offset: 320, flags: DIFlagPublic)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_move", scope: !650, file: !651, line: 31, baseType: !10, size: 32, offset: 384, flags: DIFlagPublic)
!753 = !DISubprogram(name: "zeroforces", linkageName: "_ZN5Patch10zeroforcesEv", scope: !650, file: !651, line: 28, type: !754, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!757 = !DISubprogram(name: "setforces", linkageName: "_ZN5Patch9setforcesEP6VectorS1_", scope: !650, file: !651, line: 29, type: !758, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !756, !749, !749}
!760 = !DISubprogram(name: "moveatoms", linkageName: "_ZN5Patch9moveatomsEv", scope: !650, file: !651, line: 32, type: !754, scopeLine: 32, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubprogram(name: "Patch", scope: !650, file: !651, line: 34, type: !754, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!762 = !DISubprogram(name: "~Patch", scope: !650, file: !651, line: 35, type: !754, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!763 = !DISubprogram(name: "readfile", linkageName: "_ZN5Patch8readfileEP8_IO_FILEP8Molecule", scope: !650, file: !651, line: 37, type: !764, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{!10, !756, !766, !771}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !768, line: 7, baseType: !769)
!768 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !770, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!770 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Molecule", file: !773, line: 36, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !774, identifier: "_ZTS8Molecule")
!773 = !DIFile(filename: "./Molecule.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !{!775, !778, !786, !789, !790, !791, !792, !793, !797, !798, !801, !808, !811, !814, !819}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exclArena", scope: !772, file: !773, line: 41, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_class_type, name: "ObjectArena<char>", file: !773, line: 25, flags: DIFlagFwdDecl, identifier: "_ZTS11ObjectArenaIcE")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "all_exclusions", scope: !772, file: !773, line: 42, baseType: !779, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ExclusionCheck", file: !773, line: 27, size: 128, flags: DIFlagTypePassByValue, elements: !781, identifier: "_ZTS14ExclusionCheck")
!781 = !{!782, !784, !785}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !780, file: !773, line: 29, baseType: !783, size: 32, flags: DIFlagPublic)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !666, line: 19, baseType: !10)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !780, file: !773, line: 29, baseType: !783, size: 32, offset: 32, flags: DIFlagPublic)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !780, file: !773, line: 30, baseType: !487, size: 64, offset: 64, flags: DIFlagPublic)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fullExclusionsByAtom", scope: !772, file: !773, line: 48, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "modExclusionsByAtom", scope: !772, file: !773, line: 49, baseType: !787, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "numAtoms", scope: !772, file: !773, line: 52, baseType: !10, size: 32, offset: 256, flags: DIFlagPublic)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "numCalcExclusions", scope: !772, file: !773, line: 53, baseType: !10, size: 32, offset: 288, flags: DIFlagPublic)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "atomVdwType", scope: !772, file: !773, line: 60, baseType: !45, size: 64, offset: 320, flags: DIFlagPublic)
!793 = !DISubprogram(name: "Molecule", scope: !772, file: !773, line: 55, type: !794, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!797 = !DISubprogram(name: "~Molecule", scope: !772, file: !773, line: 56, type: !794, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubprogram(name: "readfile", linkageName: "_ZN8Molecule8readfileEP8_IO_FILE", scope: !772, file: !773, line: 58, type: !799, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!799 = !DISubroutineType(types: !800)
!800 = !{!10, !796, !766}
!801 = !DISubprogram(name: "atomvdwtype", linkageName: "_ZNK8Molecule11atomvdwtypeEi", scope: !772, file: !773, line: 63, type: !802, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !806, !10}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "Index", file: !666, line: 24, baseType: !805)
!805 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!808 = !DISubprogram(name: "checkexcl", linkageName: "_ZNK8Molecule9checkexclEii", scope: !772, file: !773, line: 70, type: !809, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!10, !806, !10, !10}
!811 = !DISubprogram(name: "get_excl_check_for_atom", linkageName: "_ZNK8Molecule23get_excl_check_for_atomEi", scope: !772, file: !773, line: 72, type: !812, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{!779, !806, !10}
!814 = !DISubprogram(name: "get_full_exclusions_for_atom", linkageName: "_ZNK8Molecule28get_full_exclusions_for_atomEi", scope: !772, file: !773, line: 75, type: !815, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !806, !10}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!819 = !DISubprogram(name: "get_mod_exclusions_for_atom", linkageName: "_ZNK8Molecule27get_mod_exclusions_for_atomEi", scope: !772, file: !773, line: 77, type: !815, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!820 = !DILocalVariable(name: "this", arg: 1, scope: !649, type: !821, flags: DIFlagArtificial | DIFlagObjectPointer)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!822 = !DILocation(line: 0, scope: !649)
!823 = !DILocation(line: 12, column: 3, scope: !824)
!824 = distinct !DILexicalBlock(scope: !649, file: !1, line: 11, column: 16)
!825 = !DILocation(line: 12, column: 12, scope: !824)
!826 = !DILocation(line: 13, column: 3, scope: !824)
!827 = !DILocation(line: 13, column: 9, scope: !824)
!828 = !DILocation(line: 14, column: 3, scope: !824)
!829 = !DILocation(line: 14, column: 11, scope: !824)
!830 = !DILocation(line: 15, column: 3, scope: !824)
!831 = !DILocation(line: 15, column: 10, scope: !824)
!832 = !DILocation(line: 16, column: 3, scope: !824)
!833 = !DILocation(line: 16, column: 10, scope: !824)
!834 = !DILocation(line: 17, column: 3, scope: !824)
!835 = !DILocation(line: 17, column: 10, scope: !824)
!836 = !DILocation(line: 18, column: 1, scope: !649)
!837 = distinct !DISubprogram(name: "~Patch", linkageName: "_ZN5PatchD2Ev", scope: !650, file: !1, line: 20, type: !754, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !762, retainedNodes: !2)
