; ModuleID = 'ComputeNonbondedUtil.C'
source_filename = "ComputeNonbondedUtil.C"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%class.LJTable = type <{ i8*, %"struct.LJTable::TableEntry"*, i32, [4 x i8] }>
%"struct.LJTable::TableEntry" = type { double, double }
%class.Molecule = type { %class.ObjectArena*, %class.ExclusionCheck*, i32**, i32**, i32, i32, i32* }
%class.ObjectArena = type opaque
%class.ExclusionCheck = type { i32, i32, i8* }
%struct.nonbonded = type { [2 x %struct.CompAtom*], [2 x %struct.CompAtomExt*], [2 x %struct.CompAtom*], [2 x %class.Vector*], [2 x %class.Vector*], [2 x i32], %class.Vector, double*, double*, %class.ComputeNonbondedWorkArrays*, %class.Pairlists*, i32, i32, double, double, i32, i32, i32, i32 }
%struct.CompAtomExt = type { i32 }
%struct.CompAtom = type { %class.Vector, float, i16, i8, i8 }
%class.Vector = type { double, double, double }
%class.ComputeNonbondedWorkArrays = type { %class.ResizeArray, %class.ResizeArray.0, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray, %class.ResizeArray.2, %class.ResizeArray.2 }

!58 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ComputeNonbondedUtil", file: !57, line: 214, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !59, identifier: "_ZTS20ComputeNonbondedUtil")
!59 = !{!60, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !56, !82, !84, !85, !86, !87, !88, !131, !136, !137, !138, !139, !140, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !203, !204, !506, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "calcPair", scope: !58, file: !57, line: 223, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "nonbonded", file: !57, line: 171, flags: DIFlagFwdDecl, identifier: "_ZTS9nonbonded")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "calcPairEnergy", scope: !58, file: !57, line: 224, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "calcSelf", scope: !58, file: !57, line: 225, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "calcSelfEnergy", scope: !58, file: !57, line: 226, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullPair", scope: !58, file: !57, line: 228, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullPairEnergy", scope: !58, file: !57, line: 229, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullSelf", scope: !58, file: !57, line: 230, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "calcFullSelfEnergy", scope: !58, file: !57, line: 231, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergePair", scope: !58, file: !57, line: 233, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergePairEnergy", scope: !58, file: !57, line: 234, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergeSelf", scope: !58, file: !57, line: 235, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "calcMergeSelfEnergy", scope: !58, file: !57, line: 236, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowPair", scope: !58, file: !57, line: 238, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowPairEnergy", scope: !58, file: !57, line: 239, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowSelf", scope: !58, file: !57, line: 240, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "calcSlowSelfEnergy", scope: !58, file: !57, line: 241, baseType: !61, flags: DIFlagPublic | DIFlagStaticMember)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "commOnly", scope: !58, file: !57, line: 258, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !58, file: !57, line: 260, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BigReal", file: !55, line: 65, baseType: !34)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff2", scope: !58, file: !57, line: 261, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistdist", scope: !58, file: !57, line: 262, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hgroupcutoff", scope: !58, file: !57, line: 263, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dielectric_1", scope: !58, file: !57, line: 264, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ljTable", scope: !58, file: !57, line: 265, baseType: !89, flags: DIFlagPublic | DIFlagStaticMember)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "LJTable", file: !92, line: 13, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !93, identifier: "_ZTS7LJTable")
!92 = !DIFile(filename: "./LJTable.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !{!94, !97, !103, !104, !108, !109, !116, !119, !120, !128}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table_alloc", scope: !91, file: !92, line: 46, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !91, file: !92, line: 47, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TableEntry", scope: !91, file: !92, line: 16, size: 128, flags: DIFlagTypePassByValue, elements: !100, identifier: "_ZTSN7LJTable10TableEntryE")
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !99, file: !92, line: 19, baseType: !83, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !99, file: !92, line: 20, baseType: !83, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "table_dim", scope: !91, file: !92, line: 48, baseType: !11, size: 32, offset: 128)
!104 = !DISubprogram(name: "LJTable", scope: !91, file: !92, line: 23, type: !105, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!108 = !DISubprogram(name: "~LJTable", scope: !91, file: !92, line: 25, type: !105, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!109 = !DISubprogram(name: "table_row", linkageName: "_ZNK7LJTable9table_rowEj", scope: !91, file: !92, line: 27, type: !110, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!115 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!116 = !DISubprogram(name: "table_val", linkageName: "_ZNK7LJTable9table_valEjj", scope: !91, file: !92, line: 31, type: !117, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!117 = !DISubroutineType(types: !118)
!118 = !{!112, !114, !115, !115}
!119 = !DISubprogram(name: "table_val_scale14", linkageName: "_ZNK7LJTable17table_val_scale14Ejj", scope: !91, file: !92, line: 35, type: !117, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!120 = !DISubprogram(name: "readfile", linkageName: "_ZN7LJTable8readfileEP8_IO_FILE", scope: !91, file: !92, line: 39, type: !121, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!121 = !DISubroutineType(types: !122)
!122 = !{!11, !107, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !125, line: 7, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !127, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!128 = !DISubprogram(name: "compute_vdw_params", linkageName: "_ZN7LJTable18compute_vdw_paramsEiiPNS_10TableEntryES1_", scope: !91, file: !92, line: 43, type: !129, scopeLine: 43, flags: DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !107, !11, !11, !98, !98}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mol", scope: !58, file: !57, line: 266, baseType: !132, flags: DIFlagPublic | DIFlagStaticMember)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "Molecule", file: !135, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTS8Molecule")
!135 = !DIFile(filename: "./Molecule.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta", scope: !58, file: !57, line: 267, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta_1", scope: !58, file: !57, line: 267, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rowsize", scope: !58, file: !57, line: 268, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "columnsize", scope: !58, file: !57, line: 269, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "r2_delta_exp", scope: !58, file: !57, line: 270, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "table_alloc", scope: !58, file: !57, line: 271, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "table_ener", scope: !58, file: !57, line: 272, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "table_short", scope: !58, file: !57, line: 273, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "table_noshort", scope: !58, file: !57, line: 274, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fast_table", scope: !58, file: !57, line: 275, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "scor_table", scope: !58, file: !57, line: 276, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "slow_table", scope: !58, file: !57, line: 277, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "corr_table", scope: !58, file: !57, line: 278, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "full_table", scope: !58, file: !57, line: 279, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vdwa_table", scope: !58, file: !57, line: 280, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vdwb_table", scope: !58, file: !57, line: 281, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "r2_table", scope: !58, file: !57, line: 282, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !58, file: !57, line: 283, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "scale14", scope: !58, file: !57, line: 284, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn", scope: !58, file: !57, line: 285, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn_1", scope: !58, file: !57, line: 286, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "switchOn2", scope: !58, file: !57, line: 287, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v_vdwa", scope: !58, file: !57, line: 288, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v_vdwb", scope: !58, file: !57, line: 289, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "k_vdwa", scope: !58, file: !57, line: 290, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "k_vdwb", scope: !58, file: !57, line: 291, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_3", scope: !58, file: !57, line: 292, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff_6", scope: !58, file: !57, line: 293, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "c0", scope: !58, file: !57, line: 294, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !58, file: !57, line: 295, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "c3", scope: !58, file: !57, line: 296, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "c5", scope: !58, file: !57, line: 297, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !58, file: !57, line: 298, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "c7", scope: !58, file: !57, line: 299, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "c8", scope: !58, file: !57, line: 300, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepOn", scope: !58, file: !57, line: 303, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "alchThermIntOn", scope: !58, file: !57, line: 304, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda", scope: !58, file: !57, line: 305, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda2", scope: !58, file: !57, line: 306, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwShiftCoeff", scope: !58, file: !57, line: 307, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alchElecLambdaStart", scope: !58, file: !57, line: 308, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwLambdaEnd", scope: !58, file: !57, line: 309, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Fep_WCA_repuOn", scope: !58, file: !57, line: 310, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Fep_WCA_dispOn", scope: !58, file: !57, line: 311, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "WCA_rcut1", scope: !58, file: !57, line: 312, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "WCA_rcut2", scope: !58, file: !57, line: 313, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "alchDecouple", scope: !58, file: !57, line: 314, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lesOn", scope: !58, file: !57, line: 316, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "lesFactor", scope: !58, file: !57, line: 317, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lesScaling", scope: !58, file: !57, line: 318, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lambda_table", scope: !58, file: !57, line: 320, baseType: !142, flags: DIFlagPublic | DIFlagStaticMember)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionOn", scope: !58, file: !57, line: 322, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionSelf", scope: !58, file: !57, line: 323, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileOn", scope: !58, file: !57, line: 325, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileSlabs", scope: !58, file: !57, line: 326, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileAtomTypes", scope: !58, file: !57, line: 327, baseType: !11, flags: DIFlagPublic | DIFlagStaticMember)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileThickness", scope: !58, file: !57, line: 328, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileMin", scope: !58, file: !57, line: 329, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "accelMDOn", scope: !58, file: !57, line: 331, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "drudeNbthole", scope: !58, file: !57, line: 333, baseType: !54, flags: DIFlagPublic | DIFlagStaticMember)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcof", scope: !58, file: !57, line: 336, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pi_ewaldcof", scope: !58, file: !57, line: 337, baseType: !83, flags: DIFlagPublic | DIFlagStaticMember)
!199 = !DISubprogram(name: "ComputeNonbondedUtil", scope: !58, file: !57, line: 218, type: !200, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DISubprogram(name: "~ComputeNonbondedUtil", scope: !58, file: !57, line: 219, type: !200, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!204 = !DISubprogram(name: "select", linkageName: "_ZN20ComputeNonbondedUtil6selectEP13SimParametersP8MoleculeP7LJTable", scope: !58, file: !57, line: 220, type: !205, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207, !504, !505}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SimParameters", file: !209, line: 32, size: 5056, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !210, identifier: "_ZTS13SimParameters")
!209 = !DIFile(filename: "./SimParameters.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!210 = !{!211, !284, !285, !286, !287, !288, !289, !290, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !493, !497, !498, !501}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cellBasisVector1", scope: !208, file: !212, line: 7, baseType: !213, size: 192, flags: DIFlagPublic)
!212 = !DIFile(filename: "./SimParamList.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!213 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector", file: !214, line: 24, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !215, identifier: "_ZTS6Vector")
!214 = !DIFile(filename: "./Vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!215 = !{!216, !217, !218, !219, !223, !226, !229, !249, !253, !259, !262, !263, !266, !267, !271, !272, !275, !276, !279}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !214, line: 26, baseType: !83, size: 64, flags: DIFlagPublic)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !214, line: 26, baseType: !83, size: 64, offset: 64, flags: DIFlagPublic)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !213, file: !214, line: 26, baseType: !83, size: 64, offset: 128, flags: DIFlagPublic)
!219 = !DISubprogram(name: "Vector", scope: !213, file: !214, line: 28, type: !220, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DISubprogram(name: "Vector", scope: !213, file: !214, line: 31, type: !224, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !222, !83, !83, !83}
!226 = !DISubprogram(name: "Vector", scope: !213, file: !214, line: 34, type: !227, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !222, !83}
!229 = !DISubprogram(name: "Vector", scope: !213, file: !214, line: 37, type: !230, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !222, !232}
!232 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FloatVector", file: !214, line: 16, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !235, identifier: "_ZTS11FloatVector")
!235 = !{!236, !238, !239, !240, !244}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !234, file: !214, line: 18, baseType: !237, size: 32, flags: DIFlagPublic)
!237 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !234, file: !214, line: 18, baseType: !237, size: 32, offset: 32, flags: DIFlagPublic)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !234, file: !214, line: 18, baseType: !237, size: 32, offset: 64, flags: DIFlagPublic)
!240 = !DISubprogram(name: "FloatVector", scope: !234, file: !214, line: 19, type: !241, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!244 = !DISubprogram(name: "FloatVector", scope: !234, file: !214, line: 20, type: !245, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !243, !247}
!247 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!249 = !DISubprogram(name: "operator[]", linkageName: "_ZN6VectorixEi", scope: !213, file: !214, line: 39, type: !250, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !222, !11}
!252 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !83, size: 64)
!253 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectoraSERKd", scope: !213, file: !214, line: 48, type: !254, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !222, !257}
!256 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !213, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!259 = !DISubprogram(name: "operator+=", linkageName: "_ZN6VectorpLERKS_", scope: !213, file: !214, line: 56, type: !260, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !222, !247}
!262 = !DISubprogram(name: "operator-=", linkageName: "_ZN6VectormIERKS_", scope: !213, file: !214, line: 63, type: !260, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubprogram(name: "operator*=", linkageName: "_ZN6VectormLERKd", scope: !213, file: !214, line: 70, type: !264, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !222, !257}
!266 = !DISubprogram(name: "operator/=", linkageName: "_ZN6VectordVERKd", scope: !213, file: !214, line: 77, type: !264, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubprogram(name: "length", linkageName: "_ZNK6Vector6lengthEv", scope: !213, file: !214, line: 125, type: !268, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!268 = !DISubroutineType(types: !269)
!269 = !{!83, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!271 = !DISubprogram(name: "length2", linkageName: "_ZNK6Vector7length2Ev", scope: !213, file: !214, line: 129, type: !268, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!272 = !DISubprogram(name: "unit", linkageName: "_ZNK6Vector4unitEv", scope: !213, file: !214, line: 134, type: !273, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!273 = !DISubroutineType(types: !274)
!274 = !{!213, !270}
!275 = !DISubprogram(name: "cross", linkageName: "_ZN6Vector5crossERKS_", scope: !213, file: !214, line: 164, type: !260, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DISubprogram(name: "dot", linkageName: "_ZN6Vector3dotERKS_", scope: !213, file: !214, line: 174, type: !277, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!277 = !DISubroutineType(types: !278)
!278 = !{!83, !222, !247}
!279 = !DISubprogram(name: "set", linkageName: "_ZN6Vector3setEPKc", scope: !213, file: !214, line: 180, type: !280, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!280 = !DISubroutineType(types: !281)
!281 = !{!54, !222, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cellBasisVector2", scope: !208, file: !212, line: 8, baseType: !213, size: 192, offset: 192, flags: DIFlagPublic)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cellBasisVector3", scope: !208, file: !212, line: 9, baseType: !213, size: 192, offset: 384, flags: DIFlagPublic)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cellOrigin", scope: !208, file: !212, line: 10, baseType: !213, size: 192, offset: 576, flags: DIFlagPublic)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nonbondedFrequency", scope: !208, file: !212, line: 12, baseType: !11, size: 32, offset: 768, flags: DIFlagPublic)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fullElectFrequency", scope: !208, file: !212, line: 14, baseType: !11, size: 32, offset: 800, flags: DIFlagPublic)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dielectric", scope: !208, file: !212, line: 16, baseType: !83, size: 64, offset: 832, flags: DIFlagPublic)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "exclude", scope: !208, file: !212, line: 17, baseType: !291, size: 32, offset: 896, flags: DIFlagPublic)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExclusionSettings", file: !209, line: 17, baseType: !11)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "scale14", scope: !208, file: !212, line: 19, baseType: !83, size: 64, offset: 960, flags: DIFlagPublic)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nonbondedScaling", scope: !208, file: !212, line: 21, baseType: !83, size: 64, offset: 1024, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !208, file: !212, line: 22, baseType: !83, size: 64, offset: 1088, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "switchingActive", scope: !208, file: !212, line: 23, baseType: !54, size: 32, offset: 1152, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "switchingDist", scope: !208, file: !212, line: 25, baseType: !83, size: 64, offset: 1216, flags: DIFlagPublic)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pairlistDist", scope: !208, file: !212, line: 27, baseType: !83, size: 64, offset: 1280, flags: DIFlagPublic)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alchOn", scope: !208, file: !212, line: 33, baseType: !54, size: 32, offset: 1344, flags: DIFlagPublic)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda", scope: !208, file: !212, line: 34, baseType: !83, size: 64, offset: 1408, flags: DIFlagPublic)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "alchLambda2", scope: !208, file: !212, line: 35, baseType: !83, size: 64, offset: 1472, flags: DIFlagPublic)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alchOutFreq", scope: !208, file: !212, line: 36, baseType: !11, size: 32, offset: 1536, flags: DIFlagPublic)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "alchEquilSteps", scope: !208, file: !212, line: 37, baseType: !11, size: 32, offset: 1568, flags: DIFlagPublic)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwShiftCoeff", scope: !208, file: !212, line: 38, baseType: !11, size: 32, offset: 1600, flags: DIFlagPublic)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileOn", scope: !208, file: !212, line: 42, baseType: !54, size: 32, offset: 1632, flags: DIFlagPublic)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileSlabs", scope: !208, file: !212, line: 44, baseType: !11, size: 32, offset: 1664, flags: DIFlagPublic)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileFreq", scope: !208, file: !212, line: 45, baseType: !11, size: 32, offset: 1696, flags: DIFlagPublic)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lesOn", scope: !208, file: !212, line: 50, baseType: !54, size: 32, offset: 1728, flags: DIFlagPublic)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lesFactor", scope: !208, file: !212, line: 51, baseType: !11, size: 32, offset: 1760, flags: DIFlagPublic)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionOn", scope: !208, file: !212, line: 53, baseType: !54, size: 32, offset: 1792, flags: DIFlagPublic)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionGroup1", scope: !208, file: !212, line: 54, baseType: !11, size: 32, offset: 1824, flags: DIFlagPublic)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionGroup2", scope: !208, file: !212, line: 55, baseType: !11, size: 32, offset: 1856, flags: DIFlagPublic)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pairInteractionSelf", scope: !208, file: !212, line: 56, baseType: !54, size: 32, offset: 1888, flags: DIFlagPublic)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fixedAtomsOn", scope: !208, file: !212, line: 58, baseType: !54, size: 32, offset: 1920, flags: DIFlagPublic)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fixedAtomsForces", scope: !208, file: !212, line: 59, baseType: !54, size: 32, offset: 1952, flags: DIFlagPublic)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "FMAOn", scope: !208, file: !212, line: 61, baseType: !54, size: 32, offset: 1984, flags: DIFlagPublic)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fullDirectOn", scope: !208, file: !212, line: 62, baseType: !54, size: 32, offset: 2016, flags: DIFlagPublic)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "PMEOn", scope: !208, file: !212, line: 63, baseType: !54, size: 32, offset: 2048, flags: DIFlagPublic)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "PMETolerance", scope: !208, file: !212, line: 64, baseType: !83, size: 64, offset: 2112, flags: DIFlagPublic)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "PMEEwaldCoefficient", scope: !208, file: !212, line: 65, baseType: !83, size: 64, offset: 2176, flags: DIFlagPublic)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "longSplitting", scope: !208, file: !212, line: 67, baseType: !11, size: 32, offset: 2240, flags: DIFlagPublic)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hgroupCutoff", scope: !208, file: !212, line: 70, baseType: !83, size: 64, offset: 2304, flags: DIFlagPublic)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mollyOn", scope: !208, file: !212, line: 72, baseType: !11, size: 32, offset: 2368, flags: DIFlagPublic)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "commOnly", scope: !208, file: !212, line: 74, baseType: !54, size: 32, offset: 2400, flags: DIFlagPublic)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "loweAndersenCutoff", scope: !208, file: !212, line: 76, baseType: !83, size: 64, offset: 2432, flags: DIFlagPublic)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !208, file: !212, line: 77, baseType: !83, size: 64, offset: 2496, flags: DIFlagPublic)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "loweAndersenRate", scope: !208, file: !212, line: 78, baseType: !83, size: 64, offset: 2560, flags: DIFlagPublic)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rigidBonds", scope: !208, file: !212, line: 79, baseType: !11, size: 32, offset: 2624, flags: DIFlagPublic)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "loweAndersenTemp", scope: !208, file: !212, line: 80, baseType: !83, size: 64, offset: 2688, flags: DIFlagPublic)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepOn", scope: !208, file: !212, line: 81, baseType: !54, size: 32, offset: 2752, flags: DIFlagPublic)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepWCARepuOn", scope: !208, file: !212, line: 82, baseType: !54, size: 32, offset: 2784, flags: DIFlagPublic)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepWCADispOn", scope: !208, file: !212, line: 83, baseType: !54, size: 32, offset: 2816, flags: DIFlagPublic)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "alchThermIntOn", scope: !208, file: !212, line: 84, baseType: !54, size: 32, offset: 2848, flags: DIFlagPublic)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tabulatedEnergies", scope: !208, file: !212, line: 85, baseType: !54, size: 32, offset: 2880, flags: DIFlagPublic)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepWCArcut1", scope: !208, file: !212, line: 86, baseType: !83, size: 64, offset: 2944, flags: DIFlagPublic)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "alchFepWCArcut2", scope: !208, file: !212, line: 87, baseType: !83, size: 64, offset: 3008, flags: DIFlagPublic)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "alchVdwLambdaEnd", scope: !208, file: !212, line: 88, baseType: !83, size: 64, offset: 3072, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alchElecLambdaStart", scope: !208, file: !212, line: 89, baseType: !83, size: 64, offset: 3136, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "alchDecouple", scope: !208, file: !212, line: 90, baseType: !54, size: 32, offset: 3200, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "accelMDOn", scope: !208, file: !212, line: 91, baseType: !54, size: 32, offset: 3232, flags: DIFlagPublic)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "drudeNbtholeCut", scope: !208, file: !212, line: 92, baseType: !83, size: 64, offset: 3264, flags: DIFlagPublic)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "drudeOn", scope: !208, file: !212, line: 93, baseType: !54, size: 32, offset: 3328, flags: DIFlagPublic)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pressureProfileAtomTypes", scope: !208, file: !212, line: 94, baseType: !11, size: 32, offset: 3360, flags: DIFlagPublic)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "MSMOn", scope: !208, file: !212, line: 95, baseType: !54, size: 32, offset: 3392, flags: DIFlagPublic)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MSMSplit", scope: !208, file: !212, line: 96, baseType: !11, size: 32, offset: 3424, flags: DIFlagPublic)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "limitDist", scope: !208, file: !212, line: 97, baseType: !83, size: 64, offset: 3456, flags: DIFlagPublic)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vdwForceSwitching", scope: !208, file: !212, line: 98, baseType: !54, size: 32, offset: 3520, flags: DIFlagPublic)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "martiniSwitching", scope: !208, file: !212, line: 99, baseType: !54, size: 32, offset: 3552, flags: DIFlagPublic)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lattice", scope: !208, file: !209, line: 43, baseType: !349, size: 1472, offset: 3584, flags: DIFlagPublic)
!349 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Lattice", file: !350, line: 25, size: 1472, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !351, identifier: "_ZTS7Lattice")
!350 = !DIFile(filename: "./Lattice.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !366, !369, !372, !377, !423, !429, !433, !436, !439, !453, !458, !459, !464, !467, !468, !471, !474, !477, !478, !479, !482, !483, !484, !485, !486, !487, !488, !489, !492}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !349, file: !350, line: 272, baseType: !213, size: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !349, file: !350, line: 272, baseType: !213, size: 192, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !349, file: !350, line: 272, baseType: !213, size: 192, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b1", scope: !349, file: !350, line: 273, baseType: !213, size: 192, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !349, file: !350, line: 273, baseType: !213, size: 192, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b3", scope: !349, file: !350, line: 273, baseType: !213, size: 192, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !349, file: !350, line: 274, baseType: !213, size: 192, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !349, file: !350, line: 275, baseType: !11, size: 32, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !349, file: !350, line: 275, baseType: !11, size: 32, offset: 1376)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "p3", scope: !349, file: !350, line: 275, baseType: !11, size: 32, offset: 1408)
!362 = !DISubprogram(name: "Lattice", scope: !349, file: !350, line: 28, type: !363, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!366 = !DISubprogram(name: "index", linkageName: "_ZN7Lattice5indexEiii", scope: !349, file: !350, line: 33, type: !367, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!11, !11, !11, !11}
!369 = !DISubprogram(name: "set", linkageName: "_ZN7Lattice3setE6VectorS0_S0_", scope: !349, file: !350, line: 39, type: !370, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !365, !213, !213, !213}
!372 = !DISubprogram(name: "set", linkageName: "_ZN7Lattice3setE6VectorS0_S0_S0_", scope: !349, file: !350, line: 45, type: !373, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !365, !213, !213, !213, !375}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "Position", file: !376, line: 18, baseType: !213)
!376 = !DIFile(filename: "./NamdTypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!377 = !DISubprogram(name: "rescale", linkageName: "_ZN7Lattice7rescaleE6Tensor", scope: !349, file: !350, line: 68, type: !378, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !365, !380}
!380 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Tensor", file: !381, line: 15, size: 576, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !382, identifier: "_ZTS6Tensor")
!381 = !DIFile(filename: "./Tensor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !396, !401, !404, !407, !410, !411, !412, !416, !419, !420, !421, !422}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xx", scope: !380, file: !381, line: 17, baseType: !83, size: 64, flags: DIFlagPublic)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xy", scope: !380, file: !381, line: 17, baseType: !83, size: 64, offset: 64, flags: DIFlagPublic)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "xz", scope: !380, file: !381, line: 17, baseType: !83, size: 64, offset: 128, flags: DIFlagPublic)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "yx", scope: !380, file: !381, line: 18, baseType: !83, size: 64, offset: 192, flags: DIFlagPublic)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "yy", scope: !380, file: !381, line: 18, baseType: !83, size: 64, offset: 256, flags: DIFlagPublic)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "yz", scope: !380, file: !381, line: 18, baseType: !83, size: 64, offset: 320, flags: DIFlagPublic)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "zx", scope: !380, file: !381, line: 19, baseType: !83, size: 64, offset: 384, flags: DIFlagPublic)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "zy", scope: !380, file: !381, line: 19, baseType: !83, size: 64, offset: 448, flags: DIFlagPublic)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !380, file: !381, line: 19, baseType: !83, size: 64, offset: 512, flags: DIFlagPublic)
!392 = !DISubprogram(name: "Tensor", scope: !380, file: !381, line: 21, type: !393, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!396 = !DISubprogram(name: "Tensor", scope: !380, file: !381, line: 25, type: !397, scopeLine: 25, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !395, !399}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!401 = !DISubprogram(name: "identity", linkageName: "_ZN6Tensor8identityEd", scope: !380, file: !381, line: 31, type: !402, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!380, !83}
!404 = !DISubprogram(name: "diagonal", linkageName: "_ZN6Tensor8diagonalERK6Vector", scope: !380, file: !381, line: 37, type: !405, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!380, !247}
!407 = !DISubprogram(name: "symmetric", linkageName: "_ZN6Tensor9symmetricERK6VectorS2_", scope: !380, file: !381, line: 45, type: !408, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!380, !247, !247}
!410 = !DISubprogram(name: "triangular", linkageName: "_ZN6Tensor10triangularERK6VectorS2_", scope: !380, file: !381, line: 53, type: !408, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!411 = !DISubprogram(name: "~Tensor", scope: !380, file: !381, line: 61, type: !393, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubprogram(name: "operator=", linkageName: "_ZN6TensoraSERKS_", scope: !380, file: !381, line: 63, type: !413, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !395, !399}
!415 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !380, size: 64)
!416 = !DISubprogram(name: "operator=", linkageName: "_ZN6TensoraSERKd", scope: !380, file: !381, line: 70, type: !417, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!415, !395, !257}
!419 = !DISubprogram(name: "operator+=", linkageName: "_ZN6TensorpLERKS_", scope: !380, file: !381, line: 75, type: !413, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "operator-=", linkageName: "_ZN6TensormIERKS_", scope: !380, file: !381, line: 82, type: !413, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "operator*=", linkageName: "_ZN6TensormLERKd", scope: !380, file: !381, line: 89, type: !417, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubprogram(name: "operator/=", linkageName: "_ZN6TensordVERKd", scope: !380, file: !381, line: 96, type: !417, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubprogram(name: "rescale", linkageName: "_ZNK7Lattice7rescaleER6Vector6Tensor", scope: !349, file: !350, line: 77, type: !424, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !426, !428, !380}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!428 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !375, size: 64)
!429 = !DISubprogram(name: "unscale", linkageName: "_ZNK7Lattice7unscaleE6Vector", scope: !349, file: !350, line: 85, type: !430, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{!375, !426, !432}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScaledPosition", file: !350, line: 23, baseType: !213)
!433 = !DISubprogram(name: "scale", linkageName: "_ZNK7Lattice5scaleE6Vector", scope: !349, file: !350, line: 91, type: !434, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!432, !426, !375}
!436 = !DISubprogram(name: "nearest", linkageName: "_ZNK7Lattice7nearestE6VectorS0_", scope: !349, file: !350, line: 98, type: !437, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!375, !426, !375, !432}
!439 = !DISubprogram(name: "nearest", linkageName: "_ZNK7Lattice7nearestE6VectorS0_P9Transform", scope: !349, file: !350, line: 115, type: !440, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{!375, !426, !375, !432, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform", file: !376, line: 34, size: 24, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !444, identifier: "_ZTS9Transform")
!444 = !{!445, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !443, file: !376, line: 36, baseType: !446, size: 8)
!446 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !443, file: !376, line: 36, baseType: !446, size: 8, offset: 8)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !443, file: !376, line: 36, baseType: !446, size: 8, offset: 16)
!449 = !DISubprogram(name: "Transform", scope: !443, file: !376, line: 37, type: !450, scopeLine: 37, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!453 = !DISubprogram(name: "apply_transform", linkageName: "_ZNK7Lattice15apply_transformE6VectorRK9Transform", scope: !349, file: !350, line: 140, type: !454, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!454 = !DISubroutineType(types: !455)
!455 = !{!375, !426, !375, !456}
!456 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!458 = !DISubprogram(name: "reverse_transform", linkageName: "_ZNK7Lattice17reverse_transformE6VectorRK9Transform", scope: !349, file: !350, line: 146, type: !454, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!459 = !DISubprogram(name: "delta", linkageName: "_ZNK7Lattice5deltaERK6VectorS2_", scope: !349, file: !350, line: 152, type: !460, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!213, !426, !462, !462}
!462 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!464 = !DISubprogram(name: "delta", linkageName: "_ZNK7Lattice5deltaERK6Vector", scope: !349, file: !350, line: 188, type: !465, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!213, !426, !462}
!467 = !DISubprogram(name: "wrap_delta", linkageName: "_ZNK7Lattice10wrap_deltaERK6Vector", scope: !349, file: !350, line: 199, type: !465, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!468 = !DISubprogram(name: "wrap_nearest_delta", linkageName: "_ZNK7Lattice18wrap_nearest_deltaE6Vector", scope: !349, file: !350, line: 210, type: !469, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!213, !426, !375}
!471 = !DISubprogram(name: "offset", linkageName: "_ZNK7Lattice6offsetEi", scope: !349, file: !350, line: 235, type: !472, scopeLine: 235, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{!213, !426, !11}
!474 = !DISubprogram(name: "a", linkageName: "_ZNK7Lattice1aEv", scope: !349, file: !350, line: 241, type: !475, scopeLine: 241, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!475 = !DISubroutineType(types: !476)
!476 = !{!213, !426}
!477 = !DISubprogram(name: "b", linkageName: "_ZNK7Lattice1bEv", scope: !349, file: !350, line: 242, type: !475, scopeLine: 242, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!478 = !DISubprogram(name: "c", linkageName: "_ZNK7Lattice1cEv", scope: !349, file: !350, line: 243, type: !475, scopeLine: 243, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubprogram(name: "orthogonal", linkageName: "_ZNK7Lattice10orthogonalEv", scope: !349, file: !350, line: 246, type: !480, scopeLine: 246, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!11, !426}
!482 = !DISubprogram(name: "origin", linkageName: "_ZNK7Lattice6originEv", scope: !349, file: !350, line: 251, type: !475, scopeLine: 251, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!483 = !DISubprogram(name: "a_r", linkageName: "_ZNK7Lattice3a_rEv", scope: !349, file: !350, line: 257, type: !475, scopeLine: 257, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!484 = !DISubprogram(name: "b_r", linkageName: "_ZNK7Lattice3b_rEv", scope: !349, file: !350, line: 258, type: !475, scopeLine: 258, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubprogram(name: "c_r", linkageName: "_ZNK7Lattice3c_rEv", scope: !349, file: !350, line: 259, type: !475, scopeLine: 259, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubprogram(name: "a_p", linkageName: "_ZNK7Lattice3a_pEv", scope: !349, file: !350, line: 262, type: !480, scopeLine: 262, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!487 = !DISubprogram(name: "b_p", linkageName: "_ZNK7Lattice3b_pEv", scope: !349, file: !350, line: 263, type: !480, scopeLine: 263, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!488 = !DISubprogram(name: "c_p", linkageName: "_ZNK7Lattice3c_pEv", scope: !349, file: !350, line: 264, type: !480, scopeLine: 264, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!489 = !DISubprogram(name: "volume", linkageName: "_ZNK7Lattice6volumeEv", scope: !349, file: !350, line: 266, type: !490, scopeLine: 266, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!490 = !DISubroutineType(types: !491)
!491 = !{!83, !426}
!492 = !DISubprogram(name: "recalculate", linkageName: "_ZN7Lattice11recalculateEv", scope: !349, file: !350, line: 278, type: !363, scopeLine: 278, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DISubprogram(name: "SimParameters", scope: !208, file: !209, line: 45, type: !494, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!497 = !DISubprogram(name: "~SimParameters", scope: !208, file: !209, line: 46, type: !494, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!498 = !DISubprogram(name: "readfile", linkageName: "_ZN13SimParameters8readfileEP8_IO_FILE", scope: !208, file: !209, line: 47, type: !499, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!11, !496, !123}
!501 = !DISubprogram(name: "setparam", linkageName: "_ZN13SimParameters8setparamEPKcS1_", scope: !208, file: !209, line: 48, type: !502, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!11, !496, !282, !282}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!506 = !DISubprogram(name: "square", linkageName: "_ZN20ComputeNonbondedUtil6squareERKdS1_S1_", scope: !58, file: !57, line: 340, type: !507, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!83, !257, !257, !257}
!509 = !DISubprogram(name: "calc_error", linkageName: "_ZN20ComputeNonbondedUtil10calc_errorEP9nonbonded", scope: !58, file: !57, line: 347, type: !62, scopeLine: 347, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!510 = !DISubprogram(name: "calc_pair", linkageName: "_ZN20ComputeNonbondedUtil9calc_pairEP9nonbonded", scope: !58, file: !57, line: 349, type: !62, scopeLine: 349, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!511 = !DISubprogram(name: "calc_pair_energy", linkageName: "_ZN20ComputeNonbondedUtil16calc_pair_energyEP9nonbonded", scope: !58, file: !57, line: 350, type: !62, scopeLine: 350, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!512 = !DISubprogram(name: "calc_pair_fullelect", linkageName: "_ZN20ComputeNonbondedUtil19calc_pair_fullelectEP9nonbonded", scope: !58, file: !57, line: 351, type: !62, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!513 = !DISubprogram(name: "calc_pair_energy_fullelect", linkageName: "_ZN20ComputeNonbondedUtil26calc_pair_energy_fullelectEP9nonbonded", scope: !58, file: !57, line: 352, type: !62, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!514 = !DISubprogram(name: "calc_pair_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil25calc_pair_merge_fullelectEP9nonbonded", scope: !58, file: !57, line: 353, type: !62, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!515 = !DISubprogram(name: "calc_pair_energy_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_energy_merge_fullelectEP9nonbonded", scope: !58, file: !57, line: 354, type: !62, scopeLine: 354, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!516 = !DISubprogram(name: "calc_pair_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil24calc_pair_slow_fullelectEP9nonbonded", scope: !58, file: !57, line: 355, type: !62, scopeLine: 355, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!517 = !DISubprogram(name: "calc_pair_energy_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil31calc_pair_energy_slow_fullelectEP9nonbonded", scope: !58, file: !57, line: 356, type: !62, scopeLine: 356, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!518 = !DISubprogram(name: "calc_self", linkageName: "_ZN20ComputeNonbondedUtil9calc_selfEP9nonbonded", scope: !58, file: !57, line: 358, type: !62, scopeLine: 358, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!519 = !DISubprogram(name: "calc_self_energy", linkageName: "_ZN20ComputeNonbondedUtil16calc_self_energyEP9nonbonded", scope: !58, file: !57, line: 359, type: !62, scopeLine: 359, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!520 = !DISubprogram(name: "calc_self_fullelect", linkageName: "_ZN20ComputeNonbondedUtil19calc_self_fullelectEP9nonbonded", scope: !58, file: !57, line: 360, type: !62, scopeLine: 360, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!521 = !DISubprogram(name: "calc_self_energy_fullelect", linkageName: "_ZN20ComputeNonbondedUtil26calc_self_energy_fullelectEP9nonbonded", scope: !58, file: !57, line: 361, type: !62, scopeLine: 361, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!522 = !DISubprogram(name: "calc_self_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil25calc_self_merge_fullelectEP9nonbonded", scope: !58, file: !57, line: 362, type: !62, scopeLine: 362, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!523 = !DISubprogram(name: "calc_self_energy_merge_fullelect", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_energy_merge_fullelectEP9nonbonded", scope: !58, file: !57, line: 363, type: !62, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!524 = !DISubprogram(name: "calc_self_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil24calc_self_slow_fullelectEP9nonbonded", scope: !58, file: !57, line: 364, type: !62, scopeLine: 364, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!525 = !DISubprogram(name: "calc_self_energy_slow_fullelect", linkageName: "_ZN20ComputeNonbondedUtil31calc_self_energy_slow_fullelectEP9nonbonded", scope: !58, file: !57, line: 365, type: !62, scopeLine: 365, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!526 = !DISubprogram(name: "calc_pair_energy_fep", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_fepEP9nonbonded", scope: !58, file: !57, line: 368, type: !62, scopeLine: 368, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!527 = !DISubprogram(name: "calc_pair_energy_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 369, type: !62, scopeLine: 369, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!528 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 370, type: !62, scopeLine: 370, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!529 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_slow_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 371, type: !62, scopeLine: 371, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!530 = !DISubprogram(name: "calc_self_energy_fep", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_fepEP9nonbonded", scope: !58, file: !57, line: 372, type: !62, scopeLine: 372, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!531 = !DISubprogram(name: "calc_self_energy_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 373, type: !62, scopeLine: 373, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!532 = !DISubprogram(name: "calc_self_energy_merge_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 374, type: !62, scopeLine: 374, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!533 = !DISubprogram(name: "calc_self_energy_slow_fullelect_fep", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_slow_fullelect_fepEP9nonbonded", scope: !58, file: !57, line: 375, type: !62, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!534 = !DISubprogram(name: "calc_pair_energy_ti", linkageName: "_ZN20ComputeNonbondedUtil19calc_pair_energy_tiEP9nonbonded", scope: !58, file: !57, line: 377, type: !62, scopeLine: 377, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!535 = !DISubprogram(name: "calc_pair_ti", linkageName: "_ZN20ComputeNonbondedUtil12calc_pair_tiEP9nonbonded", scope: !58, file: !57, line: 378, type: !62, scopeLine: 378, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!536 = !DISubprogram(name: "calc_pair_energy_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil29calc_pair_energy_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 379, type: !62, scopeLine: 379, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!537 = !DISubprogram(name: "calc_pair_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil22calc_pair_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 380, type: !62, scopeLine: 380, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!538 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_merge_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 381, type: !62, scopeLine: 381, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!539 = !DISubprogram(name: "calc_pair_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil28calc_pair_merge_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 382, type: !62, scopeLine: 382, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!540 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil34calc_pair_energy_slow_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 383, type: !62, scopeLine: 383, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!541 = !DISubprogram(name: "calc_pair_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil27calc_pair_slow_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 384, type: !62, scopeLine: 384, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!542 = !DISubprogram(name: "calc_self_energy_ti", linkageName: "_ZN20ComputeNonbondedUtil19calc_self_energy_tiEP9nonbonded", scope: !58, file: !57, line: 385, type: !62, scopeLine: 385, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!543 = !DISubprogram(name: "calc_self_ti", linkageName: "_ZN20ComputeNonbondedUtil12calc_self_tiEP9nonbonded", scope: !58, file: !57, line: 386, type: !62, scopeLine: 386, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!544 = !DISubprogram(name: "calc_self_energy_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil29calc_self_energy_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 387, type: !62, scopeLine: 387, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!545 = !DISubprogram(name: "calc_self_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil22calc_self_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 388, type: !62, scopeLine: 388, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!546 = !DISubprogram(name: "calc_self_energy_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_merge_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 389, type: !62, scopeLine: 389, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!547 = !DISubprogram(name: "calc_self_merge_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil28calc_self_merge_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 390, type: !62, scopeLine: 390, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!548 = !DISubprogram(name: "calc_self_energy_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil34calc_self_energy_slow_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 391, type: !62, scopeLine: 391, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!549 = !DISubprogram(name: "calc_self_slow_fullelect_ti", linkageName: "_ZN20ComputeNonbondedUtil27calc_self_slow_fullelect_tiEP9nonbonded", scope: !58, file: !57, line: 392, type: !62, scopeLine: 392, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!550 = !DISubprogram(name: "calc_pair_les", linkageName: "_ZN20ComputeNonbondedUtil13calc_pair_lesEP9nonbonded", scope: !58, file: !57, line: 395, type: !62, scopeLine: 395, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!551 = !DISubprogram(name: "calc_pair_energy_les", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_lesEP9nonbonded", scope: !58, file: !57, line: 396, type: !62, scopeLine: 396, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!552 = !DISubprogram(name: "calc_pair_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil23calc_pair_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 397, type: !62, scopeLine: 397, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!553 = !DISubprogram(name: "calc_pair_energy_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 398, type: !62, scopeLine: 398, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!554 = !DISubprogram(name: "calc_pair_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil29calc_pair_merge_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 399, type: !62, scopeLine: 399, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!555 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 400, type: !62, scopeLine: 400, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!556 = !DISubprogram(name: "calc_pair_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil28calc_pair_slow_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 401, type: !62, scopeLine: 401, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!557 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil35calc_pair_energy_slow_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 402, type: !62, scopeLine: 402, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!558 = !DISubprogram(name: "calc_self_les", linkageName: "_ZN20ComputeNonbondedUtil13calc_self_lesEP9nonbonded", scope: !58, file: !57, line: 403, type: !62, scopeLine: 403, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!559 = !DISubprogram(name: "calc_self_energy_les", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_lesEP9nonbonded", scope: !58, file: !57, line: 404, type: !62, scopeLine: 404, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!560 = !DISubprogram(name: "calc_self_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil23calc_self_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 405, type: !62, scopeLine: 405, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!561 = !DISubprogram(name: "calc_self_energy_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 406, type: !62, scopeLine: 406, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!562 = !DISubprogram(name: "calc_self_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil29calc_self_merge_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 407, type: !62, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!563 = !DISubprogram(name: "calc_self_energy_merge_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 408, type: !62, scopeLine: 408, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!564 = !DISubprogram(name: "calc_self_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil28calc_self_slow_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 409, type: !62, scopeLine: 409, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!565 = !DISubprogram(name: "calc_self_energy_slow_fullelect_les", linkageName: "_ZN20ComputeNonbondedUtil35calc_self_energy_slow_fullelect_lesEP9nonbonded", scope: !58, file: !57, line: 410, type: !62, scopeLine: 410, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!566 = !DISubprogram(name: "calc_pair_energy_int", linkageName: "_ZN20ComputeNonbondedUtil20calc_pair_energy_intEP9nonbonded", scope: !58, file: !57, line: 413, type: !62, scopeLine: 413, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!567 = !DISubprogram(name: "calc_pair_energy_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_energy_fullelect_intEP9nonbonded", scope: !58, file: !57, line: 414, type: !62, scopeLine: 414, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!568 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil36calc_pair_energy_merge_fullelect_intEP9nonbonded", scope: !58, file: !57, line: 415, type: !62, scopeLine: 415, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!569 = !DISubprogram(name: "calc_self_energy_int", linkageName: "_ZN20ComputeNonbondedUtil20calc_self_energy_intEP9nonbonded", scope: !58, file: !57, line: 416, type: !62, scopeLine: 416, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!570 = !DISubprogram(name: "calc_self_energy_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_energy_fullelect_intEP9nonbonded", scope: !58, file: !57, line: 417, type: !62, scopeLine: 417, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!571 = !DISubprogram(name: "calc_self_energy_merge_fullelect_int", linkageName: "_ZN20ComputeNonbondedUtil36calc_self_energy_merge_fullelect_intEP9nonbonded", scope: !58, file: !57, line: 418, type: !62, scopeLine: 418, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!572 = !DISubprogram(name: "calc_pair_pprof", linkageName: "_ZN20ComputeNonbondedUtil15calc_pair_pprofEP9nonbonded", scope: !58, file: !57, line: 421, type: !62, scopeLine: 421, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!573 = !DISubprogram(name: "calc_pair_energy_pprof", linkageName: "_ZN20ComputeNonbondedUtil22calc_pair_energy_pprofEP9nonbonded", scope: !58, file: !57, line: 422, type: !62, scopeLine: 422, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!574 = !DISubprogram(name: "calc_pair_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil25calc_pair_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 423, type: !62, scopeLine: 423, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!575 = !DISubprogram(name: "calc_pair_energy_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_energy_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 424, type: !62, scopeLine: 424, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!576 = !DISubprogram(name: "calc_pair_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil31calc_pair_merge_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 425, type: !62, scopeLine: 425, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!577 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil38calc_pair_energy_merge_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 426, type: !62, scopeLine: 426, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!578 = !DISubprogram(name: "calc_pair_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil30calc_pair_slow_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 427, type: !62, scopeLine: 427, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!579 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil37calc_pair_energy_slow_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 428, type: !62, scopeLine: 428, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!580 = !DISubprogram(name: "calc_self_pprof", linkageName: "_ZN20ComputeNonbondedUtil15calc_self_pprofEP9nonbonded", scope: !58, file: !57, line: 429, type: !62, scopeLine: 429, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!581 = !DISubprogram(name: "calc_self_energy_pprof", linkageName: "_ZN20ComputeNonbondedUtil22calc_self_energy_pprofEP9nonbonded", scope: !58, file: !57, line: 430, type: !62, scopeLine: 430, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!582 = !DISubprogram(name: "calc_self_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil25calc_self_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 431, type: !62, scopeLine: 431, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!583 = !DISubprogram(name: "calc_self_energy_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_energy_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 432, type: !62, scopeLine: 432, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!584 = !DISubprogram(name: "calc_self_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil31calc_self_merge_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 433, type: !62, scopeLine: 433, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!585 = !DISubprogram(name: "calc_self_energy_merge_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil38calc_self_energy_merge_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 434, type: !62, scopeLine: 434, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!586 = !DISubprogram(name: "calc_self_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil30calc_self_slow_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 435, type: !62, scopeLine: 435, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!587 = !DISubprogram(name: "calc_self_energy_slow_fullelect_pprof", linkageName: "_ZN20ComputeNonbondedUtil37calc_self_energy_slow_fullelect_pprofEP9nonbonded", scope: !58, file: !57, line: 436, type: !62, scopeLine: 436, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!588 = !DISubprogram(name: "calc_pair_tabener", linkageName: "_ZN20ComputeNonbondedUtil17calc_pair_tabenerEP9nonbonded", scope: !58, file: !57, line: 439, type: !62, scopeLine: 439, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!589 = !DISubprogram(name: "calc_pair_energy_tabener", linkageName: "_ZN20ComputeNonbondedUtil24calc_pair_energy_tabenerEP9nonbonded", scope: !58, file: !57, line: 440, type: !62, scopeLine: 440, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!590 = !DISubprogram(name: "calc_pair_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil27calc_pair_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 441, type: !62, scopeLine: 441, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!591 = !DISubprogram(name: "calc_pair_energy_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil34calc_pair_energy_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 442, type: !62, scopeLine: 442, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!592 = !DISubprogram(name: "calc_pair_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil33calc_pair_merge_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 443, type: !62, scopeLine: 443, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!593 = !DISubprogram(name: "calc_pair_energy_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil40calc_pair_energy_merge_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 444, type: !62, scopeLine: 444, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!594 = !DISubprogram(name: "calc_pair_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil32calc_pair_slow_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 445, type: !62, scopeLine: 445, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!595 = !DISubprogram(name: "calc_pair_energy_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil39calc_pair_energy_slow_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 446, type: !62, scopeLine: 446, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!596 = !DISubprogram(name: "calc_self_tabener", linkageName: "_ZN20ComputeNonbondedUtil17calc_self_tabenerEP9nonbonded", scope: !58, file: !57, line: 447, type: !62, scopeLine: 447, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!597 = !DISubprogram(name: "calc_self_energy_tabener", linkageName: "_ZN20ComputeNonbondedUtil24calc_self_energy_tabenerEP9nonbonded", scope: !58, file: !57, line: 448, type: !62, scopeLine: 448, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!598 = !DISubprogram(name: "calc_self_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil27calc_self_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 449, type: !62, scopeLine: 449, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!599 = !DISubprogram(name: "calc_self_energy_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil34calc_self_energy_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 450, type: !62, scopeLine: 450, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!600 = !DISubprogram(name: "calc_self_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil33calc_self_merge_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 451, type: !62, scopeLine: 451, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!601 = !DISubprogram(name: "calc_self_energy_merge_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil40calc_self_energy_merge_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 452, type: !62, scopeLine: 452, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!602 = !DISubprogram(name: "calc_self_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil32calc_self_slow_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 453, type: !62, scopeLine: 453, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!603 = !DISubprogram(name: "calc_self_energy_slow_fullelect_tabener", linkageName: "_ZN20ComputeNonbondedUtil39calc_self_energy_slow_fullelect_tabenerEP9nonbonded", scope: !58, file: !57, line: 454, type: !62, scopeLine: 454, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!604 = !DISubprogram(name: "calcGBIS", linkageName: "_ZN20ComputeNonbondedUtil8calcGBISEP9nonbondedP15GBISParamStruct", scope: !58, file: !57, line: 456, type: !605, scopeLine: 456, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !202, !64, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "GBISParamStruct", file: !57, line: 138, flags: DIFlagFwdDecl, identifier: "_ZTS15GBISParamStruct")
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "cutoff", linkageName: "_ZN20ComputeNonbondedUtil6cutoffE", scope: !30, file: !31, line: 35, type: !83, isLocal: false, isDefinition: true, declaration: !82)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "cutoff2", linkageName: "_ZN20ComputeNonbondedUtil7cutoff2E", scope: !30, file: !31, line: 36, type: !83, isLocal: false, isDefinition: true, declaration: !84)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "pairlistdist", linkageName: "_ZN20ComputeNonbondedUtil12pairlistdistE", scope: !30, file: !31, line: 37, type: !83, isLocal: false, isDefinition: true, declaration: !85)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "hgroupcutoff", linkageName: "_ZN20ComputeNonbondedUtil12hgroupcutoffE", scope: !30, file: !31, line: 38, type: !83, isLocal: false, isDefinition: true, declaration: !86)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "dielectric_1", linkageName: "_ZN20ComputeNonbondedUtil12dielectric_1E", scope: !30, file: !31, line: 39, type: !83, isLocal: false, isDefinition: true, declaration: !87)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "ljTable", linkageName: "_ZN20ComputeNonbondedUtil7ljTableE", scope: !30, file: !31, line: 40, type: !89, isLocal: false, isDefinition: true, declaration: !88)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "mol", linkageName: "_ZN20ComputeNonbondedUtil3molE", scope: !30, file: !31, line: 41, type: !132, isLocal: false, isDefinition: true, declaration: !131)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "r2_delta", linkageName: "_ZN20ComputeNonbondedUtil8r2_deltaE", scope: !30, file: !31, line: 42, type: !83, isLocal: false, isDefinition: true, declaration: !136)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "r2_delta_1", linkageName: "_ZN20ComputeNonbondedUtil10r2_delta_1E", scope: !30, file: !31, line: 43, type: !83, isLocal: false, isDefinition: true, declaration: !137)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "r2_delta_exp", linkageName: "_ZN20ComputeNonbondedUtil12r2_delta_expE", scope: !30, file: !31, line: 44, type: !11, isLocal: false, isDefinition: true, declaration: !140)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "rowsize", linkageName: "_ZN20ComputeNonbondedUtil7rowsizeE", scope: !30, file: !31, line: 45, type: !11, isLocal: false, isDefinition: true, declaration: !138)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "columnsize", linkageName: "_ZN20ComputeNonbondedUtil10columnsizeE", scope: !30, file: !31, line: 46, type: !11, isLocal: false, isDefinition: true, declaration: !139)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "table_alloc", linkageName: "_ZN20ComputeNonbondedUtil11table_allocE", scope: !30, file: !31, line: 47, type: !142, isLocal: false, isDefinition: true, declaration: !141)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "table_ener", linkageName: "_ZN20ComputeNonbondedUtil10table_enerE", scope: !30, file: !31, line: 48, type: !142, isLocal: false, isDefinition: true, declaration: !143)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "table_short", linkageName: "_ZN20ComputeNonbondedUtil11table_shortE", scope: !30, file: !31, line: 49, type: !142, isLocal: false, isDefinition: true, declaration: !144)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "table_noshort", linkageName: "_ZN20ComputeNonbondedUtil13table_noshortE", scope: !30, file: !31, line: 50, type: !142, isLocal: false, isDefinition: true, declaration: !145)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "fast_table", linkageName: "_ZN20ComputeNonbondedUtil10fast_tableE", scope: !30, file: !31, line: 51, type: !142, isLocal: false, isDefinition: true, declaration: !146)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "scor_table", linkageName: "_ZN20ComputeNonbondedUtil10scor_tableE", scope: !30, file: !31, line: 52, type: !142, isLocal: false, isDefinition: true, declaration: !147)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "slow_table", linkageName: "_ZN20ComputeNonbondedUtil10slow_tableE", scope: !30, file: !31, line: 53, type: !142, isLocal: false, isDefinition: true, declaration: !148)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "corr_table", linkageName: "_ZN20ComputeNonbondedUtil10corr_tableE", scope: !30, file: !31, line: 54, type: !142, isLocal: false, isDefinition: true, declaration: !149)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "full_table", linkageName: "_ZN20ComputeNonbondedUtil10full_tableE", scope: !30, file: !31, line: 55, type: !142, isLocal: false, isDefinition: true, declaration: !150)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "vdwa_table", linkageName: "_ZN20ComputeNonbondedUtil10vdwa_tableE", scope: !30, file: !31, line: 56, type: !142, isLocal: false, isDefinition: true, declaration: !151)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "vdwb_table", linkageName: "_ZN20ComputeNonbondedUtil10vdwb_tableE", scope: !30, file: !31, line: 57, type: !142, isLocal: false, isDefinition: true, declaration: !152)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "r2_table", linkageName: "_ZN20ComputeNonbondedUtil8r2_tableE", scope: !30, file: !31, line: 58, type: !142, isLocal: false, isDefinition: true, declaration: !153)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "scaling", linkageName: "_ZN20ComputeNonbondedUtil7scalingE", scope: !30, file: !31, line: 59, type: !83, isLocal: false, isDefinition: true, declaration: !154)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "scale14", linkageName: "_ZN20ComputeNonbondedUtil7scale14E", scope: !30, file: !31, line: 60, type: !83, isLocal: false, isDefinition: true, declaration: !155)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "switchOn", linkageName: "_ZN20ComputeNonbondedUtil8switchOnE", scope: !30, file: !31, line: 61, type: !83, isLocal: false, isDefinition: true, declaration: !156)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "switchOn_1", linkageName: "_ZN20ComputeNonbondedUtil10switchOn_1E", scope: !30, file: !31, line: 62, type: !83, isLocal: false, isDefinition: true, declaration: !157)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "switchOn2", linkageName: "_ZN20ComputeNonbondedUtil9switchOn2E", scope: !30, file: !31, line: 63, type: !83, isLocal: false, isDefinition: true, declaration: !158)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "v_vdwa", linkageName: "_ZN20ComputeNonbondedUtil6v_vdwaE", scope: !30, file: !31, line: 64, type: !83, isLocal: false, isDefinition: true, declaration: !159)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "v_vdwb", linkageName: "_ZN20ComputeNonbondedUtil6v_vdwbE", scope: !30, file: !31, line: 65, type: !83, isLocal: false, isDefinition: true, declaration: !160)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "k_vdwa", linkageName: "_ZN20ComputeNonbondedUtil6k_vdwaE", scope: !30, file: !31, line: 66, type: !83, isLocal: false, isDefinition: true, declaration: !161)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "k_vdwb", linkageName: "_ZN20ComputeNonbondedUtil6k_vdwbE", scope: !30, file: !31, line: 67, type: !83, isLocal: false, isDefinition: true, declaration: !162)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "cutoff_3", linkageName: "_ZN20ComputeNonbondedUtil8cutoff_3E", scope: !30, file: !31, line: 68, type: !83, isLocal: false, isDefinition: true, declaration: !163)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "cutoff_6", linkageName: "_ZN20ComputeNonbondedUtil8cutoff_6E", scope: !30, file: !31, line: 69, type: !83, isLocal: false, isDefinition: true, declaration: !164)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "c0", linkageName: "_ZN20ComputeNonbondedUtil2c0E", scope: !30, file: !31, line: 70, type: !83, isLocal: false, isDefinition: true, declaration: !165)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "c1", linkageName: "_ZN20ComputeNonbondedUtil2c1E", scope: !30, file: !31, line: 71, type: !83, isLocal: false, isDefinition: true, declaration: !166)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "c3", linkageName: "_ZN20ComputeNonbondedUtil2c3E", scope: !30, file: !31, line: 72, type: !83, isLocal: false, isDefinition: true, declaration: !167)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "c5", linkageName: "_ZN20ComputeNonbondedUtil2c5E", scope: !30, file: !31, line: 73, type: !83, isLocal: false, isDefinition: true, declaration: !168)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "c6", linkageName: "_ZN20ComputeNonbondedUtil2c6E", scope: !30, file: !31, line: 74, type: !83, isLocal: false, isDefinition: true, declaration: !169)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "c7", linkageName: "_ZN20ComputeNonbondedUtil2c7E", scope: !30, file: !31, line: 75, type: !83, isLocal: false, isDefinition: true, declaration: !170)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "c8", linkageName: "_ZN20ComputeNonbondedUtil2c8E", scope: !30, file: !31, line: 76, type: !83, isLocal: false, isDefinition: true, declaration: !171)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "alchFepOn", linkageName: "_ZN20ComputeNonbondedUtil9alchFepOnE", scope: !30, file: !31, line: 79, type: !54, isLocal: false, isDefinition: true, declaration: !172)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "alchThermIntOn", linkageName: "_ZN20ComputeNonbondedUtil14alchThermIntOnE", scope: !30, file: !31, line: 80, type: !54, isLocal: false, isDefinition: true, declaration: !173)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "Fep_WCA_repuOn", linkageName: "_ZN20ComputeNonbondedUtil14Fep_WCA_repuOnE", scope: !30, file: !31, line: 81, type: !54, isLocal: false, isDefinition: true, declaration: !179)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "Fep_WCA_dispOn", linkageName: "_ZN20ComputeNonbondedUtil14Fep_WCA_dispOnE", scope: !30, file: !31, line: 82, type: !54, isLocal: false, isDefinition: true, declaration: !180)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "WCA_rcut1", linkageName: "_ZN20ComputeNonbondedUtil9WCA_rcut1E", scope: !30, file: !31, line: 83, type: !83, isLocal: false, isDefinition: true, declaration: !181)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "WCA_rcut2", linkageName: "_ZN20ComputeNonbondedUtil9WCA_rcut2E", scope: !30, file: !31, line: 84, type: !83, isLocal: false, isDefinition: true, declaration: !182)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "alchLambda", linkageName: "_ZN20ComputeNonbondedUtil10alchLambdaE", scope: !30, file: !31, line: 85, type: !83, isLocal: false, isDefinition: true, declaration: !174)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "alchLambda2", linkageName: "_ZN20ComputeNonbondedUtil11alchLambda2E", scope: !30, file: !31, line: 86, type: !83, isLocal: false, isDefinition: true, declaration: !175)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "alchVdwShiftCoeff", linkageName: "_ZN20ComputeNonbondedUtil17alchVdwShiftCoeffE", scope: !30, file: !31, line: 87, type: !83, isLocal: false, isDefinition: true, declaration: !176)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "alchVdwLambdaEnd", linkageName: "_ZN20ComputeNonbondedUtil16alchVdwLambdaEndE", scope: !30, file: !31, line: 88, type: !83, isLocal: false, isDefinition: true, declaration: !178)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "alchElecLambdaStart", linkageName: "_ZN20ComputeNonbondedUtil19alchElecLambdaStartE", scope: !30, file: !31, line: 89, type: !83, isLocal: false, isDefinition: true, declaration: !177)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "alchDecouple", linkageName: "_ZN20ComputeNonbondedUtil12alchDecoupleE", scope: !30, file: !31, line: 90, type: !54, isLocal: false, isDefinition: true, declaration: !183)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "lesOn", linkageName: "_ZN20ComputeNonbondedUtil5lesOnE", scope: !30, file: !31, line: 92, type: !54, isLocal: false, isDefinition: true, declaration: !184)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
