; ModuleID = 'PatchList.C'
source_filename = "PatchList.C"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%class.PatchList = type { i32, i32, i32, i32, i32, %class.Patch*, %class.Lattice*, double* }
%class.Patch = type <{ i32, [4 x i8], %struct.CompAtom*, %struct.CompAtomExt*, %class.Vector*, %class.Vector*, %class.Vector*, i32, [4 x i8] }>
%struct.CompAtom = type { %class.Vector, float, i16, i8, i8 }
%class.Vector = type { double, double, double }
%struct.CompAtomExt = type { i32 }
%class.Lattice = type opaque
%class.ResultSet = type { i32, i32, i32, i32, %class.Vector*, %class.Vector*, [21 x double], %class.Vector, %class.Vector, %class.Vector, double, double, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%class.Molecule = type opaque

$_ZN6VectoraSERKd = comdat any

$_ZplRK6VectorS1_ = comdat any

$_ZN6VectorpLERKS_ = comdat any

$_ZNK6Vector7length2Ev = comdat any

$_ZN6VectorC2Eddd = comdat any

@.str = private unnamed_addr constant [17 x i8] c"PATCHLIST_BEGIN\0A\00", align 1

!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!410 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !400, file: !401, line: 86, type: !411, scopeLine: 86, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !409}
!413 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !400, file: !401, line: 87, type: !411, scopeLine: 87, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !400, file: !401, line: 89, type: !415, scopeLine: 89, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!405, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!419 = !DISubprogram(name: "exception_ptr", scope: !400, file: !401, line: 97, type: !411, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!420 = !DISubprogram(name: "exception_ptr", scope: !400, file: !401, line: 99, type: !421, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !409, !423}
!423 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !418, size: 64)
!424 = !DISubprogram(name: "exception_ptr", scope: !400, file: !401, line: 102, type: !425, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !409, !427}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !42, file: !428, line: 264, baseType: !429)
!428 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h", directory: "")
!429 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!430 = !DISubprogram(name: "exception_ptr", scope: !400, file: !401, line: 106, type: !431, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !409, !433}
!433 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !400, size: 64)
!434 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !400, file: !401, line: 119, type: !435, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !409, !423}
!437 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !400, size: 64)
!438 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !400, file: !401, line: 123, type: !439, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!437, !409, !433}
!441 = !DISubprogram(name: "~exception_ptr", scope: !400, file: !401, line: 130, type: !411, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!442 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !400, file: !401, line: 133, type: !443, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !409, !437}
!445 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !400, file: !401, line: 145, type: !446, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !417}
!448 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!449 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !400, file: !401, line: 154, type: !450, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !417}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !42, file: !455, line: 88, flags: DIFlagFwdDecl)
!455 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/typeinfo", directory: "")
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !402, entity: !457, file: !401, line: 74)
!457 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !42, file: !401, line: 70, type: !458, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !400}
!460 = !{i32 7, !"Dwarf Version", i32 4}
!461 = !{i32 2, !"Debug Info Version", i32 3}
!462 = !{i32 1, !"wchar_size", i32 4}
!463 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!464 = distinct !DISubprogram(name: "PatchList", linkageName: "_ZN9PatchListC2ER7Lattice", scope: !465, file: !1, line: 13, type: !603, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !602, retainedNodes: !656)
!465 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "PatchList", file: !466, line: 16, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !467, identifier: "_ZTS9PatchList")
!466 = !DIFile(filename: "./PatchList.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !470, !471, !472, !473, !598, !601, !602, !606, !609, !612, !613, !614}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "doEnergy", scope: !465, file: !466, line: 19, baseType: !47, size: 32, flags: DIFlagPublic)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "doFull", scope: !465, file: !466, line: 20, baseType: !47, size: 32, offset: 32, flags: DIFlagPublic)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "doMerge", scope: !465, file: !466, line: 21, baseType: !47, size: 32, offset: 64, flags: DIFlagPublic)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "savePairlists", scope: !465, file: !466, line: 22, baseType: !47, size: 32, offset: 96, flags: DIFlagPublic)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "numPatches", scope: !465, file: !466, line: 24, baseType: !47, size: 32, offset: 128, flags: DIFlagPublic)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "patches", scope: !465, file: !466, line: 26, baseType: !474, size: 64, offset: 192, flags: DIFlagPublic)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Patch", file: !476, line: 16, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !477, identifier: "_ZTS5Patch")
!476 = !DIFile(filename: "./Patch.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!477 = !{!478, !479, !566, !573, !575, !576, !577, !578, !582, !585, !586, !587, !588}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "numAtoms", scope: !475, file: !476, line: 19, baseType: !47, size: 32, flags: DIFlagPublic)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !475, file: !476, line: 21, baseType: !480, size: 64, offset: 64, flags: DIFlagPublic)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CompAtom", file: !482, line: 50, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !483, identifier: "_ZTS8CompAtom")
!482 = !DIFile(filename: "./NamdTypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!483 = !{!484, !557, !559, !561, !563, !564, !565}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !481, file: !482, line: 51, baseType: !485, size: 192)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "Position", file: !482, line: 18, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector", file: !487, line: 24, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !488, identifier: "_ZTS6Vector")
!487 = !DIFile(filename: "./Vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!488 = !{!489, !492, !493, !494, !498, !501, !504, !523, !527, !533, !536, !537, !540, !541, !545, !546, !549, !550, !553}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !486, file: !487, line: 26, baseType: !490, size: 64, flags: DIFlagPublic)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "BigReal", file: !491, line: 65, baseType: !54)
!491 = !DIFile(filename: "./common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !486, file: !487, line: 26, baseType: !490, size: 64, offset: 64, flags: DIFlagPublic)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !486, file: !487, line: 26, baseType: !490, size: 64, offset: 128, flags: DIFlagPublic)
!494 = !DISubprogram(name: "Vector", scope: !486, file: !487, line: 28, type: !495, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!498 = !DISubprogram(name: "Vector", scope: !486, file: !487, line: 31, type: !499, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !497, !490, !490, !490}
!501 = !DISubprogram(name: "Vector", scope: !486, file: !487, line: 34, type: !502, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !497, !490}
!504 = !DISubprogram(name: "Vector", scope: !486, file: !487, line: 37, type: !505, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !497, !507}
!507 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FloatVector", file: !487, line: 16, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !510, identifier: "_ZTS11FloatVector")
!510 = !{!511, !512, !513, !514, !518}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !509, file: !487, line: 18, baseType: !113, size: 32, flags: DIFlagPublic)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !509, file: !487, line: 18, baseType: !113, size: 32, offset: 32, flags: DIFlagPublic)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !509, file: !487, line: 18, baseType: !113, size: 32, offset: 64, flags: DIFlagPublic)
!514 = !DISubprogram(name: "FloatVector", scope: !509, file: !487, line: 19, type: !515, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!518 = !DISubprogram(name: "FloatVector", scope: !509, file: !487, line: 20, type: !519, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !517, !521}
!521 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!523 = !DISubprogram(name: "operator[]", linkageName: "_ZN6VectorixEi", scope: !486, file: !487, line: 39, type: !524, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{!526, !497, !47}
!526 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !490, size: 64)
!527 = !DISubprogram(name: "operator=", linkageName: "_ZN6VectoraSERKd", scope: !486, file: !487, line: 48, type: !528, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !497, !531}
!530 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !486, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!533 = !DISubprogram(name: "operator+=", linkageName: "_ZN6VectorpLERKS_", scope: !486, file: !487, line: 56, type: !534, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !497, !521}
!536 = !DISubprogram(name: "operator-=", linkageName: "_ZN6VectormIERKS_", scope: !486, file: !487, line: 63, type: !534, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!537 = !DISubprogram(name: "operator*=", linkageName: "_ZN6VectormLERKd", scope: !486, file: !487, line: 70, type: !538, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !497, !531}
!540 = !DISubprogram(name: "operator/=", linkageName: "_ZN6VectordVERKd", scope: !486, file: !487, line: 77, type: !538, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubprogram(name: "length", linkageName: "_ZNK6Vector6lengthEv", scope: !486, file: !487, line: 125, type: !542, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!542 = !DISubroutineType(types: !543)
!543 = !{!490, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DISubprogram(name: "length2", linkageName: "_ZNK6Vector7length2Ev", scope: !486, file: !487, line: 129, type: !542, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!546 = !DISubprogram(name: "unit", linkageName: "_ZNK6Vector4unitEv", scope: !486, file: !487, line: 134, type: !547, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!486, !544}
!549 = !DISubprogram(name: "cross", linkageName: "_ZN6Vector5crossERKS_", scope: !486, file: !487, line: 164, type: !534, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!550 = !DISubprogram(name: "dot", linkageName: "_ZN6Vector3dotERKS_", scope: !486, file: !487, line: 174, type: !551, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!490, !497, !521}
!553 = !DISubprogram(name: "set", linkageName: "_ZN6Vector3setEPKc", scope: !486, file: !487, line: 180, type: !554, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !497, !291}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !491, line: 83, baseType: !47)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "charge", scope: !481, file: !482, line: 52, baseType: !558, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Charge", file: !482, line: 30, baseType: !113)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vdwType", scope: !481, file: !482, line: 53, baseType: !560, size: 16, offset: 224)
!560 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !481, file: !482, line: 54, baseType: !562, size: 8, offset: 240)
!562 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nonbondedGroupSize", scope: !481, file: !482, line: 55, baseType: !5, size: 3, offset: 248, flags: DIFlagBitField, extraData: i64 248)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hydrogenGroupSize", scope: !481, file: !482, line: 56, baseType: !5, size: 4, offset: 251, flags: DIFlagBitField, extraData: i64 248)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "isWater", scope: !481, file: !482, line: 57, baseType: !5, size: 1, offset: 255, flags: DIFlagBitField, extraData: i64 248)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atomsExt", scope: !475, file: !476, line: 22, baseType: !567, size: 64, offset: 128, flags: DIFlagPublic)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CompAtomExt", file: !482, line: 76, size: 32, flags: DIFlagTypePassByValue, elements: !569, identifier: "_ZTS11CompAtomExt")
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !482, line: 84, baseType: !47, size: 30, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atomFixed", scope: !568, file: !482, line: 85, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "groupFixed", scope: !568, file: !482, line: 86, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "f_nbond", scope: !475, file: !476, line: 24, baseType: !574, size: 64, offset: 192, flags: DIFlagPublic)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "f_slow", scope: !475, file: !476, line: 25, baseType: !574, size: 64, offset: 256, flags: DIFlagPublic)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "p_orig", scope: !475, file: !476, line: 26, baseType: !574, size: 64, offset: 320, flags: DIFlagPublic)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_move", scope: !475, file: !476, line: 31, baseType: !47, size: 32, offset: 384, flags: DIFlagPublic)
!578 = !DISubprogram(name: "zeroforces", linkageName: "_ZN5Patch10zeroforcesEv", scope: !475, file: !476, line: 28, type: !579, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!582 = !DISubprogram(name: "setforces", linkageName: "_ZN5Patch9setforcesEP6VectorS1_", scope: !475, file: !476, line: 29, type: !583, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !581, !574, !574}
!585 = !DISubprogram(name: "moveatoms", linkageName: "_ZN5Patch9moveatomsEv", scope: !475, file: !476, line: 32, type: !579, scopeLine: 32, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubprogram(name: "Patch", scope: !475, file: !476, line: 34, type: !579, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubprogram(name: "~Patch", scope: !475, file: !476, line: 35, type: !579, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubprogram(name: "readfile", linkageName: "_ZN5Patch8readfileEP8_IO_FILEP8Molecule", scope: !475, file: !476, line: 37, type: !589, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!47, !581, !591, !596}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !593, line: 7, baseType: !594)
!593 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !595, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_class_type, name: "Molecule", file: !476, line: 13, flags: DIFlagFwdDecl, identifier: "_ZTS8Molecule")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lattice", scope: !465, file: !466, line: 33, baseType: !599, size: 64, offset: 256, flags: DIFlagPublic)
!599 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_class_type, name: "Lattice", file: !476, line: 14, flags: DIFlagFwdDecl, identifier: "_ZTS7Lattice")
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reductionData", scope: !465, file: !466, line: 39, baseType: !95, size: 64, offset: 320, flags: DIFlagPublic)
!602 = !DISubprogram(name: "PatchList", scope: !465, file: !466, line: 28, type: !603, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !605, !599}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!606 = !DISubprogram(name: "~PatchList", scope: !465, file: !466, line: 29, type: !607, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !605}
!609 = !DISubprogram(name: "readfile", linkageName: "_ZN9PatchList8readfileEP8_IO_FILEP8Molecule", scope: !465, file: !466, line: 31, type: !610, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!47, !605, !591, !596}
!612 = !DISubprogram(name: "zeroresults", linkageName: "_ZN9PatchList11zeroresultsEv", scope: !465, file: !466, line: 35, type: !607, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!613 = !DISubprogram(name: "moveatoms", linkageName: "_ZN9PatchList9moveatomsEv", scope: !465, file: !466, line: 37, type: !607, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!614 = !DISubprogram(name: "setresults", linkageName: "_ZN9PatchList10setresultsEP9ResultSet", scope: !465, file: !466, line: 41, type: !615, scopeLine: 41, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !605, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ResultSet", file: !619, line: 8, size: 2368, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !620, identifier: "_ZTS9ResultSet")
!619 = !DIFile(filename: "./ResultSet.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/508.namd_r/build/build_base_ld-loop-ext-m64.0000")
!620 = !{!621, !622, !623, !624, !625, !626, !627, !631, !632, !633, !634, !635, !636, !637, !641, !644, !647, !650, !651, !655}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "numAtoms", scope: !618, file: !619, line: 10, baseType: !47, size: 32, flags: DIFlagPublic)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "doEnergy", scope: !618, file: !619, line: 10, baseType: !47, size: 32, offset: 32, flags: DIFlagPublic)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "doFull", scope: !618, file: !619, line: 10, baseType: !47, size: 32, offset: 64, flags: DIFlagPublic)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "doMerge", scope: !618, file: !619, line: 10, baseType: !47, size: 32, offset: 96, flags: DIFlagPublic)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "f_nbond", scope: !618, file: !619, line: 11, baseType: !574, size: 64, offset: 128, flags: DIFlagPublic)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "f_slow", scope: !618, file: !619, line: 12, baseType: !574, size: 64, offset: 192, flags: DIFlagPublic)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reductions", scope: !618, file: !619, line: 13, baseType: !628, size: 1344, offset: 256, flags: DIFlagPublic)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1344, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 21)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "netf_nbond", scope: !618, file: !619, line: 14, baseType: !486, size: 192, offset: 1600, flags: DIFlagPublic)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "netf_slow", scope: !618, file: !619, line: 15, baseType: !486, size: 192, offset: 1792, flags: DIFlagPublic)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "netf_both", scope: !618, file: !619, line: 16, baseType: !486, size: 192, offset: 1984, flags: DIFlagPublic)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rmsf_nbond", scope: !618, file: !619, line: 17, baseType: !54, size: 64, offset: 2176, flags: DIFlagPublic)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rmsf_slow", scope: !618, file: !619, line: 18, baseType: !54, size: 64, offset: 2240, flags: DIFlagPublic)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rmsf_both", scope: !618, file: !619, line: 19, baseType: !54, size: 64, offset: 2304, flags: DIFlagPublic)
!637 = !DISubprogram(name: "ResultSet", scope: !618, file: !619, line: 21, type: !638, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640, !47}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!641 = !DISubprogram(name: "~ResultSet", scope: !618, file: !619, line: 27, type: !642, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !640}
!644 = !DISubprogram(name: "writefile", linkageName: "_ZN9ResultSet9writefileEP8_IO_FILE", scope: !618, file: !619, line: 32, type: !645, scopeLine: 32, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !640, !591}
!647 = !DISubprogram(name: "readfile", linkageName: "_ZN9ResultSet8readfileEP8_IO_FILE", scope: !618, file: !619, line: 33, type: !648, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!47, !640, !591}
!650 = !DISubprogram(name: "check", linkageName: "_ZN9ResultSet5checkEv", scope: !618, file: !619, line: 35, type: !642, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!651 = !DISubprogram(name: "samemode", linkageName: "_ZN9ResultSet8samemodeERS_", scope: !618, file: !619, line: 36, type: !652, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !640, !654}
!654 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !618, size: 64)
!655 = !DISubprogram(name: "compare", linkageName: "_ZN9ResultSet7compareERS_", scope: !618, file: !619, line: 37, type: !652, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!656 = !{}
!657 = !DILocalVariable(name: "this", arg: 1, scope: !464, type: !658, flags: DIFlagArtificial | DIFlagObjectPointer)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!659 = !DILocation(line: 0, scope: !464)
!660 = !DILocalVariable(name: "l", arg: 2, scope: !464, file: !1, line: 13, type: !599)
!661 = !DILocation(line: 13, column: 31, scope: !464)
!662 = !DILocation(line: 13, column: 36, scope: !464)
!663 = !DILocation(line: 13, column: 44, scope: !464)
!664 = !DILocation(line: 14, column: 3, scope: !665)
!665 = distinct !DILexicalBlock(scope: !464, file: !1, line: 13, column: 47)
!666 = !DILocation(line: 14, column: 14, scope: !665)
!667 = !DILocation(line: 15, column: 3, scope: !665)
!668 = !DILocation(line: 15, column: 11, scope: !665)
!669 = !DILocation(line: 16, column: 19, scope: !665)
!670 = !DILocation(line: 16, column: 3, scope: !665)
!671 = !DILocation(line: 16, column: 17, scope: !665)
!672 = !DILocation(line: 17, column: 23, scope: !665)
!673 = !DILocation(line: 17, column: 31, scope: !665)
!674 = !DILocation(line: 17, column: 14, scope: !665)
!675 = !DILocation(line: 17, column: 21, scope: !665)
!676 = !DILocation(line: 17, column: 3, scope: !665)
!677 = !DILocation(line: 17, column: 12, scope: !665)
!678 = !DILocation(line: 18, column: 1, scope: !464)
!679 = distinct !DISubprogram(name: "~PatchList", linkageName: "_ZN9PatchListD2Ev", scope: !465, file: !1, line: 20, type: !607, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !606, retainedNodes: !656)
!680 = !DILocalVariable(name: "this", arg: 1, scope: !679, type: !658, flags: DIFlagArtificial | DIFlagObjectPointer)
!681 = !DILocation(line: 0, scope: !679)
!682 = !DILocation(line: 21, column: 13, scope: !683)
!683 = distinct !DILexicalBlock(scope: !679, file: !1, line: 20, column: 25)
!684 = !DILocation(line: 21, column: 3, scope: !683)
!685 = !DILocation(line: 22, column: 13, scope: !683)
!686 = !DILocation(line: 22, column: 3, scope: !683)
