; ModuleID = 'bezier.cpp'
source_filename = "bezier.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Bicubic_Patch_Methods", linkageName: "_ZN3povL21Bicubic_Patch_MethodsE", scope: !2, file: !3, line: 102, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "bezier.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !288, globals: !351, imports: !357, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !155, !161}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !56, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!158 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !162, line: 149, baseType: !56, size: 32, elements: !163, identifier: "_ZTSN3pov5STATSE")
!162 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!164 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!165 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!166 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!167 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!168 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!169 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!170 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!171 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!178 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!179 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!180 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!181 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!214 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!215 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!224 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!225 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!242 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!243 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!246 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!247 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!252 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!253 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!254 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!255 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!259 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!260 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!261 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!262 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!263 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!264 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!265 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!266 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!267 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!268 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!269 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!270 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!271 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!272 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!273 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!274 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!275 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!276 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!277 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!278 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!279 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!280 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!281 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!282 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!283 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!284 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!285 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!286 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!287 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!288 = !{!289, !293, !64, !104, !324, !337, !345, !14, !334, !44}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 3072, elements: !291)
!291 = !{!292, !292}
!292 = !DISubrange(count: 4)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "BICUBIC_PATCH", scope: !2, file: !295, line: 59, baseType: !296)
!295 = !DIFile(filename: "./bezier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bicubic_Patch_Struct", scope: !2, file: !295, line: 84, size: 5184, flags: DIFlagTypePassByValue, elements: !297, identifier: "_ZTSN3pov20Bicubic_Patch_StructE")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !319, !320, !321, !322, !323, !333}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !296, file: !295, line: 86, baseType: !19, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !296, file: !295, line: 86, baseType: !13, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !296, file: !295, line: 86, baseType: !14, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !296, file: !295, line: 86, baseType: !23, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !296, file: !295, line: 86, baseType: !23, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !296, file: !295, line: 86, baseType: !28, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !296, file: !295, line: 86, baseType: !14, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !296, file: !295, line: 86, baseType: !14, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !296, file: !295, line: 86, baseType: !34, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !296, file: !295, line: 86, baseType: !38, size: 192, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !296, file: !295, line: 86, baseType: !50, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !296, file: !295, line: 86, baseType: !50, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !296, file: !295, line: 86, baseType: !45, size: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !296, file: !295, line: 86, baseType: !56, size: 32, offset: 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Patch_Type", scope: !296, file: !295, line: 87, baseType: !13, size: 32, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "U_Steps", scope: !296, file: !295, line: 87, baseType: !13, size: 32, offset: 992)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "V_Steps", scope: !296, file: !295, line: 87, baseType: !13, size: 32, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Control_Points", scope: !296, file: !295, line: 88, baseType: !290, size: 3072, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ST", scope: !296, file: !295, line: 89, baseType: !317, size: 512, offset: 4160)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 512, elements: !318)
!318 = !{!292}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Bounding_Sphere_Center", scope: !296, file: !295, line: 90, baseType: !62, size: 192, offset: 4672)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Bounding_Sphere_Radius", scope: !296, file: !295, line: 91, baseType: !64, size: 64, offset: 4864)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Flatness_Value", scope: !296, file: !295, line: 92, baseType: !64, size: 64, offset: 4928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !296, file: !295, line: 93, baseType: !64, size: 64, offset: 4992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Node_Tree", scope: !296, file: !295, line: 95, baseType: !324, size: 64, offset: 5056)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "BEZIER_NODE", scope: !2, file: !295, line: 60, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bezier_Node_Struct", scope: !2, file: !295, line: 75, size: 448, flags: DIFlagTypePassByValue, elements: !327, identifier: "_ZTSN3pov18Bezier_Node_StructE")
!327 = !{!328, !329, !330, !331, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Node_Type", scope: !326, file: !295, line: 77, baseType: !13, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !326, file: !295, line: 78, baseType: !62, size: 192, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Squared", scope: !326, file: !295, line: 79, baseType: !64, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !326, file: !295, line: 80, baseType: !13, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Data_Ptr", scope: !326, file: !295, line: 81, baseType: !104, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Weights", scope: !296, file: !295, line: 96, baseType: !334, size: 64, offset: 5120)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "WEIGHTS", scope: !2, file: !295, line: 58, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !291)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "BEZIER_VERTICES", scope: !2, file: !295, line: 62, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bezier_Vertices_Struct", scope: !2, file: !295, line: 69, size: 896, flags: DIFlagTypePassByValue, elements: !340, identifier: "_ZTSN3pov22Bezier_Vertices_StructE")
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uvbnds", scope: !339, file: !295, line: 71, baseType: !342, size: 128)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !318)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Vertices", scope: !339, file: !295, line: 72, baseType: !344, size: 768, offset: 128)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, elements: !318)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BEZIER_CHILDREN", scope: !2, file: !295, line: 61, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bezier_Child_Struct", scope: !2, file: !295, line: 64, size: 256, flags: DIFlagTypePassByValue, elements: !348, identifier: "_ZTSN3pov19Bezier_Child_StructE")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !347, file: !295, line: 66, baseType: !350, size: 256)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 256, elements: !318)
!351 = !{!352, !0, !355}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_constu, 4457293557087583675, DW_OP_stack_value))
!353 = distinct !DIGlobalVariable(name: "BEZIER_EPSILON", scope: !2, file: !3, line: 50, type: !354, isLocal: true, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression(DW_OP_constu, 4532020583610935537, DW_OP_stack_value))
!356 = distinct !DIGlobalVariable(name: "BEZIER_TOLERANCE", scope: !2, file: !3, line: 51, type: !354, isLocal: true, isDefinition: true)
!357 = !{!358, !365, !371, !373, !375, !379, !381, !383, !385, !387, !389, !391, !393, !398, !402, !404, !406, !410, !412, !414, !416, !418, !420, !422, !425, !427, !429, !433, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !462, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !500, !504, !508, !510, !512, !514, !516, !518, !520, !522, !524, !526, !530, !534, !538, !540, !542, !544, !549, !553, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !586, !590, !594, !596, !598, !600, !607, !611, !615, !617, !619, !621, !623, !625, !627, !631, !635, !637, !639, !641, !643, !647, !651, !655, !657, !659, !661, !663, !665, !667, !671, !675, !679, !681, !685, !689, !691, !693, !695, !697, !699, !701, !707, !712, !716, !722, !726, !731, !733, !735, !739, !743, !756, !760, !764, !768, !772, !777, !781, !785, !789, !793, !801, !805, !809, !811, !815, !819, !823, !829, !833, !837, !839, !847, !851, !858, !860, !864, !868, !872, !876, !881, !885, !889, !890, !891, !892, !894, !895, !896, !897, !898, !899, !900, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !959, !961, !963, !969, !973, !979, !983, !987, !991, !995, !997, !999, !1003, !1007, !1011, !1015, !1019, !1021, !1023, !1025, !1029, !1033, !1037, !1039, !1041, !1044, !1046, !1047, !1049, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1075, !1076, !1077, !1081, !1137, !1141}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !360, file: !364, line: 52)
!359 = !DINamespace(name: "std", scope: null)
!360 = !DISubprogram(name: "abs", scope: !361, file: !361, line: 840, type: !362, flags: DIFlagPrototyped, spFlags: 0)
!361 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!362 = !DISubroutineType(types: !363)
!363 = !{!13, !13}
!364 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !366, file: !370, line: 83)
!366 = !DISubprogram(name: "acos", scope: !367, file: !367, line: 53, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!368 = !DISubroutineType(types: !369)
!369 = !{!64, !64}
!370 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !372, file: !370, line: 102)
!372 = !DISubprogram(name: "asin", scope: !367, file: !367, line: 55, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !374, file: !370, line: 121)
!374 = !DISubprogram(name: "atan", scope: !367, file: !367, line: 57, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !376, file: !370, line: 140)
!376 = !DISubprogram(name: "atan2", scope: !367, file: !367, line: 59, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!64, !64, !64}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !380, file: !370, line: 161)
!380 = !DISubprogram(name: "ceil", scope: !367, file: !367, line: 159, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !382, file: !370, line: 180)
!382 = !DISubprogram(name: "cos", scope: !367, file: !367, line: 62, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !384, file: !370, line: 199)
!384 = !DISubprogram(name: "cosh", scope: !367, file: !367, line: 71, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !386, file: !370, line: 218)
!386 = !DISubprogram(name: "exp", scope: !367, file: !367, line: 95, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !388, file: !370, line: 237)
!388 = !DISubprogram(name: "fabs", scope: !367, file: !367, line: 162, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !390, file: !370, line: 256)
!390 = !DISubprogram(name: "floor", scope: !367, file: !367, line: 165, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !392, file: !370, line: 275)
!392 = !DISubprogram(name: "fmod", scope: !367, file: !367, line: 168, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !394, file: !370, line: 296)
!394 = !DISubprogram(name: "frexp", scope: !367, file: !367, line: 98, type: !395, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{!64, !64, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !399, file: !370, line: 315)
!399 = !DISubprogram(name: "ldexp", scope: !367, file: !367, line: 101, type: !400, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{!64, !64, !13}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !403, file: !370, line: 334)
!403 = !DISubprogram(name: "log", scope: !367, file: !367, line: 104, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !405, file: !370, line: 353)
!405 = !DISubprogram(name: "log10", scope: !367, file: !367, line: 107, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !407, file: !370, line: 372)
!407 = !DISubprogram(name: "modf", scope: !367, file: !367, line: 110, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!64, !64, !113}
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !411, file: !370, line: 384)
!411 = !DISubprogram(name: "pow", scope: !367, file: !367, line: 140, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !413, file: !370, line: 421)
!413 = !DISubprogram(name: "sin", scope: !367, file: !367, line: 64, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !415, file: !370, line: 440)
!415 = !DISubprogram(name: "sinh", scope: !367, file: !367, line: 73, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !417, file: !370, line: 459)
!417 = !DISubprogram(name: "sqrt", scope: !367, file: !367, line: 143, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !419, file: !370, line: 478)
!419 = !DISubprogram(name: "tan", scope: !367, file: !367, line: 66, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !421, file: !370, line: 497)
!421 = !DISubprogram(name: "tanh", scope: !367, file: !367, line: 75, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !423, file: !370, line: 1065)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !424, line: 150, baseType: !64)
!424 = !DIFile(filename: "/usr/include/math.h", directory: "")
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !426, file: !370, line: 1066)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !424, line: 149, baseType: !45)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !428, file: !370, line: 1069)
!428 = !DISubprogram(name: "acosh", scope: !367, file: !367, line: 85, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !430, file: !370, line: 1070)
!430 = !DISubprogram(name: "acoshf", scope: !367, file: !367, line: 85, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{!45, !45}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !434, file: !370, line: 1071)
!434 = !DISubprogram(name: "acoshl", scope: !367, file: !367, line: 85, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !437}
!437 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !439, file: !370, line: 1073)
!439 = !DISubprogram(name: "asinh", scope: !367, file: !367, line: 87, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !441, file: !370, line: 1074)
!441 = !DISubprogram(name: "asinhf", scope: !367, file: !367, line: 87, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !443, file: !370, line: 1075)
!443 = !DISubprogram(name: "asinhl", scope: !367, file: !367, line: 87, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !445, file: !370, line: 1077)
!445 = !DISubprogram(name: "atanh", scope: !367, file: !367, line: 89, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !447, file: !370, line: 1078)
!447 = !DISubprogram(name: "atanhf", scope: !367, file: !367, line: 89, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !449, file: !370, line: 1079)
!449 = !DISubprogram(name: "atanhl", scope: !367, file: !367, line: 89, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !451, file: !370, line: 1081)
!451 = !DISubprogram(name: "cbrt", scope: !367, file: !367, line: 152, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !453, file: !370, line: 1082)
!453 = !DISubprogram(name: "cbrtf", scope: !367, file: !367, line: 152, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !455, file: !370, line: 1083)
!455 = !DISubprogram(name: "cbrtl", scope: !367, file: !367, line: 152, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !457, file: !370, line: 1085)
!457 = !DISubprogram(name: "copysign", scope: !367, file: !367, line: 196, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !459, file: !370, line: 1086)
!459 = !DISubprogram(name: "copysignf", scope: !367, file: !367, line: 196, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!45, !45, !45}
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !463, file: !370, line: 1087)
!463 = !DISubprogram(name: "copysignl", scope: !367, file: !367, line: 196, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{!437, !437, !437}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !467, file: !370, line: 1089)
!467 = !DISubprogram(name: "erf", scope: !367, file: !367, line: 228, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !469, file: !370, line: 1090)
!469 = !DISubprogram(name: "erff", scope: !367, file: !367, line: 228, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !471, file: !370, line: 1091)
!471 = !DISubprogram(name: "erfl", scope: !367, file: !367, line: 228, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !473, file: !370, line: 1093)
!473 = !DISubprogram(name: "erfc", scope: !367, file: !367, line: 229, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !475, file: !370, line: 1094)
!475 = !DISubprogram(name: "erfcf", scope: !367, file: !367, line: 229, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !477, file: !370, line: 1095)
!477 = !DISubprogram(name: "erfcl", scope: !367, file: !367, line: 229, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !479, file: !370, line: 1097)
!479 = !DISubprogram(name: "exp2", scope: !367, file: !367, line: 130, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !481, file: !370, line: 1098)
!481 = !DISubprogram(name: "exp2f", scope: !367, file: !367, line: 130, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !483, file: !370, line: 1099)
!483 = !DISubprogram(name: "exp2l", scope: !367, file: !367, line: 130, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !485, file: !370, line: 1101)
!485 = !DISubprogram(name: "expm1", scope: !367, file: !367, line: 119, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !487, file: !370, line: 1102)
!487 = !DISubprogram(name: "expm1f", scope: !367, file: !367, line: 119, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !489, file: !370, line: 1103)
!489 = !DISubprogram(name: "expm1l", scope: !367, file: !367, line: 119, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !491, file: !370, line: 1105)
!491 = !DISubprogram(name: "fdim", scope: !367, file: !367, line: 326, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !493, file: !370, line: 1106)
!493 = !DISubprogram(name: "fdimf", scope: !367, file: !367, line: 326, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !495, file: !370, line: 1107)
!495 = !DISubprogram(name: "fdiml", scope: !367, file: !367, line: 326, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !497, file: !370, line: 1109)
!497 = !DISubprogram(name: "fma", scope: !367, file: !367, line: 335, type: !498, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DISubroutineType(types: !499)
!499 = !{!64, !64, !64, !64}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !501, file: !370, line: 1110)
!501 = !DISubprogram(name: "fmaf", scope: !367, file: !367, line: 335, type: !502, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!45, !45, !45, !45}
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !505, file: !370, line: 1111)
!505 = !DISubprogram(name: "fmal", scope: !367, file: !367, line: 335, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!437, !437, !437, !437}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !509, file: !370, line: 1113)
!509 = !DISubprogram(name: "fmax", scope: !367, file: !367, line: 329, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !511, file: !370, line: 1114)
!511 = !DISubprogram(name: "fmaxf", scope: !367, file: !367, line: 329, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !513, file: !370, line: 1115)
!513 = !DISubprogram(name: "fmaxl", scope: !367, file: !367, line: 329, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !515, file: !370, line: 1117)
!515 = !DISubprogram(name: "fmin", scope: !367, file: !367, line: 332, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !517, file: !370, line: 1118)
!517 = !DISubprogram(name: "fminf", scope: !367, file: !367, line: 332, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !519, file: !370, line: 1119)
!519 = !DISubprogram(name: "fminl", scope: !367, file: !367, line: 332, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !521, file: !370, line: 1121)
!521 = !DISubprogram(name: "hypot", scope: !367, file: !367, line: 147, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !523, file: !370, line: 1122)
!523 = !DISubprogram(name: "hypotf", scope: !367, file: !367, line: 147, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !525, file: !370, line: 1123)
!525 = !DISubprogram(name: "hypotl", scope: !367, file: !367, line: 147, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !527, file: !370, line: 1125)
!527 = !DISubprogram(name: "ilogb", scope: !367, file: !367, line: 280, type: !528, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DISubroutineType(types: !529)
!529 = !{!13, !64}
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !531, file: !370, line: 1126)
!531 = !DISubprogram(name: "ilogbf", scope: !367, file: !367, line: 280, type: !532, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DISubroutineType(types: !533)
!533 = !{!13, !45}
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !535, file: !370, line: 1127)
!535 = !DISubprogram(name: "ilogbl", scope: !367, file: !367, line: 280, type: !536, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DISubroutineType(types: !537)
!537 = !{!13, !437}
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !539, file: !370, line: 1129)
!539 = !DISubprogram(name: "lgamma", scope: !367, file: !367, line: 230, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !541, file: !370, line: 1130)
!541 = !DISubprogram(name: "lgammaf", scope: !367, file: !367, line: 230, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !543, file: !370, line: 1131)
!543 = !DISubprogram(name: "lgammal", scope: !367, file: !367, line: 230, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !545, file: !370, line: 1134)
!545 = !DISubprogram(name: "llrint", scope: !367, file: !367, line: 316, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !64}
!548 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !550, file: !370, line: 1135)
!550 = !DISubprogram(name: "llrintf", scope: !367, file: !367, line: 316, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!548, !45}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !554, file: !370, line: 1136)
!554 = !DISubprogram(name: "llrintl", scope: !367, file: !367, line: 316, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!548, !437}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !558, file: !370, line: 1138)
!558 = !DISubprogram(name: "llround", scope: !367, file: !367, line: 322, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !560, file: !370, line: 1139)
!560 = !DISubprogram(name: "llroundf", scope: !367, file: !367, line: 322, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !562, file: !370, line: 1140)
!562 = !DISubprogram(name: "llroundl", scope: !367, file: !367, line: 322, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !564, file: !370, line: 1143)
!564 = !DISubprogram(name: "log1p", scope: !367, file: !367, line: 122, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !566, file: !370, line: 1144)
!566 = !DISubprogram(name: "log1pf", scope: !367, file: !367, line: 122, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !568, file: !370, line: 1145)
!568 = !DISubprogram(name: "log1pl", scope: !367, file: !367, line: 122, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !570, file: !370, line: 1147)
!570 = !DISubprogram(name: "log2", scope: !367, file: !367, line: 133, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !572, file: !370, line: 1148)
!572 = !DISubprogram(name: "log2f", scope: !367, file: !367, line: 133, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !574, file: !370, line: 1149)
!574 = !DISubprogram(name: "log2l", scope: !367, file: !367, line: 133, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !576, file: !370, line: 1151)
!576 = !DISubprogram(name: "logb", scope: !367, file: !367, line: 125, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !578, file: !370, line: 1152)
!578 = !DISubprogram(name: "logbf", scope: !367, file: !367, line: 125, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !580, file: !370, line: 1153)
!580 = !DISubprogram(name: "logbl", scope: !367, file: !367, line: 125, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !582, file: !370, line: 1155)
!582 = !DISubprogram(name: "lrint", scope: !367, file: !367, line: 314, type: !583, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !64}
!585 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !587, file: !370, line: 1156)
!587 = !DISubprogram(name: "lrintf", scope: !367, file: !367, line: 314, type: !588, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!585, !45}
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !591, file: !370, line: 1157)
!591 = !DISubprogram(name: "lrintl", scope: !367, file: !367, line: 314, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!585, !437}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !595, file: !370, line: 1159)
!595 = !DISubprogram(name: "lround", scope: !367, file: !367, line: 320, type: !583, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !597, file: !370, line: 1160)
!597 = !DISubprogram(name: "lroundf", scope: !367, file: !367, line: 320, type: !588, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !599, file: !370, line: 1161)
!599 = !DISubprogram(name: "lroundl", scope: !367, file: !367, line: 320, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !601, file: !370, line: 1163)
!601 = !DISubprogram(name: "nan", scope: !367, file: !367, line: 201, type: !602, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DISubroutineType(types: !603)
!603 = !{!64, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !608, file: !370, line: 1164)
!608 = !DISubprogram(name: "nanf", scope: !367, file: !367, line: 201, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!45, !604}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !612, file: !370, line: 1165)
!612 = !DISubprogram(name: "nanl", scope: !367, file: !367, line: 201, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{!437, !604}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !616, file: !370, line: 1167)
!616 = !DISubprogram(name: "nearbyint", scope: !367, file: !367, line: 294, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !618, file: !370, line: 1168)
!618 = !DISubprogram(name: "nearbyintf", scope: !367, file: !367, line: 294, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !620, file: !370, line: 1169)
!620 = !DISubprogram(name: "nearbyintl", scope: !367, file: !367, line: 294, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !622, file: !370, line: 1171)
!622 = !DISubprogram(name: "nextafter", scope: !367, file: !367, line: 259, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !624, file: !370, line: 1172)
!624 = !DISubprogram(name: "nextafterf", scope: !367, file: !367, line: 259, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !626, file: !370, line: 1173)
!626 = !DISubprogram(name: "nextafterl", scope: !367, file: !367, line: 259, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !628, file: !370, line: 1175)
!628 = !DISubprogram(name: "nexttoward", scope: !367, file: !367, line: 261, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!64, !64, !437}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !632, file: !370, line: 1176)
!632 = !DISubprogram(name: "nexttowardf", scope: !367, file: !367, line: 261, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!45, !45, !437}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !636, file: !370, line: 1177)
!636 = !DISubprogram(name: "nexttowardl", scope: !367, file: !367, line: 261, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !638, file: !370, line: 1179)
!638 = !DISubprogram(name: "remainder", scope: !367, file: !367, line: 272, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !640, file: !370, line: 1180)
!640 = !DISubprogram(name: "remainderf", scope: !367, file: !367, line: 272, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !642, file: !370, line: 1181)
!642 = !DISubprogram(name: "remainderl", scope: !367, file: !367, line: 272, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !644, file: !370, line: 1183)
!644 = !DISubprogram(name: "remquo", scope: !367, file: !367, line: 307, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!64, !64, !64, !397}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !648, file: !370, line: 1184)
!648 = !DISubprogram(name: "remquof", scope: !367, file: !367, line: 307, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!45, !45, !45, !397}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !652, file: !370, line: 1185)
!652 = !DISubprogram(name: "remquol", scope: !367, file: !367, line: 307, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!437, !437, !437, !397}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !656, file: !370, line: 1187)
!656 = !DISubprogram(name: "rint", scope: !367, file: !367, line: 256, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !658, file: !370, line: 1188)
!658 = !DISubprogram(name: "rintf", scope: !367, file: !367, line: 256, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !660, file: !370, line: 1189)
!660 = !DISubprogram(name: "rintl", scope: !367, file: !367, line: 256, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !662, file: !370, line: 1191)
!662 = !DISubprogram(name: "round", scope: !367, file: !367, line: 298, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !664, file: !370, line: 1192)
!664 = !DISubprogram(name: "roundf", scope: !367, file: !367, line: 298, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !666, file: !370, line: 1193)
!666 = !DISubprogram(name: "roundl", scope: !367, file: !367, line: 298, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !668, file: !370, line: 1195)
!668 = !DISubprogram(name: "scalbln", scope: !367, file: !367, line: 290, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!64, !64, !585}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !672, file: !370, line: 1196)
!672 = !DISubprogram(name: "scalblnf", scope: !367, file: !367, line: 290, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!45, !45, !585}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !676, file: !370, line: 1197)
!676 = !DISubprogram(name: "scalblnl", scope: !367, file: !367, line: 290, type: !677, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{!437, !437, !585}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !680, file: !370, line: 1199)
!680 = !DISubprogram(name: "scalbn", scope: !367, file: !367, line: 276, type: !400, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !682, file: !370, line: 1200)
!682 = !DISubprogram(name: "scalbnf", scope: !367, file: !367, line: 276, type: !683, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DISubroutineType(types: !684)
!684 = !{!45, !45, !13}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !686, file: !370, line: 1201)
!686 = !DISubprogram(name: "scalbnl", scope: !367, file: !367, line: 276, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!437, !437, !13}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !690, file: !370, line: 1203)
!690 = !DISubprogram(name: "tgamma", scope: !367, file: !367, line: 235, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !692, file: !370, line: 1204)
!692 = !DISubprogram(name: "tgammaf", scope: !367, file: !367, line: 235, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !694, file: !370, line: 1205)
!694 = !DISubprogram(name: "tgammal", scope: !367, file: !367, line: 235, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !696, file: !370, line: 1207)
!696 = !DISubprogram(name: "trunc", scope: !367, file: !367, line: 302, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !698, file: !370, line: 1208)
!698 = !DISubprogram(name: "truncf", scope: !367, file: !367, line: 302, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !700, file: !370, line: 1209)
!700 = !DISubprogram(name: "truncl", scope: !367, file: !367, line: 302, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !702, file: !706, line: 38)
!702 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !359, file: !364, line: 103, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !705}
!705 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!706 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !708, file: !706, line: 54)
!708 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !359, file: !370, line: 380, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{!437, !437, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !713, file: !715, line: 127)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !361, line: 62, baseType: !714)
!714 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!715 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !717, file: !715, line: 128)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !361, line: 70, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !719, identifier: "_ZTS6ldiv_t")
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !718, file: !361, line: 68, baseType: !585, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !718, file: !361, line: 69, baseType: !585, size: 64, offset: 64)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !723, file: !715, line: 130)
!723 = !DISubprogram(name: "abort", scope: !361, file: !361, line: 591, type: !724, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{null}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !727, file: !715, line: 134)
!727 = !DISubprogram(name: "atexit", scope: !361, file: !361, line: 595, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!13, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !732, file: !715, line: 137)
!732 = !DISubprogram(name: "at_quick_exit", scope: !361, file: !361, line: 600, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !734, file: !715, line: 140)
!734 = !DISubprogram(name: "atof", scope: !361, file: !361, line: 101, type: !602, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !736, file: !715, line: 141)
!736 = !DISubprogram(name: "atoi", scope: !361, file: !361, line: 104, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!13, !604}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !740, file: !715, line: 142)
!740 = !DISubprogram(name: "atol", scope: !361, file: !361, line: 107, type: !741, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{!585, !604}
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !744, file: !715, line: 143)
!744 = !DISubprogram(name: "bsearch", scope: !361, file: !361, line: 820, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!104, !747, !747, !749, !749, !752}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !750, line: 46, baseType: !751)
!750 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!751 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !361, line: 808, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!13, !747, !747}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !757, file: !715, line: 144)
!757 = !DISubprogram(name: "calloc", scope: !361, file: !361, line: 542, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!104, !749, !749}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !761, file: !715, line: 145)
!761 = !DISubprogram(name: "div", scope: !361, file: !361, line: 852, type: !762, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!713, !13, !13}
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !765, file: !715, line: 146)
!765 = !DISubprogram(name: "exit", scope: !361, file: !361, line: 617, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !13}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !769, file: !715, line: 147)
!769 = !DISubprogram(name: "free", scope: !361, file: !361, line: 565, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !104}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !773, file: !715, line: 148)
!773 = !DISubprogram(name: "getenv", scope: !361, file: !361, line: 634, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !604}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !778, file: !715, line: 149)
!778 = !DISubprogram(name: "labs", scope: !361, file: !361, line: 841, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{!585, !585}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !782, file: !715, line: 150)
!782 = !DISubprogram(name: "ldiv", scope: !361, file: !361, line: 854, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!717, !585, !585}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !786, file: !715, line: 151)
!786 = !DISubprogram(name: "malloc", scope: !361, file: !361, line: 539, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!104, !749}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !790, file: !715, line: 153)
!790 = !DISubprogram(name: "mblen", scope: !361, file: !361, line: 922, type: !791, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{!13, !604, !749}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !794, file: !715, line: 154)
!794 = !DISubprogram(name: "mbstowcs", scope: !361, file: !361, line: 933, type: !795, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!749, !797, !800, !749}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!800 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !604)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !802, file: !715, line: 155)
!802 = !DISubprogram(name: "mbtowc", scope: !361, file: !361, line: 925, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!13, !797, !800, !749}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !806, file: !715, line: 157)
!806 = !DISubprogram(name: "qsort", scope: !361, file: !361, line: 830, type: !807, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !104, !749, !749, !752}
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !810, file: !715, line: 160)
!810 = !DISubprogram(name: "quick_exit", scope: !361, file: !361, line: 623, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !812, file: !715, line: 163)
!812 = !DISubprogram(name: "rand", scope: !361, file: !361, line: 453, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!13}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !816, file: !715, line: 164)
!816 = !DISubprogram(name: "realloc", scope: !361, file: !361, line: 550, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!104, !104, !749}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !820, file: !715, line: 165)
!820 = !DISubprogram(name: "srand", scope: !361, file: !361, line: 455, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !56}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !824, file: !715, line: 166)
!824 = !DISubprogram(name: "strtod", scope: !361, file: !361, line: 117, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!64, !800, !827}
!827 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !830, file: !715, line: 167)
!830 = !DISubprogram(name: "strtol", scope: !361, file: !361, line: 176, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!585, !800, !827, !13}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !834, file: !715, line: 168)
!834 = !DISubprogram(name: "strtoul", scope: !361, file: !361, line: 180, type: !835, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!751, !800, !827, !13}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !838, file: !715, line: 169)
!838 = !DISubprogram(name: "system", scope: !361, file: !361, line: 784, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !840, file: !715, line: 171)
!840 = !DISubprogram(name: "wcstombs", scope: !361, file: !361, line: 936, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!749, !843, !844, !749}
!843 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !776)
!844 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !848, file: !715, line: 172)
!848 = !DISubprogram(name: "wctomb", scope: !361, file: !361, line: 929, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!13, !776, !799}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !853, file: !715, line: 200)
!852 = !DINamespace(name: "__gnu_cxx", scope: null)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !361, line: 80, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !855, identifier: "_ZTS7lldiv_t")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !854, file: !361, line: 78, baseType: !548, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !854, file: !361, line: 79, baseType: !548, size: 64, offset: 64)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !859, file: !715, line: 206)
!859 = !DISubprogram(name: "_Exit", scope: !361, file: !361, line: 629, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !861, file: !715, line: 210)
!861 = !DISubprogram(name: "llabs", scope: !361, file: !361, line: 844, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!548, !548}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !865, file: !715, line: 216)
!865 = !DISubprogram(name: "lldiv", scope: !361, file: !361, line: 858, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!853, !548, !548}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !869, file: !715, line: 227)
!869 = !DISubprogram(name: "atoll", scope: !361, file: !361, line: 112, type: !870, flags: DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!548, !604}
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !873, file: !715, line: 228)
!873 = !DISubprogram(name: "strtoll", scope: !361, file: !361, line: 200, type: !874, flags: DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{!548, !800, !827, !13}
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !877, file: !715, line: 229)
!877 = !DISubprogram(name: "strtoull", scope: !361, file: !361, line: 205, type: !878, flags: DIFlagPrototyped, spFlags: 0)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !800, !827, !13}
!880 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !882, file: !715, line: 231)
!882 = !DISubprogram(name: "strtof", scope: !361, file: !361, line: 123, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!45, !800, !827}
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !886, file: !715, line: 232)
!886 = !DISubprogram(name: "strtold", scope: !361, file: !361, line: 126, type: !887, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{!437, !800, !827}
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !853, file: !715, line: 240)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !859, file: !715, line: 242)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !861, file: !715, line: 244)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !893, file: !715, line: 245)
!893 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !852, file: !715, line: 213, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !865, file: !715, line: 246)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !869, file: !715, line: 248)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !882, file: !715, line: 249)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !873, file: !715, line: 250)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !877, file: !715, line: 251)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !359, entity: !886, file: !715, line: 252)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !723, file: !901, line: 38)
!901 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
