; ModuleID = 'sphsweep.cpp'
source_filename = "sphsweep.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Sphere_Sweep_Methods", linkageName: "_ZN3povL20Sphere_Sweep_MethodsE", scope: !2, file: !3, line: 145, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "sphsweep.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "Catmull_Rom_Matrix", linkageName: "_ZN3povL18Catmull_Rom_MatrixE", scope: !2, file: !3, line: 155, type: !151, isLocal: true, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !5, line: 693, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !154)
!154 = !{!155, !155}
!155 = !DISubrange(count: 4)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "B_Matrix", linkageName: "_ZN3povL8B_MatrixE", scope: !2, file: !3, line: 163, type: !151, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "lcm_bezier_01", linkageName: "_ZN3povL13lcm_bezier_01E", scope: !2, file: !3, line: 1925, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 576, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 18)
!163 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !298, globals: !354, imports: !360, splitDebugInlining: false, nameTableKind: None)
!164 = !{!165, !171}
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !172, line: 149, baseType: !56, size: 32, elements: !173, identifier: "_ZTSN3pov5STATSE")
!172 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!174 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!175 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!176 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!177 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!178 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!179 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!180 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!181 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!188 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!189 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!190 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!191 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!224 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!225 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!234 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!235 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!252 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!253 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!255 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!256 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!257 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!262 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!263 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!264 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!265 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!266 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!267 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!268 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!269 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!270 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!271 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!272 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!273 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!274 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!275 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!276 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!277 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!278 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!279 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!280 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!281 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!282 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!283 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!284 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!285 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!286 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!287 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!288 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!289 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!290 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!291 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!292 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!293 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!294 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!295 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!296 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!297 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!298 = !{!299, !321, !104, !331, !347, !44}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHERE_SWEEP", scope: !2, file: !301, line: 65, baseType: !302)
!301 = !DIFile(filename: "./sphsweep.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sphere_Sweep_Struct", scope: !2, file: !301, line: 70, size: 1408, flags: DIFlagTypePassByValue, elements: !303, identifier: "_ZTSN3pov19Sphere_Sweep_StructE")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !327, !328, !329, !330, !346}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !302, file: !301, line: 72, baseType: !19, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !302, file: !301, line: 72, baseType: !13, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !302, file: !301, line: 72, baseType: !14, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !302, file: !301, line: 72, baseType: !23, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !302, file: !301, line: 72, baseType: !23, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !302, file: !301, line: 72, baseType: !28, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !302, file: !301, line: 72, baseType: !14, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !302, file: !301, line: 72, baseType: !14, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !302, file: !301, line: 72, baseType: !34, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !302, file: !301, line: 72, baseType: !38, size: 192, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !302, file: !301, line: 72, baseType: !50, size: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !302, file: !301, line: 72, baseType: !50, size: 64, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !302, file: !301, line: 72, baseType: !45, size: 32, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !302, file: !301, line: 72, baseType: !56, size: 32, offset: 928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !302, file: !301, line: 73, baseType: !13, size: 32, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Modeling_Spheres", scope: !302, file: !301, line: 74, baseType: !13, size: 32, offset: 992)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Modeling_Sphere", scope: !302, file: !301, line: 75, baseType: !321, size: 64, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHSWEEP_SPH", scope: !2, file: !301, line: 66, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sphere_Sweep_Sphere_Struct", scope: !2, file: !301, line: 84, size: 256, flags: DIFlagTypePassByValue, elements: !324, identifier: "_ZTSN3pov26Sphere_Sweep_Sphere_StructE")
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !323, file: !301, line: 86, baseType: !62, size: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !323, file: !301, line: 87, baseType: !64, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Spheres", scope: !302, file: !301, line: 76, baseType: !13, size: 32, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Sphere", scope: !302, file: !301, line: 77, baseType: !321, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Segments", scope: !302, file: !301, line: 78, baseType: !13, size: 32, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Segment", scope: !302, file: !301, line: 79, baseType: !331, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHSWEEP_SEG", scope: !2, file: !301, line: 67, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sphere_Sweep_Segment_Struct", scope: !2, file: !301, line: 91, size: 2112, flags: DIFlagTypePassByValue, elements: !334, identifier: "_ZTSN3pov27Sphere_Sweep_Segment_StructE")
!334 = !{!335, !337, !339, !340, !341, !344}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Closing_Sphere", scope: !333, file: !301, line: 93, baseType: !336, size: 512)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 512, elements: !89)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Center_Deriv", scope: !333, file: !301, line: 94, baseType: !338, size: 384, offset: 512)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 384, elements: !89)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Deriv", scope: !333, file: !301, line: 95, baseType: !88, size: 128, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Coefs", scope: !333, file: !301, line: 96, baseType: !13, size: 32, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Center_Coef", scope: !333, file: !301, line: 97, baseType: !342, size: 768, offset: 1088)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, elements: !343)
!343 = !{!155}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Coef", scope: !333, file: !301, line: 98, baseType: !345, size: 256, offset: 1856)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !343)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Depth_Tolerance", scope: !302, file: !301, line: 80, baseType: !64, size: 64, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHSWEEP_INT", scope: !2, file: !3, line: 105, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sphere_Sweep_Intersection_Structure", scope: !2, file: !3, line: 108, size: 448, flags: DIFlagTypePassByValue, elements: !350, identifier: "_ZTSN3pov35Sphere_Sweep_Intersection_StructureE")
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !349, file: !3, line: 110, baseType: !64, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Point", scope: !349, file: !3, line: 111, baseType: !62, size: 192, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !349, file: !3, line: 112, baseType: !62, size: 192, offset: 256)
!354 = !{!355, !358, !0, !149, !156, !158}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!356 = distinct !DIGlobalVariable(name: "ZERO_TOLERANCE", scope: !2, file: !3, line: 93, type: !357, isLocal: true, isDefinition: true)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!359 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 92, type: !357, isLocal: true, isDefinition: true)
!360 = !{!361, !368, !374, !376, !378, !382, !384, !386, !388, !390, !392, !394, !396, !401, !405, !407, !409, !413, !415, !417, !419, !421, !423, !425, !428, !430, !432, !436, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !465, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !503, !507, !511, !513, !515, !517, !519, !521, !523, !525, !527, !529, !533, !537, !541, !543, !545, !547, !552, !556, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !584, !589, !593, !597, !599, !601, !603, !610, !614, !618, !620, !622, !624, !626, !628, !630, !634, !638, !640, !642, !644, !646, !650, !654, !658, !660, !662, !664, !666, !668, !670, !674, !678, !682, !684, !688, !692, !694, !696, !698, !700, !702, !704, !710, !715, !719, !725, !729, !734, !736, !738, !742, !746, !759, !763, !767, !771, !775, !780, !784, !788, !792, !796, !804, !808, !812, !814, !818, !822, !826, !832, !836, !840, !842, !850, !854, !861, !863, !867, !871, !875, !879, !884, !888, !892, !893, !894, !895, !897, !898, !899, !900, !901, !902, !903, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !940, !942, !944, !946, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !972, !976, !982, !986, !990, !994, !998, !1000, !1002, !1006, !1010, !1014, !1018, !1022, !1024, !1026, !1028, !1032, !1036, !1040, !1042, !1044, !1047, !1049, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1071, !1072, !1073, !1075, !1077, !1079, !1081, !1082, !1086, !1142, !1146}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !363, file: !367, line: 52)
!362 = !DINamespace(name: "std", scope: null)
!363 = !DISubprogram(name: "abs", scope: !364, file: !364, line: 840, type: !365, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!365 = !DISubroutineType(types: !366)
!366 = !{!13, !13}
!367 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !369, file: !373, line: 83)
!369 = !DISubprogram(name: "acos", scope: !370, file: !370, line: 53, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!371 = !DISubroutineType(types: !372)
!372 = !{!64, !64}
!373 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !375, file: !373, line: 102)
!375 = !DISubprogram(name: "asin", scope: !370, file: !370, line: 55, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !377, file: !373, line: 121)
!377 = !DISubprogram(name: "atan", scope: !370, file: !370, line: 57, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !379, file: !373, line: 140)
!379 = !DISubprogram(name: "atan2", scope: !370, file: !370, line: 59, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DISubroutineType(types: !381)
!381 = !{!64, !64, !64}
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !383, file: !373, line: 161)
!383 = !DISubprogram(name: "ceil", scope: !370, file: !370, line: 159, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !385, file: !373, line: 180)
!385 = !DISubprogram(name: "cos", scope: !370, file: !370, line: 62, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !387, file: !373, line: 199)
!387 = !DISubprogram(name: "cosh", scope: !370, file: !370, line: 71, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !389, file: !373, line: 218)
!389 = !DISubprogram(name: "exp", scope: !370, file: !370, line: 95, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !391, file: !373, line: 237)
!391 = !DISubprogram(name: "fabs", scope: !370, file: !370, line: 162, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !393, file: !373, line: 256)
!393 = !DISubprogram(name: "floor", scope: !370, file: !370, line: 165, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !395, file: !373, line: 275)
!395 = !DISubprogram(name: "fmod", scope: !370, file: !370, line: 168, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !397, file: !373, line: 296)
!397 = !DISubprogram(name: "frexp", scope: !370, file: !370, line: 98, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!64, !64, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !402, file: !373, line: 315)
!402 = !DISubprogram(name: "ldexp", scope: !370, file: !370, line: 101, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{!64, !64, !13}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !406, file: !373, line: 334)
!406 = !DISubprogram(name: "log", scope: !370, file: !370, line: 104, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !408, file: !373, line: 353)
!408 = !DISubprogram(name: "log10", scope: !370, file: !370, line: 107, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !410, file: !373, line: 372)
!410 = !DISubprogram(name: "modf", scope: !370, file: !370, line: 110, type: !411, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{!64, !64, !113}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !414, file: !373, line: 384)
!414 = !DISubprogram(name: "pow", scope: !370, file: !370, line: 140, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !416, file: !373, line: 421)
!416 = !DISubprogram(name: "sin", scope: !370, file: !370, line: 64, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !418, file: !373, line: 440)
!418 = !DISubprogram(name: "sinh", scope: !370, file: !370, line: 73, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !420, file: !373, line: 459)
!420 = !DISubprogram(name: "sqrt", scope: !370, file: !370, line: 143, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !422, file: !373, line: 478)
!422 = !DISubprogram(name: "tan", scope: !370, file: !370, line: 66, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !424, file: !373, line: 497)
!424 = !DISubprogram(name: "tanh", scope: !370, file: !370, line: 75, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !426, file: !373, line: 1065)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !427, line: 150, baseType: !64)
!427 = !DIFile(filename: "/usr/include/math.h", directory: "")
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !429, file: !373, line: 1066)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !427, line: 149, baseType: !45)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !431, file: !373, line: 1069)
!431 = !DISubprogram(name: "acosh", scope: !370, file: !370, line: 85, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !433, file: !373, line: 1070)
!433 = !DISubprogram(name: "acoshf", scope: !370, file: !370, line: 85, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!45, !45}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !437, file: !373, line: 1071)
!437 = !DISubprogram(name: "acoshl", scope: !370, file: !370, line: 85, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !440}
!440 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !442, file: !373, line: 1073)
!442 = !DISubprogram(name: "asinh", scope: !370, file: !370, line: 87, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !444, file: !373, line: 1074)
!444 = !DISubprogram(name: "asinhf", scope: !370, file: !370, line: 87, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !446, file: !373, line: 1075)
!446 = !DISubprogram(name: "asinhl", scope: !370, file: !370, line: 87, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !448, file: !373, line: 1077)
!448 = !DISubprogram(name: "atanh", scope: !370, file: !370, line: 89, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !450, file: !373, line: 1078)
!450 = !DISubprogram(name: "atanhf", scope: !370, file: !370, line: 89, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !452, file: !373, line: 1079)
!452 = !DISubprogram(name: "atanhl", scope: !370, file: !370, line: 89, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !454, file: !373, line: 1081)
!454 = !DISubprogram(name: "cbrt", scope: !370, file: !370, line: 152, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !456, file: !373, line: 1082)
!456 = !DISubprogram(name: "cbrtf", scope: !370, file: !370, line: 152, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !458, file: !373, line: 1083)
!458 = !DISubprogram(name: "cbrtl", scope: !370, file: !370, line: 152, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !460, file: !373, line: 1085)
!460 = !DISubprogram(name: "copysign", scope: !370, file: !370, line: 196, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !462, file: !373, line: 1086)
!462 = !DISubprogram(name: "copysignf", scope: !370, file: !370, line: 196, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!45, !45, !45}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !466, file: !373, line: 1087)
!466 = !DISubprogram(name: "copysignl", scope: !370, file: !370, line: 196, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{!440, !440, !440}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !470, file: !373, line: 1089)
!470 = !DISubprogram(name: "erf", scope: !370, file: !370, line: 228, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !472, file: !373, line: 1090)
!472 = !DISubprogram(name: "erff", scope: !370, file: !370, line: 228, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !474, file: !373, line: 1091)
!474 = !DISubprogram(name: "erfl", scope: !370, file: !370, line: 228, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !476, file: !373, line: 1093)
!476 = !DISubprogram(name: "erfc", scope: !370, file: !370, line: 229, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !478, file: !373, line: 1094)
!478 = !DISubprogram(name: "erfcf", scope: !370, file: !370, line: 229, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !480, file: !373, line: 1095)
!480 = !DISubprogram(name: "erfcl", scope: !370, file: !370, line: 229, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !482, file: !373, line: 1097)
!482 = !DISubprogram(name: "exp2", scope: !370, file: !370, line: 130, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !484, file: !373, line: 1098)
!484 = !DISubprogram(name: "exp2f", scope: !370, file: !370, line: 130, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !486, file: !373, line: 1099)
!486 = !DISubprogram(name: "exp2l", scope: !370, file: !370, line: 130, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !488, file: !373, line: 1101)
!488 = !DISubprogram(name: "expm1", scope: !370, file: !370, line: 119, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !490, file: !373, line: 1102)
!490 = !DISubprogram(name: "expm1f", scope: !370, file: !370, line: 119, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !492, file: !373, line: 1103)
!492 = !DISubprogram(name: "expm1l", scope: !370, file: !370, line: 119, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !494, file: !373, line: 1105)
!494 = !DISubprogram(name: "fdim", scope: !370, file: !370, line: 326, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !496, file: !373, line: 1106)
!496 = !DISubprogram(name: "fdimf", scope: !370, file: !370, line: 326, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !498, file: !373, line: 1107)
!498 = !DISubprogram(name: "fdiml", scope: !370, file: !370, line: 326, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !500, file: !373, line: 1109)
!500 = !DISubprogram(name: "fma", scope: !370, file: !370, line: 335, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!64, !64, !64, !64}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !504, file: !373, line: 1110)
!504 = !DISubprogram(name: "fmaf", scope: !370, file: !370, line: 335, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!45, !45, !45, !45}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !508, file: !373, line: 1111)
!508 = !DISubprogram(name: "fmal", scope: !370, file: !370, line: 335, type: !509, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!440, !440, !440, !440}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !512, file: !373, line: 1113)
!512 = !DISubprogram(name: "fmax", scope: !370, file: !370, line: 329, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !514, file: !373, line: 1114)
!514 = !DISubprogram(name: "fmaxf", scope: !370, file: !370, line: 329, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !516, file: !373, line: 1115)
!516 = !DISubprogram(name: "fmaxl", scope: !370, file: !370, line: 329, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !518, file: !373, line: 1117)
!518 = !DISubprogram(name: "fmin", scope: !370, file: !370, line: 332, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !520, file: !373, line: 1118)
!520 = !DISubprogram(name: "fminf", scope: !370, file: !370, line: 332, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !522, file: !373, line: 1119)
!522 = !DISubprogram(name: "fminl", scope: !370, file: !370, line: 332, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !524, file: !373, line: 1121)
!524 = !DISubprogram(name: "hypot", scope: !370, file: !370, line: 147, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !526, file: !373, line: 1122)
!526 = !DISubprogram(name: "hypotf", scope: !370, file: !370, line: 147, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !528, file: !373, line: 1123)
!528 = !DISubprogram(name: "hypotl", scope: !370, file: !370, line: 147, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !530, file: !373, line: 1125)
!530 = !DISubprogram(name: "ilogb", scope: !370, file: !370, line: 280, type: !531, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{!13, !64}
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !534, file: !373, line: 1126)
!534 = !DISubprogram(name: "ilogbf", scope: !370, file: !370, line: 280, type: !535, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DISubroutineType(types: !536)
!536 = !{!13, !45}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !538, file: !373, line: 1127)
!538 = !DISubprogram(name: "ilogbl", scope: !370, file: !370, line: 280, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!13, !440}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !542, file: !373, line: 1129)
!542 = !DISubprogram(name: "lgamma", scope: !370, file: !370, line: 230, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !544, file: !373, line: 1130)
!544 = !DISubprogram(name: "lgammaf", scope: !370, file: !370, line: 230, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !546, file: !373, line: 1131)
!546 = !DISubprogram(name: "lgammal", scope: !370, file: !370, line: 230, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !548, file: !373, line: 1134)
!548 = !DISubprogram(name: "llrint", scope: !370, file: !370, line: 316, type: !549, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !64}
!551 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !553, file: !373, line: 1135)
!553 = !DISubprogram(name: "llrintf", scope: !370, file: !370, line: 316, type: !554, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DISubroutineType(types: !555)
!555 = !{!551, !45}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !557, file: !373, line: 1136)
!557 = !DISubprogram(name: "llrintl", scope: !370, file: !370, line: 316, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!551, !440}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !561, file: !373, line: 1138)
!561 = !DISubprogram(name: "llround", scope: !370, file: !370, line: 322, type: !549, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !563, file: !373, line: 1139)
!563 = !DISubprogram(name: "llroundf", scope: !370, file: !370, line: 322, type: !554, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !565, file: !373, line: 1140)
!565 = !DISubprogram(name: "llroundl", scope: !370, file: !370, line: 322, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !567, file: !373, line: 1143)
!567 = !DISubprogram(name: "log1p", scope: !370, file: !370, line: 122, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !569, file: !373, line: 1144)
!569 = !DISubprogram(name: "log1pf", scope: !370, file: !370, line: 122, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !571, file: !373, line: 1145)
!571 = !DISubprogram(name: "log1pl", scope: !370, file: !370, line: 122, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !573, file: !373, line: 1147)
!573 = !DISubprogram(name: "log2", scope: !370, file: !370, line: 133, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !575, file: !373, line: 1148)
!575 = !DISubprogram(name: "log2f", scope: !370, file: !370, line: 133, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !577, file: !373, line: 1149)
!577 = !DISubprogram(name: "log2l", scope: !370, file: !370, line: 133, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !579, file: !373, line: 1151)
!579 = !DISubprogram(name: "logb", scope: !370, file: !370, line: 125, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !581, file: !373, line: 1152)
!581 = !DISubprogram(name: "logbf", scope: !370, file: !370, line: 125, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !583, file: !373, line: 1153)
!583 = !DISubprogram(name: "logbl", scope: !370, file: !370, line: 125, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !585, file: !373, line: 1155)
!585 = !DISubprogram(name: "lrint", scope: !370, file: !370, line: 314, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !64}
!588 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !590, file: !373, line: 1156)
!590 = !DISubprogram(name: "lrintf", scope: !370, file: !370, line: 314, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!588, !45}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !594, file: !373, line: 1157)
!594 = !DISubprogram(name: "lrintl", scope: !370, file: !370, line: 314, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!588, !440}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !598, file: !373, line: 1159)
!598 = !DISubprogram(name: "lround", scope: !370, file: !370, line: 320, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !600, file: !373, line: 1160)
!600 = !DISubprogram(name: "lroundf", scope: !370, file: !370, line: 320, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !602, file: !373, line: 1161)
!602 = !DISubprogram(name: "lroundl", scope: !370, file: !370, line: 320, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !604, file: !373, line: 1163)
!604 = !DISubprogram(name: "nan", scope: !370, file: !370, line: 201, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!64, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !611, file: !373, line: 1164)
!611 = !DISubprogram(name: "nanf", scope: !370, file: !370, line: 201, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!45, !607}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !615, file: !373, line: 1165)
!615 = !DISubprogram(name: "nanl", scope: !370, file: !370, line: 201, type: !616, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!440, !607}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !619, file: !373, line: 1167)
!619 = !DISubprogram(name: "nearbyint", scope: !370, file: !370, line: 294, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !621, file: !373, line: 1168)
!621 = !DISubprogram(name: "nearbyintf", scope: !370, file: !370, line: 294, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !623, file: !373, line: 1169)
!623 = !DISubprogram(name: "nearbyintl", scope: !370, file: !370, line: 294, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !625, file: !373, line: 1171)
!625 = !DISubprogram(name: "nextafter", scope: !370, file: !370, line: 259, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !627, file: !373, line: 1172)
!627 = !DISubprogram(name: "nextafterf", scope: !370, file: !370, line: 259, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !629, file: !373, line: 1173)
!629 = !DISubprogram(name: "nextafterl", scope: !370, file: !370, line: 259, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !631, file: !373, line: 1175)
!631 = !DISubprogram(name: "nexttoward", scope: !370, file: !370, line: 261, type: !632, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DISubroutineType(types: !633)
!633 = !{!64, !64, !440}
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !635, file: !373, line: 1176)
!635 = !DISubprogram(name: "nexttowardf", scope: !370, file: !370, line: 261, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!45, !45, !440}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !639, file: !373, line: 1177)
!639 = !DISubprogram(name: "nexttowardl", scope: !370, file: !370, line: 261, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !641, file: !373, line: 1179)
!641 = !DISubprogram(name: "remainder", scope: !370, file: !370, line: 272, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !643, file: !373, line: 1180)
!643 = !DISubprogram(name: "remainderf", scope: !370, file: !370, line: 272, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !645, file: !373, line: 1181)
!645 = !DISubprogram(name: "remainderl", scope: !370, file: !370, line: 272, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !647, file: !373, line: 1183)
!647 = !DISubprogram(name: "remquo", scope: !370, file: !370, line: 307, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!64, !64, !64, !400}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !651, file: !373, line: 1184)
!651 = !DISubprogram(name: "remquof", scope: !370, file: !370, line: 307, type: !652, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!45, !45, !45, !400}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !655, file: !373, line: 1185)
!655 = !DISubprogram(name: "remquol", scope: !370, file: !370, line: 307, type: !656, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{!440, !440, !440, !400}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !659, file: !373, line: 1187)
!659 = !DISubprogram(name: "rint", scope: !370, file: !370, line: 256, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !661, file: !373, line: 1188)
!661 = !DISubprogram(name: "rintf", scope: !370, file: !370, line: 256, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !663, file: !373, line: 1189)
!663 = !DISubprogram(name: "rintl", scope: !370, file: !370, line: 256, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !665, file: !373, line: 1191)
!665 = !DISubprogram(name: "round", scope: !370, file: !370, line: 298, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !667, file: !373, line: 1192)
!667 = !DISubprogram(name: "roundf", scope: !370, file: !370, line: 298, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !669, file: !373, line: 1193)
!669 = !DISubprogram(name: "roundl", scope: !370, file: !370, line: 298, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !671, file: !373, line: 1195)
!671 = !DISubprogram(name: "scalbln", scope: !370, file: !370, line: 290, type: !672, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{!64, !64, !588}
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !675, file: !373, line: 1196)
!675 = !DISubprogram(name: "scalblnf", scope: !370, file: !370, line: 290, type: !676, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!45, !45, !588}
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !679, file: !373, line: 1197)
!679 = !DISubprogram(name: "scalblnl", scope: !370, file: !370, line: 290, type: !680, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DISubroutineType(types: !681)
!681 = !{!440, !440, !588}
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !683, file: !373, line: 1199)
!683 = !DISubprogram(name: "scalbn", scope: !370, file: !370, line: 276, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !685, file: !373, line: 1200)
!685 = !DISubprogram(name: "scalbnf", scope: !370, file: !370, line: 276, type: !686, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DISubroutineType(types: !687)
!687 = !{!45, !45, !13}
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !689, file: !373, line: 1201)
!689 = !DISubprogram(name: "scalbnl", scope: !370, file: !370, line: 276, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!440, !440, !13}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !693, file: !373, line: 1203)
!693 = !DISubprogram(name: "tgamma", scope: !370, file: !370, line: 235, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !695, file: !373, line: 1204)
!695 = !DISubprogram(name: "tgammaf", scope: !370, file: !370, line: 235, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !697, file: !373, line: 1205)
!697 = !DISubprogram(name: "tgammal", scope: !370, file: !370, line: 235, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !699, file: !373, line: 1207)
!699 = !DISubprogram(name: "trunc", scope: !370, file: !370, line: 302, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !701, file: !373, line: 1208)
!701 = !DISubprogram(name: "truncf", scope: !370, file: !370, line: 302, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !703, file: !373, line: 1209)
!703 = !DISubprogram(name: "truncl", scope: !370, file: !370, line: 302, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !163, entity: !705, file: !709, line: 38)
!705 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !362, file: !367, line: 103, type: !706, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !708}
!708 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!709 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !163, entity: !711, file: !709, line: 54)
!711 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !362, file: !373, line: 380, type: !712, flags: DIFlagPrototyped, spFlags: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{!440, !440, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !716, file: !718, line: 127)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !364, line: 62, baseType: !717)
!717 = !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!718 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !720, file: !718, line: 128)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !364, line: 70, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !722, identifier: "_ZTS6ldiv_t")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !721, file: !364, line: 68, baseType: !588, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !721, file: !364, line: 69, baseType: !588, size: 64, offset: 64)
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !726, file: !718, line: 130)
!726 = !DISubprogram(name: "abort", scope: !364, file: !364, line: 591, type: !727, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{null}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !730, file: !718, line: 134)
!730 = !DISubprogram(name: "atexit", scope: !364, file: !364, line: 595, type: !731, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{!13, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !735, file: !718, line: 137)
!735 = !DISubprogram(name: "at_quick_exit", scope: !364, file: !364, line: 600, type: !731, flags: DIFlagPrototyped, spFlags: 0)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !737, file: !718, line: 140)
!737 = !DISubprogram(name: "atof", scope: !364, file: !364, line: 101, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !739, file: !718, line: 141)
!739 = !DISubprogram(name: "atoi", scope: !364, file: !364, line: 104, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!13, !607}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !743, file: !718, line: 142)
!743 = !DISubprogram(name: "atol", scope: !364, file: !364, line: 107, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!588, !607}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !747, file: !718, line: 143)
!747 = !DISubprogram(name: "bsearch", scope: !364, file: !364, line: 820, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!104, !750, !750, !752, !752, !755}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !753, line: 46, baseType: !754)
!753 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!754 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !364, line: 808, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!13, !750, !750}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !760, file: !718, line: 144)
!760 = !DISubprogram(name: "calloc", scope: !364, file: !364, line: 542, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!104, !752, !752}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !764, file: !718, line: 145)
!764 = !DISubprogram(name: "div", scope: !364, file: !364, line: 852, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!716, !13, !13}
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !768, file: !718, line: 146)
!768 = !DISubprogram(name: "exit", scope: !364, file: !364, line: 617, type: !769, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !13}
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !772, file: !718, line: 147)
!772 = !DISubprogram(name: "free", scope: !364, file: !364, line: 565, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !104}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !776, file: !718, line: 148)
!776 = !DISubprogram(name: "getenv", scope: !364, file: !364, line: 634, type: !777, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{!779, !607}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !781, file: !718, line: 149)
!781 = !DISubprogram(name: "labs", scope: !364, file: !364, line: 841, type: !782, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{!588, !588}
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !785, file: !718, line: 150)
!785 = !DISubprogram(name: "ldiv", scope: !364, file: !364, line: 854, type: !786, flags: DIFlagPrototyped, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{!720, !588, !588}
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !789, file: !718, line: 151)
!789 = !DISubprogram(name: "malloc", scope: !364, file: !364, line: 539, type: !790, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{!104, !752}
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !793, file: !718, line: 153)
!793 = !DISubprogram(name: "mblen", scope: !364, file: !364, line: 922, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!13, !607, !752}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !797, file: !718, line: 154)
!797 = !DISubprogram(name: "mbstowcs", scope: !364, file: !364, line: 933, type: !798, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!752, !800, !803, !752}
!800 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!803 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !607)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !805, file: !718, line: 155)
!805 = !DISubprogram(name: "mbtowc", scope: !364, file: !364, line: 925, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!13, !800, !803, !752}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !809, file: !718, line: 157)
!809 = !DISubprogram(name: "qsort", scope: !364, file: !364, line: 830, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !104, !752, !752, !755}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !813, file: !718, line: 160)
!813 = !DISubprogram(name: "quick_exit", scope: !364, file: !364, line: 623, type: !769, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !815, file: !718, line: 163)
!815 = !DISubprogram(name: "rand", scope: !364, file: !364, line: 453, type: !816, flags: DIFlagPrototyped, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{!13}
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !819, file: !718, line: 164)
!819 = !DISubprogram(name: "realloc", scope: !364, file: !364, line: 550, type: !820, flags: DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!104, !104, !752}
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !823, file: !718, line: 165)
!823 = !DISubprogram(name: "srand", scope: !364, file: !364, line: 455, type: !824, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !56}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !827, file: !718, line: 166)
!827 = !DISubprogram(name: "strtod", scope: !364, file: !364, line: 117, type: !828, flags: DIFlagPrototyped, spFlags: 0)
!828 = !DISubroutineType(types: !829)
!829 = !{!64, !803, !830}
!830 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !833, file: !718, line: 167)
!833 = !DISubprogram(name: "strtol", scope: !364, file: !364, line: 176, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!588, !803, !830, !13}
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !837, file: !718, line: 168)
!837 = !DISubprogram(name: "strtoul", scope: !364, file: !364, line: 180, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!754, !803, !830, !13}
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !841, file: !718, line: 169)
!841 = !DISubprogram(name: "system", scope: !364, file: !364, line: 784, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !843, file: !718, line: 171)
!843 = !DISubprogram(name: "wcstombs", scope: !364, file: !364, line: 936, type: !844, flags: DIFlagPrototyped, spFlags: 0)
!844 = !DISubroutineType(types: !845)
!845 = !{!752, !846, !847, !752}
!846 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !779)
!847 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !851, file: !718, line: 172)
!851 = !DISubprogram(name: "wctomb", scope: !364, file: !364, line: 929, type: !852, flags: DIFlagPrototyped, spFlags: 0)
!852 = !DISubroutineType(types: !853)
!853 = !{!13, !779, !802}
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !856, file: !718, line: 200)
!855 = !DINamespace(name: "__gnu_cxx", scope: null)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !364, line: 80, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !858, identifier: "_ZTS7lldiv_t")
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !857, file: !364, line: 78, baseType: !551, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !857, file: !364, line: 79, baseType: !551, size: 64, offset: 64)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !862, file: !718, line: 206)
!862 = !DISubprogram(name: "_Exit", scope: !364, file: !364, line: 629, type: !769, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !864, file: !718, line: 210)
!864 = !DISubprogram(name: "llabs", scope: !364, file: !364, line: 844, type: !865, flags: DIFlagPrototyped, spFlags: 0)
!865 = !DISubroutineType(types: !866)
!866 = !{!551, !551}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !868, file: !718, line: 216)
!868 = !DISubprogram(name: "lldiv", scope: !364, file: !364, line: 858, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!856, !551, !551}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !872, file: !718, line: 227)
!872 = !DISubprogram(name: "atoll", scope: !364, file: !364, line: 112, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!551, !607}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !876, file: !718, line: 228)
!876 = !DISubprogram(name: "strtoll", scope: !364, file: !364, line: 200, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!551, !803, !830, !13}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !880, file: !718, line: 229)
!880 = !DISubprogram(name: "strtoull", scope: !364, file: !364, line: 205, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!883, !803, !830, !13}
!883 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !885, file: !718, line: 231)
!885 = !DISubprogram(name: "strtof", scope: !364, file: !364, line: 123, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!886 = !DISubroutineType(types: !887)
!887 = !{!45, !803, !830}
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !855, entity: !889, file: !718, line: 232)
!889 = !DISubprogram(name: "strtold", scope: !364, file: !364, line: 126, type: !890, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!440, !803, !830}
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !856, file: !718, line: 240)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !862, file: !718, line: 242)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !864, file: !718, line: 244)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !896, file: !718, line: 245)
!896 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !855, file: !718, line: 213, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !868, file: !718, line: 246)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !872, file: !718, line: 248)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !885, file: !718, line: 249)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !876, file: !718, line: 250)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !880, file: !718, line: 251)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !362, entity: !889, file: !718, line: 252)
!903 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !163, entity: !726, file: !904, line: 38)
!904 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
