; ModuleID = 'sor.cpp'
source_filename = "sor.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Sor_Methods", linkageName: "_ZN3povL11Sor_MethodsE", scope: !2, file: !3, line: 156, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "sor.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !288, globals: !361, imports: !372, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !157, !284}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !158, line: 149, baseType: !56, size: 32, elements: !159, identifier: "_ZTSN3pov5STATSE")
!158 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!160 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!166 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!167 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!174 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!175 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!176 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!210 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!211 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!220 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!221 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!238 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!239 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!242 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!243 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!248 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!249 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!250 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!251 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!255 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!256 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!257 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!258 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!259 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!260 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!261 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!262 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!263 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!264 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!265 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!266 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!267 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!268 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!269 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!270 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!271 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!272 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!273 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!274 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!275 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!276 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!277 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!278 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!279 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!280 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!281 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!282 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!283 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !56, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!288 = !{!289, !310, !316, !113, !104, !14, !44}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOR", scope: !2, file: !291, line: 58, baseType: !292)
!291 = !DIFile(filename: "./sor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sor_Struct", scope: !2, file: !291, line: 74, size: 1472, flags: DIFlagTypePassByValue, elements: !293, identifier: "_ZTSN3pov10Sor_StructE")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !355, !356, !357, !358, !359, !360}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !292, file: !291, line: 76, baseType: !19, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !292, file: !291, line: 76, baseType: !13, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !292, file: !291, line: 76, baseType: !14, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !292, file: !291, line: 76, baseType: !23, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !292, file: !291, line: 76, baseType: !23, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !292, file: !291, line: 76, baseType: !28, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !292, file: !291, line: 76, baseType: !14, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !292, file: !291, line: 76, baseType: !14, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !292, file: !291, line: 76, baseType: !34, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !292, file: !291, line: 76, baseType: !38, size: 192, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !292, file: !291, line: 76, baseType: !50, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !292, file: !291, line: 76, baseType: !50, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !292, file: !291, line: 76, baseType: !45, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !292, file: !291, line: 76, baseType: !56, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !292, file: !291, line: 77, baseType: !13, size: 32, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Spline", scope: !292, file: !291, line: 78, baseType: !310, size: 64, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOR_SPLINE", scope: !2, file: !291, line: 60, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sor_Spline_Struct", scope: !2, file: !291, line: 67, size: 192, flags: DIFlagTypePassByValue, elements: !313, identifier: "_ZTSN3pov17Sor_Spline_StructE")
!313 = !{!314, !315, !324}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !312, file: !291, line: 69, baseType: !13, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !312, file: !291, line: 70, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOR_SPLINE_ENTRY", scope: !2, file: !291, line: 59, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sor_Spline_Entry_Struct", scope: !2, file: !291, line: 62, size: 256, flags: DIFlagTypePassByValue, elements: !319, identifier: "_ZTSN3pov23Sor_Spline_Entry_StructE")
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !318, file: !291, line: 64, baseType: !64, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !318, file: !291, line: 64, baseType: !64, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !318, file: !291, line: 64, baseType: !64, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !318, file: !291, line: 64, baseType: !64, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "BCyl", scope: !312, file: !291, line: 71, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL", scope: !2, file: !327, line: 50, baseType: !328)
!327 = !DIFile(filename: "./bcyl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Struct", scope: !2, file: !327, line: 67, size: 448, flags: DIFlagTypePassByValue, elements: !329, identifier: "_ZTSN3pov11BCyl_StructE")
!329 = !{!330, !331, !333, !334, !335, !336, !344, !345, !346}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !328, file: !327, line: 69, baseType: !13, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nradius", scope: !328, file: !327, line: 70, baseType: !332, size: 16, offset: 32)
!332 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nheight", scope: !328, file: !327, line: 71, baseType: !332, size: 16, offset: 48)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !328, file: !327, line: 72, baseType: !113, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !328, file: !327, line: 73, baseType: !113, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rint", scope: !328, file: !327, line: 74, baseType: !337, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_INT", scope: !2, file: !327, line: 52, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Intersection_Struct", scope: !2, file: !327, line: 54, size: 320, flags: DIFlagTypePassByValue, elements: !340, identifier: "_ZTSN3pov24BCyl_Intersection_StructE")
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !339, file: !327, line: 56, baseType: !13, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !339, file: !327, line: 57, baseType: !88, size: 128, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !339, file: !327, line: 58, baseType: !88, size: 128, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !328, file: !327, line: 75, baseType: !337, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "intervals", scope: !328, file: !327, line: 76, baseType: !337, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !328, file: !327, line: 77, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_ENTRY", scope: !2, file: !327, line: 51, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Entry_Struct", scope: !2, file: !327, line: 61, size: 64, flags: DIFlagTypePassByValue, elements: !350, identifier: "_ZTSN3pov17BCyl_Entry_StructE")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !349, file: !327, line: 63, baseType: !332, size: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !349, file: !327, line: 63, baseType: !332, size: 16, offset: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !349, file: !327, line: 64, baseType: !332, size: 16, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !349, file: !327, line: 64, baseType: !332, size: 16, offset: 48)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Height1", scope: !292, file: !291, line: 79, baseType: !64, size: 64, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Height2", scope: !292, file: !291, line: 79, baseType: !64, size: 64, offset: 1152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Radius1", scope: !292, file: !291, line: 80, baseType: !64, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Radius2", scope: !292, file: !291, line: 80, baseType: !64, size: 64, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Base_Radius_Squared", scope: !292, file: !291, line: 81, baseType: !64, size: 64, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Cap_Radius_Squared", scope: !292, file: !291, line: 82, baseType: !64, size: 64, offset: 1408)
!361 = !{!0, !362, !365, !368, !370}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!363 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 113, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!366 = distinct !DIGlobalVariable(name: "BASE_PLANE", scope: !2, file: !3, line: 117, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!369 = distinct !DIGlobalVariable(name: "CAP_PLANE", scope: !2, file: !3, line: 118, type: !367, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!371 = distinct !DIGlobalVariable(name: "CURVE", scope: !2, file: !3, line: 119, type: !367, isLocal: true, isDefinition: true)
!372 = !{!373, !380, !386, !388, !390, !394, !396, !398, !400, !402, !404, !406, !408, !413, !417, !419, !421, !425, !427, !429, !431, !433, !435, !437, !440, !442, !444, !448, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !477, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !507, !509, !511, !515, !519, !523, !525, !527, !529, !531, !533, !535, !537, !539, !541, !545, !549, !553, !555, !557, !559, !564, !568, !572, !574, !576, !578, !580, !582, !584, !586, !588, !590, !592, !594, !596, !601, !605, !609, !611, !613, !615, !622, !626, !630, !632, !634, !636, !638, !640, !642, !646, !650, !652, !654, !656, !658, !662, !666, !670, !672, !674, !676, !678, !680, !682, !686, !690, !694, !696, !700, !704, !706, !708, !710, !712, !714, !716, !722, !727, !731, !737, !741, !746, !748, !750, !754, !758, !771, !775, !779, !783, !787, !792, !796, !800, !804, !808, !816, !820, !824, !826, !830, !834, !838, !844, !848, !852, !854, !862, !866, !873, !875, !879, !883, !887, !891, !896, !900, !904, !905, !906, !907, !909, !910, !911, !912, !913, !914, !915, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !952, !954, !956, !958, !960, !962, !964, !966, !968, !970, !972, !974, !976, !978, !984, !988, !994, !998, !1002, !1006, !1010, !1012, !1014, !1018, !1022, !1026, !1030, !1034, !1036, !1038, !1040, !1044, !1048, !1052, !1054, !1056, !1059, !1061, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1083, !1084, !1085, !1087, !1089, !1091, !1093, !1094, !1095, !1099, !1155, !1159}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !375, file: !379, line: 52)
!374 = !DINamespace(name: "std", scope: null)
!375 = !DISubprogram(name: "abs", scope: !376, file: !376, line: 840, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!377 = !DISubroutineType(types: !378)
!378 = !{!13, !13}
!379 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !381, file: !385, line: 83)
!381 = !DISubprogram(name: "acos", scope: !382, file: !382, line: 53, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!383 = !DISubroutineType(types: !384)
!384 = !{!64, !64}
!385 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !387, file: !385, line: 102)
!387 = !DISubprogram(name: "asin", scope: !382, file: !382, line: 55, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !389, file: !385, line: 121)
!389 = !DISubprogram(name: "atan", scope: !382, file: !382, line: 57, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !391, file: !385, line: 140)
!391 = !DISubprogram(name: "atan2", scope: !382, file: !382, line: 59, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DISubroutineType(types: !393)
!393 = !{!64, !64, !64}
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !395, file: !385, line: 161)
!395 = !DISubprogram(name: "ceil", scope: !382, file: !382, line: 159, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !397, file: !385, line: 180)
!397 = !DISubprogram(name: "cos", scope: !382, file: !382, line: 62, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !399, file: !385, line: 199)
!399 = !DISubprogram(name: "cosh", scope: !382, file: !382, line: 71, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !401, file: !385, line: 218)
!401 = !DISubprogram(name: "exp", scope: !382, file: !382, line: 95, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !403, file: !385, line: 237)
!403 = !DISubprogram(name: "fabs", scope: !382, file: !382, line: 162, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !405, file: !385, line: 256)
!405 = !DISubprogram(name: "floor", scope: !382, file: !382, line: 165, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !407, file: !385, line: 275)
!407 = !DISubprogram(name: "fmod", scope: !382, file: !382, line: 168, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !409, file: !385, line: 296)
!409 = !DISubprogram(name: "frexp", scope: !382, file: !382, line: 98, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!64, !64, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !414, file: !385, line: 315)
!414 = !DISubprogram(name: "ldexp", scope: !382, file: !382, line: 101, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!64, !64, !13}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !418, file: !385, line: 334)
!418 = !DISubprogram(name: "log", scope: !382, file: !382, line: 104, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !420, file: !385, line: 353)
!420 = !DISubprogram(name: "log10", scope: !382, file: !382, line: 107, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !422, file: !385, line: 372)
!422 = !DISubprogram(name: "modf", scope: !382, file: !382, line: 110, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!64, !64, !113}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !426, file: !385, line: 384)
!426 = !DISubprogram(name: "pow", scope: !382, file: !382, line: 140, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !428, file: !385, line: 421)
!428 = !DISubprogram(name: "sin", scope: !382, file: !382, line: 64, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !430, file: !385, line: 440)
!430 = !DISubprogram(name: "sinh", scope: !382, file: !382, line: 73, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !432, file: !385, line: 459)
!432 = !DISubprogram(name: "sqrt", scope: !382, file: !382, line: 143, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !434, file: !385, line: 478)
!434 = !DISubprogram(name: "tan", scope: !382, file: !382, line: 66, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !436, file: !385, line: 497)
!436 = !DISubprogram(name: "tanh", scope: !382, file: !382, line: 75, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !438, file: !385, line: 1065)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !439, line: 150, baseType: !64)
!439 = !DIFile(filename: "/usr/include/math.h", directory: "")
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !441, file: !385, line: 1066)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !439, line: 149, baseType: !45)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !443, file: !385, line: 1069)
!443 = !DISubprogram(name: "acosh", scope: !382, file: !382, line: 85, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !445, file: !385, line: 1070)
!445 = !DISubprogram(name: "acoshf", scope: !382, file: !382, line: 85, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!45, !45}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !449, file: !385, line: 1071)
!449 = !DISubprogram(name: "acoshl", scope: !382, file: !382, line: 85, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !452}
!452 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !454, file: !385, line: 1073)
!454 = !DISubprogram(name: "asinh", scope: !382, file: !382, line: 87, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !456, file: !385, line: 1074)
!456 = !DISubprogram(name: "asinhf", scope: !382, file: !382, line: 87, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !458, file: !385, line: 1075)
!458 = !DISubprogram(name: "asinhl", scope: !382, file: !382, line: 87, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !460, file: !385, line: 1077)
!460 = !DISubprogram(name: "atanh", scope: !382, file: !382, line: 89, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !462, file: !385, line: 1078)
!462 = !DISubprogram(name: "atanhf", scope: !382, file: !382, line: 89, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !464, file: !385, line: 1079)
!464 = !DISubprogram(name: "atanhl", scope: !382, file: !382, line: 89, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !466, file: !385, line: 1081)
!466 = !DISubprogram(name: "cbrt", scope: !382, file: !382, line: 152, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !468, file: !385, line: 1082)
!468 = !DISubprogram(name: "cbrtf", scope: !382, file: !382, line: 152, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !470, file: !385, line: 1083)
!470 = !DISubprogram(name: "cbrtl", scope: !382, file: !382, line: 152, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !472, file: !385, line: 1085)
!472 = !DISubprogram(name: "copysign", scope: !382, file: !382, line: 196, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !474, file: !385, line: 1086)
!474 = !DISubprogram(name: "copysignf", scope: !382, file: !382, line: 196, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DISubroutineType(types: !476)
!476 = !{!45, !45, !45}
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !478, file: !385, line: 1087)
!478 = !DISubprogram(name: "copysignl", scope: !382, file: !382, line: 196, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{!452, !452, !452}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !482, file: !385, line: 1089)
!482 = !DISubprogram(name: "erf", scope: !382, file: !382, line: 228, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !484, file: !385, line: 1090)
!484 = !DISubprogram(name: "erff", scope: !382, file: !382, line: 228, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !486, file: !385, line: 1091)
!486 = !DISubprogram(name: "erfl", scope: !382, file: !382, line: 228, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !488, file: !385, line: 1093)
!488 = !DISubprogram(name: "erfc", scope: !382, file: !382, line: 229, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !490, file: !385, line: 1094)
!490 = !DISubprogram(name: "erfcf", scope: !382, file: !382, line: 229, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !492, file: !385, line: 1095)
!492 = !DISubprogram(name: "erfcl", scope: !382, file: !382, line: 229, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !494, file: !385, line: 1097)
!494 = !DISubprogram(name: "exp2", scope: !382, file: !382, line: 130, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !496, file: !385, line: 1098)
!496 = !DISubprogram(name: "exp2f", scope: !382, file: !382, line: 130, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !498, file: !385, line: 1099)
!498 = !DISubprogram(name: "exp2l", scope: !382, file: !382, line: 130, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !500, file: !385, line: 1101)
!500 = !DISubprogram(name: "expm1", scope: !382, file: !382, line: 119, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !502, file: !385, line: 1102)
!502 = !DISubprogram(name: "expm1f", scope: !382, file: !382, line: 119, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !504, file: !385, line: 1103)
!504 = !DISubprogram(name: "expm1l", scope: !382, file: !382, line: 119, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !506, file: !385, line: 1105)
!506 = !DISubprogram(name: "fdim", scope: !382, file: !382, line: 326, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !508, file: !385, line: 1106)
!508 = !DISubprogram(name: "fdimf", scope: !382, file: !382, line: 326, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !510, file: !385, line: 1107)
!510 = !DISubprogram(name: "fdiml", scope: !382, file: !382, line: 326, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !512, file: !385, line: 1109)
!512 = !DISubprogram(name: "fma", scope: !382, file: !382, line: 335, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{!64, !64, !64, !64}
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !516, file: !385, line: 1110)
!516 = !DISubprogram(name: "fmaf", scope: !382, file: !382, line: 335, type: !517, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{!45, !45, !45, !45}
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !520, file: !385, line: 1111)
!520 = !DISubprogram(name: "fmal", scope: !382, file: !382, line: 335, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{!452, !452, !452, !452}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !524, file: !385, line: 1113)
!524 = !DISubprogram(name: "fmax", scope: !382, file: !382, line: 329, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !526, file: !385, line: 1114)
!526 = !DISubprogram(name: "fmaxf", scope: !382, file: !382, line: 329, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !528, file: !385, line: 1115)
!528 = !DISubprogram(name: "fmaxl", scope: !382, file: !382, line: 329, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !530, file: !385, line: 1117)
!530 = !DISubprogram(name: "fmin", scope: !382, file: !382, line: 332, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !532, file: !385, line: 1118)
!532 = !DISubprogram(name: "fminf", scope: !382, file: !382, line: 332, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !534, file: !385, line: 1119)
!534 = !DISubprogram(name: "fminl", scope: !382, file: !382, line: 332, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !536, file: !385, line: 1121)
!536 = !DISubprogram(name: "hypot", scope: !382, file: !382, line: 147, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !538, file: !385, line: 1122)
!538 = !DISubprogram(name: "hypotf", scope: !382, file: !382, line: 147, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !540, file: !385, line: 1123)
!540 = !DISubprogram(name: "hypotl", scope: !382, file: !382, line: 147, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !542, file: !385, line: 1125)
!542 = !DISubprogram(name: "ilogb", scope: !382, file: !382, line: 280, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!13, !64}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !546, file: !385, line: 1126)
!546 = !DISubprogram(name: "ilogbf", scope: !382, file: !382, line: 280, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!13, !45}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !550, file: !385, line: 1127)
!550 = !DISubprogram(name: "ilogbl", scope: !382, file: !382, line: 280, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!13, !452}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !554, file: !385, line: 1129)
!554 = !DISubprogram(name: "lgamma", scope: !382, file: !382, line: 230, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !556, file: !385, line: 1130)
!556 = !DISubprogram(name: "lgammaf", scope: !382, file: !382, line: 230, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !558, file: !385, line: 1131)
!558 = !DISubprogram(name: "lgammal", scope: !382, file: !382, line: 230, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !560, file: !385, line: 1134)
!560 = !DISubprogram(name: "llrint", scope: !382, file: !382, line: 316, type: !561, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !64}
!563 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !565, file: !385, line: 1135)
!565 = !DISubprogram(name: "llrintf", scope: !382, file: !382, line: 316, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DISubroutineType(types: !567)
!567 = !{!563, !45}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !569, file: !385, line: 1136)
!569 = !DISubprogram(name: "llrintl", scope: !382, file: !382, line: 316, type: !570, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DISubroutineType(types: !571)
!571 = !{!563, !452}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !573, file: !385, line: 1138)
!573 = !DISubprogram(name: "llround", scope: !382, file: !382, line: 322, type: !561, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !575, file: !385, line: 1139)
!575 = !DISubprogram(name: "llroundf", scope: !382, file: !382, line: 322, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !577, file: !385, line: 1140)
!577 = !DISubprogram(name: "llroundl", scope: !382, file: !382, line: 322, type: !570, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !579, file: !385, line: 1143)
!579 = !DISubprogram(name: "log1p", scope: !382, file: !382, line: 122, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !581, file: !385, line: 1144)
!581 = !DISubprogram(name: "log1pf", scope: !382, file: !382, line: 122, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !583, file: !385, line: 1145)
!583 = !DISubprogram(name: "log1pl", scope: !382, file: !382, line: 122, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !585, file: !385, line: 1147)
!585 = !DISubprogram(name: "log2", scope: !382, file: !382, line: 133, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !587, file: !385, line: 1148)
!587 = !DISubprogram(name: "log2f", scope: !382, file: !382, line: 133, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !589, file: !385, line: 1149)
!589 = !DISubprogram(name: "log2l", scope: !382, file: !382, line: 133, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !591, file: !385, line: 1151)
!591 = !DISubprogram(name: "logb", scope: !382, file: !382, line: 125, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !593, file: !385, line: 1152)
!593 = !DISubprogram(name: "logbf", scope: !382, file: !382, line: 125, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !595, file: !385, line: 1153)
!595 = !DISubprogram(name: "logbl", scope: !382, file: !382, line: 125, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !597, file: !385, line: 1155)
!597 = !DISubprogram(name: "lrint", scope: !382, file: !382, line: 314, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DISubroutineType(types: !599)
!599 = !{!600, !64}
!600 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !602, file: !385, line: 1156)
!602 = !DISubprogram(name: "lrintf", scope: !382, file: !382, line: 314, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!600, !45}
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !606, file: !385, line: 1157)
!606 = !DISubprogram(name: "lrintl", scope: !382, file: !382, line: 314, type: !607, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DISubroutineType(types: !608)
!608 = !{!600, !452}
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !610, file: !385, line: 1159)
!610 = !DISubprogram(name: "lround", scope: !382, file: !382, line: 320, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !612, file: !385, line: 1160)
!612 = !DISubprogram(name: "lroundf", scope: !382, file: !382, line: 320, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !614, file: !385, line: 1161)
!614 = !DISubprogram(name: "lroundl", scope: !382, file: !382, line: 320, type: !607, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !616, file: !385, line: 1163)
!616 = !DISubprogram(name: "nan", scope: !382, file: !382, line: 201, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{!64, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !623, file: !385, line: 1164)
!623 = !DISubprogram(name: "nanf", scope: !382, file: !382, line: 201, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!45, !619}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !627, file: !385, line: 1165)
!627 = !DISubprogram(name: "nanl", scope: !382, file: !382, line: 201, type: !628, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!452, !619}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !631, file: !385, line: 1167)
!631 = !DISubprogram(name: "nearbyint", scope: !382, file: !382, line: 294, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !633, file: !385, line: 1168)
!633 = !DISubprogram(name: "nearbyintf", scope: !382, file: !382, line: 294, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !635, file: !385, line: 1169)
!635 = !DISubprogram(name: "nearbyintl", scope: !382, file: !382, line: 294, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !637, file: !385, line: 1171)
!637 = !DISubprogram(name: "nextafter", scope: !382, file: !382, line: 259, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !639, file: !385, line: 1172)
!639 = !DISubprogram(name: "nextafterf", scope: !382, file: !382, line: 259, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !641, file: !385, line: 1173)
!641 = !DISubprogram(name: "nextafterl", scope: !382, file: !382, line: 259, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !643, file: !385, line: 1175)
!643 = !DISubprogram(name: "nexttoward", scope: !382, file: !382, line: 261, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!64, !64, !452}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !647, file: !385, line: 1176)
!647 = !DISubprogram(name: "nexttowardf", scope: !382, file: !382, line: 261, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!45, !45, !452}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !651, file: !385, line: 1177)
!651 = !DISubprogram(name: "nexttowardl", scope: !382, file: !382, line: 261, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !653, file: !385, line: 1179)
!653 = !DISubprogram(name: "remainder", scope: !382, file: !382, line: 272, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !655, file: !385, line: 1180)
!655 = !DISubprogram(name: "remainderf", scope: !382, file: !382, line: 272, type: !475, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !657, file: !385, line: 1181)
!657 = !DISubprogram(name: "remainderl", scope: !382, file: !382, line: 272, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !659, file: !385, line: 1183)
!659 = !DISubprogram(name: "remquo", scope: !382, file: !382, line: 307, type: !660, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!64, !64, !64, !412}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !663, file: !385, line: 1184)
!663 = !DISubprogram(name: "remquof", scope: !382, file: !382, line: 307, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!45, !45, !45, !412}
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !667, file: !385, line: 1185)
!667 = !DISubprogram(name: "remquol", scope: !382, file: !382, line: 307, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{!452, !452, !452, !412}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !671, file: !385, line: 1187)
!671 = !DISubprogram(name: "rint", scope: !382, file: !382, line: 256, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !673, file: !385, line: 1188)
!673 = !DISubprogram(name: "rintf", scope: !382, file: !382, line: 256, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !675, file: !385, line: 1189)
!675 = !DISubprogram(name: "rintl", scope: !382, file: !382, line: 256, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !677, file: !385, line: 1191)
!677 = !DISubprogram(name: "round", scope: !382, file: !382, line: 298, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !679, file: !385, line: 1192)
!679 = !DISubprogram(name: "roundf", scope: !382, file: !382, line: 298, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !681, file: !385, line: 1193)
!681 = !DISubprogram(name: "roundl", scope: !382, file: !382, line: 298, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !683, file: !385, line: 1195)
!683 = !DISubprogram(name: "scalbln", scope: !382, file: !382, line: 290, type: !684, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!64, !64, !600}
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !687, file: !385, line: 1196)
!687 = !DISubprogram(name: "scalblnf", scope: !382, file: !382, line: 290, type: !688, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DISubroutineType(types: !689)
!689 = !{!45, !45, !600}
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !691, file: !385, line: 1197)
!691 = !DISubprogram(name: "scalblnl", scope: !382, file: !382, line: 290, type: !692, flags: DIFlagPrototyped, spFlags: 0)
!692 = !DISubroutineType(types: !693)
!693 = !{!452, !452, !600}
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !695, file: !385, line: 1199)
!695 = !DISubprogram(name: "scalbn", scope: !382, file: !382, line: 276, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !697, file: !385, line: 1200)
!697 = !DISubprogram(name: "scalbnf", scope: !382, file: !382, line: 276, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!45, !45, !13}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !701, file: !385, line: 1201)
!701 = !DISubprogram(name: "scalbnl", scope: !382, file: !382, line: 276, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!452, !452, !13}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !705, file: !385, line: 1203)
!705 = !DISubprogram(name: "tgamma", scope: !382, file: !382, line: 235, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !707, file: !385, line: 1204)
!707 = !DISubprogram(name: "tgammaf", scope: !382, file: !382, line: 235, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !709, file: !385, line: 1205)
!709 = !DISubprogram(name: "tgammal", scope: !382, file: !382, line: 235, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !711, file: !385, line: 1207)
!711 = !DISubprogram(name: "trunc", scope: !382, file: !382, line: 302, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !713, file: !385, line: 1208)
!713 = !DISubprogram(name: "truncf", scope: !382, file: !382, line: 302, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !715, file: !385, line: 1209)
!715 = !DISubprogram(name: "truncl", scope: !382, file: !382, line: 302, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !717, file: !721, line: 38)
!717 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !374, file: !379, line: 103, type: !718, flags: DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !720}
!720 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!721 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !723, file: !721, line: 54)
!723 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !374, file: !385, line: 380, type: !724, flags: DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{!452, !452, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !728, file: !730, line: 127)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !376, line: 62, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!730 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !732, file: !730, line: 128)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !376, line: 70, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !734, identifier: "_ZTS6ldiv_t")
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !733, file: !376, line: 68, baseType: !600, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !733, file: !376, line: 69, baseType: !600, size: 64, offset: 64)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !738, file: !730, line: 130)
!738 = !DISubprogram(name: "abort", scope: !376, file: !376, line: 591, type: !739, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{null}
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !742, file: !730, line: 134)
!742 = !DISubprogram(name: "atexit", scope: !376, file: !376, line: 595, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!13, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !747, file: !730, line: 137)
!747 = !DISubprogram(name: "at_quick_exit", scope: !376, file: !376, line: 600, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !749, file: !730, line: 140)
!749 = !DISubprogram(name: "atof", scope: !376, file: !376, line: 101, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !751, file: !730, line: 141)
!751 = !DISubprogram(name: "atoi", scope: !376, file: !376, line: 104, type: !752, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!13, !619}
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !755, file: !730, line: 142)
!755 = !DISubprogram(name: "atol", scope: !376, file: !376, line: 107, type: !756, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DISubroutineType(types: !757)
!757 = !{!600, !619}
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !759, file: !730, line: 143)
!759 = !DISubprogram(name: "bsearch", scope: !376, file: !376, line: 820, type: !760, flags: DIFlagPrototyped, spFlags: 0)
!760 = !DISubroutineType(types: !761)
!761 = !{!104, !762, !762, !764, !764, !767}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !765, line: 46, baseType: !766)
!765 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!766 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !376, line: 808, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!13, !762, !762}
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !772, file: !730, line: 144)
!772 = !DISubprogram(name: "calloc", scope: !376, file: !376, line: 542, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!104, !764, !764}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !776, file: !730, line: 145)
!776 = !DISubprogram(name: "div", scope: !376, file: !376, line: 852, type: !777, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{!728, !13, !13}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !780, file: !730, line: 146)
!780 = !DISubprogram(name: "exit", scope: !376, file: !376, line: 617, type: !781, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !13}
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !784, file: !730, line: 147)
!784 = !DISubprogram(name: "free", scope: !376, file: !376, line: 565, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !104}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !788, file: !730, line: 148)
!788 = !DISubprogram(name: "getenv", scope: !376, file: !376, line: 634, type: !789, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !619}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !793, file: !730, line: 149)
!793 = !DISubprogram(name: "labs", scope: !376, file: !376, line: 841, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!600, !600}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !797, file: !730, line: 150)
!797 = !DISubprogram(name: "ldiv", scope: !376, file: !376, line: 854, type: !798, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!732, !600, !600}
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !801, file: !730, line: 151)
!801 = !DISubprogram(name: "malloc", scope: !376, file: !376, line: 539, type: !802, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!104, !764}
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !805, file: !730, line: 153)
!805 = !DISubprogram(name: "mblen", scope: !376, file: !376, line: 922, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!13, !619, !764}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !809, file: !730, line: 154)
!809 = !DISubprogram(name: "mbstowcs", scope: !376, file: !376, line: 933, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!764, !812, !815, !764}
!812 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!815 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !619)
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !817, file: !730, line: 155)
!817 = !DISubprogram(name: "mbtowc", scope: !376, file: !376, line: 925, type: !818, flags: DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{!13, !812, !815, !764}
!820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !821, file: !730, line: 157)
!821 = !DISubprogram(name: "qsort", scope: !376, file: !376, line: 830, type: !822, flags: DIFlagPrototyped, spFlags: 0)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !104, !764, !764, !767}
!824 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !825, file: !730, line: 160)
!825 = !DISubprogram(name: "quick_exit", scope: !376, file: !376, line: 623, type: !781, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !827, file: !730, line: 163)
!827 = !DISubprogram(name: "rand", scope: !376, file: !376, line: 453, type: !828, flags: DIFlagPrototyped, spFlags: 0)
!828 = !DISubroutineType(types: !829)
!829 = !{!13}
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !831, file: !730, line: 164)
!831 = !DISubprogram(name: "realloc", scope: !376, file: !376, line: 550, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!104, !104, !764}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !835, file: !730, line: 165)
!835 = !DISubprogram(name: "srand", scope: !376, file: !376, line: 455, type: !836, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !56}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !839, file: !730, line: 166)
!839 = !DISubprogram(name: "strtod", scope: !376, file: !376, line: 117, type: !840, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!64, !815, !842}
!842 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !845, file: !730, line: 167)
!845 = !DISubprogram(name: "strtol", scope: !376, file: !376, line: 176, type: !846, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!600, !815, !842, !13}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !849, file: !730, line: 168)
!849 = !DISubprogram(name: "strtoul", scope: !376, file: !376, line: 180, type: !850, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{!766, !815, !842, !13}
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !853, file: !730, line: 169)
!853 = !DISubprogram(name: "system", scope: !376, file: !376, line: 784, type: !752, flags: DIFlagPrototyped, spFlags: 0)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !855, file: !730, line: 171)
!855 = !DISubprogram(name: "wcstombs", scope: !376, file: !376, line: 936, type: !856, flags: DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!764, !858, !859, !764}
!858 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !791)
!859 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !863, file: !730, line: 172)
!863 = !DISubprogram(name: "wctomb", scope: !376, file: !376, line: 929, type: !864, flags: DIFlagPrototyped, spFlags: 0)
!864 = !DISubroutineType(types: !865)
!865 = !{!13, !791, !814}
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !868, file: !730, line: 200)
!867 = !DINamespace(name: "__gnu_cxx", scope: null)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !376, line: 80, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !870, identifier: "_ZTS7lldiv_t")
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !869, file: !376, line: 78, baseType: !563, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !869, file: !376, line: 79, baseType: !563, size: 64, offset: 64)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !874, file: !730, line: 206)
!874 = !DISubprogram(name: "_Exit", scope: !376, file: !376, line: 629, type: !781, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !876, file: !730, line: 210)
!876 = !DISubprogram(name: "llabs", scope: !376, file: !376, line: 844, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!563, !563}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !880, file: !730, line: 216)
!880 = !DISubprogram(name: "lldiv", scope: !376, file: !376, line: 858, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!868, !563, !563}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !884, file: !730, line: 227)
!884 = !DISubprogram(name: "atoll", scope: !376, file: !376, line: 112, type: !885, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!563, !619}
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !888, file: !730, line: 228)
!888 = !DISubprogram(name: "strtoll", scope: !376, file: !376, line: 200, type: !889, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{!563, !815, !842, !13}
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !892, file: !730, line: 229)
!892 = !DISubprogram(name: "strtoull", scope: !376, file: !376, line: 205, type: !893, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !815, !842, !13}
!895 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !897, file: !730, line: 231)
!897 = !DISubprogram(name: "strtof", scope: !376, file: !376, line: 123, type: !898, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!45, !815, !842}
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !867, entity: !901, file: !730, line: 232)
!901 = !DISubprogram(name: "strtold", scope: !376, file: !376, line: 126, type: !902, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!452, !815, !842}
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !868, file: !730, line: 240)
!905 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !874, file: !730, line: 242)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !876, file: !730, line: 244)
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !908, file: !730, line: 245)
!908 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !867, file: !730, line: 213, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!909 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !880, file: !730, line: 246)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !884, file: !730, line: 248)
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !897, file: !730, line: 249)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !888, file: !730, line: 250)
!913 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !892, file: !730, line: 251)
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !901, file: !730, line: 252)
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !738, file: !916, line: 38)
!916 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
