; ModuleID = 'boxes.cpp'
source_filename = "boxes.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Box_Methods", linkageName: "_ZN3pov11Box_MethodsE", scope: !2, file: !3, line: 86, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "boxes.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !288, globals: !310, imports: !329, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !157, !284}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !158, line: 149, baseType: !56, size: 32, elements: !159, identifier: "_ZTSN3pov5STATSE")
!158 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!160 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!166 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!167 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!174 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!175 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!176 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!210 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!211 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!220 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!221 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!238 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!239 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!242 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!243 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!248 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!249 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!250 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!251 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!255 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!256 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!257 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!258 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!259 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!260 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!261 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!262 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!263 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!264 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!265 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!266 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!267 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!268 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!269 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!270 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!271 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!272 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!273 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!274 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!275 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!276 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!277 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!278 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!279 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!280 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!281 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!282 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!283 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !56, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!288 = !{!289, !104, !44}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOX", scope: !2, file: !291, line: 50, baseType: !292)
!291 = !DIFile(filename: "./boxes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Box_Struct", scope: !2, file: !291, line: 52, size: 1344, flags: DIFlagTypePassByValue, elements: !293, identifier: "_ZTSN3pov10Box_StructE")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !292, file: !291, line: 54, baseType: !19, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !292, file: !291, line: 54, baseType: !13, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !292, file: !291, line: 54, baseType: !14, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !292, file: !291, line: 54, baseType: !23, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !292, file: !291, line: 54, baseType: !23, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !292, file: !291, line: 54, baseType: !28, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !292, file: !291, line: 54, baseType: !14, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !292, file: !291, line: 54, baseType: !14, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !292, file: !291, line: 54, baseType: !34, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !292, file: !291, line: 54, baseType: !38, size: 192, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !292, file: !291, line: 54, baseType: !50, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !292, file: !291, line: 54, baseType: !50, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !292, file: !291, line: 54, baseType: !45, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !292, file: !291, line: 54, baseType: !56, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !292, file: !291, line: 55, baseType: !309, size: 384, offset: 960)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 384, elements: !89)
!310 = !{!0, !311, !314, !316, !319, !321, !323, !325, !327}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!312 = distinct !DIGlobalVariable(name: "SIDE_X_0", scope: !2, file: !3, line: 58, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!315 = distinct !DIGlobalVariable(name: "SIDE_X_1", scope: !2, file: !3, line: 59, type: !313, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!317 = distinct !DIGlobalVariable(name: "CLOSE_TOLERANCE", scope: !2, file: !3, line: 54, type: !318, isLocal: true, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!320 = distinct !DIGlobalVariable(name: "SIDE_Y_0", scope: !2, file: !3, line: 60, type: !313, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!322 = distinct !DIGlobalVariable(name: "SIDE_Y_1", scope: !2, file: !3, line: 61, type: !313, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!324 = distinct !DIGlobalVariable(name: "SIDE_Z_0", scope: !2, file: !3, line: 62, type: !313, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression(DW_OP_constu, 6, DW_OP_stack_value))
!326 = distinct !DIGlobalVariable(name: "SIDE_Z_1", scope: !2, file: !3, line: 63, type: !313, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!328 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 50, type: !318, isLocal: true, isDefinition: true)
!329 = !{!330, !337, !343, !345, !347, !351, !353, !355, !357, !359, !361, !363, !365, !370, !374, !376, !378, !382, !384, !386, !388, !390, !392, !394, !397, !399, !401, !405, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !434, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !472, !476, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !502, !506, !510, !512, !514, !516, !521, !525, !529, !531, !533, !535, !537, !539, !541, !543, !545, !547, !549, !551, !553, !558, !562, !566, !568, !570, !572, !579, !583, !587, !589, !591, !593, !595, !597, !599, !603, !607, !609, !611, !613, !615, !619, !623, !627, !629, !631, !633, !635, !637, !639, !643, !647, !651, !653, !657, !661, !663, !665, !667, !669, !671, !673, !679, !684, !688, !694, !698, !703, !705, !707, !711, !715, !728, !732, !736, !740, !744, !749, !753, !757, !761, !765, !773, !777, !781, !783, !787, !791, !795, !801, !805, !809, !811, !819, !823, !830, !832, !836, !840, !844, !848, !853, !857, !861, !862, !863, !864, !866, !867, !868, !869, !870, !871, !872, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !909, !911, !913, !915, !917, !919, !921, !923, !925, !927, !929, !931, !933, !935, !941, !945, !951, !955, !959, !963, !967, !969, !971, !975, !979, !983, !987, !991, !993, !995, !997, !1001, !1005, !1009, !1011, !1013, !1016, !1018, !1019, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1040, !1041, !1042, !1044, !1045, !1047, !1049}
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !332, file: !336, line: 52)
!331 = !DINamespace(name: "std", scope: null)
!332 = !DISubprogram(name: "abs", scope: !333, file: !333, line: 840, type: !334, flags: DIFlagPrototyped, spFlags: 0)
!333 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!334 = !DISubroutineType(types: !335)
!335 = !{!13, !13}
!336 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !338, file: !342, line: 83)
!338 = !DISubprogram(name: "acos", scope: !339, file: !339, line: 53, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!340 = !DISubroutineType(types: !341)
!341 = !{!64, !64}
!342 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !344, file: !342, line: 102)
!344 = !DISubprogram(name: "asin", scope: !339, file: !339, line: 55, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !346, file: !342, line: 121)
!346 = !DISubprogram(name: "atan", scope: !339, file: !339, line: 57, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !348, file: !342, line: 140)
!348 = !DISubprogram(name: "atan2", scope: !339, file: !339, line: 59, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!349 = !DISubroutineType(types: !350)
!350 = !{!64, !64, !64}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !352, file: !342, line: 161)
!352 = !DISubprogram(name: "ceil", scope: !339, file: !339, line: 159, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !354, file: !342, line: 180)
!354 = !DISubprogram(name: "cos", scope: !339, file: !339, line: 62, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !356, file: !342, line: 199)
!356 = !DISubprogram(name: "cosh", scope: !339, file: !339, line: 71, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !358, file: !342, line: 218)
!358 = !DISubprogram(name: "exp", scope: !339, file: !339, line: 95, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !360, file: !342, line: 237)
!360 = !DISubprogram(name: "fabs", scope: !339, file: !339, line: 162, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !362, file: !342, line: 256)
!362 = !DISubprogram(name: "floor", scope: !339, file: !339, line: 165, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !364, file: !342, line: 275)
!364 = !DISubprogram(name: "fmod", scope: !339, file: !339, line: 168, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !366, file: !342, line: 296)
!366 = !DISubprogram(name: "frexp", scope: !339, file: !339, line: 98, type: !367, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!64, !64, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !371, file: !342, line: 315)
!371 = !DISubprogram(name: "ldexp", scope: !339, file: !339, line: 101, type: !372, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DISubroutineType(types: !373)
!373 = !{!64, !64, !13}
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !375, file: !342, line: 334)
!375 = !DISubprogram(name: "log", scope: !339, file: !339, line: 104, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !377, file: !342, line: 353)
!377 = !DISubprogram(name: "log10", scope: !339, file: !339, line: 107, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !379, file: !342, line: 372)
!379 = !DISubprogram(name: "modf", scope: !339, file: !339, line: 110, type: !380, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DISubroutineType(types: !381)
!381 = !{!64, !64, !113}
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !383, file: !342, line: 384)
!383 = !DISubprogram(name: "pow", scope: !339, file: !339, line: 140, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !385, file: !342, line: 421)
!385 = !DISubprogram(name: "sin", scope: !339, file: !339, line: 64, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !387, file: !342, line: 440)
!387 = !DISubprogram(name: "sinh", scope: !339, file: !339, line: 73, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !389, file: !342, line: 459)
!389 = !DISubprogram(name: "sqrt", scope: !339, file: !339, line: 143, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !391, file: !342, line: 478)
!391 = !DISubprogram(name: "tan", scope: !339, file: !339, line: 66, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !393, file: !342, line: 497)
!393 = !DISubprogram(name: "tanh", scope: !339, file: !339, line: 75, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !395, file: !342, line: 1065)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !396, line: 150, baseType: !64)
!396 = !DIFile(filename: "/usr/include/math.h", directory: "")
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !398, file: !342, line: 1066)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !396, line: 149, baseType: !45)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !400, file: !342, line: 1069)
!400 = !DISubprogram(name: "acosh", scope: !339, file: !339, line: 85, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !402, file: !342, line: 1070)
!402 = !DISubprogram(name: "acoshf", scope: !339, file: !339, line: 85, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{!45, !45}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !406, file: !342, line: 1071)
!406 = !DISubprogram(name: "acoshl", scope: !339, file: !339, line: 85, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{!409, !409}
!409 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !411, file: !342, line: 1073)
!411 = !DISubprogram(name: "asinh", scope: !339, file: !339, line: 87, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !413, file: !342, line: 1074)
!413 = !DISubprogram(name: "asinhf", scope: !339, file: !339, line: 87, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !415, file: !342, line: 1075)
!415 = !DISubprogram(name: "asinhl", scope: !339, file: !339, line: 87, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !417, file: !342, line: 1077)
!417 = !DISubprogram(name: "atanh", scope: !339, file: !339, line: 89, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !419, file: !342, line: 1078)
!419 = !DISubprogram(name: "atanhf", scope: !339, file: !339, line: 89, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !421, file: !342, line: 1079)
!421 = !DISubprogram(name: "atanhl", scope: !339, file: !339, line: 89, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !423, file: !342, line: 1081)
!423 = !DISubprogram(name: "cbrt", scope: !339, file: !339, line: 152, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !425, file: !342, line: 1082)
!425 = !DISubprogram(name: "cbrtf", scope: !339, file: !339, line: 152, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !427, file: !342, line: 1083)
!427 = !DISubprogram(name: "cbrtl", scope: !339, file: !339, line: 152, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !429, file: !342, line: 1085)
!429 = !DISubprogram(name: "copysign", scope: !339, file: !339, line: 196, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !431, file: !342, line: 1086)
!431 = !DISubprogram(name: "copysignf", scope: !339, file: !339, line: 196, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!45, !45, !45}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !435, file: !342, line: 1087)
!435 = !DISubprogram(name: "copysignl", scope: !339, file: !339, line: 196, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!409, !409, !409}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !439, file: !342, line: 1089)
!439 = !DISubprogram(name: "erf", scope: !339, file: !339, line: 228, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !441, file: !342, line: 1090)
!441 = !DISubprogram(name: "erff", scope: !339, file: !339, line: 228, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !443, file: !342, line: 1091)
!443 = !DISubprogram(name: "erfl", scope: !339, file: !339, line: 228, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !445, file: !342, line: 1093)
!445 = !DISubprogram(name: "erfc", scope: !339, file: !339, line: 229, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !447, file: !342, line: 1094)
!447 = !DISubprogram(name: "erfcf", scope: !339, file: !339, line: 229, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !449, file: !342, line: 1095)
!449 = !DISubprogram(name: "erfcl", scope: !339, file: !339, line: 229, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !451, file: !342, line: 1097)
!451 = !DISubprogram(name: "exp2", scope: !339, file: !339, line: 130, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !453, file: !342, line: 1098)
!453 = !DISubprogram(name: "exp2f", scope: !339, file: !339, line: 130, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !455, file: !342, line: 1099)
!455 = !DISubprogram(name: "exp2l", scope: !339, file: !339, line: 130, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !457, file: !342, line: 1101)
!457 = !DISubprogram(name: "expm1", scope: !339, file: !339, line: 119, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !459, file: !342, line: 1102)
!459 = !DISubprogram(name: "expm1f", scope: !339, file: !339, line: 119, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !461, file: !342, line: 1103)
!461 = !DISubprogram(name: "expm1l", scope: !339, file: !339, line: 119, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !463, file: !342, line: 1105)
!463 = !DISubprogram(name: "fdim", scope: !339, file: !339, line: 326, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !465, file: !342, line: 1106)
!465 = !DISubprogram(name: "fdimf", scope: !339, file: !339, line: 326, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !467, file: !342, line: 1107)
!467 = !DISubprogram(name: "fdiml", scope: !339, file: !339, line: 326, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !469, file: !342, line: 1109)
!469 = !DISubprogram(name: "fma", scope: !339, file: !339, line: 335, type: !470, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DISubroutineType(types: !471)
!471 = !{!64, !64, !64, !64}
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !473, file: !342, line: 1110)
!473 = !DISubprogram(name: "fmaf", scope: !339, file: !339, line: 335, type: !474, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!45, !45, !45, !45}
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !477, file: !342, line: 1111)
!477 = !DISubprogram(name: "fmal", scope: !339, file: !339, line: 335, type: !478, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{!409, !409, !409, !409}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !481, file: !342, line: 1113)
!481 = !DISubprogram(name: "fmax", scope: !339, file: !339, line: 329, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !483, file: !342, line: 1114)
!483 = !DISubprogram(name: "fmaxf", scope: !339, file: !339, line: 329, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !485, file: !342, line: 1115)
!485 = !DISubprogram(name: "fmaxl", scope: !339, file: !339, line: 329, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !487, file: !342, line: 1117)
!487 = !DISubprogram(name: "fmin", scope: !339, file: !339, line: 332, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !489, file: !342, line: 1118)
!489 = !DISubprogram(name: "fminf", scope: !339, file: !339, line: 332, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !491, file: !342, line: 1119)
!491 = !DISubprogram(name: "fminl", scope: !339, file: !339, line: 332, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !493, file: !342, line: 1121)
!493 = !DISubprogram(name: "hypot", scope: !339, file: !339, line: 147, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !495, file: !342, line: 1122)
!495 = !DISubprogram(name: "hypotf", scope: !339, file: !339, line: 147, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !497, file: !342, line: 1123)
!497 = !DISubprogram(name: "hypotl", scope: !339, file: !339, line: 147, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !499, file: !342, line: 1125)
!499 = !DISubprogram(name: "ilogb", scope: !339, file: !339, line: 280, type: !500, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!13, !64}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !503, file: !342, line: 1126)
!503 = !DISubprogram(name: "ilogbf", scope: !339, file: !339, line: 280, type: !504, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{!13, !45}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !507, file: !342, line: 1127)
!507 = !DISubprogram(name: "ilogbl", scope: !339, file: !339, line: 280, type: !508, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DISubroutineType(types: !509)
!509 = !{!13, !409}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !511, file: !342, line: 1129)
!511 = !DISubprogram(name: "lgamma", scope: !339, file: !339, line: 230, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !513, file: !342, line: 1130)
!513 = !DISubprogram(name: "lgammaf", scope: !339, file: !339, line: 230, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !515, file: !342, line: 1131)
!515 = !DISubprogram(name: "lgammal", scope: !339, file: !339, line: 230, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !517, file: !342, line: 1134)
!517 = !DISubprogram(name: "llrint", scope: !339, file: !339, line: 316, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !64}
!520 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !522, file: !342, line: 1135)
!522 = !DISubprogram(name: "llrintf", scope: !339, file: !339, line: 316, type: !523, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DISubroutineType(types: !524)
!524 = !{!520, !45}
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !526, file: !342, line: 1136)
!526 = !DISubprogram(name: "llrintl", scope: !339, file: !339, line: 316, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!520, !409}
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !530, file: !342, line: 1138)
!530 = !DISubprogram(name: "llround", scope: !339, file: !339, line: 322, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !532, file: !342, line: 1139)
!532 = !DISubprogram(name: "llroundf", scope: !339, file: !339, line: 322, type: !523, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !534, file: !342, line: 1140)
!534 = !DISubprogram(name: "llroundl", scope: !339, file: !339, line: 322, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !536, file: !342, line: 1143)
!536 = !DISubprogram(name: "log1p", scope: !339, file: !339, line: 122, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !538, file: !342, line: 1144)
!538 = !DISubprogram(name: "log1pf", scope: !339, file: !339, line: 122, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !540, file: !342, line: 1145)
!540 = !DISubprogram(name: "log1pl", scope: !339, file: !339, line: 122, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !542, file: !342, line: 1147)
!542 = !DISubprogram(name: "log2", scope: !339, file: !339, line: 133, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !544, file: !342, line: 1148)
!544 = !DISubprogram(name: "log2f", scope: !339, file: !339, line: 133, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !546, file: !342, line: 1149)
!546 = !DISubprogram(name: "log2l", scope: !339, file: !339, line: 133, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !548, file: !342, line: 1151)
!548 = !DISubprogram(name: "logb", scope: !339, file: !339, line: 125, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !550, file: !342, line: 1152)
!550 = !DISubprogram(name: "logbf", scope: !339, file: !339, line: 125, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !552, file: !342, line: 1153)
!552 = !DISubprogram(name: "logbl", scope: !339, file: !339, line: 125, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !554, file: !342, line: 1155)
!554 = !DISubprogram(name: "lrint", scope: !339, file: !339, line: 314, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !64}
!557 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !559, file: !342, line: 1156)
!559 = !DISubprogram(name: "lrintf", scope: !339, file: !339, line: 314, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DISubroutineType(types: !561)
!561 = !{!557, !45}
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !563, file: !342, line: 1157)
!563 = !DISubprogram(name: "lrintl", scope: !339, file: !339, line: 314, type: !564, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DISubroutineType(types: !565)
!565 = !{!557, !409}
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !567, file: !342, line: 1159)
!567 = !DISubprogram(name: "lround", scope: !339, file: !339, line: 320, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !569, file: !342, line: 1160)
!569 = !DISubprogram(name: "lroundf", scope: !339, file: !339, line: 320, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !571, file: !342, line: 1161)
!571 = !DISubprogram(name: "lroundl", scope: !339, file: !339, line: 320, type: !564, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !573, file: !342, line: 1163)
!573 = !DISubprogram(name: "nan", scope: !339, file: !339, line: 201, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!64, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !580, file: !342, line: 1164)
!580 = !DISubprogram(name: "nanf", scope: !339, file: !339, line: 201, type: !581, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{!45, !576}
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !584, file: !342, line: 1165)
!584 = !DISubprogram(name: "nanl", scope: !339, file: !339, line: 201, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DISubroutineType(types: !586)
!586 = !{!409, !576}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !588, file: !342, line: 1167)
!588 = !DISubprogram(name: "nearbyint", scope: !339, file: !339, line: 294, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !590, file: !342, line: 1168)
!590 = !DISubprogram(name: "nearbyintf", scope: !339, file: !339, line: 294, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !592, file: !342, line: 1169)
!592 = !DISubprogram(name: "nearbyintl", scope: !339, file: !339, line: 294, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !594, file: !342, line: 1171)
!594 = !DISubprogram(name: "nextafter", scope: !339, file: !339, line: 259, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !596, file: !342, line: 1172)
!596 = !DISubprogram(name: "nextafterf", scope: !339, file: !339, line: 259, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !598, file: !342, line: 1173)
!598 = !DISubprogram(name: "nextafterl", scope: !339, file: !339, line: 259, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !600, file: !342, line: 1175)
!600 = !DISubprogram(name: "nexttoward", scope: !339, file: !339, line: 261, type: !601, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DISubroutineType(types: !602)
!602 = !{!64, !64, !409}
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !604, file: !342, line: 1176)
!604 = !DISubprogram(name: "nexttowardf", scope: !339, file: !339, line: 261, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!45, !45, !409}
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !608, file: !342, line: 1177)
!608 = !DISubprogram(name: "nexttowardl", scope: !339, file: !339, line: 261, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !610, file: !342, line: 1179)
!610 = !DISubprogram(name: "remainder", scope: !339, file: !339, line: 272, type: !349, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !612, file: !342, line: 1180)
!612 = !DISubprogram(name: "remainderf", scope: !339, file: !339, line: 272, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !614, file: !342, line: 1181)
!614 = !DISubprogram(name: "remainderl", scope: !339, file: !339, line: 272, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !616, file: !342, line: 1183)
!616 = !DISubprogram(name: "remquo", scope: !339, file: !339, line: 307, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{!64, !64, !64, !369}
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !620, file: !342, line: 1184)
!620 = !DISubprogram(name: "remquof", scope: !339, file: !339, line: 307, type: !621, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{!45, !45, !45, !369}
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !624, file: !342, line: 1185)
!624 = !DISubprogram(name: "remquol", scope: !339, file: !339, line: 307, type: !625, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{!409, !409, !409, !369}
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !628, file: !342, line: 1187)
!628 = !DISubprogram(name: "rint", scope: !339, file: !339, line: 256, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !630, file: !342, line: 1188)
!630 = !DISubprogram(name: "rintf", scope: !339, file: !339, line: 256, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !632, file: !342, line: 1189)
!632 = !DISubprogram(name: "rintl", scope: !339, file: !339, line: 256, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !634, file: !342, line: 1191)
!634 = !DISubprogram(name: "round", scope: !339, file: !339, line: 298, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !636, file: !342, line: 1192)
!636 = !DISubprogram(name: "roundf", scope: !339, file: !339, line: 298, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !638, file: !342, line: 1193)
!638 = !DISubprogram(name: "roundl", scope: !339, file: !339, line: 298, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !640, file: !342, line: 1195)
!640 = !DISubprogram(name: "scalbln", scope: !339, file: !339, line: 290, type: !641, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DISubroutineType(types: !642)
!642 = !{!64, !64, !557}
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !644, file: !342, line: 1196)
!644 = !DISubprogram(name: "scalblnf", scope: !339, file: !339, line: 290, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!45, !45, !557}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !648, file: !342, line: 1197)
!648 = !DISubprogram(name: "scalblnl", scope: !339, file: !339, line: 290, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!409, !409, !557}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !652, file: !342, line: 1199)
!652 = !DISubprogram(name: "scalbn", scope: !339, file: !339, line: 276, type: !372, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !654, file: !342, line: 1200)
!654 = !DISubprogram(name: "scalbnf", scope: !339, file: !339, line: 276, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!45, !45, !13}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !658, file: !342, line: 1201)
!658 = !DISubprogram(name: "scalbnl", scope: !339, file: !339, line: 276, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!409, !409, !13}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !662, file: !342, line: 1203)
!662 = !DISubprogram(name: "tgamma", scope: !339, file: !339, line: 235, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !664, file: !342, line: 1204)
!664 = !DISubprogram(name: "tgammaf", scope: !339, file: !339, line: 235, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !666, file: !342, line: 1205)
!666 = !DISubprogram(name: "tgammal", scope: !339, file: !339, line: 235, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !668, file: !342, line: 1207)
!668 = !DISubprogram(name: "trunc", scope: !339, file: !339, line: 302, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !670, file: !342, line: 1208)
!670 = !DISubprogram(name: "truncf", scope: !339, file: !339, line: 302, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !672, file: !342, line: 1209)
!672 = !DISubprogram(name: "truncl", scope: !339, file: !339, line: 302, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !674, file: !678, line: 38)
!674 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !331, file: !336, line: 103, type: !675, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !677}
!677 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!678 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !680, file: !678, line: 54)
!680 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !331, file: !342, line: 380, type: !681, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DISubroutineType(types: !682)
!682 = !{!409, !409, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !685, file: !687, line: 127)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !333, line: 62, baseType: !686)
!686 = !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!687 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !689, file: !687, line: 128)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !333, line: 70, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !691, identifier: "_ZTS6ldiv_t")
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !690, file: !333, line: 68, baseType: !557, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !690, file: !333, line: 69, baseType: !557, size: 64, offset: 64)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !695, file: !687, line: 130)
!695 = !DISubprogram(name: "abort", scope: !333, file: !333, line: 591, type: !696, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!696 = !DISubroutineType(types: !697)
!697 = !{null}
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !699, file: !687, line: 134)
!699 = !DISubprogram(name: "atexit", scope: !333, file: !333, line: 595, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{!13, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !704, file: !687, line: 137)
!704 = !DISubprogram(name: "at_quick_exit", scope: !333, file: !333, line: 600, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !706, file: !687, line: 140)
!706 = !DISubprogram(name: "atof", scope: !333, file: !333, line: 101, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !708, file: !687, line: 141)
!708 = !DISubprogram(name: "atoi", scope: !333, file: !333, line: 104, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{!13, !576}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !712, file: !687, line: 142)
!712 = !DISubprogram(name: "atol", scope: !333, file: !333, line: 107, type: !713, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!557, !576}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !716, file: !687, line: 143)
!716 = !DISubprogram(name: "bsearch", scope: !333, file: !333, line: 820, type: !717, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!104, !719, !719, !721, !721, !724}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !722, line: 46, baseType: !723)
!722 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!723 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !333, line: 808, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!13, !719, !719}
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !729, file: !687, line: 144)
!729 = !DISubprogram(name: "calloc", scope: !333, file: !333, line: 542, type: !730, flags: DIFlagPrototyped, spFlags: 0)
!730 = !DISubroutineType(types: !731)
!731 = !{!104, !721, !721}
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !733, file: !687, line: 145)
!733 = !DISubprogram(name: "div", scope: !333, file: !333, line: 852, type: !734, flags: DIFlagPrototyped, spFlags: 0)
!734 = !DISubroutineType(types: !735)
!735 = !{!685, !13, !13}
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !737, file: !687, line: 146)
!737 = !DISubprogram(name: "exit", scope: !333, file: !333, line: 617, type: !738, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !13}
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !741, file: !687, line: 147)
!741 = !DISubprogram(name: "free", scope: !333, file: !333, line: 565, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !104}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !745, file: !687, line: 148)
!745 = !DISubprogram(name: "getenv", scope: !333, file: !333, line: 634, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !576}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !750, file: !687, line: 149)
!750 = !DISubprogram(name: "labs", scope: !333, file: !333, line: 841, type: !751, flags: DIFlagPrototyped, spFlags: 0)
!751 = !DISubroutineType(types: !752)
!752 = !{!557, !557}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !754, file: !687, line: 150)
!754 = !DISubprogram(name: "ldiv", scope: !333, file: !333, line: 854, type: !755, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DISubroutineType(types: !756)
!756 = !{!689, !557, !557}
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !758, file: !687, line: 151)
!758 = !DISubprogram(name: "malloc", scope: !333, file: !333, line: 539, type: !759, flags: DIFlagPrototyped, spFlags: 0)
!759 = !DISubroutineType(types: !760)
!760 = !{!104, !721}
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !762, file: !687, line: 153)
!762 = !DISubprogram(name: "mblen", scope: !333, file: !333, line: 922, type: !763, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!13, !576, !721}
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !766, file: !687, line: 154)
!766 = !DISubprogram(name: "mbstowcs", scope: !333, file: !333, line: 933, type: !767, flags: DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{!721, !769, !772, !721}
!769 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!772 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !576)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !774, file: !687, line: 155)
!774 = !DISubprogram(name: "mbtowc", scope: !333, file: !333, line: 925, type: !775, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!13, !769, !772, !721}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !778, file: !687, line: 157)
!778 = !DISubprogram(name: "qsort", scope: !333, file: !333, line: 830, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !104, !721, !721, !724}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !782, file: !687, line: 160)
!782 = !DISubprogram(name: "quick_exit", scope: !333, file: !333, line: 623, type: !738, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !784, file: !687, line: 163)
!784 = !DISubprogram(name: "rand", scope: !333, file: !333, line: 453, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!13}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !788, file: !687, line: 164)
!788 = !DISubprogram(name: "realloc", scope: !333, file: !333, line: 550, type: !789, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{!104, !104, !721}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !792, file: !687, line: 165)
!792 = !DISubprogram(name: "srand", scope: !333, file: !333, line: 455, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !56}
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !796, file: !687, line: 166)
!796 = !DISubprogram(name: "strtod", scope: !333, file: !333, line: 117, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!64, !772, !799}
!799 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !802, file: !687, line: 167)
!802 = !DISubprogram(name: "strtol", scope: !333, file: !333, line: 176, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!557, !772, !799, !13}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !806, file: !687, line: 168)
!806 = !DISubprogram(name: "strtoul", scope: !333, file: !333, line: 180, type: !807, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{!723, !772, !799, !13}
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !810, file: !687, line: 169)
!810 = !DISubprogram(name: "system", scope: !333, file: !333, line: 784, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !812, file: !687, line: 171)
!812 = !DISubprogram(name: "wcstombs", scope: !333, file: !333, line: 936, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!721, !815, !816, !721}
!815 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !748)
!816 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !820, file: !687, line: 172)
!820 = !DISubprogram(name: "wctomb", scope: !333, file: !333, line: 929, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!13, !748, !771}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !825, file: !687, line: 200)
!824 = !DINamespace(name: "__gnu_cxx", scope: null)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !333, line: 80, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !827, identifier: "_ZTS7lldiv_t")
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !826, file: !333, line: 78, baseType: !520, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !826, file: !333, line: 79, baseType: !520, size: 64, offset: 64)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !831, file: !687, line: 206)
!831 = !DISubprogram(name: "_Exit", scope: !333, file: !333, line: 629, type: !738, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !833, file: !687, line: 210)
!833 = !DISubprogram(name: "llabs", scope: !333, file: !333, line: 844, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!520, !520}
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !837, file: !687, line: 216)
!837 = !DISubprogram(name: "lldiv", scope: !333, file: !333, line: 858, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!825, !520, !520}
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !841, file: !687, line: 227)
!841 = !DISubprogram(name: "atoll", scope: !333, file: !333, line: 112, type: !842, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!520, !576}
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !845, file: !687, line: 228)
!845 = !DISubprogram(name: "strtoll", scope: !333, file: !333, line: 200, type: !846, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!520, !772, !799, !13}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !849, file: !687, line: 229)
!849 = !DISubprogram(name: "strtoull", scope: !333, file: !333, line: 205, type: !850, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{!852, !772, !799, !13}
!852 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !854, file: !687, line: 231)
!854 = !DISubprogram(name: "strtof", scope: !333, file: !333, line: 123, type: !855, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DISubroutineType(types: !856)
!856 = !{!45, !772, !799}
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !824, entity: !858, file: !687, line: 232)
!858 = !DISubprogram(name: "strtold", scope: !333, file: !333, line: 126, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{!409, !772, !799}
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !825, file: !687, line: 240)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !831, file: !687, line: 242)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !833, file: !687, line: 244)
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !865, file: !687, line: 245)
!865 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !824, file: !687, line: 213, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !837, file: !687, line: 246)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !841, file: !687, line: 248)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !854, file: !687, line: 249)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !845, file: !687, line: 250)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !849, file: !687, line: 251)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !331, entity: !858, file: !687, line: 252)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !695, file: !873, line: 38)
!873 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
