; ModuleID = 'quadrics.cpp'
source_filename = "quadrics.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Quadric_Methods", linkageName: "_ZN3pov15Quadric_MethodsE", scope: !2, file: !3, line: 97, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "quadrics.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !115, !121, !128, !130, !135, !140, !142, !144, !149, !154}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !65, !79}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !61, !62, !63}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !53, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !{!54, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !52, file: !5, line: 1018, baseType: !55, size: 1024)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !5, line: 693, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !58)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !{!59, !59}
!59 = !DISubrange(count: 4)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !5, line: 1019, baseType: !55, size: 1024, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !64, size: 32, offset: 928)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !68, identifier: "_ZTSN3pov10Ray_StructE")
!68 = !{!69, !72, !73, !74, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !67, file: !5, line: 1799, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !46)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !67, file: !5, line: 1800, baseType: !70, size: 192, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !67, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !67, file: !5, line: 1802, baseType: !64, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !67, file: !5, line: 1803, baseType: !76, size: 6400, offset: 448)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 100)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN3pov13istack_structE")
!82 = !{!83, !85, !113, !114}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !5, line: 1637, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !81, file: !5, line: 1638, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN3pov10istk_entryE")
!88 = !{!89, !90, !91, !92, !93, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !87, file: !5, line: 1612, baseType: !57, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !87, file: !5, line: 1613, baseType: !70, size: 192, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !87, file: !5, line: 1614, baseType: !70, size: 192, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !87, file: !5, line: 1615, baseType: !70, size: 192, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !87, file: !5, line: 1616, baseType: !94, size: 128, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !87, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !87, file: !5, line: 1630, baseType: !111, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !87, file: !5, line: 1632, baseType: !111, size: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !81, file: !5, line: 1639, baseType: !64, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !81, file: !5, line: 1640, baseType: !64, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!13, !120, !14}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !120, !14, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !87)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !123)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!111, !14}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !14, !120, !50}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !141, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !137)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !137)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !14, !50}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !14}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !151)
!156 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !157, retainedTypes: !291, globals: !338, imports: !339, splitDebugInlining: false, nameTableKind: None)
!157 = !{!158, !164}
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !64, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163}
!160 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !165, line: 149, baseType: !64, size: 32, elements: !166, identifier: "_ZTSN3pov5STATSE")
!165 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!167 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!171 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!172 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!173 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!174 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!181 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!182 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!183 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!184 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!217 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!218 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!227 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!228 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!245 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!246 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!249 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!250 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!255 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!256 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!257 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!258 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!262 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!263 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!264 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!265 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!266 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!267 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!268 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!269 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!270 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!271 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!272 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!273 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!274 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!275 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!276 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!277 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!278 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!279 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!280 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!281 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!282 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!283 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!284 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!285 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!286 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!287 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!288 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!289 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!290 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!291 = !{!292, !317, !44, !111}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUADRIC", scope: !2, file: !294, line: 52, baseType: !295)
!294 = !DIFile(filename: "./quadrics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Quadric_Struct", scope: !2, file: !294, line: 54, size: 1664, flags: DIFlagTypePassByValue, elements: !296, identifier: "_ZTSN3pov14Quadric_StructE")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !295, file: !294, line: 56, baseType: !19, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !295, file: !294, line: 56, baseType: !13, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !295, file: !294, line: 56, baseType: !14, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !295, file: !294, line: 56, baseType: !23, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !295, file: !294, line: 56, baseType: !23, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !295, file: !294, line: 56, baseType: !28, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !295, file: !294, line: 56, baseType: !14, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !295, file: !294, line: 56, baseType: !14, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !295, file: !294, line: 56, baseType: !34, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !295, file: !294, line: 56, baseType: !38, size: 192, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !295, file: !294, line: 56, baseType: !50, size: 64, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !295, file: !294, line: 56, baseType: !50, size: 64, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !295, file: !294, line: 56, baseType: !45, size: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !295, file: !294, line: 56, baseType: !64, size: 32, offset: 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Square_Terms", scope: !295, file: !294, line: 57, baseType: !70, size: 192, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Mixed_Terms", scope: !295, file: !294, line: 58, baseType: !70, size: 192, offset: 1152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", scope: !295, file: !294, line: 59, baseType: !70, size: 192, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Constant", scope: !295, file: !294, line: 60, baseType: !57, size: 64, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Automatic_Bounds", scope: !295, file: !294, line: 61, baseType: !316, size: 8, offset: 1600)
!316 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLANE", scope: !2, file: !319, line: 50, baseType: !320)
!319 = !DIFile(filename: "./planes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Plane_Struct", scope: !2, file: !319, line: 52, size: 1216, flags: DIFlagTypePassByValue, elements: !321, identifier: "_ZTSN3pov12Plane_StructE")
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !320, file: !319, line: 54, baseType: !19, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !320, file: !319, line: 54, baseType: !13, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !320, file: !319, line: 54, baseType: !14, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !320, file: !319, line: 54, baseType: !23, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !320, file: !319, line: 54, baseType: !23, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !320, file: !319, line: 54, baseType: !28, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !320, file: !319, line: 54, baseType: !14, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !320, file: !319, line: 54, baseType: !14, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !320, file: !319, line: 54, baseType: !34, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !320, file: !319, line: 54, baseType: !38, size: 192, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !320, file: !319, line: 54, baseType: !50, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !320, file: !319, line: 54, baseType: !50, size: 64, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !320, file: !319, line: 54, baseType: !45, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !320, file: !319, line: 54, baseType: !64, size: 32, offset: 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vector", scope: !320, file: !319, line: 55, baseType: !70, size: 192, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !320, file: !319, line: 56, baseType: !57, size: 64, offset: 1152)
!338 = !{!0}
!339 = !{!340, !347, !353, !355, !357, !361, !363, !365, !367, !369, !371, !373, !375, !380, !384, !386, !388, !392, !394, !396, !398, !400, !402, !404, !407, !409, !411, !415, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !444, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !482, !486, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !512, !516, !520, !522, !524, !526, !531, !535, !539, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !568, !572, !576, !578, !580, !582, !589, !593, !597, !599, !601, !603, !605, !607, !609, !613, !617, !619, !621, !623, !625, !629, !633, !637, !639, !641, !643, !645, !647, !649, !653, !657, !661, !663, !667, !671, !673, !675, !677, !679, !681, !683, !689, !694, !698, !704, !708, !713, !715, !717, !721, !725, !738, !742, !746, !750, !754, !759, !763, !767, !771, !775, !783, !787, !791, !793, !797, !801, !805, !811, !815, !819, !821, !829, !833, !840, !842, !846, !850, !854, !858, !863, !867, !871, !872, !873, !874, !876, !877, !878, !879, !880, !881, !882, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !943, !945, !951, !955, !961, !965, !969, !973, !977, !979, !981, !985, !989, !993, !997, !1001, !1003, !1005, !1007, !1011, !1015, !1019, !1021, !1023, !1026, !1028, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1050, !1051, !1052, !1054, !1056, !1058, !1059, !1060, !1064, !1119, !1123}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !342, file: !346, line: 52)
!341 = !DINamespace(name: "std", scope: null)
!342 = !DISubprogram(name: "abs", scope: !343, file: !343, line: 840, type: !344, flags: DIFlagPrototyped, spFlags: 0)
!343 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!344 = !DISubroutineType(types: !345)
!345 = !{!13, !13}
!346 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !348, file: !352, line: 83)
!348 = !DISubprogram(name: "acos", scope: !349, file: !349, line: 53, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!349 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!350 = !DISubroutineType(types: !351)
!351 = !{!57, !57}
!352 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !354, file: !352, line: 102)
!354 = !DISubprogram(name: "asin", scope: !349, file: !349, line: 55, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !356, file: !352, line: 121)
!356 = !DISubprogram(name: "atan", scope: !349, file: !349, line: 57, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !358, file: !352, line: 140)
!358 = !DISubprogram(name: "atan2", scope: !349, file: !349, line: 59, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!57, !57, !57}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !362, file: !352, line: 161)
!362 = !DISubprogram(name: "ceil", scope: !349, file: !349, line: 159, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !364, file: !352, line: 180)
!364 = !DISubprogram(name: "cos", scope: !349, file: !349, line: 62, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !366, file: !352, line: 199)
!366 = !DISubprogram(name: "cosh", scope: !349, file: !349, line: 71, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !368, file: !352, line: 218)
!368 = !DISubprogram(name: "exp", scope: !349, file: !349, line: 95, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !370, file: !352, line: 237)
!370 = !DISubprogram(name: "fabs", scope: !349, file: !349, line: 162, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !372, file: !352, line: 256)
!372 = !DISubprogram(name: "floor", scope: !349, file: !349, line: 165, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !374, file: !352, line: 275)
!374 = !DISubprogram(name: "fmod", scope: !349, file: !349, line: 168, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !376, file: !352, line: 296)
!376 = !DISubprogram(name: "frexp", scope: !349, file: !349, line: 98, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!57, !57, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !381, file: !352, line: 315)
!381 = !DISubprogram(name: "ldexp", scope: !349, file: !349, line: 101, type: !382, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DISubroutineType(types: !383)
!383 = !{!57, !57, !13}
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !385, file: !352, line: 334)
!385 = !DISubprogram(name: "log", scope: !349, file: !349, line: 104, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !387, file: !352, line: 353)
!387 = !DISubprogram(name: "log10", scope: !349, file: !349, line: 107, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !389, file: !352, line: 372)
!389 = !DISubprogram(name: "modf", scope: !349, file: !349, line: 110, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{!57, !57, !120}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !393, file: !352, line: 384)
!393 = !DISubprogram(name: "pow", scope: !349, file: !349, line: 140, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !395, file: !352, line: 421)
!395 = !DISubprogram(name: "sin", scope: !349, file: !349, line: 64, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !397, file: !352, line: 440)
!397 = !DISubprogram(name: "sinh", scope: !349, file: !349, line: 73, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !399, file: !352, line: 459)
!399 = !DISubprogram(name: "sqrt", scope: !349, file: !349, line: 143, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !401, file: !352, line: 478)
!401 = !DISubprogram(name: "tan", scope: !349, file: !349, line: 66, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !403, file: !352, line: 497)
!403 = !DISubprogram(name: "tanh", scope: !349, file: !349, line: 75, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !405, file: !352, line: 1065)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !406, line: 150, baseType: !57)
!406 = !DIFile(filename: "/usr/include/math.h", directory: "")
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !408, file: !352, line: 1066)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !406, line: 149, baseType: !45)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !410, file: !352, line: 1069)
!410 = !DISubprogram(name: "acosh", scope: !349, file: !349, line: 85, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !412, file: !352, line: 1070)
!412 = !DISubprogram(name: "acoshf", scope: !349, file: !349, line: 85, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!45, !45}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !416, file: !352, line: 1071)
!416 = !DISubprogram(name: "acoshl", scope: !349, file: !349, line: 85, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !419}
!419 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !421, file: !352, line: 1073)
!421 = !DISubprogram(name: "asinh", scope: !349, file: !349, line: 87, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !423, file: !352, line: 1074)
!423 = !DISubprogram(name: "asinhf", scope: !349, file: !349, line: 87, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !425, file: !352, line: 1075)
!425 = !DISubprogram(name: "asinhl", scope: !349, file: !349, line: 87, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !427, file: !352, line: 1077)
!427 = !DISubprogram(name: "atanh", scope: !349, file: !349, line: 89, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !429, file: !352, line: 1078)
!429 = !DISubprogram(name: "atanhf", scope: !349, file: !349, line: 89, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !431, file: !352, line: 1079)
!431 = !DISubprogram(name: "atanhl", scope: !349, file: !349, line: 89, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !433, file: !352, line: 1081)
!433 = !DISubprogram(name: "cbrt", scope: !349, file: !349, line: 152, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !435, file: !352, line: 1082)
!435 = !DISubprogram(name: "cbrtf", scope: !349, file: !349, line: 152, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !437, file: !352, line: 1083)
!437 = !DISubprogram(name: "cbrtl", scope: !349, file: !349, line: 152, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !439, file: !352, line: 1085)
!439 = !DISubprogram(name: "copysign", scope: !349, file: !349, line: 196, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !441, file: !352, line: 1086)
!441 = !DISubprogram(name: "copysignf", scope: !349, file: !349, line: 196, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DISubroutineType(types: !443)
!443 = !{!45, !45, !45}
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !445, file: !352, line: 1087)
!445 = !DISubprogram(name: "copysignl", scope: !349, file: !349, line: 196, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!419, !419, !419}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !449, file: !352, line: 1089)
!449 = !DISubprogram(name: "erf", scope: !349, file: !349, line: 228, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !451, file: !352, line: 1090)
!451 = !DISubprogram(name: "erff", scope: !349, file: !349, line: 228, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !453, file: !352, line: 1091)
!453 = !DISubprogram(name: "erfl", scope: !349, file: !349, line: 228, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !455, file: !352, line: 1093)
!455 = !DISubprogram(name: "erfc", scope: !349, file: !349, line: 229, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !457, file: !352, line: 1094)
!457 = !DISubprogram(name: "erfcf", scope: !349, file: !349, line: 229, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !459, file: !352, line: 1095)
!459 = !DISubprogram(name: "erfcl", scope: !349, file: !349, line: 229, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !461, file: !352, line: 1097)
!461 = !DISubprogram(name: "exp2", scope: !349, file: !349, line: 130, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !463, file: !352, line: 1098)
!463 = !DISubprogram(name: "exp2f", scope: !349, file: !349, line: 130, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !465, file: !352, line: 1099)
!465 = !DISubprogram(name: "exp2l", scope: !349, file: !349, line: 130, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !467, file: !352, line: 1101)
!467 = !DISubprogram(name: "expm1", scope: !349, file: !349, line: 119, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !469, file: !352, line: 1102)
!469 = !DISubprogram(name: "expm1f", scope: !349, file: !349, line: 119, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !471, file: !352, line: 1103)
!471 = !DISubprogram(name: "expm1l", scope: !349, file: !349, line: 119, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !473, file: !352, line: 1105)
!473 = !DISubprogram(name: "fdim", scope: !349, file: !349, line: 326, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !475, file: !352, line: 1106)
!475 = !DISubprogram(name: "fdimf", scope: !349, file: !349, line: 326, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !477, file: !352, line: 1107)
!477 = !DISubprogram(name: "fdiml", scope: !349, file: !349, line: 326, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !479, file: !352, line: 1109)
!479 = !DISubprogram(name: "fma", scope: !349, file: !349, line: 335, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!57, !57, !57, !57}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !483, file: !352, line: 1110)
!483 = !DISubprogram(name: "fmaf", scope: !349, file: !349, line: 335, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DISubroutineType(types: !485)
!485 = !{!45, !45, !45, !45}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !487, file: !352, line: 1111)
!487 = !DISubprogram(name: "fmal", scope: !349, file: !349, line: 335, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!419, !419, !419, !419}
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !491, file: !352, line: 1113)
!491 = !DISubprogram(name: "fmax", scope: !349, file: !349, line: 329, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !493, file: !352, line: 1114)
!493 = !DISubprogram(name: "fmaxf", scope: !349, file: !349, line: 329, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !495, file: !352, line: 1115)
!495 = !DISubprogram(name: "fmaxl", scope: !349, file: !349, line: 329, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !497, file: !352, line: 1117)
!497 = !DISubprogram(name: "fmin", scope: !349, file: !349, line: 332, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !499, file: !352, line: 1118)
!499 = !DISubprogram(name: "fminf", scope: !349, file: !349, line: 332, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !501, file: !352, line: 1119)
!501 = !DISubprogram(name: "fminl", scope: !349, file: !349, line: 332, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !503, file: !352, line: 1121)
!503 = !DISubprogram(name: "hypot", scope: !349, file: !349, line: 147, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !505, file: !352, line: 1122)
!505 = !DISubprogram(name: "hypotf", scope: !349, file: !349, line: 147, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !507, file: !352, line: 1123)
!507 = !DISubprogram(name: "hypotl", scope: !349, file: !349, line: 147, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !509, file: !352, line: 1125)
!509 = !DISubprogram(name: "ilogb", scope: !349, file: !349, line: 280, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!13, !57}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !513, file: !352, line: 1126)
!513 = !DISubprogram(name: "ilogbf", scope: !349, file: !349, line: 280, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!13, !45}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !517, file: !352, line: 1127)
!517 = !DISubprogram(name: "ilogbl", scope: !349, file: !349, line: 280, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!13, !419}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !521, file: !352, line: 1129)
!521 = !DISubprogram(name: "lgamma", scope: !349, file: !349, line: 230, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !523, file: !352, line: 1130)
!523 = !DISubprogram(name: "lgammaf", scope: !349, file: !349, line: 230, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !525, file: !352, line: 1131)
!525 = !DISubprogram(name: "lgammal", scope: !349, file: !349, line: 230, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !527, file: !352, line: 1134)
!527 = !DISubprogram(name: "llrint", scope: !349, file: !349, line: 316, type: !528, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !57}
!530 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !532, file: !352, line: 1135)
!532 = !DISubprogram(name: "llrintf", scope: !349, file: !349, line: 316, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{!530, !45}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !536, file: !352, line: 1136)
!536 = !DISubprogram(name: "llrintl", scope: !349, file: !349, line: 316, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!530, !419}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !540, file: !352, line: 1138)
!540 = !DISubprogram(name: "llround", scope: !349, file: !349, line: 322, type: !528, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !542, file: !352, line: 1139)
!542 = !DISubprogram(name: "llroundf", scope: !349, file: !349, line: 322, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !544, file: !352, line: 1140)
!544 = !DISubprogram(name: "llroundl", scope: !349, file: !349, line: 322, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !546, file: !352, line: 1143)
!546 = !DISubprogram(name: "log1p", scope: !349, file: !349, line: 122, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !548, file: !352, line: 1144)
!548 = !DISubprogram(name: "log1pf", scope: !349, file: !349, line: 122, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !550, file: !352, line: 1145)
!550 = !DISubprogram(name: "log1pl", scope: !349, file: !349, line: 122, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !552, file: !352, line: 1147)
!552 = !DISubprogram(name: "log2", scope: !349, file: !349, line: 133, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !554, file: !352, line: 1148)
!554 = !DISubprogram(name: "log2f", scope: !349, file: !349, line: 133, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !556, file: !352, line: 1149)
!556 = !DISubprogram(name: "log2l", scope: !349, file: !349, line: 133, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !558, file: !352, line: 1151)
!558 = !DISubprogram(name: "logb", scope: !349, file: !349, line: 125, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !560, file: !352, line: 1152)
!560 = !DISubprogram(name: "logbf", scope: !349, file: !349, line: 125, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !562, file: !352, line: 1153)
!562 = !DISubprogram(name: "logbl", scope: !349, file: !349, line: 125, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !564, file: !352, line: 1155)
!564 = !DISubprogram(name: "lrint", scope: !349, file: !349, line: 314, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !57}
!567 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !569, file: !352, line: 1156)
!569 = !DISubprogram(name: "lrintf", scope: !349, file: !349, line: 314, type: !570, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DISubroutineType(types: !571)
!571 = !{!567, !45}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !573, file: !352, line: 1157)
!573 = !DISubprogram(name: "lrintl", scope: !349, file: !349, line: 314, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!567, !419}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !577, file: !352, line: 1159)
!577 = !DISubprogram(name: "lround", scope: !349, file: !349, line: 320, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !579, file: !352, line: 1160)
!579 = !DISubprogram(name: "lroundf", scope: !349, file: !349, line: 320, type: !570, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !581, file: !352, line: 1161)
!581 = !DISubprogram(name: "lroundl", scope: !349, file: !349, line: 320, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !583, file: !352, line: 1163)
!583 = !DISubprogram(name: "nan", scope: !349, file: !349, line: 201, type: !584, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DISubroutineType(types: !585)
!585 = !{!57, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !590, file: !352, line: 1164)
!590 = !DISubprogram(name: "nanf", scope: !349, file: !349, line: 201, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!45, !586}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !594, file: !352, line: 1165)
!594 = !DISubprogram(name: "nanl", scope: !349, file: !349, line: 201, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!419, !586}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !598, file: !352, line: 1167)
!598 = !DISubprogram(name: "nearbyint", scope: !349, file: !349, line: 294, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !600, file: !352, line: 1168)
!600 = !DISubprogram(name: "nearbyintf", scope: !349, file: !349, line: 294, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !602, file: !352, line: 1169)
!602 = !DISubprogram(name: "nearbyintl", scope: !349, file: !349, line: 294, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !604, file: !352, line: 1171)
!604 = !DISubprogram(name: "nextafter", scope: !349, file: !349, line: 259, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !606, file: !352, line: 1172)
!606 = !DISubprogram(name: "nextafterf", scope: !349, file: !349, line: 259, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !608, file: !352, line: 1173)
!608 = !DISubprogram(name: "nextafterl", scope: !349, file: !349, line: 259, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !610, file: !352, line: 1175)
!610 = !DISubprogram(name: "nexttoward", scope: !349, file: !349, line: 261, type: !611, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!57, !57, !419}
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !614, file: !352, line: 1176)
!614 = !DISubprogram(name: "nexttowardf", scope: !349, file: !349, line: 261, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!45, !45, !419}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !618, file: !352, line: 1177)
!618 = !DISubprogram(name: "nexttowardl", scope: !349, file: !349, line: 261, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !620, file: !352, line: 1179)
!620 = !DISubprogram(name: "remainder", scope: !349, file: !349, line: 272, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !622, file: !352, line: 1180)
!622 = !DISubprogram(name: "remainderf", scope: !349, file: !349, line: 272, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !624, file: !352, line: 1181)
!624 = !DISubprogram(name: "remainderl", scope: !349, file: !349, line: 272, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !626, file: !352, line: 1183)
!626 = !DISubprogram(name: "remquo", scope: !349, file: !349, line: 307, type: !627, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{!57, !57, !57, !379}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !630, file: !352, line: 1184)
!630 = !DISubprogram(name: "remquof", scope: !349, file: !349, line: 307, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!45, !45, !45, !379}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !634, file: !352, line: 1185)
!634 = !DISubprogram(name: "remquol", scope: !349, file: !349, line: 307, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!419, !419, !419, !379}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !638, file: !352, line: 1187)
!638 = !DISubprogram(name: "rint", scope: !349, file: !349, line: 256, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !640, file: !352, line: 1188)
!640 = !DISubprogram(name: "rintf", scope: !349, file: !349, line: 256, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !642, file: !352, line: 1189)
!642 = !DISubprogram(name: "rintl", scope: !349, file: !349, line: 256, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !644, file: !352, line: 1191)
!644 = !DISubprogram(name: "round", scope: !349, file: !349, line: 298, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !646, file: !352, line: 1192)
!646 = !DISubprogram(name: "roundf", scope: !349, file: !349, line: 298, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !648, file: !352, line: 1193)
!648 = !DISubprogram(name: "roundl", scope: !349, file: !349, line: 298, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !650, file: !352, line: 1195)
!650 = !DISubprogram(name: "scalbln", scope: !349, file: !349, line: 290, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!57, !57, !567}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !654, file: !352, line: 1196)
!654 = !DISubprogram(name: "scalblnf", scope: !349, file: !349, line: 290, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!45, !45, !567}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !658, file: !352, line: 1197)
!658 = !DISubprogram(name: "scalblnl", scope: !349, file: !349, line: 290, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!419, !419, !567}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !662, file: !352, line: 1199)
!662 = !DISubprogram(name: "scalbn", scope: !349, file: !349, line: 276, type: !382, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !664, file: !352, line: 1200)
!664 = !DISubprogram(name: "scalbnf", scope: !349, file: !349, line: 276, type: !665, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DISubroutineType(types: !666)
!666 = !{!45, !45, !13}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !668, file: !352, line: 1201)
!668 = !DISubprogram(name: "scalbnl", scope: !349, file: !349, line: 276, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!419, !419, !13}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !672, file: !352, line: 1203)
!672 = !DISubprogram(name: "tgamma", scope: !349, file: !349, line: 235, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !674, file: !352, line: 1204)
!674 = !DISubprogram(name: "tgammaf", scope: !349, file: !349, line: 235, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !676, file: !352, line: 1205)
!676 = !DISubprogram(name: "tgammal", scope: !349, file: !349, line: 235, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !678, file: !352, line: 1207)
!678 = !DISubprogram(name: "trunc", scope: !349, file: !349, line: 302, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !680, file: !352, line: 1208)
!680 = !DISubprogram(name: "truncf", scope: !349, file: !349, line: 302, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !682, file: !352, line: 1209)
!682 = !DISubprogram(name: "truncl", scope: !349, file: !349, line: 302, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !684, file: !688, line: 38)
!684 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !341, file: !346, line: 103, type: !685, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !687}
!687 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!688 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !690, file: !688, line: 54)
!690 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !341, file: !352, line: 380, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{!419, !419, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !695, file: !697, line: 127)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !343, line: 62, baseType: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!697 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !699, file: !697, line: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !343, line: 70, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !701, identifier: "_ZTS6ldiv_t")
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !700, file: !343, line: 68, baseType: !567, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !700, file: !343, line: 69, baseType: !567, size: 64, offset: 64)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !705, file: !697, line: 130)
!705 = !DISubprogram(name: "abort", scope: !343, file: !343, line: 591, type: !706, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{null}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !709, file: !697, line: 134)
!709 = !DISubprogram(name: "atexit", scope: !343, file: !343, line: 595, type: !710, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!13, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !714, file: !697, line: 137)
!714 = !DISubprogram(name: "at_quick_exit", scope: !343, file: !343, line: 600, type: !710, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !716, file: !697, line: 140)
!716 = !DISubprogram(name: "atof", scope: !343, file: !343, line: 101, type: !584, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !718, file: !697, line: 141)
!718 = !DISubprogram(name: "atoi", scope: !343, file: !343, line: 104, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!13, !586}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !722, file: !697, line: 142)
!722 = !DISubprogram(name: "atol", scope: !343, file: !343, line: 107, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!567, !586}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !726, file: !697, line: 143)
!726 = !DISubprogram(name: "bsearch", scope: !343, file: !343, line: 820, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!111, !729, !729, !731, !731, !734}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !732, line: 46, baseType: !733)
!732 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!733 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !343, line: 808, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!13, !729, !729}
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !739, file: !697, line: 144)
!739 = !DISubprogram(name: "calloc", scope: !343, file: !343, line: 542, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!111, !731, !731}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !743, file: !697, line: 145)
!743 = !DISubprogram(name: "div", scope: !343, file: !343, line: 852, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!695, !13, !13}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !747, file: !697, line: 146)
!747 = !DISubprogram(name: "exit", scope: !343, file: !343, line: 617, type: !748, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !13}
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !751, file: !697, line: 147)
!751 = !DISubprogram(name: "free", scope: !343, file: !343, line: 565, type: !752, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !111}
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !755, file: !697, line: 148)
!755 = !DISubprogram(name: "getenv", scope: !343, file: !343, line: 634, type: !756, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !586}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !760, file: !697, line: 149)
!760 = !DISubprogram(name: "labs", scope: !343, file: !343, line: 841, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!567, !567}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !764, file: !697, line: 150)
!764 = !DISubprogram(name: "ldiv", scope: !343, file: !343, line: 854, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!699, !567, !567}
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !768, file: !697, line: 151)
!768 = !DISubprogram(name: "malloc", scope: !343, file: !343, line: 539, type: !769, flags: DIFlagPrototyped, spFlags: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{!111, !731}
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !772, file: !697, line: 153)
!772 = !DISubprogram(name: "mblen", scope: !343, file: !343, line: 922, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!13, !586, !731}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !776, file: !697, line: 154)
!776 = !DISubprogram(name: "mbstowcs", scope: !343, file: !343, line: 933, type: !777, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{!731, !779, !782, !731}
!779 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!782 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !586)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !784, file: !697, line: 155)
!784 = !DISubprogram(name: "mbtowc", scope: !343, file: !343, line: 925, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!13, !779, !782, !731}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !788, file: !697, line: 157)
!788 = !DISubprogram(name: "qsort", scope: !343, file: !343, line: 830, type: !789, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !111, !731, !731, !734}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !792, file: !697, line: 160)
!792 = !DISubprogram(name: "quick_exit", scope: !343, file: !343, line: 623, type: !748, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !794, file: !697, line: 163)
!794 = !DISubprogram(name: "rand", scope: !343, file: !343, line: 453, type: !795, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!13}
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !798, file: !697, line: 164)
!798 = !DISubprogram(name: "realloc", scope: !343, file: !343, line: 550, type: !799, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DISubroutineType(types: !800)
!800 = !{!111, !111, !731}
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !802, file: !697, line: 165)
!802 = !DISubprogram(name: "srand", scope: !343, file: !343, line: 455, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !64}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !806, file: !697, line: 166)
!806 = !DISubprogram(name: "strtod", scope: !343, file: !343, line: 117, type: !807, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{!57, !782, !809}
!809 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !812, file: !697, line: 167)
!812 = !DISubprogram(name: "strtol", scope: !343, file: !343, line: 176, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!567, !782, !809, !13}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !816, file: !697, line: 168)
!816 = !DISubprogram(name: "strtoul", scope: !343, file: !343, line: 180, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!733, !782, !809, !13}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !820, file: !697, line: 169)
!820 = !DISubprogram(name: "system", scope: !343, file: !343, line: 784, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !822, file: !697, line: 171)
!822 = !DISubprogram(name: "wcstombs", scope: !343, file: !343, line: 936, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!731, !825, !826, !731}
!825 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !758)
!826 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !830, file: !697, line: 172)
!830 = !DISubprogram(name: "wctomb", scope: !343, file: !343, line: 929, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!13, !758, !781}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !835, file: !697, line: 200)
!834 = !DINamespace(name: "__gnu_cxx", scope: null)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !343, line: 80, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !837, identifier: "_ZTS7lldiv_t")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !836, file: !343, line: 78, baseType: !530, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !836, file: !343, line: 79, baseType: !530, size: 64, offset: 64)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !841, file: !697, line: 206)
!841 = !DISubprogram(name: "_Exit", scope: !343, file: !343, line: 629, type: !748, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !843, file: !697, line: 210)
!843 = !DISubprogram(name: "llabs", scope: !343, file: !343, line: 844, type: !844, flags: DIFlagPrototyped, spFlags: 0)
!844 = !DISubroutineType(types: !845)
!845 = !{!530, !530}
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !847, file: !697, line: 216)
!847 = !DISubprogram(name: "lldiv", scope: !343, file: !343, line: 858, type: !848, flags: DIFlagPrototyped, spFlags: 0)
!848 = !DISubroutineType(types: !849)
!849 = !{!835, !530, !530}
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !851, file: !697, line: 227)
!851 = !DISubprogram(name: "atoll", scope: !343, file: !343, line: 112, type: !852, flags: DIFlagPrototyped, spFlags: 0)
!852 = !DISubroutineType(types: !853)
!853 = !{!530, !586}
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !855, file: !697, line: 228)
!855 = !DISubprogram(name: "strtoll", scope: !343, file: !343, line: 200, type: !856, flags: DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!530, !782, !809, !13}
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !859, file: !697, line: 229)
!859 = !DISubprogram(name: "strtoull", scope: !343, file: !343, line: 205, type: !860, flags: DIFlagPrototyped, spFlags: 0)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !782, !809, !13}
!862 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !864, file: !697, line: 231)
!864 = !DISubprogram(name: "strtof", scope: !343, file: !343, line: 123, type: !865, flags: DIFlagPrototyped, spFlags: 0)
!865 = !DISubroutineType(types: !866)
!866 = !{!45, !782, !809}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !834, entity: !868, file: !697, line: 232)
!868 = !DISubprogram(name: "strtold", scope: !343, file: !343, line: 126, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!419, !782, !809}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !835, file: !697, line: 240)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !841, file: !697, line: 242)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !843, file: !697, line: 244)
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !875, file: !697, line: 245)
!875 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !834, file: !697, line: 213, type: !848, flags: DIFlagPrototyped, spFlags: 0)
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !847, file: !697, line: 246)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !851, file: !697, line: 248)
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !864, file: !697, line: 249)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !855, file: !697, line: 250)
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !859, file: !697, line: 251)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !341, entity: !868, file: !697, line: 252)
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !705, file: !883, line: 38)
!883 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
