; ModuleID = 'normal.cpp'
source_filename = "normal.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], float, float, i32, i32, double, i8, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [4096 x i8], [6 x %"struct.pov::shelldata"], [4096 x i8], [4096 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Pyramid_Vect", linkageName: "_ZN3povL12Pyramid_VectE", scope: !2, file: !3, line: 71, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "normal.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 768, elements: !12)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !7, line: 691, baseType: !8)
!7 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !10)
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !{!11}
!11 = !DISubrange(count: 3)
!12 = !{!13}
!13 = !DISubrange(count: 4)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "cvc", scope: !16, file: !3, line: 415, type: !29, isLocal: true, isDefinition: true)
!16 = distinct !DISubprogram(name: "facets", linkageName: "_ZN3povL6facetsEPdPNS_14Tnormal_StructES0_", scope: !2, file: !3, line: 404, type: !17, scopeLine: 405, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !283, retainedNodes: !1095)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !20, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !7, line: 1037, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !7, line: 1348, size: 1344, flags: DIFlagTypePassByValue, elements: !23, identifier: "_ZTSN3pov14Tnormal_StructE")
!23 = !{!24, !26, !27, !28, !30, !32, !33, !34, !38, !42, !83, !281, !282}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !22, file: !7, line: 1350, baseType: !25, size: 16)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !22, file: !7, line: 1350, baseType: !25, size: 16, offset: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !22, file: !7, line: 1350, baseType: !25, size: 16, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !22, file: !7, line: 1350, baseType: !29, size: 32, offset: 64)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !22, file: !7, line: 1350, baseType: !31, size: 32, offset: 96)
!31 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !22, file: !7, line: 1350, baseType: !31, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !22, file: !7, line: 1350, baseType: !31, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !22, file: !7, line: 1350, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !7, line: 1040, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !7, line: 1387, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Warps_StructE")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !22, file: !7, line: 1350, baseType: !39, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !7, line: 1034, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !7, line: 1337, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pattern_StructE")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !22, file: !7, line: 1350, baseType: !43, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !7, line: 1033, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !7, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !46, identifier: "_ZTSN3pov16Blend_Map_StructE")
!46 = !{!47, !48, !50, !52, !53}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !45, file: !7, line: 1061, baseType: !29, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !45, file: !7, line: 1062, baseType: !49, size: 16, offset: 32)
!49 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !45, file: !7, line: 1063, baseType: !51, size: 8, offset: 48)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !45, file: !7, line: 1063, baseType: !51, size: 8, offset: 56)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !45, file: !7, line: 1064, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !7, line: 1032, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !7, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !57, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !56, file: !7, line: 1047, baseType: !31, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !56, file: !7, line: 1048, baseType: !60, size: 8, offset: 32)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !56, file: !7, line: 1056, baseType: !62, size: 192, offset: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !56, file: !7, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !63, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!63 = !{!64, !69, !73, !74, !78}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !62, file: !7, line: 1051, baseType: !65, size: 160)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !7, line: 695, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 5)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !62, file: !7, line: 1052, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !7, line: 1036, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !7, line: 1342, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pigment_StructE")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !62, file: !7, line: 1053, baseType: !20, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !62, file: !7, line: 1054, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !7, line: 1035, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !7, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !62, file: !7, line: 1055, baseType: !79, size: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !7, line: 690, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 2)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !22, file: !7, line: 1350, baseType: !84, size: 896, offset: 384)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !7, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !85, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!85 = !{!86, !90, !94, !95, !96, !97, !98, !99, !104, !109, !115, !127, !138, !148, !154, !155}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !84, file: !7, line: 1350, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !7, line: 1280, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !7, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !84, file: !7, line: 1350, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !7, line: 1232, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !7, line: 1234, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Image_StructE")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !84, file: !7, line: 1350, baseType: !6, size: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !84, file: !7, line: 1350, baseType: !31, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !84, file: !7, line: 1350, baseType: !49, size: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !84, file: !7, line: 1350, baseType: !49, size: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !84, file: !7, line: 1350, baseType: !49, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !84, file: !7, line: 1350, baseType: !100, size: 256)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 256, flags: DIFlagTypePassByValue, elements: !101, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !100, file: !7, line: 1350, baseType: !31, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !100, file: !7, line: 1350, baseType: !6, size: 192, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !84, file: !7, line: 1350, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 64, flags: DIFlagTypePassByValue, elements: !106, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !105, file: !7, line: 1350, baseType: !31, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !105, file: !7, line: 1350, baseType: !31, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !84, file: !7, line: 1350, baseType: !110, size: 320)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 320, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !110, file: !7, line: 1350, baseType: !9, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !110, file: !7, line: 1350, baseType: !9, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !110, file: !7, line: 1350, baseType: !6, size: 192, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !84, file: !7, line: 1350, baseType: !116, size: 896)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !117, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!117 = !{!118, !119, !120, !121, !122, !123, !125, !126}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !116, file: !7, line: 1350, baseType: !6, size: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !116, file: !7, line: 1350, baseType: !6, size: 192, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !116, file: !7, line: 1350, baseType: !9, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !116, file: !7, line: 1350, baseType: !9, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !116, file: !7, line: 1350, baseType: !49, size: 16, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !116, file: !7, line: 1350, baseType: !124, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !116, file: !7, line: 1350, baseType: !29, size: 32, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !116, file: !7, line: 1350, baseType: !6, size: 192, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !84, file: !7, line: 1350, baseType: !128, size: 832)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 832, flags: DIFlagTypePassByValue, elements: !129, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !128, file: !7, line: 1350, baseType: !6, size: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !128, file: !7, line: 1350, baseType: !6, size: 192, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !128, file: !7, line: 1350, baseType: !49, size: 16, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !128, file: !7, line: 1350, baseType: !49, size: 16, offset: 400)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !128, file: !7, line: 1350, baseType: !9, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !128, file: !7, line: 1350, baseType: !9, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !128, file: !7, line: 1350, baseType: !79, size: 128, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !128, file: !7, line: 1350, baseType: !79, size: 128, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !84, file: !7, line: 1350, baseType: !139, size: 384)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 384, flags: DIFlagTypePassByValue, elements: !140, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!140 = !{!141, !142, !143, !144, !145, !146, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !139, file: !7, line: 1350, baseType: !79, size: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !139, file: !7, line: 1350, baseType: !49, size: 16, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !139, file: !7, line: 1350, baseType: !49, size: 16, offset: 144)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !139, file: !7, line: 1350, baseType: !49, size: 16, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !139, file: !7, line: 1350, baseType: !9, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !139, file: !7, line: 1350, baseType: !9, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !139, file: !7, line: 1350, baseType: !29, size: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !84, file: !7, line: 1350, baseType: !149, size: 128)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !7, line: 1350, size: 128, flags: DIFlagTypePassByValue, elements: !150, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !149, file: !7, line: 1350, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !149, file: !7, line: 1350, baseType: !152, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !84, file: !7, line: 1350, baseType: !70, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !84, file: !7, line: 1350, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !7, line: 678, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !7, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !159, identifier: "_ZTSN3pov13Object_StructE")
!159 = !{!160, !254, !255, !256, !257, !258, !262, !263, !264, !268, !277, !278, !279, !280}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !158, file: !7, line: 1537, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !7, line: 1432, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !7, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !164, identifier: "_ZTSN3pov13Method_StructE")
!164 = !{!165, !205, !210, !217, !219, !224, !238, !240, !242, !247, !252}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !163, file: !7, line: 1519, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !7, line: 1434, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!29, !156, !170, !173}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !7, line: 680, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !7, line: 1797, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov10Ray_StructE")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !7, line: 681, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !7, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !176, identifier: "_ZTSN3pov13istack_structE")
!176 = !{!177, !179, !202, !204}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !7, line: 1637, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !175, file: !7, line: 1638, baseType: !180, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !7, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !182, identifier: "_ZTSN3pov10istk_entryE")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !181, file: !7, line: 1612, baseType: !9, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !181, file: !7, line: 1613, baseType: !6, size: 192, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !181, file: !7, line: 1614, baseType: !6, size: 192, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !181, file: !7, line: 1615, baseType: !6, size: 192, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !181, file: !7, line: 1616, baseType: !79, size: 128, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !181, file: !7, line: 1617, baseType: !156, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !181, file: !7, line: 1624, baseType: !29, size: 32, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !181, file: !7, line: 1624, baseType: !29, size: 32, offset: 864)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !181, file: !7, line: 1625, baseType: !9, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !181, file: !7, line: 1625, baseType: !9, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !181, file: !7, line: 1626, baseType: !9, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !181, file: !7, line: 1626, baseType: !9, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !181, file: !7, line: 1627, baseType: !9, size: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !181, file: !7, line: 1627, baseType: !9, size: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !181, file: !7, line: 1628, baseType: !9, size: 64, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !181, file: !7, line: 1628, baseType: !9, size: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !181, file: !7, line: 1628, baseType: !9, size: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !181, file: !7, line: 1630, baseType: !152, size: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !181, file: !7, line: 1632, baseType: !152, size: 64, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !175, file: !7, line: 1639, baseType: !203, size: 32, offset: 128)
!203 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !175, file: !7, line: 1640, baseType: !203, size: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !163, file: !7, line: 1520, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !7, line: 1435, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!29, !19, !156}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !163, file: !7, line: 1521, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !7, line: 1436, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !19, !156, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !7, line: 682, baseType: !181)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !163, file: !7, line: 1522, baseType: !218, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !7, line: 1437, baseType: !212)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !163, file: !7, line: 1523, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !7, line: 1438, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!152, !156}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !163, file: !7, line: 1524, baseType: !225, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !7, line: 1439, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !156, !19, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !7, line: 1014, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !7, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !232, identifier: "_ZTSN3pov16Transform_StructE")
!232 = !{!233, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !231, file: !7, line: 1018, baseType: !234, size: 1024)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !7, line: 693, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !236)
!236 = !{!13, !13}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !231, file: !7, line: 1019, baseType: !234, size: 1024, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !163, file: !7, line: 1525, baseType: !239, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !7, line: 1440, baseType: !226)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !163, file: !7, line: 1526, baseType: !241, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !7, line: 1441, baseType: !226)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !163, file: !7, line: 1527, baseType: !243, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !7, line: 1442, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !156, !229}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !163, file: !7, line: 1528, baseType: !248, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !7, line: 1443, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !156}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !163, file: !7, line: 1529, baseType: !253, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !7, line: 1444, baseType: !249)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !158, file: !7, line: 1537, baseType: !29, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !158, file: !7, line: 1537, baseType: !156, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !158, file: !7, line: 1537, baseType: !75, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !158, file: !7, line: 1537, baseType: !75, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !158, file: !7, line: 1537, baseType: !259, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !7, line: 1124, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !7, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !158, file: !7, line: 1537, baseType: !156, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !158, file: !7, line: 1537, baseType: !156, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !158, file: !7, line: 1537, baseType: !265, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !7, line: 1041, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !7, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !158, file: !7, line: 1537, baseType: !269, size: 192, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !7, line: 888, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !7, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!271 = !{!272, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !270, file: !7, line: 892, baseType: !273, size: 96)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !7, line: 886, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 96, elements: !10)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !7, line: 884, baseType: !31)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !270, file: !7, line: 892, baseType: !273, size: 96, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !158, file: !7, line: 1537, baseType: !229, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !158, file: !7, line: 1537, baseType: !229, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !158, file: !7, line: 1537, baseType: !31, size: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !158, file: !7, line: 1537, baseType: !203, size: 32, offset: 928)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !22, file: !7, line: 1351, baseType: !31, size: 32, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !22, file: !7, line: 1352, baseType: !31, size: 32, offset: 1312)
!283 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !284, retainedTypes: !349, globals: !350, imports: !358, splitDebugInlining: false, nameTableKind: None)
!284 = !{!285, !339, !343}
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !2, file: !286, line: 47, baseType: !203, size: 32, elements: !287, identifier: "_ZTSN3pov11PATTERN_IDSE")
!286 = !DIFile(filename: "./pattern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!288 = !DIEnumerator(name: "NO_PATTERN", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1, isUnsigned: true)
!290 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2, isUnsigned: true)
!291 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3, isUnsigned: true)
!292 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4, isUnsigned: true)
!293 = !DIEnumerator(name: "WAVES_PATTERN", value: 5, isUnsigned: true)
!294 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6, isUnsigned: true)
!295 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7, isUnsigned: true)
!296 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8, isUnsigned: true)
!297 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9, isUnsigned: true)
!298 = !DIEnumerator(name: "FACETS_PATTERN", value: 10, isUnsigned: true)
!299 = !DIEnumerator(name: "DENTS_PATTERN", value: 11, isUnsigned: true)
!300 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12, isUnsigned: true)
!301 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13, isUnsigned: true)
!302 = !DIEnumerator(name: "BRICK_PATTERN", value: 14, isUnsigned: true)
!303 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15, isUnsigned: true)
!304 = !DIEnumerator(name: "BOZO_PATTERN", value: 16, isUnsigned: true)
!305 = !DIEnumerator(name: "CELLS_PATTERN", value: 17, isUnsigned: true)
!306 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18, isUnsigned: true)
!307 = !DIEnumerator(name: "WOOD_PATTERN", value: 19, isUnsigned: true)
!308 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20, isUnsigned: true)
!309 = !DIEnumerator(name: "AGATE_PATTERN", value: 21, isUnsigned: true)
!310 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22, isUnsigned: true)
!311 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23, isUnsigned: true)
!312 = !DIEnumerator(name: "ONION_PATTERN", value: 24, isUnsigned: true)
!313 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25, isUnsigned: true)
!314 = !DIEnumerator(name: "JULIA_PATTERN", value: 26, isUnsigned: true)
!315 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27, isUnsigned: true)
!316 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28, isUnsigned: true)
!317 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29, isUnsigned: true)
!318 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30, isUnsigned: true)
!319 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31, isUnsigned: true)
!320 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32, isUnsigned: true)
!321 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33, isUnsigned: true)
!322 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34, isUnsigned: true)
!323 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35, isUnsigned: true)
!324 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36, isUnsigned: true)
!325 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37, isUnsigned: true)
!326 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38, isUnsigned: true)
!327 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39, isUnsigned: true)
!328 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40, isUnsigned: true)
!329 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41, isUnsigned: true)
!330 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42, isUnsigned: true)
!331 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43, isUnsigned: true)
!332 = !DIEnumerator(name: "BOXED_PATTERN", value: 44, isUnsigned: true)
!333 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45, isUnsigned: true)
!334 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46, isUnsigned: true)
!335 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47, isUnsigned: true)
!336 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48, isUnsigned: true)
!337 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49, isUnsigned: true)
!338 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !7, line: 700, baseType: !203, size: 32, elements: !340)
!340 = !{!341, !342}
!341 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!342 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !7, line: 706, baseType: !203, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!347 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!348 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!349 = !{!20, !39, !31, !152, !9}
!350 = !{!14, !351, !353, !0}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "lastseed", scope: !16, file: !3, line: 416, type: !29, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "cv", scope: !16, file: !3, line: 417, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 15552, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 81)
!358 = !{!359, !366, !372, !374, !376, !380, !382, !384, !386, !388, !390, !392, !394, !399, !403, !405, !407, !411, !413, !415, !417, !419, !421, !423, !426, !428, !430, !434, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !463, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !501, !505, !509, !511, !513, !515, !517, !519, !521, !523, !525, !527, !531, !535, !539, !541, !543, !545, !550, !554, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !587, !591, !595, !597, !599, !601, !607, !611, !615, !617, !619, !621, !623, !625, !627, !631, !635, !637, !639, !641, !643, !647, !651, !655, !657, !659, !661, !663, !665, !667, !671, !675, !679, !681, !685, !689, !691, !693, !695, !697, !699, !701, !707, !712, !716, !722, !726, !731, !733, !735, !739, !743, !756, !760, !764, !768, !772, !777, !781, !785, !789, !793, !801, !805, !809, !811, !815, !819, !823, !829, !833, !837, !839, !847, !851, !858, !860, !864, !868, !872, !876, !881, !885, !889, !890, !891, !892, !894, !895, !896, !897, !898, !899, !900, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !959, !961, !963, !969, !973, !979, !983, !987, !991, !995, !997, !999, !1003, !1007, !1011, !1015, !1019, !1021, !1023, !1025, !1029, !1033, !1037, !1039, !1041, !1044, !1046, !1047, !1049, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1089, !1090, !1092, !1094}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !361, file: !365, line: 52)
!360 = !DINamespace(name: "std", scope: null)
!361 = !DISubprogram(name: "abs", scope: !362, file: !362, line: 840, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!363 = !DISubroutineType(types: !364)
!364 = !{!29, !29}
!365 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !367, file: !371, line: 83)
!367 = !DISubprogram(name: "acos", scope: !368, file: !368, line: 53, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!369 = !DISubroutineType(types: !370)
!370 = !{!9, !9}
!371 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !373, file: !371, line: 102)
!373 = !DISubprogram(name: "asin", scope: !368, file: !368, line: 55, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !375, file: !371, line: 121)
!375 = !DISubprogram(name: "atan", scope: !368, file: !368, line: 57, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !377, file: !371, line: 140)
!377 = !DISubprogram(name: "atan2", scope: !368, file: !368, line: 59, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!9, !9, !9}
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !381, file: !371, line: 161)
!381 = !DISubprogram(name: "ceil", scope: !368, file: !368, line: 159, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !383, file: !371, line: 180)
!383 = !DISubprogram(name: "cos", scope: !368, file: !368, line: 62, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !385, file: !371, line: 199)
!385 = !DISubprogram(name: "cosh", scope: !368, file: !368, line: 71, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !387, file: !371, line: 218)
!387 = !DISubprogram(name: "exp", scope: !368, file: !368, line: 95, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !389, file: !371, line: 237)
!389 = !DISubprogram(name: "fabs", scope: !368, file: !368, line: 162, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !391, file: !371, line: 256)
!391 = !DISubprogram(name: "floor", scope: !368, file: !368, line: 165, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !393, file: !371, line: 275)
!393 = !DISubprogram(name: "fmod", scope: !368, file: !368, line: 168, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !395, file: !371, line: 296)
!395 = !DISubprogram(name: "frexp", scope: !368, file: !368, line: 98, type: !396, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{!9, !9, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !400, file: !371, line: 315)
!400 = !DISubprogram(name: "ldexp", scope: !368, file: !368, line: 101, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!9, !9, !29}
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !404, file: !371, line: 334)
!404 = !DISubprogram(name: "log", scope: !368, file: !368, line: 104, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !406, file: !371, line: 353)
!406 = !DISubprogram(name: "log10", scope: !368, file: !368, line: 107, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !408, file: !371, line: 372)
!408 = !DISubprogram(name: "modf", scope: !368, file: !368, line: 110, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!9, !9, !19}
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !412, file: !371, line: 384)
!412 = !DISubprogram(name: "pow", scope: !368, file: !368, line: 140, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !414, file: !371, line: 421)
!414 = !DISubprogram(name: "sin", scope: !368, file: !368, line: 64, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !416, file: !371, line: 440)
!416 = !DISubprogram(name: "sinh", scope: !368, file: !368, line: 73, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !418, file: !371, line: 459)
!418 = !DISubprogram(name: "sqrt", scope: !368, file: !368, line: 143, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !420, file: !371, line: 478)
!420 = !DISubprogram(name: "tan", scope: !368, file: !368, line: 66, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !422, file: !371, line: 497)
!422 = !DISubprogram(name: "tanh", scope: !368, file: !368, line: 75, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !424, file: !371, line: 1065)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !425, line: 150, baseType: !9)
!425 = !DIFile(filename: "/usr/include/math.h", directory: "")
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !427, file: !371, line: 1066)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !425, line: 149, baseType: !31)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !429, file: !371, line: 1069)
!429 = !DISubprogram(name: "acosh", scope: !368, file: !368, line: 85, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !431, file: !371, line: 1070)
!431 = !DISubprogram(name: "acoshf", scope: !368, file: !368, line: 85, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!31, !31}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !435, file: !371, line: 1071)
!435 = !DISubprogram(name: "acoshl", scope: !368, file: !368, line: 85, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !438}
!438 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !440, file: !371, line: 1073)
!440 = !DISubprogram(name: "asinh", scope: !368, file: !368, line: 87, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !442, file: !371, line: 1074)
!442 = !DISubprogram(name: "asinhf", scope: !368, file: !368, line: 87, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !444, file: !371, line: 1075)
!444 = !DISubprogram(name: "asinhl", scope: !368, file: !368, line: 87, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !446, file: !371, line: 1077)
!446 = !DISubprogram(name: "atanh", scope: !368, file: !368, line: 89, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !448, file: !371, line: 1078)
!448 = !DISubprogram(name: "atanhf", scope: !368, file: !368, line: 89, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !450, file: !371, line: 1079)
!450 = !DISubprogram(name: "atanhl", scope: !368, file: !368, line: 89, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !452, file: !371, line: 1081)
!452 = !DISubprogram(name: "cbrt", scope: !368, file: !368, line: 152, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !454, file: !371, line: 1082)
!454 = !DISubprogram(name: "cbrtf", scope: !368, file: !368, line: 152, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !456, file: !371, line: 1083)
!456 = !DISubprogram(name: "cbrtl", scope: !368, file: !368, line: 152, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !458, file: !371, line: 1085)
!458 = !DISubprogram(name: "copysign", scope: !368, file: !368, line: 196, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !460, file: !371, line: 1086)
!460 = !DISubprogram(name: "copysignf", scope: !368, file: !368, line: 196, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!31, !31, !31}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !464, file: !371, line: 1087)
!464 = !DISubprogram(name: "copysignl", scope: !368, file: !368, line: 196, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!438, !438, !438}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !468, file: !371, line: 1089)
!468 = !DISubprogram(name: "erf", scope: !368, file: !368, line: 228, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !470, file: !371, line: 1090)
!470 = !DISubprogram(name: "erff", scope: !368, file: !368, line: 228, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !472, file: !371, line: 1091)
!472 = !DISubprogram(name: "erfl", scope: !368, file: !368, line: 228, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !474, file: !371, line: 1093)
!474 = !DISubprogram(name: "erfc", scope: !368, file: !368, line: 229, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !476, file: !371, line: 1094)
!476 = !DISubprogram(name: "erfcf", scope: !368, file: !368, line: 229, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !478, file: !371, line: 1095)
!478 = !DISubprogram(name: "erfcl", scope: !368, file: !368, line: 229, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !480, file: !371, line: 1097)
!480 = !DISubprogram(name: "exp2", scope: !368, file: !368, line: 130, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !482, file: !371, line: 1098)
!482 = !DISubprogram(name: "exp2f", scope: !368, file: !368, line: 130, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !484, file: !371, line: 1099)
!484 = !DISubprogram(name: "exp2l", scope: !368, file: !368, line: 130, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !486, file: !371, line: 1101)
!486 = !DISubprogram(name: "expm1", scope: !368, file: !368, line: 119, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !488, file: !371, line: 1102)
!488 = !DISubprogram(name: "expm1f", scope: !368, file: !368, line: 119, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !490, file: !371, line: 1103)
!490 = !DISubprogram(name: "expm1l", scope: !368, file: !368, line: 119, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !492, file: !371, line: 1105)
!492 = !DISubprogram(name: "fdim", scope: !368, file: !368, line: 326, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !494, file: !371, line: 1106)
!494 = !DISubprogram(name: "fdimf", scope: !368, file: !368, line: 326, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !496, file: !371, line: 1107)
!496 = !DISubprogram(name: "fdiml", scope: !368, file: !368, line: 326, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !498, file: !371, line: 1109)
!498 = !DISubprogram(name: "fma", scope: !368, file: !368, line: 335, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!9, !9, !9, !9}
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !502, file: !371, line: 1110)
!502 = !DISubprogram(name: "fmaf", scope: !368, file: !368, line: 335, type: !503, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DISubroutineType(types: !504)
!504 = !{!31, !31, !31, !31}
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !506, file: !371, line: 1111)
!506 = !DISubprogram(name: "fmal", scope: !368, file: !368, line: 335, type: !507, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!438, !438, !438, !438}
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !510, file: !371, line: 1113)
!510 = !DISubprogram(name: "fmax", scope: !368, file: !368, line: 329, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !512, file: !371, line: 1114)
!512 = !DISubprogram(name: "fmaxf", scope: !368, file: !368, line: 329, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !514, file: !371, line: 1115)
!514 = !DISubprogram(name: "fmaxl", scope: !368, file: !368, line: 329, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !516, file: !371, line: 1117)
!516 = !DISubprogram(name: "fmin", scope: !368, file: !368, line: 332, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !518, file: !371, line: 1118)
!518 = !DISubprogram(name: "fminf", scope: !368, file: !368, line: 332, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !520, file: !371, line: 1119)
!520 = !DISubprogram(name: "fminl", scope: !368, file: !368, line: 332, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !522, file: !371, line: 1121)
!522 = !DISubprogram(name: "hypot", scope: !368, file: !368, line: 147, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !524, file: !371, line: 1122)
!524 = !DISubprogram(name: "hypotf", scope: !368, file: !368, line: 147, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !526, file: !371, line: 1123)
!526 = !DISubprogram(name: "hypotl", scope: !368, file: !368, line: 147, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !528, file: !371, line: 1125)
!528 = !DISubprogram(name: "ilogb", scope: !368, file: !368, line: 280, type: !529, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{!29, !9}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !532, file: !371, line: 1126)
!532 = !DISubprogram(name: "ilogbf", scope: !368, file: !368, line: 280, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{!29, !31}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !536, file: !371, line: 1127)
!536 = !DISubprogram(name: "ilogbl", scope: !368, file: !368, line: 280, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!29, !438}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !540, file: !371, line: 1129)
!540 = !DISubprogram(name: "lgamma", scope: !368, file: !368, line: 230, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !542, file: !371, line: 1130)
!542 = !DISubprogram(name: "lgammaf", scope: !368, file: !368, line: 230, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !544, file: !371, line: 1131)
!544 = !DISubprogram(name: "lgammal", scope: !368, file: !368, line: 230, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !546, file: !371, line: 1134)
!546 = !DISubprogram(name: "llrint", scope: !368, file: !368, line: 316, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !9}
!549 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !551, file: !371, line: 1135)
!551 = !DISubprogram(name: "llrintf", scope: !368, file: !368, line: 316, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!549, !31}
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !555, file: !371, line: 1136)
!555 = !DISubprogram(name: "llrintl", scope: !368, file: !368, line: 316, type: !556, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{!549, !438}
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !559, file: !371, line: 1138)
!559 = !DISubprogram(name: "llround", scope: !368, file: !368, line: 322, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !561, file: !371, line: 1139)
!561 = !DISubprogram(name: "llroundf", scope: !368, file: !368, line: 322, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !563, file: !371, line: 1140)
!563 = !DISubprogram(name: "llroundl", scope: !368, file: !368, line: 322, type: !556, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !565, file: !371, line: 1143)
!565 = !DISubprogram(name: "log1p", scope: !368, file: !368, line: 122, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !567, file: !371, line: 1144)
!567 = !DISubprogram(name: "log1pf", scope: !368, file: !368, line: 122, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !569, file: !371, line: 1145)
!569 = !DISubprogram(name: "log1pl", scope: !368, file: !368, line: 122, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !571, file: !371, line: 1147)
!571 = !DISubprogram(name: "log2", scope: !368, file: !368, line: 133, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !573, file: !371, line: 1148)
!573 = !DISubprogram(name: "log2f", scope: !368, file: !368, line: 133, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !575, file: !371, line: 1149)
!575 = !DISubprogram(name: "log2l", scope: !368, file: !368, line: 133, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !577, file: !371, line: 1151)
!577 = !DISubprogram(name: "logb", scope: !368, file: !368, line: 125, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !579, file: !371, line: 1152)
!579 = !DISubprogram(name: "logbf", scope: !368, file: !368, line: 125, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !581, file: !371, line: 1153)
!581 = !DISubprogram(name: "logbl", scope: !368, file: !368, line: 125, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !583, file: !371, line: 1155)
!583 = !DISubprogram(name: "lrint", scope: !368, file: !368, line: 314, type: !584, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DISubroutineType(types: !585)
!585 = !{!586, !9}
!586 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !588, file: !371, line: 1156)
!588 = !DISubprogram(name: "lrintf", scope: !368, file: !368, line: 314, type: !589, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!586, !31}
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !592, file: !371, line: 1157)
!592 = !DISubprogram(name: "lrintl", scope: !368, file: !368, line: 314, type: !593, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DISubroutineType(types: !594)
!594 = !{!586, !438}
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !596, file: !371, line: 1159)
!596 = !DISubprogram(name: "lround", scope: !368, file: !368, line: 320, type: !584, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !598, file: !371, line: 1160)
!598 = !DISubprogram(name: "lroundf", scope: !368, file: !368, line: 320, type: !589, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !600, file: !371, line: 1161)
!600 = !DISubprogram(name: "lroundl", scope: !368, file: !368, line: 320, type: !593, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !602, file: !371, line: 1163)
!602 = !DISubprogram(name: "nan", scope: !368, file: !368, line: 201, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!9, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !608, file: !371, line: 1164)
!608 = !DISubprogram(name: "nanf", scope: !368, file: !368, line: 201, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!31, !605}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !612, file: !371, line: 1165)
!612 = !DISubprogram(name: "nanl", scope: !368, file: !368, line: 201, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{!438, !605}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !616, file: !371, line: 1167)
!616 = !DISubprogram(name: "nearbyint", scope: !368, file: !368, line: 294, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !618, file: !371, line: 1168)
!618 = !DISubprogram(name: "nearbyintf", scope: !368, file: !368, line: 294, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !620, file: !371, line: 1169)
!620 = !DISubprogram(name: "nearbyintl", scope: !368, file: !368, line: 294, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !622, file: !371, line: 1171)
!622 = !DISubprogram(name: "nextafter", scope: !368, file: !368, line: 259, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !624, file: !371, line: 1172)
!624 = !DISubprogram(name: "nextafterf", scope: !368, file: !368, line: 259, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !626, file: !371, line: 1173)
!626 = !DISubprogram(name: "nextafterl", scope: !368, file: !368, line: 259, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !628, file: !371, line: 1175)
!628 = !DISubprogram(name: "nexttoward", scope: !368, file: !368, line: 261, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!9, !9, !438}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !632, file: !371, line: 1176)
!632 = !DISubprogram(name: "nexttowardf", scope: !368, file: !368, line: 261, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!31, !31, !438}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !636, file: !371, line: 1177)
!636 = !DISubprogram(name: "nexttowardl", scope: !368, file: !368, line: 261, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !638, file: !371, line: 1179)
!638 = !DISubprogram(name: "remainder", scope: !368, file: !368, line: 272, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !640, file: !371, line: 1180)
!640 = !DISubprogram(name: "remainderf", scope: !368, file: !368, line: 272, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !642, file: !371, line: 1181)
!642 = !DISubprogram(name: "remainderl", scope: !368, file: !368, line: 272, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !644, file: !371, line: 1183)
!644 = !DISubprogram(name: "remquo", scope: !368, file: !368, line: 307, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!9, !9, !9, !398}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !648, file: !371, line: 1184)
!648 = !DISubprogram(name: "remquof", scope: !368, file: !368, line: 307, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!31, !31, !31, !398}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !652, file: !371, line: 1185)
!652 = !DISubprogram(name: "remquol", scope: !368, file: !368, line: 307, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!438, !438, !438, !398}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !656, file: !371, line: 1187)
!656 = !DISubprogram(name: "rint", scope: !368, file: !368, line: 256, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !658, file: !371, line: 1188)
!658 = !DISubprogram(name: "rintf", scope: !368, file: !368, line: 256, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !660, file: !371, line: 1189)
!660 = !DISubprogram(name: "rintl", scope: !368, file: !368, line: 256, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !662, file: !371, line: 1191)
!662 = !DISubprogram(name: "round", scope: !368, file: !368, line: 298, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !664, file: !371, line: 1192)
!664 = !DISubprogram(name: "roundf", scope: !368, file: !368, line: 298, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !666, file: !371, line: 1193)
!666 = !DISubprogram(name: "roundl", scope: !368, file: !368, line: 298, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !668, file: !371, line: 1195)
!668 = !DISubprogram(name: "scalbln", scope: !368, file: !368, line: 290, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!9, !9, !586}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !672, file: !371, line: 1196)
!672 = !DISubprogram(name: "scalblnf", scope: !368, file: !368, line: 290, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!31, !31, !586}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !676, file: !371, line: 1197)
!676 = !DISubprogram(name: "scalblnl", scope: !368, file: !368, line: 290, type: !677, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{!438, !438, !586}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !680, file: !371, line: 1199)
!680 = !DISubprogram(name: "scalbn", scope: !368, file: !368, line: 276, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !682, file: !371, line: 1200)
!682 = !DISubprogram(name: "scalbnf", scope: !368, file: !368, line: 276, type: !683, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DISubroutineType(types: !684)
!684 = !{!31, !31, !29}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !686, file: !371, line: 1201)
!686 = !DISubprogram(name: "scalbnl", scope: !368, file: !368, line: 276, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!438, !438, !29}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !690, file: !371, line: 1203)
!690 = !DISubprogram(name: "tgamma", scope: !368, file: !368, line: 235, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !692, file: !371, line: 1204)
!692 = !DISubprogram(name: "tgammaf", scope: !368, file: !368, line: 235, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !694, file: !371, line: 1205)
!694 = !DISubprogram(name: "tgammal", scope: !368, file: !368, line: 235, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !696, file: !371, line: 1207)
!696 = !DISubprogram(name: "trunc", scope: !368, file: !368, line: 302, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !698, file: !371, line: 1208)
!698 = !DISubprogram(name: "truncf", scope: !368, file: !368, line: 302, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !700, file: !371, line: 1209)
!700 = !DISubprogram(name: "truncl", scope: !368, file: !368, line: 302, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !283, entity: !702, file: !706, line: 38)
!702 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !360, file: !365, line: 103, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !705}
!705 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!706 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !283, entity: !708, file: !706, line: 54)
!708 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !360, file: !371, line: 380, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{!438, !438, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !713, file: !715, line: 127)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !362, line: 62, baseType: !714)
!714 = !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!715 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !717, file: !715, line: 128)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !362, line: 70, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !719, identifier: "_ZTS6ldiv_t")
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !718, file: !362, line: 68, baseType: !586, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !718, file: !362, line: 69, baseType: !586, size: 64, offset: 64)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !723, file: !715, line: 130)
!723 = !DISubprogram(name: "abort", scope: !362, file: !362, line: 591, type: !724, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{null}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !727, file: !715, line: 134)
!727 = !DISubprogram(name: "atexit", scope: !362, file: !362, line: 595, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!29, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !732, file: !715, line: 137)
!732 = !DISubprogram(name: "at_quick_exit", scope: !362, file: !362, line: 600, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !734, file: !715, line: 140)
!734 = !DISubprogram(name: "atof", scope: !362, file: !362, line: 101, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !736, file: !715, line: 141)
!736 = !DISubprogram(name: "atoi", scope: !362, file: !362, line: 104, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!29, !605}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !740, file: !715, line: 142)
!740 = !DISubprogram(name: "atol", scope: !362, file: !362, line: 107, type: !741, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{!586, !605}
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !744, file: !715, line: 143)
!744 = !DISubprogram(name: "bsearch", scope: !362, file: !362, line: 820, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!152, !747, !747, !749, !749, !752}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !750, line: 46, baseType: !751)
!750 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!751 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !362, line: 808, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!29, !747, !747}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !757, file: !715, line: 144)
!757 = !DISubprogram(name: "calloc", scope: !362, file: !362, line: 542, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!152, !749, !749}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !761, file: !715, line: 145)
!761 = !DISubprogram(name: "div", scope: !362, file: !362, line: 852, type: !762, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!713, !29, !29}
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !765, file: !715, line: 146)
!765 = !DISubprogram(name: "exit", scope: !362, file: !362, line: 617, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !29}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !769, file: !715, line: 147)
!769 = !DISubprogram(name: "free", scope: !362, file: !362, line: 565, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !152}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !773, file: !715, line: 148)
!773 = !DISubprogram(name: "getenv", scope: !362, file: !362, line: 634, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !605}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !778, file: !715, line: 149)
!778 = !DISubprogram(name: "labs", scope: !362, file: !362, line: 841, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{!586, !586}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !782, file: !715, line: 150)
!782 = !DISubprogram(name: "ldiv", scope: !362, file: !362, line: 854, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!717, !586, !586}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !786, file: !715, line: 151)
!786 = !DISubprogram(name: "malloc", scope: !362, file: !362, line: 539, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!152, !749}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !790, file: !715, line: 153)
!790 = !DISubprogram(name: "mblen", scope: !362, file: !362, line: 922, type: !791, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{!29, !605, !749}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !794, file: !715, line: 154)
!794 = !DISubprogram(name: "mbstowcs", scope: !362, file: !362, line: 933, type: !795, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!749, !797, !800, !749}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!800 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !605)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !802, file: !715, line: 155)
!802 = !DISubprogram(name: "mbtowc", scope: !362, file: !362, line: 925, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!29, !797, !800, !749}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !806, file: !715, line: 157)
!806 = !DISubprogram(name: "qsort", scope: !362, file: !362, line: 830, type: !807, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !152, !749, !749, !752}
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !810, file: !715, line: 160)
!810 = !DISubprogram(name: "quick_exit", scope: !362, file: !362, line: 623, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !812, file: !715, line: 163)
!812 = !DISubprogram(name: "rand", scope: !362, file: !362, line: 453, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!29}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !816, file: !715, line: 164)
!816 = !DISubprogram(name: "realloc", scope: !362, file: !362, line: 550, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!152, !152, !749}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !820, file: !715, line: 165)
!820 = !DISubprogram(name: "srand", scope: !362, file: !362, line: 455, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !203}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !824, file: !715, line: 166)
!824 = !DISubprogram(name: "strtod", scope: !362, file: !362, line: 117, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!9, !800, !827}
!827 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !830, file: !715, line: 167)
!830 = !DISubprogram(name: "strtol", scope: !362, file: !362, line: 176, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!586, !800, !827, !29}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !834, file: !715, line: 168)
!834 = !DISubprogram(name: "strtoul", scope: !362, file: !362, line: 180, type: !835, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!751, !800, !827, !29}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !838, file: !715, line: 169)
!838 = !DISubprogram(name: "system", scope: !362, file: !362, line: 784, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !840, file: !715, line: 171)
!840 = !DISubprogram(name: "wcstombs", scope: !362, file: !362, line: 936, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!749, !843, !844, !749}
!843 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !776)
!844 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !848, file: !715, line: 172)
!848 = !DISubprogram(name: "wctomb", scope: !362, file: !362, line: 929, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!29, !776, !799}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !853, file: !715, line: 200)
!852 = !DINamespace(name: "__gnu_cxx", scope: null)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !362, line: 80, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !855, identifier: "_ZTS7lldiv_t")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !854, file: !362, line: 78, baseType: !549, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !854, file: !362, line: 79, baseType: !549, size: 64, offset: 64)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !859, file: !715, line: 206)
!859 = !DISubprogram(name: "_Exit", scope: !362, file: !362, line: 629, type: !766, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !861, file: !715, line: 210)
!861 = !DISubprogram(name: "llabs", scope: !362, file: !362, line: 844, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!549, !549}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !865, file: !715, line: 216)
!865 = !DISubprogram(name: "lldiv", scope: !362, file: !362, line: 858, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!853, !549, !549}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !869, file: !715, line: 227)
!869 = !DISubprogram(name: "atoll", scope: !362, file: !362, line: 112, type: !870, flags: DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!549, !605}
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !873, file: !715, line: 228)
!873 = !DISubprogram(name: "strtoll", scope: !362, file: !362, line: 200, type: !874, flags: DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{!549, !800, !827, !29}
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !877, file: !715, line: 229)
!877 = !DISubprogram(name: "strtoull", scope: !362, file: !362, line: 205, type: !878, flags: DIFlagPrototyped, spFlags: 0)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !800, !827, !29}
!880 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !882, file: !715, line: 231)
!882 = !DISubprogram(name: "strtof", scope: !362, file: !362, line: 123, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!31, !800, !827}
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !852, entity: !886, file: !715, line: 232)
!886 = !DISubprogram(name: "strtold", scope: !362, file: !362, line: 126, type: !887, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{!438, !800, !827}
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !853, file: !715, line: 240)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !859, file: !715, line: 242)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !861, file: !715, line: 244)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !893, file: !715, line: 245)
!893 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !852, file: !715, line: 213, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !865, file: !715, line: 246)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !869, file: !715, line: 248)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !882, file: !715, line: 249)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !873, file: !715, line: 250)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !877, file: !715, line: 251)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !360, entity: !886, file: !715, line: 252)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !283, entity: !723, file: !901, line: 38)
!901 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
