; ModuleID = 'prism.cpp'
source_filename = "prism.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Prism_Methods", linkageName: "_ZN3povL13Prism_MethodsE", scope: !2, file: !3, line: 169, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "prism.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !284, globals: !348, imports: !359, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !157}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !158, line: 149, baseType: !56, size: 32, elements: !159, identifier: "_ZTSN3pov5STATSE")
!158 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!160 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!166 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!167 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!174 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!175 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!176 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!210 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!211 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!220 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!221 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!238 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!239 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!242 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!243 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!248 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!249 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!250 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!251 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!255 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!256 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!257 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!258 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!259 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!260 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!261 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!262 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!263 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!264 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!265 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!266 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!267 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!268 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!269 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!270 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!271 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!272 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!273 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!274 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!275 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!276 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!277 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!278 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!279 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!280 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!281 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!282 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!283 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!284 = !{!285, !314, !320, !336, !104, !44}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM", scope: !2, file: !287, line: 62, baseType: !288)
!287 = !DIFile(filename: "./prism.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Prism_Struct", scope: !2, file: !287, line: 88, size: 1856, flags: DIFlagTypePassByValue, elements: !289, identifier: "_ZTSN3pov12Prism_StructE")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !335, !344, !345, !346, !347}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !288, file: !287, line: 90, baseType: !19, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !288, file: !287, line: 90, baseType: !13, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !288, file: !287, line: 90, baseType: !14, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !288, file: !287, line: 90, baseType: !23, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !288, file: !287, line: 90, baseType: !23, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !288, file: !287, line: 90, baseType: !28, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !288, file: !287, line: 90, baseType: !14, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !288, file: !287, line: 90, baseType: !14, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !288, file: !287, line: 90, baseType: !34, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !288, file: !287, line: 90, baseType: !38, size: 192, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !288, file: !287, line: 90, baseType: !50, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !288, file: !287, line: 90, baseType: !50, size: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !288, file: !287, line: 90, baseType: !45, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !288, file: !287, line: 90, baseType: !56, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !288, file: !287, line: 91, baseType: !13, size: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Spline_Type", scope: !288, file: !287, line: 92, baseType: !13, size: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Sweep_Type", scope: !288, file: !287, line: 93, baseType: !13, size: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Height1", scope: !288, file: !287, line: 94, baseType: !64, size: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Height2", scope: !288, file: !287, line: 94, baseType: !64, size: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !288, file: !287, line: 95, baseType: !64, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !288, file: !287, line: 95, baseType: !64, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !288, file: !287, line: 95, baseType: !64, size: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !288, file: !287, line: 95, baseType: !64, size: 64, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Spline", scope: !288, file: !287, line: 96, baseType: !314, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM_SPLINE", scope: !2, file: !287, line: 63, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Prism_Spline_Struct", scope: !2, file: !287, line: 82, size: 128, flags: DIFlagTypePassByValue, elements: !317, identifier: "_ZTSN3pov19Prism_Spline_StructE")
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !316, file: !287, line: 84, baseType: !13, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !316, file: !287, line: 85, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM_SPLINE_ENTRY", scope: !2, file: !287, line: 64, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Prism_Spline_Entry_Struct", scope: !2, file: !287, line: 75, size: 960, flags: DIFlagTypePassByValue, elements: !323, identifier: "_ZTSN3pov25Prism_Spline_Entry_StructE")
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !322, file: !287, line: 77, baseType: !64, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !322, file: !287, line: 77, baseType: !64, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !322, file: !287, line: 77, baseType: !64, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !322, file: !287, line: 77, baseType: !64, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !322, file: !287, line: 78, baseType: !64, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !322, file: !287, line: 78, baseType: !64, size: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !322, file: !287, line: 78, baseType: !64, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !322, file: !287, line: 79, baseType: !87, size: 128, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !322, file: !287, line: 79, baseType: !87, size: 128, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !322, file: !287, line: 79, baseType: !87, size: 128, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !322, file: !287, line: 79, baseType: !87, size: 128, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Intersections", scope: !288, file: !287, line: 97, baseType: !336, size: 64, offset: 1536)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM_INT", scope: !2, file: !287, line: 65, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Prism_Intersection_Structure", scope: !2, file: !287, line: 67, size: 192, flags: DIFlagTypePassByValue, elements: !339, identifier: "_ZTSN3pov28Prism_Intersection_StructureE")
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !338, file: !287, line: 69, baseType: !64, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !338, file: !287, line: 70, baseType: !64, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !338, file: !287, line: 71, baseType: !13, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !338, file: !287, line: 72, baseType: !13, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "u1", scope: !288, file: !287, line: 98, baseType: !64, size: 64, offset: 1600)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !288, file: !287, line: 98, baseType: !64, size: 64, offset: 1664)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !288, file: !287, line: 98, baseType: !64, size: 64, offset: 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !288, file: !287, line: 98, baseType: !64, size: 64, offset: 1792)
!348 = !{!0, !349, !352, !355, !357}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!350 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 130, type: !351, isLocal: true, isDefinition: true)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!353 = distinct !DIGlobalVariable(name: "CAP_HIT", scope: !2, file: !3, line: 135, type: !354, isLocal: true, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!356 = distinct !DIGlobalVariable(name: "BASE_HIT", scope: !2, file: !3, line: 134, type: !354, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!358 = distinct !DIGlobalVariable(name: "SPLINE_HIT", scope: !2, file: !3, line: 136, type: !354, isLocal: true, isDefinition: true)
!359 = !{!360, !367, !373, !375, !377, !381, !383, !385, !387, !389, !391, !393, !395, !400, !404, !406, !408, !412, !414, !416, !418, !420, !422, !424, !427, !429, !431, !435, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !464, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !502, !506, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !532, !536, !540, !542, !544, !546, !551, !555, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !588, !592, !596, !598, !600, !602, !609, !613, !617, !619, !621, !623, !625, !627, !629, !633, !637, !639, !641, !643, !645, !649, !653, !657, !659, !661, !663, !665, !667, !669, !673, !677, !681, !683, !687, !691, !693, !695, !697, !699, !701, !703, !709, !714, !718, !724, !728, !733, !735, !737, !741, !745, !758, !762, !766, !770, !774, !779, !783, !787, !791, !795, !803, !807, !811, !813, !817, !821, !825, !831, !835, !839, !841, !849, !853, !860, !862, !866, !870, !874, !878, !883, !887, !891, !892, !893, !894, !896, !897, !898, !899, !900, !901, !902, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !959, !961, !963, !965, !971, !975, !981, !985, !989, !993, !997, !999, !1001, !1005, !1009, !1013, !1017, !1021, !1023, !1025, !1027, !1031, !1035, !1039, !1041, !1043, !1046, !1048, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1070, !1071, !1072, !1074, !1076, !1078, !1080, !1081, !1085, !1141, !1145}
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !362, file: !366, line: 52)
!361 = !DINamespace(name: "std", scope: null)
!362 = !DISubprogram(name: "abs", scope: !363, file: !363, line: 840, type: !364, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!364 = !DISubroutineType(types: !365)
!365 = !{!13, !13}
!366 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !368, file: !372, line: 83)
!368 = !DISubprogram(name: "acos", scope: !369, file: !369, line: 53, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!370 = !DISubroutineType(types: !371)
!371 = !{!64, !64}
!372 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !374, file: !372, line: 102)
!374 = !DISubprogram(name: "asin", scope: !369, file: !369, line: 55, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !376, file: !372, line: 121)
!376 = !DISubprogram(name: "atan", scope: !369, file: !369, line: 57, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !378, file: !372, line: 140)
!378 = !DISubprogram(name: "atan2", scope: !369, file: !369, line: 59, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!64, !64, !64}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !382, file: !372, line: 161)
!382 = !DISubprogram(name: "ceil", scope: !369, file: !369, line: 159, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !384, file: !372, line: 180)
!384 = !DISubprogram(name: "cos", scope: !369, file: !369, line: 62, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !386, file: !372, line: 199)
!386 = !DISubprogram(name: "cosh", scope: !369, file: !369, line: 71, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !388, file: !372, line: 218)
!388 = !DISubprogram(name: "exp", scope: !369, file: !369, line: 95, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !390, file: !372, line: 237)
!390 = !DISubprogram(name: "fabs", scope: !369, file: !369, line: 162, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !392, file: !372, line: 256)
!392 = !DISubprogram(name: "floor", scope: !369, file: !369, line: 165, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !394, file: !372, line: 275)
!394 = !DISubprogram(name: "fmod", scope: !369, file: !369, line: 168, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !396, file: !372, line: 296)
!396 = !DISubprogram(name: "frexp", scope: !369, file: !369, line: 98, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!64, !64, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !401, file: !372, line: 315)
!401 = !DISubprogram(name: "ldexp", scope: !369, file: !369, line: 101, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!64, !64, !13}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !405, file: !372, line: 334)
!405 = !DISubprogram(name: "log", scope: !369, file: !369, line: 104, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !407, file: !372, line: 353)
!407 = !DISubprogram(name: "log10", scope: !369, file: !369, line: 107, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !409, file: !372, line: 372)
!409 = !DISubprogram(name: "modf", scope: !369, file: !369, line: 110, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!64, !64, !113}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !413, file: !372, line: 384)
!413 = !DISubprogram(name: "pow", scope: !369, file: !369, line: 140, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !415, file: !372, line: 421)
!415 = !DISubprogram(name: "sin", scope: !369, file: !369, line: 64, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !417, file: !372, line: 440)
!417 = !DISubprogram(name: "sinh", scope: !369, file: !369, line: 73, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !419, file: !372, line: 459)
!419 = !DISubprogram(name: "sqrt", scope: !369, file: !369, line: 143, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !421, file: !372, line: 478)
!421 = !DISubprogram(name: "tan", scope: !369, file: !369, line: 66, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !423, file: !372, line: 497)
!423 = !DISubprogram(name: "tanh", scope: !369, file: !369, line: 75, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !425, file: !372, line: 1065)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !426, line: 150, baseType: !64)
!426 = !DIFile(filename: "/usr/include/math.h", directory: "")
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !428, file: !372, line: 1066)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !426, line: 149, baseType: !45)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !430, file: !372, line: 1069)
!430 = !DISubprogram(name: "acosh", scope: !369, file: !369, line: 85, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !432, file: !372, line: 1070)
!432 = !DISubprogram(name: "acoshf", scope: !369, file: !369, line: 85, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DISubroutineType(types: !434)
!434 = !{!45, !45}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !436, file: !372, line: 1071)
!436 = !DISubprogram(name: "acoshl", scope: !369, file: !369, line: 85, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !439}
!439 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !441, file: !372, line: 1073)
!441 = !DISubprogram(name: "asinh", scope: !369, file: !369, line: 87, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !443, file: !372, line: 1074)
!443 = !DISubprogram(name: "asinhf", scope: !369, file: !369, line: 87, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !445, file: !372, line: 1075)
!445 = !DISubprogram(name: "asinhl", scope: !369, file: !369, line: 87, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !447, file: !372, line: 1077)
!447 = !DISubprogram(name: "atanh", scope: !369, file: !369, line: 89, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !449, file: !372, line: 1078)
!449 = !DISubprogram(name: "atanhf", scope: !369, file: !369, line: 89, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !451, file: !372, line: 1079)
!451 = !DISubprogram(name: "atanhl", scope: !369, file: !369, line: 89, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !453, file: !372, line: 1081)
!453 = !DISubprogram(name: "cbrt", scope: !369, file: !369, line: 152, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !455, file: !372, line: 1082)
!455 = !DISubprogram(name: "cbrtf", scope: !369, file: !369, line: 152, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !457, file: !372, line: 1083)
!457 = !DISubprogram(name: "cbrtl", scope: !369, file: !369, line: 152, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !459, file: !372, line: 1085)
!459 = !DISubprogram(name: "copysign", scope: !369, file: !369, line: 196, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !461, file: !372, line: 1086)
!461 = !DISubprogram(name: "copysignf", scope: !369, file: !369, line: 196, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DISubroutineType(types: !463)
!463 = !{!45, !45, !45}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !465, file: !372, line: 1087)
!465 = !DISubprogram(name: "copysignl", scope: !369, file: !369, line: 196, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DISubroutineType(types: !467)
!467 = !{!439, !439, !439}
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !469, file: !372, line: 1089)
!469 = !DISubprogram(name: "erf", scope: !369, file: !369, line: 228, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !471, file: !372, line: 1090)
!471 = !DISubprogram(name: "erff", scope: !369, file: !369, line: 228, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !473, file: !372, line: 1091)
!473 = !DISubprogram(name: "erfl", scope: !369, file: !369, line: 228, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !475, file: !372, line: 1093)
!475 = !DISubprogram(name: "erfc", scope: !369, file: !369, line: 229, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !477, file: !372, line: 1094)
!477 = !DISubprogram(name: "erfcf", scope: !369, file: !369, line: 229, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !479, file: !372, line: 1095)
!479 = !DISubprogram(name: "erfcl", scope: !369, file: !369, line: 229, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !481, file: !372, line: 1097)
!481 = !DISubprogram(name: "exp2", scope: !369, file: !369, line: 130, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !483, file: !372, line: 1098)
!483 = !DISubprogram(name: "exp2f", scope: !369, file: !369, line: 130, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !485, file: !372, line: 1099)
!485 = !DISubprogram(name: "exp2l", scope: !369, file: !369, line: 130, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !487, file: !372, line: 1101)
!487 = !DISubprogram(name: "expm1", scope: !369, file: !369, line: 119, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !489, file: !372, line: 1102)
!489 = !DISubprogram(name: "expm1f", scope: !369, file: !369, line: 119, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !491, file: !372, line: 1103)
!491 = !DISubprogram(name: "expm1l", scope: !369, file: !369, line: 119, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !493, file: !372, line: 1105)
!493 = !DISubprogram(name: "fdim", scope: !369, file: !369, line: 326, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !495, file: !372, line: 1106)
!495 = !DISubprogram(name: "fdimf", scope: !369, file: !369, line: 326, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !497, file: !372, line: 1107)
!497 = !DISubprogram(name: "fdiml", scope: !369, file: !369, line: 326, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !499, file: !372, line: 1109)
!499 = !DISubprogram(name: "fma", scope: !369, file: !369, line: 335, type: !500, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!64, !64, !64, !64}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !503, file: !372, line: 1110)
!503 = !DISubprogram(name: "fmaf", scope: !369, file: !369, line: 335, type: !504, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{!45, !45, !45, !45}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !507, file: !372, line: 1111)
!507 = !DISubprogram(name: "fmal", scope: !369, file: !369, line: 335, type: !508, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DISubroutineType(types: !509)
!509 = !{!439, !439, !439, !439}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !511, file: !372, line: 1113)
!511 = !DISubprogram(name: "fmax", scope: !369, file: !369, line: 329, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !513, file: !372, line: 1114)
!513 = !DISubprogram(name: "fmaxf", scope: !369, file: !369, line: 329, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !515, file: !372, line: 1115)
!515 = !DISubprogram(name: "fmaxl", scope: !369, file: !369, line: 329, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !517, file: !372, line: 1117)
!517 = !DISubprogram(name: "fmin", scope: !369, file: !369, line: 332, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !519, file: !372, line: 1118)
!519 = !DISubprogram(name: "fminf", scope: !369, file: !369, line: 332, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !521, file: !372, line: 1119)
!521 = !DISubprogram(name: "fminl", scope: !369, file: !369, line: 332, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !523, file: !372, line: 1121)
!523 = !DISubprogram(name: "hypot", scope: !369, file: !369, line: 147, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !525, file: !372, line: 1122)
!525 = !DISubprogram(name: "hypotf", scope: !369, file: !369, line: 147, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !527, file: !372, line: 1123)
!527 = !DISubprogram(name: "hypotl", scope: !369, file: !369, line: 147, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !529, file: !372, line: 1125)
!529 = !DISubprogram(name: "ilogb", scope: !369, file: !369, line: 280, type: !530, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DISubroutineType(types: !531)
!531 = !{!13, !64}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !533, file: !372, line: 1126)
!533 = !DISubprogram(name: "ilogbf", scope: !369, file: !369, line: 280, type: !534, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DISubroutineType(types: !535)
!535 = !{!13, !45}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !537, file: !372, line: 1127)
!537 = !DISubprogram(name: "ilogbl", scope: !369, file: !369, line: 280, type: !538, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!13, !439}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !541, file: !372, line: 1129)
!541 = !DISubprogram(name: "lgamma", scope: !369, file: !369, line: 230, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !543, file: !372, line: 1130)
!543 = !DISubprogram(name: "lgammaf", scope: !369, file: !369, line: 230, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !545, file: !372, line: 1131)
!545 = !DISubprogram(name: "lgammal", scope: !369, file: !369, line: 230, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !547, file: !372, line: 1134)
!547 = !DISubprogram(name: "llrint", scope: !369, file: !369, line: 316, type: !548, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !64}
!550 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !552, file: !372, line: 1135)
!552 = !DISubprogram(name: "llrintf", scope: !369, file: !369, line: 316, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!550, !45}
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !556, file: !372, line: 1136)
!556 = !DISubprogram(name: "llrintl", scope: !369, file: !369, line: 316, type: !557, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DISubroutineType(types: !558)
!558 = !{!550, !439}
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !560, file: !372, line: 1138)
!560 = !DISubprogram(name: "llround", scope: !369, file: !369, line: 322, type: !548, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !562, file: !372, line: 1139)
!562 = !DISubprogram(name: "llroundf", scope: !369, file: !369, line: 322, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !564, file: !372, line: 1140)
!564 = !DISubprogram(name: "llroundl", scope: !369, file: !369, line: 322, type: !557, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !566, file: !372, line: 1143)
!566 = !DISubprogram(name: "log1p", scope: !369, file: !369, line: 122, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !568, file: !372, line: 1144)
!568 = !DISubprogram(name: "log1pf", scope: !369, file: !369, line: 122, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !570, file: !372, line: 1145)
!570 = !DISubprogram(name: "log1pl", scope: !369, file: !369, line: 122, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !572, file: !372, line: 1147)
!572 = !DISubprogram(name: "log2", scope: !369, file: !369, line: 133, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !574, file: !372, line: 1148)
!574 = !DISubprogram(name: "log2f", scope: !369, file: !369, line: 133, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !576, file: !372, line: 1149)
!576 = !DISubprogram(name: "log2l", scope: !369, file: !369, line: 133, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !578, file: !372, line: 1151)
!578 = !DISubprogram(name: "logb", scope: !369, file: !369, line: 125, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !580, file: !372, line: 1152)
!580 = !DISubprogram(name: "logbf", scope: !369, file: !369, line: 125, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !582, file: !372, line: 1153)
!582 = !DISubprogram(name: "logbl", scope: !369, file: !369, line: 125, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !584, file: !372, line: 1155)
!584 = !DISubprogram(name: "lrint", scope: !369, file: !369, line: 314, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !64}
!587 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !589, file: !372, line: 1156)
!589 = !DISubprogram(name: "lrintf", scope: !369, file: !369, line: 314, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!587, !45}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !593, file: !372, line: 1157)
!593 = !DISubprogram(name: "lrintl", scope: !369, file: !369, line: 314, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{!587, !439}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !597, file: !372, line: 1159)
!597 = !DISubprogram(name: "lround", scope: !369, file: !369, line: 320, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !599, file: !372, line: 1160)
!599 = !DISubprogram(name: "lroundf", scope: !369, file: !369, line: 320, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !601, file: !372, line: 1161)
!601 = !DISubprogram(name: "lroundl", scope: !369, file: !369, line: 320, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !603, file: !372, line: 1163)
!603 = !DISubprogram(name: "nan", scope: !369, file: !369, line: 201, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DISubroutineType(types: !605)
!605 = !{!64, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!608 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !610, file: !372, line: 1164)
!610 = !DISubprogram(name: "nanf", scope: !369, file: !369, line: 201, type: !611, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!45, !606}
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !614, file: !372, line: 1165)
!614 = !DISubprogram(name: "nanl", scope: !369, file: !369, line: 201, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!439, !606}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !618, file: !372, line: 1167)
!618 = !DISubprogram(name: "nearbyint", scope: !369, file: !369, line: 294, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !620, file: !372, line: 1168)
!620 = !DISubprogram(name: "nearbyintf", scope: !369, file: !369, line: 294, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !622, file: !372, line: 1169)
!622 = !DISubprogram(name: "nearbyintl", scope: !369, file: !369, line: 294, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !624, file: !372, line: 1171)
!624 = !DISubprogram(name: "nextafter", scope: !369, file: !369, line: 259, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !626, file: !372, line: 1172)
!626 = !DISubprogram(name: "nextafterf", scope: !369, file: !369, line: 259, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !628, file: !372, line: 1173)
!628 = !DISubprogram(name: "nextafterl", scope: !369, file: !369, line: 259, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !630, file: !372, line: 1175)
!630 = !DISubprogram(name: "nexttoward", scope: !369, file: !369, line: 261, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!64, !64, !439}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !634, file: !372, line: 1176)
!634 = !DISubprogram(name: "nexttowardf", scope: !369, file: !369, line: 261, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!45, !45, !439}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !638, file: !372, line: 1177)
!638 = !DISubprogram(name: "nexttowardl", scope: !369, file: !369, line: 261, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !640, file: !372, line: 1179)
!640 = !DISubprogram(name: "remainder", scope: !369, file: !369, line: 272, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !642, file: !372, line: 1180)
!642 = !DISubprogram(name: "remainderf", scope: !369, file: !369, line: 272, type: !462, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !644, file: !372, line: 1181)
!644 = !DISubprogram(name: "remainderl", scope: !369, file: !369, line: 272, type: !466, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !646, file: !372, line: 1183)
!646 = !DISubprogram(name: "remquo", scope: !369, file: !369, line: 307, type: !647, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!64, !64, !64, !399}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !650, file: !372, line: 1184)
!650 = !DISubprogram(name: "remquof", scope: !369, file: !369, line: 307, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!45, !45, !45, !399}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !654, file: !372, line: 1185)
!654 = !DISubprogram(name: "remquol", scope: !369, file: !369, line: 307, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!439, !439, !439, !399}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !658, file: !372, line: 1187)
!658 = !DISubprogram(name: "rint", scope: !369, file: !369, line: 256, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !660, file: !372, line: 1188)
!660 = !DISubprogram(name: "rintf", scope: !369, file: !369, line: 256, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !662, file: !372, line: 1189)
!662 = !DISubprogram(name: "rintl", scope: !369, file: !369, line: 256, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !664, file: !372, line: 1191)
!664 = !DISubprogram(name: "round", scope: !369, file: !369, line: 298, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !666, file: !372, line: 1192)
!666 = !DISubprogram(name: "roundf", scope: !369, file: !369, line: 298, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !668, file: !372, line: 1193)
!668 = !DISubprogram(name: "roundl", scope: !369, file: !369, line: 298, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !670, file: !372, line: 1195)
!670 = !DISubprogram(name: "scalbln", scope: !369, file: !369, line: 290, type: !671, flags: DIFlagPrototyped, spFlags: 0)
!671 = !DISubroutineType(types: !672)
!672 = !{!64, !64, !587}
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !674, file: !372, line: 1196)
!674 = !DISubprogram(name: "scalblnf", scope: !369, file: !369, line: 290, type: !675, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{!45, !45, !587}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !678, file: !372, line: 1197)
!678 = !DISubprogram(name: "scalblnl", scope: !369, file: !369, line: 290, type: !679, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{!439, !439, !587}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !682, file: !372, line: 1199)
!682 = !DISubprogram(name: "scalbn", scope: !369, file: !369, line: 276, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !684, file: !372, line: 1200)
!684 = !DISubprogram(name: "scalbnf", scope: !369, file: !369, line: 276, type: !685, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{!45, !45, !13}
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !688, file: !372, line: 1201)
!688 = !DISubprogram(name: "scalbnl", scope: !369, file: !369, line: 276, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!439, !439, !13}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !692, file: !372, line: 1203)
!692 = !DISubprogram(name: "tgamma", scope: !369, file: !369, line: 235, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !694, file: !372, line: 1204)
!694 = !DISubprogram(name: "tgammaf", scope: !369, file: !369, line: 235, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !696, file: !372, line: 1205)
!696 = !DISubprogram(name: "tgammal", scope: !369, file: !369, line: 235, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !698, file: !372, line: 1207)
!698 = !DISubprogram(name: "trunc", scope: !369, file: !369, line: 302, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !700, file: !372, line: 1208)
!700 = !DISubprogram(name: "truncf", scope: !369, file: !369, line: 302, type: !433, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !702, file: !372, line: 1209)
!702 = !DISubprogram(name: "truncl", scope: !369, file: !369, line: 302, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !704, file: !708, line: 38)
!704 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !361, file: !366, line: 103, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !707}
!707 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!708 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !710, file: !708, line: 54)
!710 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !361, file: !372, line: 380, type: !711, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{!439, !439, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !715, file: !717, line: 127)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !363, line: 62, baseType: !716)
!716 = !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!717 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !719, file: !717, line: 128)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !363, line: 70, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !721, identifier: "_ZTS6ldiv_t")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !720, file: !363, line: 68, baseType: !587, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !720, file: !363, line: 69, baseType: !587, size: 64, offset: 64)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !725, file: !717, line: 130)
!725 = !DISubprogram(name: "abort", scope: !363, file: !363, line: 591, type: !726, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{null}
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !729, file: !717, line: 134)
!729 = !DISubprogram(name: "atexit", scope: !363, file: !363, line: 595, type: !730, flags: DIFlagPrototyped, spFlags: 0)
!730 = !DISubroutineType(types: !731)
!731 = !{!13, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !734, file: !717, line: 137)
!734 = !DISubprogram(name: "at_quick_exit", scope: !363, file: !363, line: 600, type: !730, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !736, file: !717, line: 140)
!736 = !DISubprogram(name: "atof", scope: !363, file: !363, line: 101, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !738, file: !717, line: 141)
!738 = !DISubprogram(name: "atoi", scope: !363, file: !363, line: 104, type: !739, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{!13, !606}
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !742, file: !717, line: 142)
!742 = !DISubprogram(name: "atol", scope: !363, file: !363, line: 107, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!587, !606}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !746, file: !717, line: 143)
!746 = !DISubprogram(name: "bsearch", scope: !363, file: !363, line: 820, type: !747, flags: DIFlagPrototyped, spFlags: 0)
!747 = !DISubroutineType(types: !748)
!748 = !{!104, !749, !749, !751, !751, !754}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !752, line: 46, baseType: !753)
!752 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!753 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !363, line: 808, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!13, !749, !749}
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !759, file: !717, line: 144)
!759 = !DISubprogram(name: "calloc", scope: !363, file: !363, line: 542, type: !760, flags: DIFlagPrototyped, spFlags: 0)
!760 = !DISubroutineType(types: !761)
!761 = !{!104, !751, !751}
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !763, file: !717, line: 145)
!763 = !DISubprogram(name: "div", scope: !363, file: !363, line: 852, type: !764, flags: DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{!715, !13, !13}
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !767, file: !717, line: 146)
!767 = !DISubprogram(name: "exit", scope: !363, file: !363, line: 617, type: !768, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !13}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !771, file: !717, line: 147)
!771 = !DISubprogram(name: "free", scope: !363, file: !363, line: 565, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !104}
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !775, file: !717, line: 148)
!775 = !DISubprogram(name: "getenv", scope: !363, file: !363, line: 634, type: !776, flags: DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !606}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !780, file: !717, line: 149)
!780 = !DISubprogram(name: "labs", scope: !363, file: !363, line: 841, type: !781, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{!587, !587}
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !784, file: !717, line: 150)
!784 = !DISubprogram(name: "ldiv", scope: !363, file: !363, line: 854, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!719, !587, !587}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !788, file: !717, line: 151)
!788 = !DISubprogram(name: "malloc", scope: !363, file: !363, line: 539, type: !789, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{!104, !751}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !792, file: !717, line: 153)
!792 = !DISubprogram(name: "mblen", scope: !363, file: !363, line: 922, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!13, !606, !751}
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !796, file: !717, line: 154)
!796 = !DISubprogram(name: "mbstowcs", scope: !363, file: !363, line: 933, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!751, !799, !802, !751}
!799 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!802 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !606)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !804, file: !717, line: 155)
!804 = !DISubprogram(name: "mbtowc", scope: !363, file: !363, line: 925, type: !805, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DISubroutineType(types: !806)
!806 = !{!13, !799, !802, !751}
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !808, file: !717, line: 157)
!808 = !DISubprogram(name: "qsort", scope: !363, file: !363, line: 830, type: !809, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !104, !751, !751, !754}
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !812, file: !717, line: 160)
!812 = !DISubprogram(name: "quick_exit", scope: !363, file: !363, line: 623, type: !768, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !814, file: !717, line: 163)
!814 = !DISubprogram(name: "rand", scope: !363, file: !363, line: 453, type: !815, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!13}
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !818, file: !717, line: 164)
!818 = !DISubprogram(name: "realloc", scope: !363, file: !363, line: 550, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!104, !104, !751}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !822, file: !717, line: 165)
!822 = !DISubprogram(name: "srand", scope: !363, file: !363, line: 455, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !56}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !826, file: !717, line: 166)
!826 = !DISubprogram(name: "strtod", scope: !363, file: !363, line: 117, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!64, !802, !829}
!829 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !832, file: !717, line: 167)
!832 = !DISubprogram(name: "strtol", scope: !363, file: !363, line: 176, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!587, !802, !829, !13}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !836, file: !717, line: 168)
!836 = !DISubprogram(name: "strtoul", scope: !363, file: !363, line: 180, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!753, !802, !829, !13}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !840, file: !717, line: 169)
!840 = !DISubprogram(name: "system", scope: !363, file: !363, line: 784, type: !739, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !842, file: !717, line: 171)
!842 = !DISubprogram(name: "wcstombs", scope: !363, file: !363, line: 936, type: !843, flags: DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{!751, !845, !846, !751}
!845 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !778)
!846 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !850, file: !717, line: 172)
!850 = !DISubprogram(name: "wctomb", scope: !363, file: !363, line: 929, type: !851, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DISubroutineType(types: !852)
!852 = !{!13, !778, !801}
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !855, file: !717, line: 200)
!854 = !DINamespace(name: "__gnu_cxx", scope: null)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !363, line: 80, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !857, identifier: "_ZTS7lldiv_t")
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !856, file: !363, line: 78, baseType: !550, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !856, file: !363, line: 79, baseType: !550, size: 64, offset: 64)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !861, file: !717, line: 206)
!861 = !DISubprogram(name: "_Exit", scope: !363, file: !363, line: 629, type: !768, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !863, file: !717, line: 210)
!863 = !DISubprogram(name: "llabs", scope: !363, file: !363, line: 844, type: !864, flags: DIFlagPrototyped, spFlags: 0)
!864 = !DISubroutineType(types: !865)
!865 = !{!550, !550}
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !867, file: !717, line: 216)
!867 = !DISubprogram(name: "lldiv", scope: !363, file: !363, line: 858, type: !868, flags: DIFlagPrototyped, spFlags: 0)
!868 = !DISubroutineType(types: !869)
!869 = !{!855, !550, !550}
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !871, file: !717, line: 227)
!871 = !DISubprogram(name: "atoll", scope: !363, file: !363, line: 112, type: !872, flags: DIFlagPrototyped, spFlags: 0)
!872 = !DISubroutineType(types: !873)
!873 = !{!550, !606}
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !875, file: !717, line: 228)
!875 = !DISubprogram(name: "strtoll", scope: !363, file: !363, line: 200, type: !876, flags: DIFlagPrototyped, spFlags: 0)
!876 = !DISubroutineType(types: !877)
!877 = !{!550, !802, !829, !13}
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !879, file: !717, line: 229)
!879 = !DISubprogram(name: "strtoull", scope: !363, file: !363, line: 205, type: !880, flags: DIFlagPrototyped, spFlags: 0)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !802, !829, !13}
!882 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !884, file: !717, line: 231)
!884 = !DISubprogram(name: "strtof", scope: !363, file: !363, line: 123, type: !885, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!45, !802, !829}
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !854, entity: !888, file: !717, line: 232)
!888 = !DISubprogram(name: "strtold", scope: !363, file: !363, line: 126, type: !889, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{!439, !802, !829}
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !855, file: !717, line: 240)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !861, file: !717, line: 242)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !863, file: !717, line: 244)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !895, file: !717, line: 245)
!895 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !854, file: !717, line: 213, type: !868, flags: DIFlagPrototyped, spFlags: 0)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !867, file: !717, line: 246)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !871, file: !717, line: 248)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !884, file: !717, line: 249)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !875, file: !717, line: 250)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !879, file: !717, line: 251)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !888, file: !717, line: 252)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !725, file: !903, line: 38)
!903 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
