; ModuleID = 'polygon.cpp'
source_filename = "polygon.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Polygon_Methods", linkageName: "_ZN3povL15Polygon_MethodsE", scope: !2, file: !3, line: 105, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "polygon.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !115, !121, !128, !130, !135, !140, !142, !144, !149, !154}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !65, !79}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !61, !62, !63}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !53, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !{!54, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !52, file: !5, line: 1018, baseType: !55, size: 1024)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !5, line: 693, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !58)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !{!59, !59}
!59 = !DISubrange(count: 4)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !5, line: 1019, baseType: !55, size: 1024, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !64, size: 32, offset: 928)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !68, identifier: "_ZTSN3pov10Ray_StructE")
!68 = !{!69, !72, !73, !74, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !67, file: !5, line: 1799, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !46)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !67, file: !5, line: 1800, baseType: !70, size: 192, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !67, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !67, file: !5, line: 1802, baseType: !64, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !67, file: !5, line: 1803, baseType: !76, size: 6400, offset: 448)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 100)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN3pov13istack_structE")
!82 = !{!83, !85, !113, !114}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !5, line: 1637, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !81, file: !5, line: 1638, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN3pov10istk_entryE")
!88 = !{!89, !90, !91, !92, !93, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !87, file: !5, line: 1612, baseType: !57, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !87, file: !5, line: 1613, baseType: !70, size: 192, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !87, file: !5, line: 1614, baseType: !70, size: 192, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !87, file: !5, line: 1615, baseType: !70, size: 192, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !87, file: !5, line: 1616, baseType: !94, size: 128, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !87, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !87, file: !5, line: 1630, baseType: !111, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !87, file: !5, line: 1632, baseType: !111, size: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !81, file: !5, line: 1639, baseType: !64, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !81, file: !5, line: 1640, baseType: !64, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!13, !120, !14}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !120, !14, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !87)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !123)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!111, !14}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !14, !120, !50}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !141, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !137)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !137)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !14, !50}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !14}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !151)
!156 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !157, retainedTypes: !291, globals: !321, imports: !327, splitDebugInlining: false, nameTableKind: None)
!157 = !{!158, !164}
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !64, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163}
!160 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !165, line: 149, baseType: !64, size: 32, elements: !166, identifier: "_ZTSN3pov5STATSE")
!165 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!167 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!171 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!172 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!173 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!174 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!181 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!182 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!183 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!184 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!217 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!218 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!227 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!228 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!245 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!246 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!249 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!250 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!255 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!256 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!257 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!258 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!262 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!263 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!264 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!265 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!266 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!267 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!268 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!269 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!270 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!271 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!272 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!273 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!274 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!275 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!276 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!277 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!278 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!279 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!280 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!281 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!282 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!283 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!284 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!285 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!286 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!287 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!288 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!289 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!290 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!291 = !{!292, !313, !320, !111, !44}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLYGON", scope: !2, file: !294, line: 51, baseType: !295)
!294 = !DIFile(filename: "./polygon.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Polygon_Struct", scope: !2, file: !294, line: 60, size: 1216, flags: DIFlagTypePassByValue, elements: !296, identifier: "_ZTSN3pov14Polygon_StructE")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !295, file: !294, line: 62, baseType: !19, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !295, file: !294, line: 62, baseType: !13, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !295, file: !294, line: 62, baseType: !14, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !295, file: !294, line: 62, baseType: !23, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !295, file: !294, line: 62, baseType: !23, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !295, file: !294, line: 62, baseType: !28, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !295, file: !294, line: 62, baseType: !14, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !295, file: !294, line: 62, baseType: !14, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !295, file: !294, line: 62, baseType: !34, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !295, file: !294, line: 62, baseType: !38, size: 192, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !295, file: !294, line: 62, baseType: !50, size: 64, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !295, file: !294, line: 62, baseType: !50, size: 64, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !295, file: !294, line: 62, baseType: !45, size: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !295, file: !294, line: 62, baseType: !64, size: 32, offset: 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "S_Normal", scope: !295, file: !294, line: 63, baseType: !70, size: 192, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !295, file: !294, line: 64, baseType: !313, size: 64, offset: 1152)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLYGON_DATA", scope: !2, file: !294, line: 50, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Polygon_Data_Struct", scope: !2, file: !294, line: 53, size: 128, flags: DIFlagTypePassByValue, elements: !316, identifier: "_ZTSN3pov19Polygon_Data_StructE")
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !315, file: !294, line: 55, baseType: !13, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !315, file: !294, line: 56, baseType: !13, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Points", scope: !315, file: !294, line: 57, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!321 = !{!322, !0, !325}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression(DW_OP_constu, 4457293557087583675, DW_OP_stack_value))
!323 = distinct !DIGlobalVariable(name: "ZERO_TOLERANCE", scope: !2, file: !3, line: 76, type: !324, isLocal: true, isDefinition: true)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression(DW_OP_constu, 4487126258331716666, DW_OP_stack_value))
!326 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 73, type: !324, isLocal: true, isDefinition: true)
!327 = !{!328, !335, !341, !343, !345, !349, !351, !353, !355, !357, !359, !361, !363, !368, !372, !374, !376, !380, !382, !384, !386, !388, !390, !392, !395, !397, !399, !403, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !432, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !470, !474, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !500, !504, !508, !510, !512, !514, !519, !523, !527, !529, !531, !533, !535, !537, !539, !541, !543, !545, !547, !549, !551, !556, !560, !564, !566, !568, !570, !577, !581, !585, !587, !589, !591, !593, !595, !597, !601, !605, !607, !609, !611, !613, !617, !621, !625, !627, !629, !631, !633, !635, !637, !641, !645, !649, !651, !655, !659, !661, !663, !665, !667, !669, !671, !677, !682, !686, !692, !696, !701, !703, !705, !709, !713, !726, !730, !734, !738, !742, !747, !751, !755, !759, !763, !771, !775, !779, !781, !785, !789, !793, !799, !803, !807, !809, !817, !821, !828, !830, !834, !838, !842, !846, !851, !855, !859, !860, !861, !862, !864, !865, !866, !867, !868, !869, !870, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !907, !909, !911, !913, !915, !917, !919, !921, !923, !925, !927, !929, !931, !933, !939, !943, !949, !953, !957, !961, !965, !967, !969, !973, !977, !981, !985, !989, !991, !993, !995, !999, !1003, !1007, !1009, !1011, !1014, !1016, !1017, !1019, !1021, !1023, !1024, !1026, !1028, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1045, !1046, !1047, !1051, !1107, !1111}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !330, file: !334, line: 52)
!329 = !DINamespace(name: "std", scope: null)
!330 = !DISubprogram(name: "abs", scope: !331, file: !331, line: 840, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!332 = !DISubroutineType(types: !333)
!333 = !{!13, !13}
!334 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !336, file: !340, line: 83)
!336 = !DISubprogram(name: "acos", scope: !337, file: !337, line: 53, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!338 = !DISubroutineType(types: !339)
!339 = !{!57, !57}
!340 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !342, file: !340, line: 102)
!342 = !DISubprogram(name: "asin", scope: !337, file: !337, line: 55, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !344, file: !340, line: 121)
!344 = !DISubprogram(name: "atan", scope: !337, file: !337, line: 57, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !346, file: !340, line: 140)
!346 = !DISubprogram(name: "atan2", scope: !337, file: !337, line: 59, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{!57, !57, !57}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !350, file: !340, line: 161)
!350 = !DISubprogram(name: "ceil", scope: !337, file: !337, line: 159, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !352, file: !340, line: 180)
!352 = !DISubprogram(name: "cos", scope: !337, file: !337, line: 62, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !354, file: !340, line: 199)
!354 = !DISubprogram(name: "cosh", scope: !337, file: !337, line: 71, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !356, file: !340, line: 218)
!356 = !DISubprogram(name: "exp", scope: !337, file: !337, line: 95, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !358, file: !340, line: 237)
!358 = !DISubprogram(name: "fabs", scope: !337, file: !337, line: 162, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !360, file: !340, line: 256)
!360 = !DISubprogram(name: "floor", scope: !337, file: !337, line: 165, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !362, file: !340, line: 275)
!362 = !DISubprogram(name: "fmod", scope: !337, file: !337, line: 168, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !364, file: !340, line: 296)
!364 = !DISubprogram(name: "frexp", scope: !337, file: !337, line: 98, type: !365, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DISubroutineType(types: !366)
!366 = !{!57, !57, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !369, file: !340, line: 315)
!369 = !DISubprogram(name: "ldexp", scope: !337, file: !337, line: 101, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!57, !57, !13}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !373, file: !340, line: 334)
!373 = !DISubprogram(name: "log", scope: !337, file: !337, line: 104, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !375, file: !340, line: 353)
!375 = !DISubprogram(name: "log10", scope: !337, file: !337, line: 107, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !377, file: !340, line: 372)
!377 = !DISubprogram(name: "modf", scope: !337, file: !337, line: 110, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!57, !57, !120}
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !381, file: !340, line: 384)
!381 = !DISubprogram(name: "pow", scope: !337, file: !337, line: 140, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !383, file: !340, line: 421)
!383 = !DISubprogram(name: "sin", scope: !337, file: !337, line: 64, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !385, file: !340, line: 440)
!385 = !DISubprogram(name: "sinh", scope: !337, file: !337, line: 73, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !387, file: !340, line: 459)
!387 = !DISubprogram(name: "sqrt", scope: !337, file: !337, line: 143, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !389, file: !340, line: 478)
!389 = !DISubprogram(name: "tan", scope: !337, file: !337, line: 66, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !391, file: !340, line: 497)
!391 = !DISubprogram(name: "tanh", scope: !337, file: !337, line: 75, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !393, file: !340, line: 1065)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !394, line: 150, baseType: !57)
!394 = !DIFile(filename: "/usr/include/math.h", directory: "")
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !396, file: !340, line: 1066)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !394, line: 149, baseType: !45)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !398, file: !340, line: 1069)
!398 = !DISubprogram(name: "acosh", scope: !337, file: !337, line: 85, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !400, file: !340, line: 1070)
!400 = !DISubprogram(name: "acoshf", scope: !337, file: !337, line: 85, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!45, !45}
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !404, file: !340, line: 1071)
!404 = !DISubprogram(name: "acoshl", scope: !337, file: !337, line: 85, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!407, !407}
!407 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !409, file: !340, line: 1073)
!409 = !DISubprogram(name: "asinh", scope: !337, file: !337, line: 87, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !411, file: !340, line: 1074)
!411 = !DISubprogram(name: "asinhf", scope: !337, file: !337, line: 87, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !413, file: !340, line: 1075)
!413 = !DISubprogram(name: "asinhl", scope: !337, file: !337, line: 87, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !415, file: !340, line: 1077)
!415 = !DISubprogram(name: "atanh", scope: !337, file: !337, line: 89, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !417, file: !340, line: 1078)
!417 = !DISubprogram(name: "atanhf", scope: !337, file: !337, line: 89, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !419, file: !340, line: 1079)
!419 = !DISubprogram(name: "atanhl", scope: !337, file: !337, line: 89, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !421, file: !340, line: 1081)
!421 = !DISubprogram(name: "cbrt", scope: !337, file: !337, line: 152, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !423, file: !340, line: 1082)
!423 = !DISubprogram(name: "cbrtf", scope: !337, file: !337, line: 152, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !425, file: !340, line: 1083)
!425 = !DISubprogram(name: "cbrtl", scope: !337, file: !337, line: 152, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !427, file: !340, line: 1085)
!427 = !DISubprogram(name: "copysign", scope: !337, file: !337, line: 196, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !429, file: !340, line: 1086)
!429 = !DISubprogram(name: "copysignf", scope: !337, file: !337, line: 196, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{!45, !45, !45}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !433, file: !340, line: 1087)
!433 = !DISubprogram(name: "copysignl", scope: !337, file: !337, line: 196, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!407, !407, !407}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !437, file: !340, line: 1089)
!437 = !DISubprogram(name: "erf", scope: !337, file: !337, line: 228, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !439, file: !340, line: 1090)
!439 = !DISubprogram(name: "erff", scope: !337, file: !337, line: 228, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !441, file: !340, line: 1091)
!441 = !DISubprogram(name: "erfl", scope: !337, file: !337, line: 228, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !443, file: !340, line: 1093)
!443 = !DISubprogram(name: "erfc", scope: !337, file: !337, line: 229, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !445, file: !340, line: 1094)
!445 = !DISubprogram(name: "erfcf", scope: !337, file: !337, line: 229, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !447, file: !340, line: 1095)
!447 = !DISubprogram(name: "erfcl", scope: !337, file: !337, line: 229, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !449, file: !340, line: 1097)
!449 = !DISubprogram(name: "exp2", scope: !337, file: !337, line: 130, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !451, file: !340, line: 1098)
!451 = !DISubprogram(name: "exp2f", scope: !337, file: !337, line: 130, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !453, file: !340, line: 1099)
!453 = !DISubprogram(name: "exp2l", scope: !337, file: !337, line: 130, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !455, file: !340, line: 1101)
!455 = !DISubprogram(name: "expm1", scope: !337, file: !337, line: 119, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !457, file: !340, line: 1102)
!457 = !DISubprogram(name: "expm1f", scope: !337, file: !337, line: 119, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !459, file: !340, line: 1103)
!459 = !DISubprogram(name: "expm1l", scope: !337, file: !337, line: 119, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !461, file: !340, line: 1105)
!461 = !DISubprogram(name: "fdim", scope: !337, file: !337, line: 326, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !463, file: !340, line: 1106)
!463 = !DISubprogram(name: "fdimf", scope: !337, file: !337, line: 326, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !465, file: !340, line: 1107)
!465 = !DISubprogram(name: "fdiml", scope: !337, file: !337, line: 326, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !467, file: !340, line: 1109)
!467 = !DISubprogram(name: "fma", scope: !337, file: !337, line: 335, type: !468, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{!57, !57, !57, !57}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !471, file: !340, line: 1110)
!471 = !DISubprogram(name: "fmaf", scope: !337, file: !337, line: 335, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{!45, !45, !45, !45}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !475, file: !340, line: 1111)
!475 = !DISubprogram(name: "fmal", scope: !337, file: !337, line: 335, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{!407, !407, !407, !407}
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !479, file: !340, line: 1113)
!479 = !DISubprogram(name: "fmax", scope: !337, file: !337, line: 329, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !481, file: !340, line: 1114)
!481 = !DISubprogram(name: "fmaxf", scope: !337, file: !337, line: 329, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !483, file: !340, line: 1115)
!483 = !DISubprogram(name: "fmaxl", scope: !337, file: !337, line: 329, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !485, file: !340, line: 1117)
!485 = !DISubprogram(name: "fmin", scope: !337, file: !337, line: 332, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !487, file: !340, line: 1118)
!487 = !DISubprogram(name: "fminf", scope: !337, file: !337, line: 332, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !489, file: !340, line: 1119)
!489 = !DISubprogram(name: "fminl", scope: !337, file: !337, line: 332, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !491, file: !340, line: 1121)
!491 = !DISubprogram(name: "hypot", scope: !337, file: !337, line: 147, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !493, file: !340, line: 1122)
!493 = !DISubprogram(name: "hypotf", scope: !337, file: !337, line: 147, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !495, file: !340, line: 1123)
!495 = !DISubprogram(name: "hypotl", scope: !337, file: !337, line: 147, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !497, file: !340, line: 1125)
!497 = !DISubprogram(name: "ilogb", scope: !337, file: !337, line: 280, type: !498, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DISubroutineType(types: !499)
!499 = !{!13, !57}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !501, file: !340, line: 1126)
!501 = !DISubprogram(name: "ilogbf", scope: !337, file: !337, line: 280, type: !502, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!13, !45}
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !505, file: !340, line: 1127)
!505 = !DISubprogram(name: "ilogbl", scope: !337, file: !337, line: 280, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!13, !407}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !509, file: !340, line: 1129)
!509 = !DISubprogram(name: "lgamma", scope: !337, file: !337, line: 230, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !511, file: !340, line: 1130)
!511 = !DISubprogram(name: "lgammaf", scope: !337, file: !337, line: 230, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !513, file: !340, line: 1131)
!513 = !DISubprogram(name: "lgammal", scope: !337, file: !337, line: 230, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !515, file: !340, line: 1134)
!515 = !DISubprogram(name: "llrint", scope: !337, file: !337, line: 316, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DISubroutineType(types: !517)
!517 = !{!518, !57}
!518 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !520, file: !340, line: 1135)
!520 = !DISubprogram(name: "llrintf", scope: !337, file: !337, line: 316, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{!518, !45}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !524, file: !340, line: 1136)
!524 = !DISubprogram(name: "llrintl", scope: !337, file: !337, line: 316, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!518, !407}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !528, file: !340, line: 1138)
!528 = !DISubprogram(name: "llround", scope: !337, file: !337, line: 322, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !530, file: !340, line: 1139)
!530 = !DISubprogram(name: "llroundf", scope: !337, file: !337, line: 322, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !532, file: !340, line: 1140)
!532 = !DISubprogram(name: "llroundl", scope: !337, file: !337, line: 322, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !534, file: !340, line: 1143)
!534 = !DISubprogram(name: "log1p", scope: !337, file: !337, line: 122, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !536, file: !340, line: 1144)
!536 = !DISubprogram(name: "log1pf", scope: !337, file: !337, line: 122, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !538, file: !340, line: 1145)
!538 = !DISubprogram(name: "log1pl", scope: !337, file: !337, line: 122, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !540, file: !340, line: 1147)
!540 = !DISubprogram(name: "log2", scope: !337, file: !337, line: 133, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !542, file: !340, line: 1148)
!542 = !DISubprogram(name: "log2f", scope: !337, file: !337, line: 133, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !544, file: !340, line: 1149)
!544 = !DISubprogram(name: "log2l", scope: !337, file: !337, line: 133, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !546, file: !340, line: 1151)
!546 = !DISubprogram(name: "logb", scope: !337, file: !337, line: 125, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !548, file: !340, line: 1152)
!548 = !DISubprogram(name: "logbf", scope: !337, file: !337, line: 125, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !550, file: !340, line: 1153)
!550 = !DISubprogram(name: "logbl", scope: !337, file: !337, line: 125, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !552, file: !340, line: 1155)
!552 = !DISubprogram(name: "lrint", scope: !337, file: !337, line: 314, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !57}
!555 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !557, file: !340, line: 1156)
!557 = !DISubprogram(name: "lrintf", scope: !337, file: !337, line: 314, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!555, !45}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !561, file: !340, line: 1157)
!561 = !DISubprogram(name: "lrintl", scope: !337, file: !337, line: 314, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!555, !407}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !565, file: !340, line: 1159)
!565 = !DISubprogram(name: "lround", scope: !337, file: !337, line: 320, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !567, file: !340, line: 1160)
!567 = !DISubprogram(name: "lroundf", scope: !337, file: !337, line: 320, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !569, file: !340, line: 1161)
!569 = !DISubprogram(name: "lroundl", scope: !337, file: !337, line: 320, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !571, file: !340, line: 1163)
!571 = !DISubprogram(name: "nan", scope: !337, file: !337, line: 201, type: !572, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!57, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !578, file: !340, line: 1164)
!578 = !DISubprogram(name: "nanf", scope: !337, file: !337, line: 201, type: !579, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DISubroutineType(types: !580)
!580 = !{!45, !574}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !582, file: !340, line: 1165)
!582 = !DISubprogram(name: "nanl", scope: !337, file: !337, line: 201, type: !583, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DISubroutineType(types: !584)
!584 = !{!407, !574}
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !586, file: !340, line: 1167)
!586 = !DISubprogram(name: "nearbyint", scope: !337, file: !337, line: 294, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !588, file: !340, line: 1168)
!588 = !DISubprogram(name: "nearbyintf", scope: !337, file: !337, line: 294, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !590, file: !340, line: 1169)
!590 = !DISubprogram(name: "nearbyintl", scope: !337, file: !337, line: 294, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !592, file: !340, line: 1171)
!592 = !DISubprogram(name: "nextafter", scope: !337, file: !337, line: 259, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !594, file: !340, line: 1172)
!594 = !DISubprogram(name: "nextafterf", scope: !337, file: !337, line: 259, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !596, file: !340, line: 1173)
!596 = !DISubprogram(name: "nextafterl", scope: !337, file: !337, line: 259, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !598, file: !340, line: 1175)
!598 = !DISubprogram(name: "nexttoward", scope: !337, file: !337, line: 261, type: !599, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!57, !57, !407}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !602, file: !340, line: 1176)
!602 = !DISubprogram(name: "nexttowardf", scope: !337, file: !337, line: 261, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!45, !45, !407}
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !606, file: !340, line: 1177)
!606 = !DISubprogram(name: "nexttowardl", scope: !337, file: !337, line: 261, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !608, file: !340, line: 1179)
!608 = !DISubprogram(name: "remainder", scope: !337, file: !337, line: 272, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !610, file: !340, line: 1180)
!610 = !DISubprogram(name: "remainderf", scope: !337, file: !337, line: 272, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !612, file: !340, line: 1181)
!612 = !DISubprogram(name: "remainderl", scope: !337, file: !337, line: 272, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !614, file: !340, line: 1183)
!614 = !DISubprogram(name: "remquo", scope: !337, file: !337, line: 307, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!57, !57, !57, !367}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !618, file: !340, line: 1184)
!618 = !DISubprogram(name: "remquof", scope: !337, file: !337, line: 307, type: !619, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{!45, !45, !45, !367}
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !622, file: !340, line: 1185)
!622 = !DISubprogram(name: "remquol", scope: !337, file: !337, line: 307, type: !623, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DISubroutineType(types: !624)
!624 = !{!407, !407, !407, !367}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !626, file: !340, line: 1187)
!626 = !DISubprogram(name: "rint", scope: !337, file: !337, line: 256, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !628, file: !340, line: 1188)
!628 = !DISubprogram(name: "rintf", scope: !337, file: !337, line: 256, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !630, file: !340, line: 1189)
!630 = !DISubprogram(name: "rintl", scope: !337, file: !337, line: 256, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !632, file: !340, line: 1191)
!632 = !DISubprogram(name: "round", scope: !337, file: !337, line: 298, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !634, file: !340, line: 1192)
!634 = !DISubprogram(name: "roundf", scope: !337, file: !337, line: 298, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !636, file: !340, line: 1193)
!636 = !DISubprogram(name: "roundl", scope: !337, file: !337, line: 298, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !638, file: !340, line: 1195)
!638 = !DISubprogram(name: "scalbln", scope: !337, file: !337, line: 290, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{!57, !57, !555}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !642, file: !340, line: 1196)
!642 = !DISubprogram(name: "scalblnf", scope: !337, file: !337, line: 290, type: !643, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DISubroutineType(types: !644)
!644 = !{!45, !45, !555}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !646, file: !340, line: 1197)
!646 = !DISubprogram(name: "scalblnl", scope: !337, file: !337, line: 290, type: !647, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!407, !407, !555}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !650, file: !340, line: 1199)
!650 = !DISubprogram(name: "scalbn", scope: !337, file: !337, line: 276, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !652, file: !340, line: 1200)
!652 = !DISubprogram(name: "scalbnf", scope: !337, file: !337, line: 276, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!45, !45, !13}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !656, file: !340, line: 1201)
!656 = !DISubprogram(name: "scalbnl", scope: !337, file: !337, line: 276, type: !657, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DISubroutineType(types: !658)
!658 = !{!407, !407, !13}
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !660, file: !340, line: 1203)
!660 = !DISubprogram(name: "tgamma", scope: !337, file: !337, line: 235, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !662, file: !340, line: 1204)
!662 = !DISubprogram(name: "tgammaf", scope: !337, file: !337, line: 235, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !664, file: !340, line: 1205)
!664 = !DISubprogram(name: "tgammal", scope: !337, file: !337, line: 235, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !666, file: !340, line: 1207)
!666 = !DISubprogram(name: "trunc", scope: !337, file: !337, line: 302, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !668, file: !340, line: 1208)
!668 = !DISubprogram(name: "truncf", scope: !337, file: !337, line: 302, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !670, file: !340, line: 1209)
!670 = !DISubprogram(name: "truncl", scope: !337, file: !337, line: 302, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !672, file: !676, line: 38)
!672 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !329, file: !334, line: 103, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !675}
!675 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!676 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !678, file: !676, line: 54)
!678 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !329, file: !340, line: 380, type: !679, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{!407, !407, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !683, file: !685, line: 127)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !331, line: 62, baseType: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!685 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !687, file: !685, line: 128)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !331, line: 70, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !689, identifier: "_ZTS6ldiv_t")
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !688, file: !331, line: 68, baseType: !555, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !688, file: !331, line: 69, baseType: !555, size: 64, offset: 64)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !693, file: !685, line: 130)
!693 = !DISubprogram(name: "abort", scope: !331, file: !331, line: 591, type: !694, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{null}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !697, file: !685, line: 134)
!697 = !DISubprogram(name: "atexit", scope: !331, file: !331, line: 595, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!13, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !702, file: !685, line: 137)
!702 = !DISubprogram(name: "at_quick_exit", scope: !331, file: !331, line: 600, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !704, file: !685, line: 140)
!704 = !DISubprogram(name: "atof", scope: !331, file: !331, line: 101, type: !572, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !706, file: !685, line: 141)
!706 = !DISubprogram(name: "atoi", scope: !331, file: !331, line: 104, type: !707, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DISubroutineType(types: !708)
!708 = !{!13, !574}
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !710, file: !685, line: 142)
!710 = !DISubprogram(name: "atol", scope: !331, file: !331, line: 107, type: !711, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{!555, !574}
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !714, file: !685, line: 143)
!714 = !DISubprogram(name: "bsearch", scope: !331, file: !331, line: 820, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!111, !717, !717, !719, !719, !722}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !720, line: 46, baseType: !721)
!720 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!721 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !331, line: 808, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!13, !717, !717}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !727, file: !685, line: 144)
!727 = !DISubprogram(name: "calloc", scope: !331, file: !331, line: 542, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!111, !719, !719}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !731, file: !685, line: 145)
!731 = !DISubprogram(name: "div", scope: !331, file: !331, line: 852, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!683, !13, !13}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !735, file: !685, line: 146)
!735 = !DISubprogram(name: "exit", scope: !331, file: !331, line: 617, type: !736, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !13}
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !739, file: !685, line: 147)
!739 = !DISubprogram(name: "free", scope: !331, file: !331, line: 565, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !111}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !743, file: !685, line: 148)
!743 = !DISubprogram(name: "getenv", scope: !331, file: !331, line: 634, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!746, !574}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !748, file: !685, line: 149)
!748 = !DISubprogram(name: "labs", scope: !331, file: !331, line: 841, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!555, !555}
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !752, file: !685, line: 150)
!752 = !DISubprogram(name: "ldiv", scope: !331, file: !331, line: 854, type: !753, flags: DIFlagPrototyped, spFlags: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{!687, !555, !555}
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !756, file: !685, line: 151)
!756 = !DISubprogram(name: "malloc", scope: !331, file: !331, line: 539, type: !757, flags: DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!111, !719}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !760, file: !685, line: 153)
!760 = !DISubprogram(name: "mblen", scope: !331, file: !331, line: 922, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!13, !574, !719}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !764, file: !685, line: 154)
!764 = !DISubprogram(name: "mbstowcs", scope: !331, file: !331, line: 933, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!719, !767, !770, !719}
!767 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !574)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !772, file: !685, line: 155)
!772 = !DISubprogram(name: "mbtowc", scope: !331, file: !331, line: 925, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!13, !767, !770, !719}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !776, file: !685, line: 157)
!776 = !DISubprogram(name: "qsort", scope: !331, file: !331, line: 830, type: !777, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !111, !719, !719, !722}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !780, file: !685, line: 160)
!780 = !DISubprogram(name: "quick_exit", scope: !331, file: !331, line: 623, type: !736, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !782, file: !685, line: 163)
!782 = !DISubprogram(name: "rand", scope: !331, file: !331, line: 453, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!13}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !786, file: !685, line: 164)
!786 = !DISubprogram(name: "realloc", scope: !331, file: !331, line: 550, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!111, !111, !719}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !790, file: !685, line: 165)
!790 = !DISubprogram(name: "srand", scope: !331, file: !331, line: 455, type: !791, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !64}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !794, file: !685, line: 166)
!794 = !DISubprogram(name: "strtod", scope: !331, file: !331, line: 117, type: !795, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!57, !770, !797}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !800, file: !685, line: 167)
!800 = !DISubprogram(name: "strtol", scope: !331, file: !331, line: 176, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{!555, !770, !797, !13}
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !804, file: !685, line: 168)
!804 = !DISubprogram(name: "strtoul", scope: !331, file: !331, line: 180, type: !805, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DISubroutineType(types: !806)
!806 = !{!721, !770, !797, !13}
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !808, file: !685, line: 169)
!808 = !DISubprogram(name: "system", scope: !331, file: !331, line: 784, type: !707, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !810, file: !685, line: 171)
!810 = !DISubprogram(name: "wcstombs", scope: !331, file: !331, line: 936, type: !811, flags: DIFlagPrototyped, spFlags: 0)
!811 = !DISubroutineType(types: !812)
!812 = !{!719, !813, !814, !719}
!813 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !746)
!814 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !818, file: !685, line: 172)
!818 = !DISubprogram(name: "wctomb", scope: !331, file: !331, line: 929, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!13, !746, !769}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !823, file: !685, line: 200)
!822 = !DINamespace(name: "__gnu_cxx", scope: null)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !331, line: 80, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !825, identifier: "_ZTS7lldiv_t")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !824, file: !331, line: 78, baseType: !518, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !824, file: !331, line: 79, baseType: !518, size: 64, offset: 64)
!828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !829, file: !685, line: 206)
!829 = !DISubprogram(name: "_Exit", scope: !331, file: !331, line: 629, type: !736, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !831, file: !685, line: 210)
!831 = !DISubprogram(name: "llabs", scope: !331, file: !331, line: 844, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!518, !518}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !835, file: !685, line: 216)
!835 = !DISubprogram(name: "lldiv", scope: !331, file: !331, line: 858, type: !836, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!823, !518, !518}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !839, file: !685, line: 227)
!839 = !DISubprogram(name: "atoll", scope: !331, file: !331, line: 112, type: !840, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!518, !574}
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !843, file: !685, line: 228)
!843 = !DISubprogram(name: "strtoll", scope: !331, file: !331, line: 200, type: !844, flags: DIFlagPrototyped, spFlags: 0)
!844 = !DISubroutineType(types: !845)
!845 = !{!518, !770, !797, !13}
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !847, file: !685, line: 229)
!847 = !DISubprogram(name: "strtoull", scope: !331, file: !331, line: 205, type: !848, flags: DIFlagPrototyped, spFlags: 0)
!848 = !DISubroutineType(types: !849)
!849 = !{!850, !770, !797, !13}
!850 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !852, file: !685, line: 231)
!852 = !DISubprogram(name: "strtof", scope: !331, file: !331, line: 123, type: !853, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!45, !770, !797}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !822, entity: !856, file: !685, line: 232)
!856 = !DISubprogram(name: "strtold", scope: !331, file: !331, line: 126, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!407, !770, !797}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !823, file: !685, line: 240)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !829, file: !685, line: 242)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !831, file: !685, line: 244)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !863, file: !685, line: 245)
!863 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !822, file: !685, line: 213, type: !836, flags: DIFlagPrototyped, spFlags: 0)
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !835, file: !685, line: 246)
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !839, file: !685, line: 248)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !852, file: !685, line: 249)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !843, file: !685, line: 250)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !847, file: !685, line: 251)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !856, file: !685, line: 252)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !156, entity: !693, file: !871, line: 38)
!871 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
