; ModuleID = 'triangle.cpp'
source_filename = "triangle.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Triangle_Methods", linkageName: "_ZN3pov16Triangle_MethodsE", scope: !2, file: !3, line: 85, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "triangle.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "Smooth_Triangle_Methods", linkageName: "_ZN3pov23Smooth_Triangle_MethodsE", scope: !2, file: !3, line: 94, type: !4, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "Smooth_Color_Triangle_Methods", linkageName: "_ZN3pov29Smooth_Color_Triangle_MethodsE", scope: !2, file: !3, line: 104, type: !4, isLocal: false, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !154, retainedTypes: !288, globals: !344, imports: !348, splitDebugInlining: false, nameTableKind: None)
!154 = !{!155, !161}
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!158 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !162, line: 149, baseType: !56, size: 32, elements: !163, identifier: "_ZTSN3pov5STATSE")
!162 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!164 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!165 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!166 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!167 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!168 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!169 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!170 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!171 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!178 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!179 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!180 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!181 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!214 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!215 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!224 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!225 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!242 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!243 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!246 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!247 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!252 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!253 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!254 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!255 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!259 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!260 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!261 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!262 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!263 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!264 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!265 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!266 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!267 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!268 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!269 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!270 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!271 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!272 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!273 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!274 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!275 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!276 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!277 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!278 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!279 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!280 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!281 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!282 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!283 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!284 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!285 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!286 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!287 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!288 = !{!289, !319, !44, !104}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMOOTH_TRIANGLE", scope: !2, file: !291, line: 52, baseType: !292)
!291 = !DIFile(filename: "./triangle.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Smooth_Triangle_Struct", scope: !2, file: !291, line: 65, size: 2624, flags: DIFlagTypePassByValue, elements: !293, identifier: "_ZTSN3pov22Smooth_Triangle_StructE")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !292, file: !291, line: 67, baseType: !19, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !292, file: !291, line: 67, baseType: !13, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !292, file: !291, line: 67, baseType: !14, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !292, file: !291, line: 67, baseType: !23, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !292, file: !291, line: 67, baseType: !23, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !292, file: !291, line: 67, baseType: !28, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !292, file: !291, line: 67, baseType: !14, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !292, file: !291, line: 67, baseType: !14, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !292, file: !291, line: 67, baseType: !34, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !292, file: !291, line: 67, baseType: !38, size: 192, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !292, file: !291, line: 67, baseType: !50, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !292, file: !291, line: 67, baseType: !50, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !292, file: !291, line: 67, baseType: !45, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !292, file: !291, line: 67, baseType: !56, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vector", scope: !292, file: !291, line: 68, baseType: !62, size: 192, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !292, file: !291, line: 69, baseType: !64, size: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Dominant_Axis", scope: !292, file: !291, line: 70, baseType: !56, size: 2, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vAxis", scope: !292, file: !291, line: 71, baseType: !56, size: 2, offset: 1218, flags: DIFlagBitField, extraData: i64 1216)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "P1", scope: !292, file: !291, line: 72, baseType: !62, size: 192, offset: 1280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "P2", scope: !292, file: !291, line: 72, baseType: !62, size: 192, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "P3", scope: !292, file: !291, line: 72, baseType: !62, size: 192, offset: 1664)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "N1", scope: !292, file: !291, line: 73, baseType: !62, size: 192, offset: 1856)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "N2", scope: !292, file: !291, line: 73, baseType: !62, size: 192, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "N3", scope: !292, file: !291, line: 73, baseType: !62, size: 192, offset: 2240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Perp", scope: !292, file: !291, line: 73, baseType: !62, size: 192, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRIANGLE", scope: !2, file: !291, line: 51, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Triangle_Struct", scope: !2, file: !291, line: 55, size: 1856, flags: DIFlagTypePassByValue, elements: !322, identifier: "_ZTSN3pov15Triangle_StructE")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !321, file: !291, line: 57, baseType: !19, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !321, file: !291, line: 57, baseType: !13, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !321, file: !291, line: 57, baseType: !14, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !321, file: !291, line: 57, baseType: !23, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !321, file: !291, line: 57, baseType: !23, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !321, file: !291, line: 57, baseType: !28, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !321, file: !291, line: 57, baseType: !14, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !321, file: !291, line: 57, baseType: !14, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !321, file: !291, line: 57, baseType: !34, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !321, file: !291, line: 57, baseType: !38, size: 192, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !321, file: !291, line: 57, baseType: !50, size: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !321, file: !291, line: 57, baseType: !50, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !321, file: !291, line: 57, baseType: !45, size: 32, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !321, file: !291, line: 57, baseType: !56, size: 32, offset: 928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vector", scope: !321, file: !291, line: 58, baseType: !62, size: 192, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !321, file: !291, line: 59, baseType: !64, size: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Dominant_Axis", scope: !321, file: !291, line: 60, baseType: !56, size: 2, offset: 1216, flags: DIFlagBitField, extraData: i64 1216)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vAxis", scope: !321, file: !291, line: 61, baseType: !56, size: 2, offset: 1218, flags: DIFlagBitField, extraData: i64 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "P1", scope: !321, file: !291, line: 62, baseType: !62, size: 192, offset: 1280)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "P2", scope: !321, file: !291, line: 62, baseType: !62, size: 192, offset: 1472)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "P3", scope: !321, file: !291, line: 62, baseType: !62, size: 192, offset: 1664)
!344 = !{!0, !149, !151, !345}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!346 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 47, type: !347, isLocal: true, isDefinition: true)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!348 = !{!349, !356, !362, !364, !366, !370, !372, !374, !376, !378, !380, !382, !384, !389, !393, !395, !397, !401, !403, !405, !407, !409, !411, !413, !416, !418, !420, !424, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !453, !457, !459, !461, !463, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !491, !495, !499, !501, !503, !505, !507, !509, !511, !513, !515, !517, !521, !525, !529, !531, !533, !535, !540, !544, !548, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !577, !581, !585, !587, !589, !591, !598, !602, !606, !608, !610, !612, !614, !616, !618, !622, !626, !628, !630, !632, !634, !638, !642, !646, !648, !650, !652, !654, !656, !658, !662, !666, !670, !672, !676, !680, !682, !684, !686, !688, !690, !692, !698, !703, !707, !713, !717, !722, !724, !726, !730, !734, !747, !751, !755, !759, !763, !768, !772, !776, !780, !784, !792, !796, !800, !802, !806, !810, !814, !820, !824, !828, !830, !838, !842, !849, !851, !855, !859, !863, !867, !872, !876, !880, !881, !882, !883, !885, !886, !887, !888, !889, !890, !891, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !928, !930, !932, !934, !936, !938, !940, !942, !944, !946, !948, !950, !952, !954, !960, !964, !970, !974, !978, !982, !986, !988, !990, !994, !998, !1002, !1006, !1010, !1012, !1014, !1016, !1020, !1024, !1028, !1030, !1032, !1035, !1037, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1059, !1060, !1061, !1063, !1065, !1067, !1068, !1072, !1128, !1132}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !351, file: !355, line: 52)
!350 = !DINamespace(name: "std", scope: null)
!351 = !DISubprogram(name: "abs", scope: !352, file: !352, line: 840, type: !353, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!353 = !DISubroutineType(types: !354)
!354 = !{!13, !13}
!355 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !357, file: !361, line: 83)
!357 = !DISubprogram(name: "acos", scope: !358, file: !358, line: 53, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!359 = !DISubroutineType(types: !360)
!360 = !{!64, !64}
!361 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !363, file: !361, line: 102)
!363 = !DISubprogram(name: "asin", scope: !358, file: !358, line: 55, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !365, file: !361, line: 121)
!365 = !DISubprogram(name: "atan", scope: !358, file: !358, line: 57, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !367, file: !361, line: 140)
!367 = !DISubprogram(name: "atan2", scope: !358, file: !358, line: 59, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DISubroutineType(types: !369)
!369 = !{!64, !64, !64}
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !371, file: !361, line: 161)
!371 = !DISubprogram(name: "ceil", scope: !358, file: !358, line: 159, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !373, file: !361, line: 180)
!373 = !DISubprogram(name: "cos", scope: !358, file: !358, line: 62, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !375, file: !361, line: 199)
!375 = !DISubprogram(name: "cosh", scope: !358, file: !358, line: 71, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !377, file: !361, line: 218)
!377 = !DISubprogram(name: "exp", scope: !358, file: !358, line: 95, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !379, file: !361, line: 237)
!379 = !DISubprogram(name: "fabs", scope: !358, file: !358, line: 162, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !381, file: !361, line: 256)
!381 = !DISubprogram(name: "floor", scope: !358, file: !358, line: 165, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !383, file: !361, line: 275)
!383 = !DISubprogram(name: "fmod", scope: !358, file: !358, line: 168, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !385, file: !361, line: 296)
!385 = !DISubprogram(name: "frexp", scope: !358, file: !358, line: 98, type: !386, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DISubroutineType(types: !387)
!387 = !{!64, !64, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !390, file: !361, line: 315)
!390 = !DISubprogram(name: "ldexp", scope: !358, file: !358, line: 101, type: !391, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{!64, !64, !13}
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !394, file: !361, line: 334)
!394 = !DISubprogram(name: "log", scope: !358, file: !358, line: 104, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !396, file: !361, line: 353)
!396 = !DISubprogram(name: "log10", scope: !358, file: !358, line: 107, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !398, file: !361, line: 372)
!398 = !DISubprogram(name: "modf", scope: !358, file: !358, line: 110, type: !399, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DISubroutineType(types: !400)
!400 = !{!64, !64, !113}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !402, file: !361, line: 384)
!402 = !DISubprogram(name: "pow", scope: !358, file: !358, line: 140, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !404, file: !361, line: 421)
!404 = !DISubprogram(name: "sin", scope: !358, file: !358, line: 64, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !406, file: !361, line: 440)
!406 = !DISubprogram(name: "sinh", scope: !358, file: !358, line: 73, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !408, file: !361, line: 459)
!408 = !DISubprogram(name: "sqrt", scope: !358, file: !358, line: 143, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !410, file: !361, line: 478)
!410 = !DISubprogram(name: "tan", scope: !358, file: !358, line: 66, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !412, file: !361, line: 497)
!412 = !DISubprogram(name: "tanh", scope: !358, file: !358, line: 75, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !414, file: !361, line: 1065)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !415, line: 150, baseType: !64)
!415 = !DIFile(filename: "/usr/include/math.h", directory: "")
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !417, file: !361, line: 1066)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !415, line: 149, baseType: !45)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !419, file: !361, line: 1069)
!419 = !DISubprogram(name: "acosh", scope: !358, file: !358, line: 85, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !421, file: !361, line: 1070)
!421 = !DISubprogram(name: "acoshf", scope: !358, file: !358, line: 85, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DISubroutineType(types: !423)
!423 = !{!45, !45}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !425, file: !361, line: 1071)
!425 = !DISubprogram(name: "acoshl", scope: !358, file: !358, line: 85, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !428}
!428 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !430, file: !361, line: 1073)
!430 = !DISubprogram(name: "asinh", scope: !358, file: !358, line: 87, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !432, file: !361, line: 1074)
!432 = !DISubprogram(name: "asinhf", scope: !358, file: !358, line: 87, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !434, file: !361, line: 1075)
!434 = !DISubprogram(name: "asinhl", scope: !358, file: !358, line: 87, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !436, file: !361, line: 1077)
!436 = !DISubprogram(name: "atanh", scope: !358, file: !358, line: 89, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !438, file: !361, line: 1078)
!438 = !DISubprogram(name: "atanhf", scope: !358, file: !358, line: 89, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !440, file: !361, line: 1079)
!440 = !DISubprogram(name: "atanhl", scope: !358, file: !358, line: 89, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !442, file: !361, line: 1081)
!442 = !DISubprogram(name: "cbrt", scope: !358, file: !358, line: 152, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !444, file: !361, line: 1082)
!444 = !DISubprogram(name: "cbrtf", scope: !358, file: !358, line: 152, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !446, file: !361, line: 1083)
!446 = !DISubprogram(name: "cbrtl", scope: !358, file: !358, line: 152, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !448, file: !361, line: 1085)
!448 = !DISubprogram(name: "copysign", scope: !358, file: !358, line: 196, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !450, file: !361, line: 1086)
!450 = !DISubprogram(name: "copysignf", scope: !358, file: !358, line: 196, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!45, !45, !45}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !454, file: !361, line: 1087)
!454 = !DISubprogram(name: "copysignl", scope: !358, file: !358, line: 196, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!428, !428, !428}
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !458, file: !361, line: 1089)
!458 = !DISubprogram(name: "erf", scope: !358, file: !358, line: 228, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !460, file: !361, line: 1090)
!460 = !DISubprogram(name: "erff", scope: !358, file: !358, line: 228, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !462, file: !361, line: 1091)
!462 = !DISubprogram(name: "erfl", scope: !358, file: !358, line: 228, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !464, file: !361, line: 1093)
!464 = !DISubprogram(name: "erfc", scope: !358, file: !358, line: 229, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !466, file: !361, line: 1094)
!466 = !DISubprogram(name: "erfcf", scope: !358, file: !358, line: 229, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !468, file: !361, line: 1095)
!468 = !DISubprogram(name: "erfcl", scope: !358, file: !358, line: 229, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !470, file: !361, line: 1097)
!470 = !DISubprogram(name: "exp2", scope: !358, file: !358, line: 130, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !472, file: !361, line: 1098)
!472 = !DISubprogram(name: "exp2f", scope: !358, file: !358, line: 130, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !474, file: !361, line: 1099)
!474 = !DISubprogram(name: "exp2l", scope: !358, file: !358, line: 130, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !476, file: !361, line: 1101)
!476 = !DISubprogram(name: "expm1", scope: !358, file: !358, line: 119, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !478, file: !361, line: 1102)
!478 = !DISubprogram(name: "expm1f", scope: !358, file: !358, line: 119, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !480, file: !361, line: 1103)
!480 = !DISubprogram(name: "expm1l", scope: !358, file: !358, line: 119, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !482, file: !361, line: 1105)
!482 = !DISubprogram(name: "fdim", scope: !358, file: !358, line: 326, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !484, file: !361, line: 1106)
!484 = !DISubprogram(name: "fdimf", scope: !358, file: !358, line: 326, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !486, file: !361, line: 1107)
!486 = !DISubprogram(name: "fdiml", scope: !358, file: !358, line: 326, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !488, file: !361, line: 1109)
!488 = !DISubprogram(name: "fma", scope: !358, file: !358, line: 335, type: !489, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!64, !64, !64, !64}
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !492, file: !361, line: 1110)
!492 = !DISubprogram(name: "fmaf", scope: !358, file: !358, line: 335, type: !493, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DISubroutineType(types: !494)
!494 = !{!45, !45, !45, !45}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !496, file: !361, line: 1111)
!496 = !DISubprogram(name: "fmal", scope: !358, file: !358, line: 335, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!428, !428, !428, !428}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !500, file: !361, line: 1113)
!500 = !DISubprogram(name: "fmax", scope: !358, file: !358, line: 329, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !502, file: !361, line: 1114)
!502 = !DISubprogram(name: "fmaxf", scope: !358, file: !358, line: 329, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !504, file: !361, line: 1115)
!504 = !DISubprogram(name: "fmaxl", scope: !358, file: !358, line: 329, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !506, file: !361, line: 1117)
!506 = !DISubprogram(name: "fmin", scope: !358, file: !358, line: 332, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !508, file: !361, line: 1118)
!508 = !DISubprogram(name: "fminf", scope: !358, file: !358, line: 332, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !510, file: !361, line: 1119)
!510 = !DISubprogram(name: "fminl", scope: !358, file: !358, line: 332, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !512, file: !361, line: 1121)
!512 = !DISubprogram(name: "hypot", scope: !358, file: !358, line: 147, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !514, file: !361, line: 1122)
!514 = !DISubprogram(name: "hypotf", scope: !358, file: !358, line: 147, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !516, file: !361, line: 1123)
!516 = !DISubprogram(name: "hypotl", scope: !358, file: !358, line: 147, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !518, file: !361, line: 1125)
!518 = !DISubprogram(name: "ilogb", scope: !358, file: !358, line: 280, type: !519, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{!13, !64}
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !522, file: !361, line: 1126)
!522 = !DISubprogram(name: "ilogbf", scope: !358, file: !358, line: 280, type: !523, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DISubroutineType(types: !524)
!524 = !{!13, !45}
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !526, file: !361, line: 1127)
!526 = !DISubprogram(name: "ilogbl", scope: !358, file: !358, line: 280, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!13, !428}
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !530, file: !361, line: 1129)
!530 = !DISubprogram(name: "lgamma", scope: !358, file: !358, line: 230, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !532, file: !361, line: 1130)
!532 = !DISubprogram(name: "lgammaf", scope: !358, file: !358, line: 230, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !534, file: !361, line: 1131)
!534 = !DISubprogram(name: "lgammal", scope: !358, file: !358, line: 230, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !536, file: !361, line: 1134)
!536 = !DISubprogram(name: "llrint", scope: !358, file: !358, line: 316, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!539, !64}
!539 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !541, file: !361, line: 1135)
!541 = !DISubprogram(name: "llrintf", scope: !358, file: !358, line: 316, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DISubroutineType(types: !543)
!543 = !{!539, !45}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !545, file: !361, line: 1136)
!545 = !DISubprogram(name: "llrintl", scope: !358, file: !358, line: 316, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{!539, !428}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !549, file: !361, line: 1138)
!549 = !DISubprogram(name: "llround", scope: !358, file: !358, line: 322, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !551, file: !361, line: 1139)
!551 = !DISubprogram(name: "llroundf", scope: !358, file: !358, line: 322, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !553, file: !361, line: 1140)
!553 = !DISubprogram(name: "llroundl", scope: !358, file: !358, line: 322, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !555, file: !361, line: 1143)
!555 = !DISubprogram(name: "log1p", scope: !358, file: !358, line: 122, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !557, file: !361, line: 1144)
!557 = !DISubprogram(name: "log1pf", scope: !358, file: !358, line: 122, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !559, file: !361, line: 1145)
!559 = !DISubprogram(name: "log1pl", scope: !358, file: !358, line: 122, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !561, file: !361, line: 1147)
!561 = !DISubprogram(name: "log2", scope: !358, file: !358, line: 133, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !563, file: !361, line: 1148)
!563 = !DISubprogram(name: "log2f", scope: !358, file: !358, line: 133, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !565, file: !361, line: 1149)
!565 = !DISubprogram(name: "log2l", scope: !358, file: !358, line: 133, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !567, file: !361, line: 1151)
!567 = !DISubprogram(name: "logb", scope: !358, file: !358, line: 125, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !569, file: !361, line: 1152)
!569 = !DISubprogram(name: "logbf", scope: !358, file: !358, line: 125, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !571, file: !361, line: 1153)
!571 = !DISubprogram(name: "logbl", scope: !358, file: !358, line: 125, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !573, file: !361, line: 1155)
!573 = !DISubprogram(name: "lrint", scope: !358, file: !358, line: 314, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !64}
!576 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !578, file: !361, line: 1156)
!578 = !DISubprogram(name: "lrintf", scope: !358, file: !358, line: 314, type: !579, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DISubroutineType(types: !580)
!580 = !{!576, !45}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !582, file: !361, line: 1157)
!582 = !DISubprogram(name: "lrintl", scope: !358, file: !358, line: 314, type: !583, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DISubroutineType(types: !584)
!584 = !{!576, !428}
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !586, file: !361, line: 1159)
!586 = !DISubprogram(name: "lround", scope: !358, file: !358, line: 320, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !588, file: !361, line: 1160)
!588 = !DISubprogram(name: "lroundf", scope: !358, file: !358, line: 320, type: !579, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !590, file: !361, line: 1161)
!590 = !DISubprogram(name: "lroundl", scope: !358, file: !358, line: 320, type: !583, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !592, file: !361, line: 1163)
!592 = !DISubprogram(name: "nan", scope: !358, file: !358, line: 201, type: !593, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DISubroutineType(types: !594)
!594 = !{!64, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !599, file: !361, line: 1164)
!599 = !DISubprogram(name: "nanf", scope: !358, file: !358, line: 201, type: !600, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{!45, !595}
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !603, file: !361, line: 1165)
!603 = !DISubprogram(name: "nanl", scope: !358, file: !358, line: 201, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DISubroutineType(types: !605)
!605 = !{!428, !595}
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !607, file: !361, line: 1167)
!607 = !DISubprogram(name: "nearbyint", scope: !358, file: !358, line: 294, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !609, file: !361, line: 1168)
!609 = !DISubprogram(name: "nearbyintf", scope: !358, file: !358, line: 294, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !611, file: !361, line: 1169)
!611 = !DISubprogram(name: "nearbyintl", scope: !358, file: !358, line: 294, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !613, file: !361, line: 1171)
!613 = !DISubprogram(name: "nextafter", scope: !358, file: !358, line: 259, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !615, file: !361, line: 1172)
!615 = !DISubprogram(name: "nextafterf", scope: !358, file: !358, line: 259, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !617, file: !361, line: 1173)
!617 = !DISubprogram(name: "nextafterl", scope: !358, file: !358, line: 259, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !619, file: !361, line: 1175)
!619 = !DISubprogram(name: "nexttoward", scope: !358, file: !358, line: 261, type: !620, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DISubroutineType(types: !621)
!621 = !{!64, !64, !428}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !623, file: !361, line: 1176)
!623 = !DISubprogram(name: "nexttowardf", scope: !358, file: !358, line: 261, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!45, !45, !428}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !627, file: !361, line: 1177)
!627 = !DISubprogram(name: "nexttowardl", scope: !358, file: !358, line: 261, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !629, file: !361, line: 1179)
!629 = !DISubprogram(name: "remainder", scope: !358, file: !358, line: 272, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !631, file: !361, line: 1180)
!631 = !DISubprogram(name: "remainderf", scope: !358, file: !358, line: 272, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !633, file: !361, line: 1181)
!633 = !DISubprogram(name: "remainderl", scope: !358, file: !358, line: 272, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !635, file: !361, line: 1183)
!635 = !DISubprogram(name: "remquo", scope: !358, file: !358, line: 307, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!64, !64, !64, !388}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !639, file: !361, line: 1184)
!639 = !DISubprogram(name: "remquof", scope: !358, file: !358, line: 307, type: !640, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DISubroutineType(types: !641)
!641 = !{!45, !45, !45, !388}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !643, file: !361, line: 1185)
!643 = !DISubprogram(name: "remquol", scope: !358, file: !358, line: 307, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!428, !428, !428, !388}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !647, file: !361, line: 1187)
!647 = !DISubprogram(name: "rint", scope: !358, file: !358, line: 256, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !649, file: !361, line: 1188)
!649 = !DISubprogram(name: "rintf", scope: !358, file: !358, line: 256, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !651, file: !361, line: 1189)
!651 = !DISubprogram(name: "rintl", scope: !358, file: !358, line: 256, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !653, file: !361, line: 1191)
!653 = !DISubprogram(name: "round", scope: !358, file: !358, line: 298, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !655, file: !361, line: 1192)
!655 = !DISubprogram(name: "roundf", scope: !358, file: !358, line: 298, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !657, file: !361, line: 1193)
!657 = !DISubprogram(name: "roundl", scope: !358, file: !358, line: 298, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !659, file: !361, line: 1195)
!659 = !DISubprogram(name: "scalbln", scope: !358, file: !358, line: 290, type: !660, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!64, !64, !576}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !663, file: !361, line: 1196)
!663 = !DISubprogram(name: "scalblnf", scope: !358, file: !358, line: 290, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!45, !45, !576}
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !667, file: !361, line: 1197)
!667 = !DISubprogram(name: "scalblnl", scope: !358, file: !358, line: 290, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{!428, !428, !576}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !671, file: !361, line: 1199)
!671 = !DISubprogram(name: "scalbn", scope: !358, file: !358, line: 276, type: !391, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !673, file: !361, line: 1200)
!673 = !DISubprogram(name: "scalbnf", scope: !358, file: !358, line: 276, type: !674, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DISubroutineType(types: !675)
!675 = !{!45, !45, !13}
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !677, file: !361, line: 1201)
!677 = !DISubprogram(name: "scalbnl", scope: !358, file: !358, line: 276, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!428, !428, !13}
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !681, file: !361, line: 1203)
!681 = !DISubprogram(name: "tgamma", scope: !358, file: !358, line: 235, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !683, file: !361, line: 1204)
!683 = !DISubprogram(name: "tgammaf", scope: !358, file: !358, line: 235, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !685, file: !361, line: 1205)
!685 = !DISubprogram(name: "tgammal", scope: !358, file: !358, line: 235, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !687, file: !361, line: 1207)
!687 = !DISubprogram(name: "trunc", scope: !358, file: !358, line: 302, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !689, file: !361, line: 1208)
!689 = !DISubprogram(name: "truncf", scope: !358, file: !358, line: 302, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !691, file: !361, line: 1209)
!691 = !DISubprogram(name: "truncl", scope: !358, file: !358, line: 302, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !153, entity: !693, file: !697, line: 38)
!693 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !350, file: !355, line: 103, type: !694, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !696}
!696 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!697 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !153, entity: !699, file: !697, line: 54)
!699 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !350, file: !361, line: 380, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{!428, !428, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !704, file: !706, line: 127)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !352, line: 62, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!706 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !708, file: !706, line: 128)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !352, line: 70, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !710, identifier: "_ZTS6ldiv_t")
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !709, file: !352, line: 68, baseType: !576, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !709, file: !352, line: 69, baseType: !576, size: 64, offset: 64)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !714, file: !706, line: 130)
!714 = !DISubprogram(name: "abort", scope: !352, file: !352, line: 591, type: !715, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{null}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !718, file: !706, line: 134)
!718 = !DISubprogram(name: "atexit", scope: !352, file: !352, line: 595, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!13, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !723, file: !706, line: 137)
!723 = !DISubprogram(name: "at_quick_exit", scope: !352, file: !352, line: 600, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !725, file: !706, line: 140)
!725 = !DISubprogram(name: "atof", scope: !352, file: !352, line: 101, type: !593, flags: DIFlagPrototyped, spFlags: 0)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !727, file: !706, line: 141)
!727 = !DISubprogram(name: "atoi", scope: !352, file: !352, line: 104, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!13, !595}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !731, file: !706, line: 142)
!731 = !DISubprogram(name: "atol", scope: !352, file: !352, line: 107, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!576, !595}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !735, file: !706, line: 143)
!735 = !DISubprogram(name: "bsearch", scope: !352, file: !352, line: 820, type: !736, flags: DIFlagPrototyped, spFlags: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{!104, !738, !738, !740, !740, !743}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !741, line: 46, baseType: !742)
!741 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!742 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !352, line: 808, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!13, !738, !738}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !748, file: !706, line: 144)
!748 = !DISubprogram(name: "calloc", scope: !352, file: !352, line: 542, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!104, !740, !740}
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !752, file: !706, line: 145)
!752 = !DISubprogram(name: "div", scope: !352, file: !352, line: 852, type: !753, flags: DIFlagPrototyped, spFlags: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{!704, !13, !13}
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !756, file: !706, line: 146)
!756 = !DISubprogram(name: "exit", scope: !352, file: !352, line: 617, type: !757, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !13}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !760, file: !706, line: 147)
!760 = !DISubprogram(name: "free", scope: !352, file: !352, line: 565, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !104}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !764, file: !706, line: 148)
!764 = !DISubprogram(name: "getenv", scope: !352, file: !352, line: 634, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !595}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !769, file: !706, line: 149)
!769 = !DISubprogram(name: "labs", scope: !352, file: !352, line: 841, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!576, !576}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !773, file: !706, line: 150)
!773 = !DISubprogram(name: "ldiv", scope: !352, file: !352, line: 854, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!708, !576, !576}
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !777, file: !706, line: 151)
!777 = !DISubprogram(name: "malloc", scope: !352, file: !352, line: 539, type: !778, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!104, !740}
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !781, file: !706, line: 153)
!781 = !DISubprogram(name: "mblen", scope: !352, file: !352, line: 922, type: !782, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{!13, !595, !740}
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !785, file: !706, line: 154)
!785 = !DISubprogram(name: "mbstowcs", scope: !352, file: !352, line: 933, type: !786, flags: DIFlagPrototyped, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{!740, !788, !791, !740}
!788 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!791 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !595)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !793, file: !706, line: 155)
!793 = !DISubprogram(name: "mbtowc", scope: !352, file: !352, line: 925, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!13, !788, !791, !740}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !797, file: !706, line: 157)
!797 = !DISubprogram(name: "qsort", scope: !352, file: !352, line: 830, type: !798, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !104, !740, !740, !743}
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !801, file: !706, line: 160)
!801 = !DISubprogram(name: "quick_exit", scope: !352, file: !352, line: 623, type: !757, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !803, file: !706, line: 163)
!803 = !DISubprogram(name: "rand", scope: !352, file: !352, line: 453, type: !804, flags: DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!13}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !807, file: !706, line: 164)
!807 = !DISubprogram(name: "realloc", scope: !352, file: !352, line: 550, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!104, !104, !740}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !811, file: !706, line: 165)
!811 = !DISubprogram(name: "srand", scope: !352, file: !352, line: 455, type: !812, flags: DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !56}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !815, file: !706, line: 166)
!815 = !DISubprogram(name: "strtod", scope: !352, file: !352, line: 117, type: !816, flags: DIFlagPrototyped, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{!64, !791, !818}
!818 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !821, file: !706, line: 167)
!821 = !DISubprogram(name: "strtol", scope: !352, file: !352, line: 176, type: !822, flags: DIFlagPrototyped, spFlags: 0)
!822 = !DISubroutineType(types: !823)
!823 = !{!576, !791, !818, !13}
!824 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !825, file: !706, line: 168)
!825 = !DISubprogram(name: "strtoul", scope: !352, file: !352, line: 180, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!742, !791, !818, !13}
!828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !829, file: !706, line: 169)
!829 = !DISubprogram(name: "system", scope: !352, file: !352, line: 784, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !831, file: !706, line: 171)
!831 = !DISubprogram(name: "wcstombs", scope: !352, file: !352, line: 936, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!740, !834, !835, !740}
!834 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !767)
!835 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !839, file: !706, line: 172)
!839 = !DISubprogram(name: "wctomb", scope: !352, file: !352, line: 929, type: !840, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!13, !767, !790}
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !844, file: !706, line: 200)
!843 = !DINamespace(name: "__gnu_cxx", scope: null)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !352, line: 80, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !846, identifier: "_ZTS7lldiv_t")
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !845, file: !352, line: 78, baseType: !539, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !845, file: !352, line: 79, baseType: !539, size: 64, offset: 64)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !850, file: !706, line: 206)
!850 = !DISubprogram(name: "_Exit", scope: !352, file: !352, line: 629, type: !757, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !852, file: !706, line: 210)
!852 = !DISubprogram(name: "llabs", scope: !352, file: !352, line: 844, type: !853, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!539, !539}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !856, file: !706, line: 216)
!856 = !DISubprogram(name: "lldiv", scope: !352, file: !352, line: 858, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!844, !539, !539}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !860, file: !706, line: 227)
!860 = !DISubprogram(name: "atoll", scope: !352, file: !352, line: 112, type: !861, flags: DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{!539, !595}
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !864, file: !706, line: 228)
!864 = !DISubprogram(name: "strtoll", scope: !352, file: !352, line: 200, type: !865, flags: DIFlagPrototyped, spFlags: 0)
!865 = !DISubroutineType(types: !866)
!866 = !{!539, !791, !818, !13}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !868, file: !706, line: 229)
!868 = !DISubprogram(name: "strtoull", scope: !352, file: !352, line: 205, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!871, !791, !818, !13}
!871 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !873, file: !706, line: 231)
!873 = !DISubprogram(name: "strtof", scope: !352, file: !352, line: 123, type: !874, flags: DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{!45, !791, !818}
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !843, entity: !877, file: !706, line: 232)
!877 = !DISubprogram(name: "strtold", scope: !352, file: !352, line: 126, type: !878, flags: DIFlagPrototyped, spFlags: 0)
!878 = !DISubroutineType(types: !879)
!879 = !{!428, !791, !818}
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !844, file: !706, line: 240)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !850, file: !706, line: 242)
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !852, file: !706, line: 244)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !884, file: !706, line: 245)
!884 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !843, file: !706, line: 213, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !856, file: !706, line: 246)
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !860, file: !706, line: 248)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !873, file: !706, line: 249)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !864, file: !706, line: 250)
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !868, file: !706, line: 251)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !350, entity: !877, file: !706, line: 252)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !153, entity: !714, file: !892, line: 38)
!892 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
