; ModuleID = 'rendctrl.cpp'
source_filename = "rendctrl.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }
%"struct.pov::Camera_Struct" = type { [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], double, double, i32, double, double, i32, double, double, double, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Transform_Struct"* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Frame", linkageName: "_ZN3pov5FrameE", scope: !2, file: !3, line: 125, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "rendctrl.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAME", scope: !2, file: !5, line: 128, baseType: !6)
!5 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Frame_Struct", scope: !2, file: !5, line: 130, size: 1344, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov12Frame_StructE")
!7 = !{!8, !52, !53, !54, !55, !59, !63, !64, !65, !66, !72, !73, !74, !78, !83, !87, !91}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "Camera", scope: !6, file: !5, line: 132, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAMERA", scope: !2, file: !11, line: 64, baseType: !12)
!11 = !DIFile(filename: "./camera.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera_Struct", scope: !2, file: !11, line: 66, size: 2048, flags: DIFlagTypePassByValue, elements: !13, identifier: "_ZTSN3pov13Camera_StructE")
!13 = !{!14, !21, !22, !23, !24, !25, !26, !27, !28, !29, !31, !32, !33, !34, !35, !36, !37, !41}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "Location", scope: !12, file: !11, line: 68, baseType: !15, size: 192)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !16, line: 691, baseType: !17)
!16 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !19)
!18 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!19 = !{!20}
!20 = !DISubrange(count: 3)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !12, file: !11, line: 69, baseType: !15, size: 192, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Up", scope: !12, file: !11, line: 70, baseType: !15, size: 192, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Right", scope: !12, file: !11, line: 71, baseType: !15, size: 192, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Sky", scope: !12, file: !11, line: 72, baseType: !15, size: 192, offset: 768)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Look_At", scope: !12, file: !11, line: 73, baseType: !15, size: 192, offset: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Point", scope: !12, file: !11, line: 74, baseType: !15, size: 192, offset: 1152)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Distance", scope: !12, file: !11, line: 75, baseType: !18, size: 64, offset: 1344)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Aperture", scope: !12, file: !11, line: 75, baseType: !18, size: 64, offset: 1408)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Blur_Samples", scope: !12, file: !11, line: 76, baseType: !30, size: 32, offset: 1472)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !12, file: !11, line: 77, baseType: !18, size: 64, offset: 1536)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !12, file: !11, line: 78, baseType: !18, size: 64, offset: 1600)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !12, file: !11, line: 79, baseType: !30, size: 32, offset: 1664)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Angle", scope: !12, file: !11, line: 80, baseType: !18, size: 64, offset: 1728)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "H_Angle", scope: !12, file: !11, line: 81, baseType: !18, size: 64, offset: 1792)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "V_Angle", scope: !12, file: !11, line: 82, baseType: !18, size: 64, offset: 1856)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !12, file: !11, line: 83, baseType: !38, size: 64, offset: 1920)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !16, line: 1037, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !16, line: 1348, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Tnormal_StructE")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !12, file: !11, line: 84, baseType: !42, size: 64, offset: 1984)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !16, line: 1014, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !16, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !45, identifier: "_ZTSN3pov16Transform_StructE")
!45 = !{!46, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !44, file: !16, line: 1018, baseType: !47, size: 1024)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !16, line: 693, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !49)
!49 = !{!50, !50}
!50 = !DISubrange(count: 4)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !44, file: !16, line: 1019, baseType: !47, size: 1024, offset: 1024)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Screen_Height", scope: !6, file: !5, line: 133, baseType: !30, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Screen_Width", scope: !6, file: !5, line: 133, baseType: !30, size: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Light_Sources", scope: !6, file: !5, line: 134, baseType: !30, size: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Sources", scope: !6, file: !5, line: 135, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !16, line: 1041, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !16, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Objects", scope: !6, file: !5, line: 136, baseType: !60, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !16, line: 678, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !16, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Atmosphere_IOR", scope: !6, file: !5, line: 137, baseType: !18, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Atmosphere_Dispersion", scope: !6, file: !5, line: 137, baseType: !18, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Antialias_Threshold", scope: !6, file: !5, line: 137, baseType: !18, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Background_Colour", scope: !6, file: !5, line: 138, baseType: !67, size: 160, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !16, line: 695, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, elements: !70)
!69 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!70 = !{!71}
!71 = !DISubrange(count: 5)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient_Light", scope: !6, file: !5, line: 139, baseType: !67, size: 160, offset: 672)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Wavelengths", scope: !6, file: !5, line: 140, baseType: !67, size: 160, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Atmosphere", scope: !6, file: !5, line: 141, baseType: !75, size: 64, offset: 1024)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !2, file: !16, line: 1081, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !2, file: !16, line: 1083, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Media_StructE")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Fog", scope: !6, file: !5, line: 142, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FOG", scope: !2, file: !81, line: 52, baseType: !82)
!81 = !DIFile(filename: "./atmosph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fog_Struct", scope: !2, file: !81, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov10Fog_StructE")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Rainbow", scope: !6, file: !5, line: 143, baseType: !84, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAINBOW", scope: !2, file: !81, line: 53, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rainbow_Struct", scope: !2, file: !81, line: 69, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Rainbow_StructE")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Skysphere", scope: !6, file: !5, line: 144, baseType: !88, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "SKYSPHERE", scope: !2, file: !81, line: 54, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Skysphere_Struct", scope: !2, file: !81, line: 81, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Skysphere_StructE")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Group_Lights", scope: !6, file: !5, line: 145, baseType: !92, size: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_GROUP_LIGHT", scope: !2, file: !94, line: 42, baseType: !95)
!94 = !DIFile(filename: "./lightgrp.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "light_group_light_struct", scope: !2, file: !94, line: 44, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov24light_group_light_structE")
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "Clock_Delta", linkageName: "_ZN3pov11Clock_DeltaE", scope: !2, file: !3, line: 126, type: !18, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "stat_file", linkageName: "_ZN3pov9stat_fileE", scope: !2, file: !3, line: 129, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !103, file: !102, line: 154, flags: DIFlagFwdDecl)
!102 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!103 = !DINamespace(name: "pov_base", scope: null)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "stats", linkageName: "_ZN3pov5statsE", scope: !2, file: !3, line: 130, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 7872, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "COUNTER", scope: !2, file: !16, line: 975, baseType: !108)
!108 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!109 = !{!110}
!110 = !DISubrange(count: 123)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "totalstats", linkageName: "_ZN3pov10totalstatsE", scope: !2, file: !3, line: 131, type: !106, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "opts", linkageName: "_ZN3pov4optsE", scope: !2, file: !3, line: 134, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Opts", scope: !2, file: !5, line: 425, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OPTIONS_STRUCT", scope: !2, file: !5, line: 320, size: 280128, flags: DIFlagTypePassByValue, elements: !117, identifier: "_ZTSN3pov14OPTIONS_STRUCTE")
!117 = !{!118, !120, !122, !123, !124, !125, !126, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !141, !142, !143, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !161, !162, !163, !164, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !228, !229, !230, !253, !254, !255, !256, !257, !259, !260, !261, !262}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Options", scope: !116, file: !5, line: 322, baseType: !119, size: 32)
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayFormat", scope: !116, file: !5, line: 323, baseType: !121, size: 8, offset: 32)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "PaletteOption", scope: !116, file: !5, line: 324, baseType: !121, size: 8, offset: 40)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OutputFormat", scope: !116, file: !5, line: 326, baseType: !121, size: 8, offset: 48)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "OutputQuality", scope: !116, file: !5, line: 327, baseType: !30, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Output_File_Type", scope: !116, file: !5, line: 328, baseType: !30, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Input_File_Name", scope: !116, file: !5, line: 329, baseType: !127, size: 32768, offset: 128)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32768, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 4096)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Output_File_Name", scope: !116, file: !5, line: 330, baseType: !127, size: 32768, offset: 32896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Output_Path", scope: !116, file: !5, line: 331, baseType: !127, size: 32768, offset: 65664)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Output_Numbered_Name", scope: !116, file: !5, line: 332, baseType: !127, size: 32768, offset: 98432)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Scene_Name", scope: !116, file: !5, line: 333, baseType: !127, size: 32768, offset: 131200)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayGamma", scope: !116, file: !5, line: 334, baseType: !69, size: 32, offset: 163968)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "GammaFactor", scope: !116, file: !5, line: 335, baseType: !69, size: 32, offset: 164000)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Quality_Flags", scope: !116, file: !5, line: 337, baseType: !119, size: 32, offset: 164032)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "AntialiasDepth", scope: !116, file: !5, line: 339, baseType: !30, size: 32, offset: 164064)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Antialias_Threshold", scope: !116, file: !5, line: 340, baseType: !18, size: 64, offset: 164096)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "AntialiasClipped", scope: !116, file: !5, line: 341, baseType: !140, size: 8, offset: 164160)
!140 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "JitterScale", scope: !116, file: !5, line: 343, baseType: !18, size: 64, offset: 164224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Abort_Test_Counter", scope: !116, file: !5, line: 345, baseType: !30, size: 32, offset: 164288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Library_Paths", scope: !116, file: !5, line: 347, baseType: !144, size: 1600, offset: 164352)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1600, elements: !146)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!146 = !{!147}
!147 = !DISubrange(count: 25)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Library_Path_Index", scope: !116, file: !5, line: 348, baseType: !30, size: 32, offset: 165952)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "First_Column", scope: !116, file: !5, line: 350, baseType: !30, size: 32, offset: 165984)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Last_Column", scope: !116, file: !5, line: 350, baseType: !30, size: 32, offset: 166016)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "First_Column_Percent", scope: !116, file: !5, line: 351, baseType: !18, size: 64, offset: 166080)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Last_Column_Percent", scope: !116, file: !5, line: 351, baseType: !18, size: 64, offset: 166144)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "First_Line", scope: !116, file: !5, line: 353, baseType: !30, size: 32, offset: 166208)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Last_Line", scope: !116, file: !5, line: 353, baseType: !30, size: 32, offset: 166240)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "First_Line_Percent", scope: !116, file: !5, line: 354, baseType: !18, size: 64, offset: 166272)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Last_Line_Percent", scope: !116, file: !5, line: 354, baseType: !18, size: 64, offset: 166336)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Language_Version", scope: !116, file: !5, line: 357, baseType: !30, size: 32, offset: 166400)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Slabs", scope: !116, file: !5, line: 359, baseType: !140, size: 8, offset: 166432)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "BBox_Threshold", scope: !116, file: !5, line: 360, baseType: !160, size: 64, offset: 166464)
!160 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Quality", scope: !116, file: !5, line: 362, baseType: !30, size: 32, offset: 166528)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PreviewGridSize_Start", scope: !116, file: !5, line: 364, baseType: !30, size: 32, offset: 166560)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PreviewGridSize_End", scope: !116, file: !5, line: 365, baseType: !30, size: 32, offset: 166592)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSeq", scope: !116, file: !5, line: 367, baseType: !165, size: 704, offset: 166656)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAMESEQ", scope: !2, file: !16, line: 1842, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !16, line: 1822, size: 704, flags: DIFlagTypePassByValue, elements: !167, identifier: "_ZTSN3pov8FRAMESEQE")
!167 = !{!168, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "FrameType", scope: !166, file: !16, line: 1824, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRAMETYPE", scope: !2, file: !16, line: 1817, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !16, line: 1813, baseType: !119, size: 32, elements: !171, identifier: "_ZTSN3pov9FRAMETYPEE")
!171 = !{!172, !173}
!172 = !DIEnumerator(name: "FT_SINGLE_FRAME", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "FT_MULTIPLE_FRAME", value: 1, isUnsigned: true)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Clock_Value", scope: !166, file: !16, line: 1825, baseType: !18, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumber", scope: !166, file: !16, line: 1826, baseType: !30, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "InitialFrame", scope: !166, file: !16, line: 1828, baseType: !30, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "InitialClock", scope: !166, file: !16, line: 1829, baseType: !18, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "FinalFrame", scope: !166, file: !16, line: 1831, baseType: !30, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumWidth", scope: !166, file: !16, line: 1832, baseType: !30, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "FinalClock", scope: !166, file: !16, line: 1833, baseType: !18, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetStartFrame", scope: !166, file: !16, line: 1835, baseType: !30, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetStartPercent", scope: !166, file: !16, line: 1836, baseType: !18, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetEndFrame", scope: !166, file: !16, line: 1837, baseType: !30, size: 32, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetEndPercent", scope: !166, file: !16, line: 1838, baseType: !18, size: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Field_Render_Flag", scope: !166, file: !16, line: 1840, baseType: !140, size: 8, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Odd_Field_Flag", scope: !166, file: !16, line: 1841, baseType: !140, size: 8, offset: 648)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Brightness", scope: !116, file: !5, line: 371, baseType: !18, size: 64, offset: 167360)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Count", scope: !116, file: !5, line: 372, baseType: !160, size: 64, offset: 167424)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Dist_Max", scope: !116, file: !5, line: 373, baseType: !18, size: 64, offset: 167488)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Error_Bound", scope: !116, file: !5, line: 374, baseType: !18, size: 64, offset: 167552)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Gray", scope: !116, file: !5, line: 375, baseType: !18, size: 64, offset: 167616)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Low_Error_Factor", scope: !116, file: !5, line: 376, baseType: !18, size: 64, offset: 167680)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Min_Reuse", scope: !116, file: !5, line: 377, baseType: !18, size: 64, offset: 167744)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Nearest_Count", scope: !116, file: !5, line: 378, baseType: !160, size: 64, offset: 167808)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Recursion_Limit", scope: !116, file: !5, line: 379, baseType: !30, size: 32, offset: 167872)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Quality", scope: !116, file: !5, line: 380, baseType: !160, size: 64, offset: 167936)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_File_ReadOnContinue", scope: !116, file: !5, line: 381, baseType: !30, size: 32, offset: 168000)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_File_SaveWhileRendering", scope: !116, file: !5, line: 382, baseType: !30, size: 32, offset: 168032)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_File_AlwaysReadAtStart", scope: !116, file: !5, line: 383, baseType: !30, size: 32, offset: 168064)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_File_KeepOnAbort", scope: !116, file: !5, line: 384, baseType: !30, size: 32, offset: 168096)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_File_KeepAlways", scope: !116, file: !5, line: 385, baseType: !30, size: 32, offset: 168128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Preview_Done", scope: !116, file: !5, line: 386, baseType: !30, size: 32, offset: 168160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Real_Radiosity_Error_Bound", scope: !116, file: !5, line: 389, baseType: !18, size: 64, offset: 168192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Maximum_Sample_Brightness", scope: !116, file: !5, line: 390, baseType: !18, size: 64, offset: 168256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_ADC_Bailout", scope: !116, file: !5, line: 391, baseType: !18, size: 64, offset: 168320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Use_Normal", scope: !116, file: !5, line: 392, baseType: !30, size: 32, offset: 168384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Use_Media", scope: !116, file: !5, line: 393, baseType: !30, size: 32, offset: 168416)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Load_File_Name", scope: !116, file: !5, line: 394, baseType: !145, size: 64, offset: 168448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Save_File_Name", scope: !116, file: !5, line: 395, baseType: !145, size: 64, offset: 168512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Add_On_Final_Trace", scope: !116, file: !5, line: 396, baseType: !30, size: 32, offset: 168576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Radiosity_Enabled", scope: !116, file: !5, line: 397, baseType: !140, size: 8, offset: 168608)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "radPretraceStart", scope: !116, file: !5, line: 398, baseType: !18, size: 64, offset: 168640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "radPretraceEnd", scope: !116, file: !5, line: 399, baseType: !18, size: 64, offset: 168704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_x", scope: !116, file: !5, line: 401, baseType: !30, size: 32, offset: 168768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_y", scope: !116, file: !5, line: 401, baseType: !30, size: 32, offset: 168800)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_on", scope: !116, file: !5, line: 402, baseType: !140, size: 8, offset: 168832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_type", scope: !116, file: !5, line: 403, baseType: !218, size: 32, offset: 168864)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Histogram_Types", scope: !2, file: !219, line: 57, baseType: !220)
!219 = !DIFile(filename: "./render.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !219, line: 49, baseType: !119, size: 32, elements: !221, identifier: "_ZTSN3pov15Histogram_TypesE")
!221 = !{!222, !223, !224, !225, !226, !227}
!222 = !DIEnumerator(name: "CSV", value: 0, isUnsigned: true)
!223 = !DIEnumerator(name: "SYS", value: 1, isUnsigned: true)
!224 = !DIEnumerator(name: "PPM", value: 2, isUnsigned: true)
!225 = !DIEnumerator(name: "TARGA", value: 3, isUnsigned: true)
!226 = !DIEnumerator(name: "PNG", value: 4, isUnsigned: true)
!227 = !DIEnumerator(name: "NONE", value: 5, isUnsigned: true)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_file_type", scope: !116, file: !5, line: 404, baseType: !30, size: 32, offset: 168896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Histogram_File_Name", scope: !116, file: !5, line: 405, baseType: !127, size: 32768, offset: 168928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Shellouts", scope: !116, file: !5, line: 407, baseType: !231, size: 12480, offset: 201696)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 12480, elements: !251)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHELLDATA", scope: !2, file: !233, line: 93, baseType: !234)
!233 = !DIFile(filename: "./userio.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shelldata", scope: !2, file: !233, line: 88, size: 2080, flags: DIFlagTypePassByValue, elements: !235, identifier: "_ZTSN3pov9shelldataE")
!235 = !{!236, !246, !247}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Ret", scope: !234, file: !233, line: 90, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHELLRET", scope: !2, file: !233, line: 86, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shellret", scope: !2, file: !233, line: 78, baseType: !119, size: 32, elements: !239, identifier: "_ZTSN3pov8shellretE")
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DIEnumerator(name: "IGNORE_RET", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "QUIT_RET", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "USER_RET", value: 2, isUnsigned: true)
!243 = !DIEnumerator(name: "FATAL_RET", value: 3, isUnsigned: true)
!244 = !DIEnumerator(name: "SKIP_ONCE_RET", value: 4, isUnsigned: true)
!245 = !DIEnumerator(name: "ALL_SKIP_RET", value: 5, isUnsigned: true)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Inverse", scope: !234, file: !233, line: 91, baseType: !30, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !234, file: !233, line: 92, baseType: !248, size: 2000, offset: 64)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2000, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 250)
!251 = !{!252}
!252 = !DISubrange(count: 6)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Ini_Output_File_Name", scope: !116, file: !5, line: 409, baseType: !127, size: 32768, offset: 214176)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Header_File_Name", scope: !116, file: !5, line: 411, baseType: !127, size: 32768, offset: 246944)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Tracing_Method", scope: !116, file: !5, line: 413, baseType: !30, size: 32, offset: 279712)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Do_Stats", scope: !116, file: !5, line: 414, baseType: !30, size: 32, offset: 279744)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Preview_RefCon", scope: !116, file: !5, line: 416, baseType: !258, size: 64, offset: 279808)
!258 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Warning_Level", scope: !116, file: !5, line: 418, baseType: !30, size: 32, offset: 279872)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "String_Encoding", scope: !116, file: !5, line: 420, baseType: !30, size: 32, offset: 279904)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Noise_Generator", scope: !116, file: !5, line: 422, baseType: !30, size: 32, offset: 279936)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Declared_Variables", scope: !116, file: !5, line: 424, baseType: !263, size: 128, offset: 280000)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttributeList", file: !264, line: 208, baseType: !265)
!264 = !DIFile(filename: "base/povms.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !264, line: 211, size: 128, flags: DIFlagTypePassByValue, elements: !266, identifier: "_ZTS9POVMSData")
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !264, line: 213, baseType: !119, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !265, file: !264, line: 214, baseType: !30, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !264, line: 215, baseType: !270, size: 64, offset: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !265, file: !264, line: 215, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !271, identifier: "_ZTSN9POVMSDataUt_E")
!271 = !{!272, !274, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !270, file: !264, line: 217, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !270, file: !264, line: 218, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !270, file: !264, line: 219, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !264, line: 223, flags: DIFlagFwdDecl, identifier: "_ZTS9POVMSNode")
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "Option_String_Ptr", linkageName: "_ZN3pov17Option_String_PtrE", scope: !2, file: !3, line: 135, type: !145, isLocal: false, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "Number_Of_Files", linkageName: "_ZN3pov15Number_Of_FilesE", scope: !2, file: !3, line: 138, type: !30, isLocal: false, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "Output_File", linkageName: "_ZN3pov11Output_FileE", scope: !2, file: !3, line: 139, type: !285, isLocal: false, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_class_type, name: "Image_File_Class", scope: !2, file: !16, line: 1900, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Image_File_ClassE")
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "Num_Echo_Lines", linkageName: "_ZN3pov14Num_Echo_LinesE", scope: !2, file: !3, line: 140, type: !30, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "tstart", linkageName: "_ZN3pov6tstartE", scope: !2, file: !3, line: 143, type: !291, isLocal: false, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !292, line: 7, baseType: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !294, line: 160, baseType: !160)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "tstop", linkageName: "_ZN3pov5tstopE", scope: !2, file: !3, line: 143, type: !291, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "tparse", linkageName: "_ZN3pov6tparseE", scope: !2, file: !3, line: 144, type: !18, isLocal: false, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "tphoton", linkageName: "_ZN3pov7tphotonE", scope: !2, file: !3, line: 144, type: !18, isLocal: false, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "trender", linkageName: "_ZN3pov7trenderE", scope: !2, file: !3, line: 144, type: !18, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "tparse_frame", linkageName: "_ZN3pov12tparse_frameE", scope: !2, file: !3, line: 145, type: !18, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "tphoton_frame", linkageName: "_ZN3pov13tphoton_frameE", scope: !2, file: !3, line: 145, type: !18, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "trender_frame", linkageName: "_ZN3pov13trender_frameE", scope: !2, file: !3, line: 145, type: !18, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "tparse_total", linkageName: "_ZN3pov12tparse_totalE", scope: !2, file: !3, line: 146, type: !18, isLocal: false, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "tphoton_total", linkageName: "_ZN3pov13tphoton_totalE", scope: !2, file: !3, line: 146, type: !18, isLocal: false, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "trender_total", linkageName: "_ZN3pov13trender_totalE", scope: !2, file: !3, line: 146, type: !18, isLocal: false, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "Color_Bits", linkageName: "_ZN3pov10Color_BitsE", scope: !2, file: !3, line: 149, type: !121, isLocal: false, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "Display_Started", linkageName: "_ZN3pov15Display_StartedE", scope: !2, file: !3, line: 152, type: !30, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "Abort_Test_Every", linkageName: "_ZN3pov16Abort_Test_EveryE", scope: !2, file: !3, line: 153, type: !30, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Experimental_Flag", linkageName: "_ZN3pov17Experimental_FlagE", scope: !2, file: !3, line: 154, type: !30, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "Stage", linkageName: "_ZN3pov5StageE", scope: !2, file: !3, line: 157, type: !30, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "Stop_Flag", linkageName: "_ZN3pov9Stop_FlagE", scope: !2, file: !3, line: 160, type: !327, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "Actual_Output_Name", linkageName: "_ZN3pov18Actual_Output_NameE", scope: !2, file: !3, line: 167, type: !127, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "closed_flag", linkageName: "_ZN3pov11closed_flagE", scope: !2, file: !3, line: 170, type: !30, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "STORE_First_Line", linkageName: "_ZN3pov16STORE_First_LineE", scope: !2, file: !3, line: 172, type: !30, isLocal: false, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !335, retainedTypes: !367, globals: !368, imports: !374, splitDebugInlining: false, nameTableKind: None)
!335 = !{!170, !220, !238, !336, !345}
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shelltype", scope: !2, file: !233, line: 67, baseType: !119, size: 32, elements: !337, identifier: "_ZTSN3pov9shelltypeE")
!337 = !{!338, !339, !340, !341, !342, !343, !344}
!338 = !DIEnumerator(name: "PRE_SCENE_SHL", value: 0, isUnsigned: true)
!339 = !DIEnumerator(name: "PRE_FRAME_SHL", value: 1, isUnsigned: true)
!340 = !DIEnumerator(name: "POST_FRAME_SHL", value: 2, isUnsigned: true)
!341 = !DIEnumerator(name: "POST_SCENE_SHL", value: 3, isUnsigned: true)
!342 = !DIEnumerator(name: "USER_ABORT_SHL", value: 4, isUnsigned: true)
!343 = !DIEnumerator(name: "FATAL_SHL", value: 5, isUnsigned: true)
!344 = !DIEnumerator(name: "MAX_SHL", value: 6, isUnsigned: true)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !346, line: 54, baseType: !119, size: 32, elements: !347)
!346 = !DIFile(filename: "./povmsend.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!348 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1, isUnsigned: true)
!349 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2, isUnsigned: true)
!350 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3, isUnsigned: true)
!351 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4, isUnsigned: true)
!352 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5, isUnsigned: true)
!353 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6, isUnsigned: true)
!354 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7, isUnsigned: true)
!355 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8, isUnsigned: true)
!356 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9, isUnsigned: true)
!357 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10, isUnsigned: true)
!358 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11, isUnsigned: true)
!359 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14, isUnsigned: true)
!362 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15, isUnsigned: true)
!363 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16, isUnsigned: true)
!364 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17, isUnsigned: true)
!365 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18, isUnsigned: true)
!366 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19, isUnsigned: true)
!367 = !{!237, !18, !30, !119, !273}
!368 = !{!0, !96, !98, !104, !111, !113, !279, !281, !283, !287, !289, !295, !297, !299, !301, !303, !305, !307, !309, !311, !313, !315, !317, !319, !321, !323, !325, !328, !330, !332, !369, !372}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!370 = distinct !DIGlobalVariable(name: "STORE", scope: !2, file: !3, line: 101, type: !371, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!373 = distinct !DIGlobalVariable(name: "RESTORE", scope: !2, file: !3, line: 102, type: !371, isLocal: true, isDefinition: true)
!374 = !{!375, !380, !386, !390, !396, !400, !405, !407, !413, !417, !421, !433, !437, !441, !445, !449, !453, !457, !461, !465, !469, !477, !481, !485, !487, !491, !495, !499, !505, !509, !513, !515, !523, !527, !534, !536, !540, !544, !548, !552, !557, !561, !566, !567, !568, !569, !571, !572, !573, !574, !575, !576, !577, !632, !636, !642, !644, !646, !650, !652, !654, !656, !658, !660, !662, !664, !669, !673, !675, !677, !682, !684, !686, !688, !690, !692, !694, !697, !699, !701, !705, !709, !711, !713, !715, !717, !719, !721, !723, !725, !727, !729, !733, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !759, !761, !763, !765, !767, !771, !775, !779, !781, !783, !785, !787, !789, !791, !793, !795, !797, !801, !805, !809, !811, !813, !815, !819, !823, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !847, !849, !851, !855, !859, !863, !865, !867, !869, !871, !875, !879, !881, !883, !885, !887, !889, !891, !895, !899, !901, !903, !905, !907, !911, !915, !919, !921, !923, !925, !927, !929, !931, !935, !939, !943, !945, !949, !953, !955, !957, !959, !961, !963, !965, !971, !976, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1045, !1049, !1055, !1059, !1063, !1067, !1071, !1073, !1075, !1079, !1083, !1087, !1091, !1095, !1097, !1099, !1101, !1105, !1109, !1113, !1115, !1117, !1118, !1120, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1138, !1140, !1142, !1143, !1145, !1151, !1157, !1162, !1166, !1168, !1170, !1172, !1174, !1181, !1185, !1189, !1193, !1197, !1201, !1205, !1209, !1211, !1215, !1221, !1225, !1229, !1231, !1233, !1237, !1241, !1243, !1245, !1247, !1249, !1251, !1253, !1255, !1259, !1263, !1267, !1271, !1275, !1279, !1281, !1287, !1291, !1295, !1299, !1301, !1303, !1307, !1311, !1312, !1313, !1314, !1315, !1316, !1318, !1320, !1322, !1324, !1325, !1327, !1329, !1331, !1333, !1335, !1337, !1339, !1341, !1343, !1345, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1359, !1361, !1363, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1374, !1376, !1378, !1380, !1382, !1384, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1404, !1406, !1408, !1409, !1411, !1413, !1415, !1417, !1419, !1420, !1422, !1424, !1426, !1427}
!375 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !376, entity: !377, file: !379, line: 58)
!376 = !DINamespace(name: "__gnu_debug", scope: null)
!377 = !DINamespace(name: "__debug", scope: !378)
!378 = !DINamespace(name: "std", scope: null)
!379 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !381, file: !385, line: 52)
!381 = !DISubprogram(name: "abs", scope: !382, file: !382, line: 840, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!383 = !DISubroutineType(types: !384)
!384 = !{!30, !30}
!385 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !387, file: !389, line: 127)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !382, line: 62, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!389 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !391, file: !389, line: 128)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !382, line: 70, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !393, identifier: "_ZTS6ldiv_t")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !392, file: !382, line: 68, baseType: !160, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !392, file: !382, line: 69, baseType: !160, size: 64, offset: 64)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !397, file: !389, line: 130)
!397 = !DISubprogram(name: "abort", scope: !382, file: !382, line: 591, type: !398, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{null}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !401, file: !389, line: 134)
!401 = !DISubprogram(name: "atexit", scope: !382, file: !382, line: 595, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!30, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !406, file: !389, line: 137)
!406 = !DISubprogram(name: "at_quick_exit", scope: !382, file: !382, line: 600, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !408, file: !389, line: 140)
!408 = !DISubprogram(name: "atof", scope: !382, file: !382, line: 101, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!18, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !414, file: !389, line: 141)
!414 = !DISubprogram(name: "atoi", scope: !382, file: !382, line: 104, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!30, !411}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !418, file: !389, line: 142)
!418 = !DISubprogram(name: "atol", scope: !382, file: !382, line: 107, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DISubroutineType(types: !420)
!420 = !{!160, !411}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !422, file: !389, line: 143)
!422 = !DISubprogram(name: "bsearch", scope: !382, file: !382, line: 820, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!273, !425, !425, !427, !427, !429}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !428, line: 46, baseType: !258)
!428 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !382, line: 808, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!30, !425, !425}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !434, file: !389, line: 144)
!434 = !DISubprogram(name: "calloc", scope: !382, file: !382, line: 542, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!273, !427, !427}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !438, file: !389, line: 145)
!438 = !DISubprogram(name: "div", scope: !382, file: !382, line: 852, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!387, !30, !30}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !442, file: !389, line: 146)
!442 = !DISubprogram(name: "exit", scope: !382, file: !382, line: 617, type: !443, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !30}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !446, file: !389, line: 147)
!446 = !DISubprogram(name: "free", scope: !382, file: !382, line: 565, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !273}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !450, file: !389, line: 148)
!450 = !DISubprogram(name: "getenv", scope: !382, file: !382, line: 634, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!145, !411}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !454, file: !389, line: 149)
!454 = !DISubprogram(name: "labs", scope: !382, file: !382, line: 841, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!160, !160}
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !458, file: !389, line: 150)
!458 = !DISubprogram(name: "ldiv", scope: !382, file: !382, line: 854, type: !459, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!391, !160, !160}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !462, file: !389, line: 151)
!462 = !DISubprogram(name: "malloc", scope: !382, file: !382, line: 539, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!273, !427}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !466, file: !389, line: 153)
!466 = !DISubprogram(name: "mblen", scope: !382, file: !382, line: 922, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{!30, !411, !427}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !470, file: !389, line: 154)
!470 = !DISubprogram(name: "mbstowcs", scope: !382, file: !382, line: 933, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{!427, !473, !476, !427}
!473 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!476 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !411)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !478, file: !389, line: 155)
!478 = !DISubprogram(name: "mbtowc", scope: !382, file: !382, line: 925, type: !479, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{!30, !473, !476, !427}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !482, file: !389, line: 157)
!482 = !DISubprogram(name: "qsort", scope: !382, file: !382, line: 830, type: !483, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !273, !427, !427, !429}
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !486, file: !389, line: 160)
!486 = !DISubprogram(name: "quick_exit", scope: !382, file: !382, line: 623, type: !443, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !488, file: !389, line: 163)
!488 = !DISubprogram(name: "rand", scope: !382, file: !382, line: 453, type: !489, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!30}
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !492, file: !389, line: 164)
!492 = !DISubprogram(name: "realloc", scope: !382, file: !382, line: 550, type: !493, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DISubroutineType(types: !494)
!494 = !{!273, !273, !427}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !496, file: !389, line: 165)
!496 = !DISubprogram(name: "srand", scope: !382, file: !382, line: 455, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !119}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !500, file: !389, line: 166)
!500 = !DISubprogram(name: "strtod", scope: !382, file: !382, line: 117, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!18, !476, !503}
!503 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !506, file: !389, line: 167)
!506 = !DISubprogram(name: "strtol", scope: !382, file: !382, line: 176, type: !507, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!160, !476, !503, !30}
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !510, file: !389, line: 168)
!510 = !DISubprogram(name: "strtoul", scope: !382, file: !382, line: 180, type: !511, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!258, !476, !503, !30}
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !514, file: !389, line: 169)
!514 = !DISubprogram(name: "system", scope: !382, file: !382, line: 784, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !516, file: !389, line: 171)
!516 = !DISubprogram(name: "wcstombs", scope: !382, file: !382, line: 936, type: !517, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{!427, !519, !520, !427}
!519 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !145)
!520 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !524, file: !389, line: 172)
!524 = !DISubprogram(name: "wctomb", scope: !382, file: !382, line: 929, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!30, !145, !475}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !529, file: !389, line: 200)
!528 = !DINamespace(name: "__gnu_cxx", scope: null)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !382, line: 80, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !531, identifier: "_ZTS7lldiv_t")
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !530, file: !382, line: 78, baseType: !108, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !530, file: !382, line: 79, baseType: !108, size: 64, offset: 64)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !535, file: !389, line: 206)
!535 = !DISubprogram(name: "_Exit", scope: !382, file: !382, line: 629, type: !443, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !537, file: !389, line: 210)
!537 = !DISubprogram(name: "llabs", scope: !382, file: !382, line: 844, type: !538, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!108, !108}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !541, file: !389, line: 216)
!541 = !DISubprogram(name: "lldiv", scope: !382, file: !382, line: 858, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DISubroutineType(types: !543)
!543 = !{!529, !108, !108}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !545, file: !389, line: 227)
!545 = !DISubprogram(name: "atoll", scope: !382, file: !382, line: 112, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{!108, !411}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !549, file: !389, line: 228)
!549 = !DISubprogram(name: "strtoll", scope: !382, file: !382, line: 200, type: !550, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{!108, !476, !503, !30}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !553, file: !389, line: 229)
!553 = !DISubprogram(name: "strtoull", scope: !382, file: !382, line: 205, type: !554, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !476, !503, !30}
!556 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !558, file: !389, line: 231)
!558 = !DISubprogram(name: "strtof", scope: !382, file: !382, line: 123, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DISubroutineType(types: !560)
!560 = !{!69, !476, !503}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !528, entity: !562, file: !389, line: 232)
!562 = !DISubprogram(name: "strtold", scope: !382, file: !382, line: 126, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !476, !503}
!565 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !529, file: !389, line: 240)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !535, file: !389, line: 242)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !537, file: !389, line: 244)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !570, file: !389, line: 245)
!570 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !528, file: !389, line: 213, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !541, file: !389, line: 246)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !545, file: !389, line: 248)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !558, file: !389, line: 249)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !549, file: !389, line: 250)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !553, file: !389, line: 251)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !562, file: !389, line: 252)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !378, entity: !578, file: !579, line: 58)
