; ModuleID = 'objects.cpp'
source_filename = "objects.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::istack_struct" = type { %"struct.pov::istack_struct"*, %"struct.pov::istk_entry"*, i32, i32 }
%"struct.pov::istk_entry" = type { double, [3 x double], [3 x double], [3 x double], [2 x double], %"struct.pov::Object_Struct"*, i32, i32, double, double, double, double, double, double, double, double, double, i8*, i8* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Number_of_istacks", linkageName: "_ZN3pov17Number_of_istacksE", scope: !2, file: !3, line: 54, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "objects.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "Max_Intersections", linkageName: "_ZN3pov17Max_IntersectionsE", scope: !2, file: !3, line: 55, type: !4, isLocal: false, isDefinition: true)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "free_istack", linkageName: "_ZN3pov11free_istackE", scope: !2, file: !3, line: 56, type: !9, isLocal: false, isDefinition: true)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !11, line: 681, baseType: !12)
!11 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !11, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !13, identifier: "_ZTSN3pov13istack_structE")
!13 = !{!14, !16, !158, !159}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 1637, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !12, file: !11, line: 1638, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !11, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTSN3pov10istk_entryE")
!19 = !{!20, !22, !27, !28, !29, !34, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !18, file: !11, line: 1612, baseType: !21, size: 64)
!21 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !18, file: !11, line: 1613, baseType: !23, size: 192, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !11, line: 691, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 3)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !18, file: !11, line: 1614, baseType: !23, size: 192, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !18, file: !11, line: 1615, baseType: !23, size: 192, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !18, file: !11, line: 1616, baseType: !30, size: 128, offset: 640)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !11, line: 690, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 2)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !18, file: !11, line: 1617, baseType: !35, size: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !11, line: 678, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !11, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !38, identifier: "_ZTSN3pov13Object_StructE")
!38 = !{!39, !117, !118, !119, !123, !124, !125, !126, !127, !131, !141, !142, !143, !144}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !37, file: !11, line: 1537, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !11, line: 1432, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !11, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !43, identifier: "_ZTSN3pov13Method_StructE")
!43 = !{!44, !65, !71, !78, !80, !86, !101, !103, !105, !110, !115}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !42, file: !11, line: 1519, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !11, line: 1434, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !35, !50, !9}
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !11, line: 680, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !11, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !53, identifier: "_ZTSN3pov10Ray_StructE")
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !52, file: !11, line: 1799, baseType: !23, size: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !52, file: !11, line: 1800, baseType: !23, size: 192, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !52, file: !11, line: 1801, baseType: !49, size: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !52, file: !11, line: 1802, baseType: !4, size: 32, offset: 416)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !52, file: !11, line: 1803, baseType: !59, size: 6400, offset: 448)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 6400, elements: !63)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !11, line: 1124, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !11, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !42, file: !11, line: 1520, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !11, line: 1435, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!49, !70, !35}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !42, file: !11, line: 1521, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !11, line: 1436, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !70, !35, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !11, line: 682, baseType: !18)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !42, file: !11, line: 1522, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !11, line: 1437, baseType: !73)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !42, file: !11, line: 1523, baseType: !81, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !11, line: 1438, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !35}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !42, file: !11, line: 1524, baseType: !87, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !11, line: 1439, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !35, !70, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !11, line: 1014, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !11, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTSN3pov16Transform_StructE")
!94 = !{!95, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !93, file: !11, line: 1018, baseType: !96, size: 1024)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !11, line: 693, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, elements: !98)
!98 = !{!99, !99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !93, file: !11, line: 1019, baseType: !96, size: 1024, offset: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !42, file: !11, line: 1525, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !11, line: 1440, baseType: !88)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !42, file: !11, line: 1526, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !11, line: 1441, baseType: !88)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !42, file: !11, line: 1527, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !11, line: 1442, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !35, !91}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !42, file: !11, line: 1528, baseType: !111, size: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !11, line: 1443, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !35}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !42, file: !11, line: 1529, baseType: !116, size: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !11, line: 1444, baseType: !112)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !37, file: !11, line: 1537, baseType: !49, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !37, file: !11, line: 1537, baseType: !35, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !37, file: !11, line: 1537, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !11, line: 1035, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !11, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !37, file: !11, line: 1537, baseType: !120, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !37, file: !11, line: 1537, baseType: !60, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !37, file: !11, line: 1537, baseType: !35, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !37, file: !11, line: 1537, baseType: !35, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !37, file: !11, line: 1537, baseType: !128, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !11, line: 1041, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !11, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !37, file: !11, line: 1537, baseType: !132, size: 192, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !11, line: 888, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !11, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!134 = !{!135, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !133, file: !11, line: 892, baseType: !136, size: 96)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !11, line: 886, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !25)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !11, line: 884, baseType: !139)
!139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !133, file: !11, line: 892, baseType: !136, size: 96, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !37, file: !11, line: 1537, baseType: !91, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !37, file: !11, line: 1537, baseType: !91, size: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !37, file: !11, line: 1537, baseType: !139, size: 32, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !37, file: !11, line: 1537, baseType: !4, size: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !18, file: !11, line: 1624, baseType: !49, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !18, file: !11, line: 1624, baseType: !49, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !18, file: !11, line: 1625, baseType: !21, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !18, file: !11, line: 1625, baseType: !21, size: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !18, file: !11, line: 1626, baseType: !21, size: 64, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !18, file: !11, line: 1626, baseType: !21, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !18, file: !11, line: 1627, baseType: !21, size: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !18, file: !11, line: 1627, baseType: !21, size: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !18, file: !11, line: 1628, baseType: !21, size: 64, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !18, file: !11, line: 1628, baseType: !21, size: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !18, file: !11, line: 1628, baseType: !21, size: 64, offset: 1408)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !18, file: !11, line: 1630, baseType: !85, size: 64, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !18, file: !11, line: 1632, baseType: !85, size: 64, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !12, file: !11, line: 1639, baseType: !4, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !12, file: !11, line: 1640, baseType: !4, size: 32, offset: 160)
!160 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !161, retainedTypes: !299, globals: !300, imports: !301, splitDebugInlining: false, nameTableKind: None)
!161 = !{!162, !289, !295}
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !163, line: 149, baseType: !4, size: 32, elements: !164, identifier: "_ZTSN3pov5STATSE")
!163 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!165 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!166 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!168 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!169 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!170 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!171 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!172 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!179 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!180 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!181 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!182 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!215 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!216 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!225 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!226 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!243 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!244 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!247 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!248 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!253 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!254 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!255 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!256 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!260 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!261 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!262 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!263 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!264 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!265 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!266 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!267 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!268 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!269 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!270 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!271 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!272 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!273 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!274 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!275 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!276 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!277 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!278 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!279 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!280 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!281 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!282 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!283 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!284 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!285 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!286 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!287 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!288 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !11, line: 706, baseType: !4, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294}
!291 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !11, line: 700, baseType: !4, size: 32, elements: !296)
!296 = !{!297, !298}
!297 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!299 = !{!35, !60, !85, !9, !76}
!300 = !{!0, !5, !7}
!301 = !{!302, !309, !315, !317, !319, !323, !325, !327, !329, !331, !333, !335, !337, !342, !346, !348, !350, !354, !356, !358, !360, !362, !364, !366, !369, !371, !373, !377, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !406, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !440, !444, !448, !452, !454, !456, !458, !460, !462, !464, !466, !468, !470, !474, !478, !482, !484, !486, !488, !493, !497, !501, !503, !505, !507, !509, !511, !513, !515, !517, !519, !521, !523, !525, !530, !534, !538, !540, !542, !544, !551, !555, !559, !561, !563, !565, !567, !569, !571, !575, !579, !581, !583, !585, !587, !591, !595, !599, !601, !603, !605, !607, !609, !611, !615, !619, !623, !625, !629, !633, !635, !637, !639, !641, !643, !645, !651, !656, !660, !666, !670, !675, !677, !679, !683, !687, !700, !704, !708, !712, !716, !721, !725, !729, !733, !737, !745, !749, !753, !755, !759, !763, !767, !773, !777, !781, !783, !791, !795, !802, !804, !808, !812, !816, !820, !825, !829, !833, !834, !835, !836, !838, !839, !840, !841, !842, !843, !844, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901, !903, !905, !907, !913, !917, !923, !927, !931, !935, !939, !941, !943, !947, !951, !955, !959, !963, !965, !967, !969, !973, !977, !981, !983, !985, !988, !990, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1012, !1013, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028}
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !304, file: !308, line: 52)
!303 = !DINamespace(name: "std", scope: null)
!304 = !DISubprogram(name: "abs", scope: !305, file: !305, line: 840, type: !306, flags: DIFlagPrototyped, spFlags: 0)
!305 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!306 = !DISubroutineType(types: !307)
!307 = !{!49, !49}
!308 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !310, file: !314, line: 83)
!310 = !DISubprogram(name: "acos", scope: !311, file: !311, line: 53, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!312 = !DISubroutineType(types: !313)
!313 = !{!21, !21}
!314 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !316, file: !314, line: 102)
!316 = !DISubprogram(name: "asin", scope: !311, file: !311, line: 55, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !318, file: !314, line: 121)
!318 = !DISubprogram(name: "atan", scope: !311, file: !311, line: 57, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !320, file: !314, line: 140)
!320 = !DISubprogram(name: "atan2", scope: !311, file: !311, line: 59, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!321 = !DISubroutineType(types: !322)
!322 = !{!21, !21, !21}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !324, file: !314, line: 161)
!324 = !DISubprogram(name: "ceil", scope: !311, file: !311, line: 159, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !326, file: !314, line: 180)
!326 = !DISubprogram(name: "cos", scope: !311, file: !311, line: 62, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !328, file: !314, line: 199)
!328 = !DISubprogram(name: "cosh", scope: !311, file: !311, line: 71, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !330, file: !314, line: 218)
!330 = !DISubprogram(name: "exp", scope: !311, file: !311, line: 95, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !332, file: !314, line: 237)
!332 = !DISubprogram(name: "fabs", scope: !311, file: !311, line: 162, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !334, file: !314, line: 256)
!334 = !DISubprogram(name: "floor", scope: !311, file: !311, line: 165, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !336, file: !314, line: 275)
!336 = !DISubprogram(name: "fmod", scope: !311, file: !311, line: 168, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !338, file: !314, line: 296)
!338 = !DISubprogram(name: "frexp", scope: !311, file: !311, line: 98, type: !339, flags: DIFlagPrototyped, spFlags: 0)
!339 = !DISubroutineType(types: !340)
!340 = !{!21, !21, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !343, file: !314, line: 315)
!343 = !DISubprogram(name: "ldexp", scope: !311, file: !311, line: 101, type: !344, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DISubroutineType(types: !345)
!345 = !{!21, !21, !49}
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !347, file: !314, line: 334)
!347 = !DISubprogram(name: "log", scope: !311, file: !311, line: 104, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !349, file: !314, line: 353)
!349 = !DISubprogram(name: "log10", scope: !311, file: !311, line: 107, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !351, file: !314, line: 372)
!351 = !DISubprogram(name: "modf", scope: !311, file: !311, line: 110, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DISubroutineType(types: !353)
!353 = !{!21, !21, !70}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !355, file: !314, line: 384)
!355 = !DISubprogram(name: "pow", scope: !311, file: !311, line: 140, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !357, file: !314, line: 421)
!357 = !DISubprogram(name: "sin", scope: !311, file: !311, line: 64, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !359, file: !314, line: 440)
!359 = !DISubprogram(name: "sinh", scope: !311, file: !311, line: 73, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !361, file: !314, line: 459)
!361 = !DISubprogram(name: "sqrt", scope: !311, file: !311, line: 143, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !363, file: !314, line: 478)
!363 = !DISubprogram(name: "tan", scope: !311, file: !311, line: 66, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !365, file: !314, line: 497)
!365 = !DISubprogram(name: "tanh", scope: !311, file: !311, line: 75, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !367, file: !314, line: 1065)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !368, line: 150, baseType: !21)
!368 = !DIFile(filename: "/usr/include/math.h", directory: "")
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !370, file: !314, line: 1066)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !368, line: 149, baseType: !139)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !372, file: !314, line: 1069)
!372 = !DISubprogram(name: "acosh", scope: !311, file: !311, line: 85, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !374, file: !314, line: 1070)
!374 = !DISubprogram(name: "acoshf", scope: !311, file: !311, line: 85, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DISubroutineType(types: !376)
!376 = !{!139, !139}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !378, file: !314, line: 1071)
!378 = !DISubprogram(name: "acoshl", scope: !311, file: !311, line: 85, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !381}
!381 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !383, file: !314, line: 1073)
!383 = !DISubprogram(name: "asinh", scope: !311, file: !311, line: 87, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !385, file: !314, line: 1074)
!385 = !DISubprogram(name: "asinhf", scope: !311, file: !311, line: 87, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !387, file: !314, line: 1075)
!387 = !DISubprogram(name: "asinhl", scope: !311, file: !311, line: 87, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !389, file: !314, line: 1077)
!389 = !DISubprogram(name: "atanh", scope: !311, file: !311, line: 89, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !391, file: !314, line: 1078)
!391 = !DISubprogram(name: "atanhf", scope: !311, file: !311, line: 89, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !393, file: !314, line: 1079)
!393 = !DISubprogram(name: "atanhl", scope: !311, file: !311, line: 89, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !395, file: !314, line: 1081)
!395 = !DISubprogram(name: "cbrt", scope: !311, file: !311, line: 152, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !397, file: !314, line: 1082)
!397 = !DISubprogram(name: "cbrtf", scope: !311, file: !311, line: 152, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !399, file: !314, line: 1083)
!399 = !DISubprogram(name: "cbrtl", scope: !311, file: !311, line: 152, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !401, file: !314, line: 1085)
!401 = !DISubprogram(name: "copysign", scope: !311, file: !311, line: 196, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !403, file: !314, line: 1086)
!403 = !DISubprogram(name: "copysignf", scope: !311, file: !311, line: 196, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{!139, !139, !139}
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !407, file: !314, line: 1087)
!407 = !DISubprogram(name: "copysignl", scope: !311, file: !311, line: 196, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!381, !381, !381}
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !411, file: !314, line: 1089)
!411 = !DISubprogram(name: "erf", scope: !311, file: !311, line: 228, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !413, file: !314, line: 1090)
!413 = !DISubprogram(name: "erff", scope: !311, file: !311, line: 228, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !415, file: !314, line: 1091)
!415 = !DISubprogram(name: "erfl", scope: !311, file: !311, line: 228, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !417, file: !314, line: 1093)
!417 = !DISubprogram(name: "erfc", scope: !311, file: !311, line: 229, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !419, file: !314, line: 1094)
!419 = !DISubprogram(name: "erfcf", scope: !311, file: !311, line: 229, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !421, file: !314, line: 1095)
!421 = !DISubprogram(name: "erfcl", scope: !311, file: !311, line: 229, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !423, file: !314, line: 1097)
!423 = !DISubprogram(name: "exp2", scope: !311, file: !311, line: 130, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !425, file: !314, line: 1098)
!425 = !DISubprogram(name: "exp2f", scope: !311, file: !311, line: 130, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !427, file: !314, line: 1099)
!427 = !DISubprogram(name: "exp2l", scope: !311, file: !311, line: 130, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !429, file: !314, line: 1101)
!429 = !DISubprogram(name: "expm1", scope: !311, file: !311, line: 119, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !431, file: !314, line: 1102)
!431 = !DISubprogram(name: "expm1f", scope: !311, file: !311, line: 119, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !433, file: !314, line: 1103)
!433 = !DISubprogram(name: "expm1l", scope: !311, file: !311, line: 119, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !435, file: !314, line: 1105)
!435 = !DISubprogram(name: "fdim", scope: !311, file: !311, line: 326, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !437, file: !314, line: 1106)
!437 = !DISubprogram(name: "fdimf", scope: !311, file: !311, line: 326, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !439, file: !314, line: 1107)
!439 = !DISubprogram(name: "fdiml", scope: !311, file: !311, line: 326, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !441, file: !314, line: 1109)
!441 = !DISubprogram(name: "fma", scope: !311, file: !311, line: 335, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DISubroutineType(types: !443)
!443 = !{!21, !21, !21, !21}
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !445, file: !314, line: 1110)
!445 = !DISubprogram(name: "fmaf", scope: !311, file: !311, line: 335, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!139, !139, !139, !139}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !449, file: !314, line: 1111)
!449 = !DISubprogram(name: "fmal", scope: !311, file: !311, line: 335, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!381, !381, !381, !381}
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !453, file: !314, line: 1113)
!453 = !DISubprogram(name: "fmax", scope: !311, file: !311, line: 329, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !455, file: !314, line: 1114)
!455 = !DISubprogram(name: "fmaxf", scope: !311, file: !311, line: 329, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !457, file: !314, line: 1115)
!457 = !DISubprogram(name: "fmaxl", scope: !311, file: !311, line: 329, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !459, file: !314, line: 1117)
!459 = !DISubprogram(name: "fmin", scope: !311, file: !311, line: 332, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !461, file: !314, line: 1118)
!461 = !DISubprogram(name: "fminf", scope: !311, file: !311, line: 332, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !463, file: !314, line: 1119)
!463 = !DISubprogram(name: "fminl", scope: !311, file: !311, line: 332, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !465, file: !314, line: 1121)
!465 = !DISubprogram(name: "hypot", scope: !311, file: !311, line: 147, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !467, file: !314, line: 1122)
!467 = !DISubprogram(name: "hypotf", scope: !311, file: !311, line: 147, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !469, file: !314, line: 1123)
!469 = !DISubprogram(name: "hypotl", scope: !311, file: !311, line: 147, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !471, file: !314, line: 1125)
!471 = !DISubprogram(name: "ilogb", scope: !311, file: !311, line: 280, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{!49, !21}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !475, file: !314, line: 1126)
!475 = !DISubprogram(name: "ilogbf", scope: !311, file: !311, line: 280, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{!49, !139}
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !479, file: !314, line: 1127)
!479 = !DISubprogram(name: "ilogbl", scope: !311, file: !311, line: 280, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!49, !381}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !483, file: !314, line: 1129)
!483 = !DISubprogram(name: "lgamma", scope: !311, file: !311, line: 230, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !485, file: !314, line: 1130)
!485 = !DISubprogram(name: "lgammaf", scope: !311, file: !311, line: 230, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !487, file: !314, line: 1131)
!487 = !DISubprogram(name: "lgammal", scope: !311, file: !311, line: 230, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !489, file: !314, line: 1134)
!489 = !DISubprogram(name: "llrint", scope: !311, file: !311, line: 316, type: !490, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !21}
!492 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !494, file: !314, line: 1135)
!494 = !DISubprogram(name: "llrintf", scope: !311, file: !311, line: 316, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!492, !139}
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !498, file: !314, line: 1136)
!498 = !DISubprogram(name: "llrintl", scope: !311, file: !311, line: 316, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!492, !381}
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !502, file: !314, line: 1138)
!502 = !DISubprogram(name: "llround", scope: !311, file: !311, line: 322, type: !490, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !504, file: !314, line: 1139)
!504 = !DISubprogram(name: "llroundf", scope: !311, file: !311, line: 322, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !506, file: !314, line: 1140)
!506 = !DISubprogram(name: "llroundl", scope: !311, file: !311, line: 322, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !508, file: !314, line: 1143)
!508 = !DISubprogram(name: "log1p", scope: !311, file: !311, line: 122, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !510, file: !314, line: 1144)
!510 = !DISubprogram(name: "log1pf", scope: !311, file: !311, line: 122, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !512, file: !314, line: 1145)
!512 = !DISubprogram(name: "log1pl", scope: !311, file: !311, line: 122, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !514, file: !314, line: 1147)
!514 = !DISubprogram(name: "log2", scope: !311, file: !311, line: 133, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !516, file: !314, line: 1148)
!516 = !DISubprogram(name: "log2f", scope: !311, file: !311, line: 133, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !518, file: !314, line: 1149)
!518 = !DISubprogram(name: "log2l", scope: !311, file: !311, line: 133, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !520, file: !314, line: 1151)
!520 = !DISubprogram(name: "logb", scope: !311, file: !311, line: 125, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !522, file: !314, line: 1152)
!522 = !DISubprogram(name: "logbf", scope: !311, file: !311, line: 125, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !524, file: !314, line: 1153)
!524 = !DISubprogram(name: "logbl", scope: !311, file: !311, line: 125, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !526, file: !314, line: 1155)
!526 = !DISubprogram(name: "lrint", scope: !311, file: !311, line: 314, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !21}
!529 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !531, file: !314, line: 1156)
!531 = !DISubprogram(name: "lrintf", scope: !311, file: !311, line: 314, type: !532, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DISubroutineType(types: !533)
!533 = !{!529, !139}
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !535, file: !314, line: 1157)
!535 = !DISubprogram(name: "lrintl", scope: !311, file: !311, line: 314, type: !536, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DISubroutineType(types: !537)
!537 = !{!529, !381}
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !539, file: !314, line: 1159)
!539 = !DISubprogram(name: "lround", scope: !311, file: !311, line: 320, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !541, file: !314, line: 1160)
!541 = !DISubprogram(name: "lroundf", scope: !311, file: !311, line: 320, type: !532, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !543, file: !314, line: 1161)
!543 = !DISubprogram(name: "lroundl", scope: !311, file: !311, line: 320, type: !536, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !545, file: !314, line: 1163)
!545 = !DISubprogram(name: "nan", scope: !311, file: !311, line: 201, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{!21, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !552, file: !314, line: 1164)
!552 = !DISubprogram(name: "nanf", scope: !311, file: !311, line: 201, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!139, !548}
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !556, file: !314, line: 1165)
!556 = !DISubprogram(name: "nanl", scope: !311, file: !311, line: 201, type: !557, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DISubroutineType(types: !558)
!558 = !{!381, !548}
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !560, file: !314, line: 1167)
!560 = !DISubprogram(name: "nearbyint", scope: !311, file: !311, line: 294, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !562, file: !314, line: 1168)
!562 = !DISubprogram(name: "nearbyintf", scope: !311, file: !311, line: 294, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !564, file: !314, line: 1169)
!564 = !DISubprogram(name: "nearbyintl", scope: !311, file: !311, line: 294, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !566, file: !314, line: 1171)
!566 = !DISubprogram(name: "nextafter", scope: !311, file: !311, line: 259, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !568, file: !314, line: 1172)
!568 = !DISubprogram(name: "nextafterf", scope: !311, file: !311, line: 259, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !570, file: !314, line: 1173)
!570 = !DISubprogram(name: "nextafterl", scope: !311, file: !311, line: 259, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !572, file: !314, line: 1175)
!572 = !DISubprogram(name: "nexttoward", scope: !311, file: !311, line: 261, type: !573, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!21, !21, !381}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !576, file: !314, line: 1176)
!576 = !DISubprogram(name: "nexttowardf", scope: !311, file: !311, line: 261, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!139, !139, !381}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !580, file: !314, line: 1177)
!580 = !DISubprogram(name: "nexttowardl", scope: !311, file: !311, line: 261, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !582, file: !314, line: 1179)
!582 = !DISubprogram(name: "remainder", scope: !311, file: !311, line: 272, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !584, file: !314, line: 1180)
!584 = !DISubprogram(name: "remainderf", scope: !311, file: !311, line: 272, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !586, file: !314, line: 1181)
!586 = !DISubprogram(name: "remainderl", scope: !311, file: !311, line: 272, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !588, file: !314, line: 1183)
!588 = !DISubprogram(name: "remquo", scope: !311, file: !311, line: 307, type: !589, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!21, !21, !21, !341}
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !592, file: !314, line: 1184)
!592 = !DISubprogram(name: "remquof", scope: !311, file: !311, line: 307, type: !593, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DISubroutineType(types: !594)
!594 = !{!139, !139, !139, !341}
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !596, file: !314, line: 1185)
!596 = !DISubprogram(name: "remquol", scope: !311, file: !311, line: 307, type: !597, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DISubroutineType(types: !598)
!598 = !{!381, !381, !381, !341}
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !600, file: !314, line: 1187)
!600 = !DISubprogram(name: "rint", scope: !311, file: !311, line: 256, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !602, file: !314, line: 1188)
!602 = !DISubprogram(name: "rintf", scope: !311, file: !311, line: 256, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !604, file: !314, line: 1189)
!604 = !DISubprogram(name: "rintl", scope: !311, file: !311, line: 256, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !606, file: !314, line: 1191)
!606 = !DISubprogram(name: "round", scope: !311, file: !311, line: 298, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !608, file: !314, line: 1192)
!608 = !DISubprogram(name: "roundf", scope: !311, file: !311, line: 298, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !610, file: !314, line: 1193)
!610 = !DISubprogram(name: "roundl", scope: !311, file: !311, line: 298, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !612, file: !314, line: 1195)
!612 = !DISubprogram(name: "scalbln", scope: !311, file: !311, line: 290, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{!21, !21, !529}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !616, file: !314, line: 1196)
!616 = !DISubprogram(name: "scalblnf", scope: !311, file: !311, line: 290, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{!139, !139, !529}
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !620, file: !314, line: 1197)
!620 = !DISubprogram(name: "scalblnl", scope: !311, file: !311, line: 290, type: !621, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{!381, !381, !529}
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !624, file: !314, line: 1199)
!624 = !DISubprogram(name: "scalbn", scope: !311, file: !311, line: 276, type: !344, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !626, file: !314, line: 1200)
!626 = !DISubprogram(name: "scalbnf", scope: !311, file: !311, line: 276, type: !627, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{!139, !139, !49}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !630, file: !314, line: 1201)
!630 = !DISubprogram(name: "scalbnl", scope: !311, file: !311, line: 276, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!381, !381, !49}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !634, file: !314, line: 1203)
!634 = !DISubprogram(name: "tgamma", scope: !311, file: !311, line: 235, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !636, file: !314, line: 1204)
!636 = !DISubprogram(name: "tgammaf", scope: !311, file: !311, line: 235, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !638, file: !314, line: 1205)
!638 = !DISubprogram(name: "tgammal", scope: !311, file: !311, line: 235, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !640, file: !314, line: 1207)
!640 = !DISubprogram(name: "trunc", scope: !311, file: !311, line: 302, type: !312, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !642, file: !314, line: 1208)
!642 = !DISubprogram(name: "truncf", scope: !311, file: !311, line: 302, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !644, file: !314, line: 1209)
!644 = !DISubprogram(name: "truncl", scope: !311, file: !311, line: 302, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !160, entity: !646, file: !650, line: 38)
!646 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !303, file: !308, line: 103, type: !647, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!649, !649}
!649 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!650 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !160, entity: !652, file: !650, line: 54)
!652 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !303, file: !314, line: 380, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!381, !381, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !657, file: !659, line: 127)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !305, line: 62, baseType: !658)
!658 = !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!659 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !661, file: !659, line: 128)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !305, line: 70, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !663, identifier: "_ZTS6ldiv_t")
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !662, file: !305, line: 68, baseType: !529, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !662, file: !305, line: 69, baseType: !529, size: 64, offset: 64)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !667, file: !659, line: 130)
!667 = !DISubprogram(name: "abort", scope: !305, file: !305, line: 591, type: !668, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{null}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !671, file: !659, line: 134)
!671 = !DISubprogram(name: "atexit", scope: !305, file: !305, line: 595, type: !672, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{!49, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !676, file: !659, line: 137)
!676 = !DISubprogram(name: "at_quick_exit", scope: !305, file: !305, line: 600, type: !672, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !678, file: !659, line: 140)
!678 = !DISubprogram(name: "atof", scope: !305, file: !305, line: 101, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !680, file: !659, line: 141)
!680 = !DISubprogram(name: "atoi", scope: !305, file: !305, line: 104, type: !681, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DISubroutineType(types: !682)
!682 = !{!49, !548}
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !684, file: !659, line: 142)
!684 = !DISubprogram(name: "atol", scope: !305, file: !305, line: 107, type: !685, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{!529, !548}
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !688, file: !659, line: 143)
!688 = !DISubprogram(name: "bsearch", scope: !305, file: !305, line: 820, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!85, !691, !691, !693, !693, !696}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !694, line: 46, baseType: !695)
!694 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!695 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !305, line: 808, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!49, !691, !691}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !701, file: !659, line: 144)
!701 = !DISubprogram(name: "calloc", scope: !305, file: !305, line: 542, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!85, !693, !693}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !705, file: !659, line: 145)
!705 = !DISubprogram(name: "div", scope: !305, file: !305, line: 852, type: !706, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!657, !49, !49}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !709, file: !659, line: 146)
!709 = !DISubprogram(name: "exit", scope: !305, file: !305, line: 617, type: !710, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !49}
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !713, file: !659, line: 147)
!713 = !DISubprogram(name: "free", scope: !305, file: !305, line: 565, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !85}
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !717, file: !659, line: 148)
!717 = !DISubprogram(name: "getenv", scope: !305, file: !305, line: 634, type: !718, flags: DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !548}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !722, file: !659, line: 149)
!722 = !DISubprogram(name: "labs", scope: !305, file: !305, line: 841, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!529, !529}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !726, file: !659, line: 150)
!726 = !DISubprogram(name: "ldiv", scope: !305, file: !305, line: 854, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!661, !529, !529}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !730, file: !659, line: 151)
!730 = !DISubprogram(name: "malloc", scope: !305, file: !305, line: 539, type: !731, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{!85, !693}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !734, file: !659, line: 153)
!734 = !DISubprogram(name: "mblen", scope: !305, file: !305, line: 922, type: !735, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DISubroutineType(types: !736)
!736 = !{!49, !548, !693}
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !738, file: !659, line: 154)
!738 = !DISubprogram(name: "mbstowcs", scope: !305, file: !305, line: 933, type: !739, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{!693, !741, !744, !693}
!741 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!744 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !548)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !746, file: !659, line: 155)
!746 = !DISubprogram(name: "mbtowc", scope: !305, file: !305, line: 925, type: !747, flags: DIFlagPrototyped, spFlags: 0)
!747 = !DISubroutineType(types: !748)
!748 = !{!49, !741, !744, !693}
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !750, file: !659, line: 157)
!750 = !DISubprogram(name: "qsort", scope: !305, file: !305, line: 830, type: !751, flags: DIFlagPrototyped, spFlags: 0)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !85, !693, !693, !696}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !754, file: !659, line: 160)
!754 = !DISubprogram(name: "quick_exit", scope: !305, file: !305, line: 623, type: !710, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !756, file: !659, line: 163)
!756 = !DISubprogram(name: "rand", scope: !305, file: !305, line: 453, type: !757, flags: DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!49}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !760, file: !659, line: 164)
!760 = !DISubprogram(name: "realloc", scope: !305, file: !305, line: 550, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!85, !85, !693}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !764, file: !659, line: 165)
!764 = !DISubprogram(name: "srand", scope: !305, file: !305, line: 455, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !4}
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !768, file: !659, line: 166)
!768 = !DISubprogram(name: "strtod", scope: !305, file: !305, line: 117, type: !769, flags: DIFlagPrototyped, spFlags: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{!21, !744, !771}
!771 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !774, file: !659, line: 167)
!774 = !DISubprogram(name: "strtol", scope: !305, file: !305, line: 176, type: !775, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!529, !744, !771, !49}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !778, file: !659, line: 168)
!778 = !DISubprogram(name: "strtoul", scope: !305, file: !305, line: 180, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{!695, !744, !771, !49}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !782, file: !659, line: 169)
!782 = !DISubprogram(name: "system", scope: !305, file: !305, line: 784, type: !681, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !784, file: !659, line: 171)
!784 = !DISubprogram(name: "wcstombs", scope: !305, file: !305, line: 936, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!693, !787, !788, !693}
!787 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !720)
!788 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !792, file: !659, line: 172)
!792 = !DISubprogram(name: "wctomb", scope: !305, file: !305, line: 929, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!49, !720, !743}
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !797, file: !659, line: 200)
!796 = !DINamespace(name: "__gnu_cxx", scope: null)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !305, line: 80, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !799, identifier: "_ZTS7lldiv_t")
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !798, file: !305, line: 78, baseType: !492, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !798, file: !305, line: 79, baseType: !492, size: 64, offset: 64)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !803, file: !659, line: 206)
!803 = !DISubprogram(name: "_Exit", scope: !305, file: !305, line: 629, type: !710, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !805, file: !659, line: 210)
!805 = !DISubprogram(name: "llabs", scope: !305, file: !305, line: 844, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!492, !492}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !809, file: !659, line: 216)
!809 = !DISubprogram(name: "lldiv", scope: !305, file: !305, line: 858, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!797, !492, !492}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !813, file: !659, line: 227)
!813 = !DISubprogram(name: "atoll", scope: !305, file: !305, line: 112, type: !814, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{!492, !548}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !817, file: !659, line: 228)
!817 = !DISubprogram(name: "strtoll", scope: !305, file: !305, line: 200, type: !818, flags: DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{!492, !744, !771, !49}
!820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !821, file: !659, line: 229)
!821 = !DISubprogram(name: "strtoull", scope: !305, file: !305, line: 205, type: !822, flags: DIFlagPrototyped, spFlags: 0)
!822 = !DISubroutineType(types: !823)
!823 = !{!824, !744, !771, !49}
!824 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !826, file: !659, line: 231)
!826 = !DISubprogram(name: "strtof", scope: !305, file: !305, line: 123, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!139, !744, !771}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !796, entity: !830, file: !659, line: 232)
!830 = !DISubprogram(name: "strtold", scope: !305, file: !305, line: 126, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!381, !744, !771}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !797, file: !659, line: 240)
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !803, file: !659, line: 242)
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !805, file: !659, line: 244)
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !837, file: !659, line: 245)
!837 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !796, file: !659, line: 213, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !809, file: !659, line: 246)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !813, file: !659, line: 248)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !826, file: !659, line: 249)
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !817, file: !659, line: 250)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !821, file: !659, line: 251)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !830, file: !659, line: 252)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !160, entity: !667, file: !845, line: 38)
!845 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
