; ModuleID = 'truetype.cpp'
source_filename = "truetype.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TTF_Methods", linkageName: "_ZN3pov11TTF_MethodsE", scope: !2, file: !3, line: 371, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "truetype.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !115, !121, !128, !130, !135, !140, !142, !144, !149, !154}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !65, !79}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !61, !62, !63}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !53, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !{!54, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !52, file: !5, line: 1018, baseType: !55, size: 1024)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !5, line: 693, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !58)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !{!59, !59}
!59 = !DISubrange(count: 4)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !5, line: 1019, baseType: !55, size: 1024, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !64, size: 32, offset: 928)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !68, identifier: "_ZTSN3pov10Ray_StructE")
!68 = !{!69, !72, !73, !74, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !67, file: !5, line: 1799, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !46)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !67, file: !5, line: 1800, baseType: !70, size: 192, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !67, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !67, file: !5, line: 1802, baseType: !64, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !67, file: !5, line: 1803, baseType: !76, size: 6400, offset: 448)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 100)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN3pov13istack_structE")
!82 = !{!83, !85, !113, !114}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !5, line: 1637, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !81, file: !5, line: 1638, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN3pov10istk_entryE")
!88 = !{!89, !90, !91, !92, !93, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !87, file: !5, line: 1612, baseType: !57, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !87, file: !5, line: 1613, baseType: !70, size: 192, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !87, file: !5, line: 1614, baseType: !70, size: 192, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !87, file: !5, line: 1615, baseType: !70, size: 192, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !87, file: !5, line: 1616, baseType: !94, size: 128, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !87, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !87, file: !5, line: 1630, baseType: !111, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !87, file: !5, line: 1632, baseType: !111, size: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !81, file: !5, line: 1639, baseType: !64, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !81, file: !5, line: 1640, baseType: !64, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!13, !120, !14}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !120, !14, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !87)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !123)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!111, !14}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !14, !120, !50}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !141, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !137)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !137)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !14, !50}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !14}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !151)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "TTFonts", linkageName: "_ZN3povL7TTFontsE", scope: !2, file: !3, line: 319, type: !158, isLocal: true, isDefinition: true)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontFileInfo", scope: !2, file: !3, line: 303, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FontFileInfoStruct", scope: !2, file: !3, line: 281, size: 1216, flags: DIFlagTypePassByValue, elements: !161, identifier: "_ZTSN3pov18FontFileInfoStructE")
!161 = !{!162, !165, !170, !175, !176, !178, !179, !180, !181, !184, !186, !218, !239, !240, !248, !249, !250, !251, !252, !253, !255, !256, !257, !258}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !160, file: !3, line: 283, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !160, file: !3, line: 284, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !169, file: !168, line: 122, flags: DIFlagFwdDecl)
!168 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !DINamespace(name: "pov_base", scope: null)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "platformID", scope: !160, file: !3, line: 285, baseType: !171, size: 64, offset: 128)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !174)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "USHORT", scope: !2, file: !3, line: 107, baseType: !173)
!173 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!174 = !{!59}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "specificID", scope: !160, file: !3, line: 286, baseType: !171, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cmap_table_offset", scope: !160, file: !3, line: 287, baseType: !177, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULONG", scope: !2, file: !3, line: 109, baseType: !64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "glyf_table_offset", scope: !160, file: !3, line: 288, baseType: !177, size: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "numGlyphs", scope: !160, file: !3, line: 289, baseType: !172, size: 16, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "unitsPerEm", scope: !160, file: !3, line: 290, baseType: !172, size: 16, offset: 336)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "indexToLocFormat", scope: !160, file: !3, line: 291, baseType: !182, size: 16, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHORT", scope: !2, file: !3, line: 106, baseType: !183)
!183 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "loca_table", scope: !160, file: !3, line: 292, baseType: !185, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !160, file: !3, line: 293, baseType: !187, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphPtr", scope: !2, file: !3, line: 235, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphStruct", scope: !2, file: !3, line: 238, size: 384, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTSN3pov11GlyphStructE")
!190 = !{!191, !200, !201, !214, !215, !216, !217}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !189, file: !3, line: 240, baseType: !192, size: 80)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphHeader", scope: !2, file: !3, line: 215, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 208, size: 80, flags: DIFlagTypePassByValue, elements: !194, identifier: "_ZTSN3pov11GlyphHeaderE")
!194 = !{!195, !196, !197, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "numContours", scope: !193, file: !3, line: 210, baseType: !182, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !193, file: !3, line: 211, baseType: !182, size: 16, offset: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !193, file: !3, line: 212, baseType: !182, size: 16, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !193, file: !3, line: 213, baseType: !182, size: 16, offset: 48)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !193, file: !3, line: 214, baseType: !182, size: 16, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_index", scope: !189, file: !3, line: 242, baseType: !172, size: 16, offset: 80)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !189, file: !3, line: 243, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "Contour", scope: !2, file: !3, line: 233, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 227, size: 256, flags: DIFlagTypePassByValue, elements: !205, identifier: "_ZTSN3pov7ContourE")
!205 = !{!206, !209, !210, !212, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inside_flag", scope: !204, file: !3, line: 229, baseType: !207, size: 8)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", scope: !2, file: !3, line: 105, baseType: !208)
!208 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !204, file: !3, line: 230, baseType: !172, size: 16, offset: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !3, line: 231, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !204, file: !3, line: 232, baseType: !120, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !204, file: !3, line: 232, baseType: !120, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "unitsPerEm", scope: !189, file: !3, line: 244, baseType: !172, size: 16, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !3, line: 245, baseType: !187, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !189, file: !3, line: 246, baseType: !172, size: 16, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "myMetrics", scope: !189, file: !3, line: 247, baseType: !172, size: 16, offset: 336)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "kerning_tables", scope: !160, file: !3, line: 294, baseType: !219, size: 128, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernTables", scope: !2, file: !3, line: 272, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernTableStruct", scope: !2, file: !3, line: 268, size: 128, flags: DIFlagTypePassByValue, elements: !221, identifier: "_ZTSN3pov15KernTableStructE")
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nTables", scope: !220, file: !3, line: 270, baseType: !172, size: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tables", scope: !220, file: !3, line: 271, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "TTKernTable", scope: !2, file: !3, line: 266, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernStruct", scope: !2, file: !3, line: 261, size: 128, flags: DIFlagTypePassByValue, elements: !227, identifier: "_ZTSN3pov10KernStructE")
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "coverage", scope: !226, file: !3, line: 263, baseType: !172, size: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nPairs", scope: !226, file: !3, line: 264, baseType: !172, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "kern_pairs", scope: !226, file: !3, line: 265, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernData", scope: !2, file: !3, line: 254, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernData_struct", scope: !2, file: !3, line: 250, size: 48, flags: DIFlagTypePassByValue, elements: !234, identifier: "_ZTSN3pov15KernData_structE")
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !233, file: !3, line: 252, baseType: !172, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !233, file: !3, line: 252, baseType: !172, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !233, file: !3, line: 253, baseType: !238, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "FWord", scope: !2, file: !3, line: 110, baseType: !183)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfHMetrics", scope: !160, file: !3, line: 295, baseType: !172, size: 16, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hmtx_table", scope: !160, file: !3, line: 296, baseType: !241, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "longHorMetric", scope: !2, file: !3, line: 278, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "longHorMertric", scope: !2, file: !3, line: 274, size: 32, flags: DIFlagTypePassByValue, elements: !244, identifier: "_ZTSN3pov14longHorMertricE")
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "advanceWidth", scope: !243, file: !3, line: 276, baseType: !246, size: 16)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uFWord", scope: !2, file: !3, line: 111, baseType: !173)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lsb", scope: !243, file: !3, line: 277, baseType: !238, size: 16, offset: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "glyphIDoffset", scope: !160, file: !3, line: 297, baseType: !177, size: 32, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "segCount", scope: !160, file: !3, line: 298, baseType: !172, size: 16, offset: 800)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "searchRange", scope: !160, file: !3, line: 298, baseType: !172, size: 16, offset: 816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "entrySelector", scope: !160, file: !3, line: 299, baseType: !172, size: 16, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rangeShift", scope: !160, file: !3, line: 299, baseType: !172, size: 16, offset: 848)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "startCount", scope: !160, file: !3, line: 300, baseType: !254, size: 64, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "endCount", scope: !160, file: !3, line: 300, baseType: !254, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "idDelta", scope: !160, file: !3, line: 301, baseType: !254, size: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "idRangeOffset", scope: !160, file: !3, line: 301, baseType: !254, size: 64, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !3, line: 302, baseType: !259, size: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "tag_TTCFontFile", linkageName: "_ZN3povL15tag_TTCFontFileE", scope: !2, file: !3, line: 317, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 40, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!264 = !{!265}
!265 = !DISubrange(count: 5)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "tag_CharToIndexMap", linkageName: "_ZN3povL18tag_CharToIndexMapE", scope: !2, file: !3, line: 309, type: !262, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "tag_GlyphData", linkageName: "_ZN3povL13tag_GlyphDataE", scope: !2, file: !3, line: 311, type: !262, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "tag_FontHeader", linkageName: "_ZN3povL14tag_FontHeaderE", scope: !2, file: !3, line: 310, type: !262, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "tag_IndexToLoc", linkageName: "_ZN3povL14tag_IndexToLocE", scope: !2, file: !3, line: 312, type: !262, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "tag_MaxProfile", linkageName: "_ZN3povL14tag_MaxProfileE", scope: !2, file: !3, line: 314, type: !262, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "tag_Kerning", linkageName: "_ZN3povL11tag_KerningE", scope: !2, file: !3, line: 313, type: !262, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "tag_HorizHeader", linkageName: "_ZN3povL15tag_HorizHeaderE", scope: !2, file: !3, line: 315, type: !262, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "tag_HorizMetric", linkageName: "_ZN3povL15tag_HorizMetricE", scope: !2, file: !3, line: 316, type: !262, isLocal: true, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !283, retainedTypes: !447, globals: !503, imports: !548, splitDebugInlining: false, nameTableKind: None)
!283 = !{!284, !290, !314, !320}
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !64, size: 32, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !169, file: !168, line: 51, baseType: !64, size: 32, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!292 = !DIEnumerator(name: "POV_File_Unknown", value: 0, isUnsigned: true)
!293 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2, isUnsigned: true)
!295 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3, isUnsigned: true)
!296 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4, isUnsigned: true)
!297 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5, isUnsigned: true)
!298 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6, isUnsigned: true)
!299 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7, isUnsigned: true)
!300 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8, isUnsigned: true)
!301 = !DIEnumerator(name: "POV_File_Image_System", value: 9, isUnsigned: true)
!302 = !DIEnumerator(name: "POV_File_Text_POV", value: 10, isUnsigned: true)
!303 = !DIEnumerator(name: "POV_File_Text_INC", value: 11, isUnsigned: true)
!304 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11, isUnsigned: true)
!305 = !DIEnumerator(name: "POV_File_Text_INI", value: 12, isUnsigned: true)
!306 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13, isUnsigned: true)
!307 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14, isUnsigned: true)
!308 = !DIEnumerator(name: "POV_File_Text_User", value: 15, isUnsigned: true)
!309 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16, isUnsigned: true)
!310 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17, isUnsigned: true)
!311 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18, isUnsigned: true)
!312 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19, isUnsigned: true)
!313 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20, isUnsigned: true)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !315, file: !168, line: 96, baseType: !64, size: 32, elements: !316, identifier: "_ZTSN8pov_base6IOBaseUt1_E")
!315 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !169, file: !168, line: 88, flags: DIFlagFwdDecl)
!316 = !{!317, !318, !319}
!317 = !DIEnumerator(name: "seek_set", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "seek_cur", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "seek_end", value: 2, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !321, line: 149, baseType: !64, size: 32, elements: !322, identifier: "_ZTSN3pov5STATSE")
!321 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!323 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!327 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!328 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!329 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!330 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!331 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!332 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!333 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!334 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!335 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!336 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!337 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!338 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!339 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!340 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!341 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!342 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!343 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!344 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!345 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!346 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!347 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!348 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!349 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!350 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!351 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!352 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!353 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!354 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!355 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!356 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!357 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!358 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!359 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!360 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!361 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!362 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!363 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!364 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!365 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!366 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!367 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!368 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!369 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!370 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!371 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!372 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!373 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!374 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!375 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!376 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!377 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!378 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!379 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!380 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!381 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!382 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!383 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!384 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!385 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!386 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!387 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!388 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!389 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!390 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!391 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!392 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!393 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!394 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!395 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!396 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!397 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!398 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!399 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!400 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!401 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!402 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!403 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!404 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!405 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!406 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!407 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!408 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!409 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!410 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!411 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!412 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!413 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!414 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!415 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!416 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!417 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!418 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!419 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!420 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!421 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!422 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!423 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!424 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!425 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!426 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!427 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!428 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!429 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!430 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!431 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!432 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!433 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!434 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!435 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!436 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!437 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!438 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!439 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!440 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!441 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!442 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!443 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!444 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!445 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!446 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!447 = !{!448, !64, !14, !111, !57, !238, !187, !163, !158, !177, !172, !185, !241, !224, !231, !13, !207, !254, !469, !211, !120, !480, !202, !482, !44}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSG", scope: !2, file: !450, line: 60, baseType: !451)
!450 = !DIFile(filename: "./csg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CSG_Struct", scope: !2, file: !450, line: 62, size: 1088, flags: DIFlagTypePassByValue, elements: !452, identifier: "_ZTSN3pov10CSG_StructE")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !451, file: !450, line: 64, baseType: !19, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !451, file: !450, line: 64, baseType: !13, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !451, file: !450, line: 64, baseType: !14, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !451, file: !450, line: 64, baseType: !23, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !451, file: !450, line: 64, baseType: !23, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !451, file: !450, line: 64, baseType: !28, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !451, file: !450, line: 64, baseType: !14, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !451, file: !450, line: 64, baseType: !14, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !451, file: !450, line: 64, baseType: !34, size: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !451, file: !450, line: 64, baseType: !38, size: 192, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !451, file: !450, line: 64, baseType: !50, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !451, file: !450, line: 64, baseType: !50, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !451, file: !450, line: 64, baseType: !45, size: 32, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !451, file: !450, line: 64, baseType: !64, size: 32, offset: 928)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !451, file: !450, line: 64, baseType: !14, size: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "do_split", scope: !451, file: !450, line: 65, baseType: !13, size: 32, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphOutline", scope: !2, file: !3, line: 225, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 217, size: 448, flags: DIFlagTypePassByValue, elements: !472, identifier: "_ZTSN3pov12GlyphOutlineE")
!472 = !{!473, !474, !475, !476, !477, !478, !479}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !471, file: !3, line: 219, baseType: !192, size: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !471, file: !3, line: 220, baseType: !172, size: 16, offset: 80)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "endPoints", scope: !471, file: !3, line: 221, baseType: !254, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !471, file: !3, line: 222, baseType: !211, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !471, file: !3, line: 223, baseType: !120, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !471, file: !3, line: 223, baseType: !120, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "myMetrics", scope: !471, file: !3, line: 224, baseType: !172, size: 16, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "Glyph", scope: !2, file: !3, line: 248, baseType: !189)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "TTF", scope: !2, file: !484, line: 50, baseType: !485)
!484 = !DIFile(filename: "./truetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrueTypeFont_Struct", scope: !2, file: !484, line: 52, size: 1088, flags: DIFlagTypePassByValue, elements: !486, identifier: "_ZTSN3pov19TrueTypeFont_StructE")
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !485, file: !484, line: 54, baseType: !19, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !485, file: !484, line: 54, baseType: !13, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !485, file: !484, line: 54, baseType: !14, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !485, file: !484, line: 54, baseType: !23, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !485, file: !484, line: 54, baseType: !23, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !485, file: !484, line: 54, baseType: !28, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !485, file: !484, line: 54, baseType: !14, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !485, file: !484, line: 54, baseType: !14, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !485, file: !484, line: 54, baseType: !34, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !485, file: !484, line: 54, baseType: !38, size: 192, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !485, file: !484, line: 54, baseType: !50, size: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !485, file: !484, line: 54, baseType: !50, size: 64, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !485, file: !484, line: 54, baseType: !45, size: 32, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !485, file: !484, line: 54, baseType: !64, size: 32, offset: 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !485, file: !484, line: 55, baseType: !111, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !485, file: !484, line: 56, baseType: !57, size: 64, offset: 1024)
!503 = !{!0, !504, !507, !509, !511, !513, !260, !266, !268, !270, !272, !274, !276, !278, !280, !156, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546}
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!505 = distinct !DIGlobalVariable(name: "KERN_HORIZONTAL", scope: !2, file: !3, line: 85, type: !506, isLocal: true, isDefinition: true)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!508 = distinct !DIGlobalVariable(name: "KERN_MINIMUM", scope: !2, file: !3, line: 86, type: !506, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!510 = distinct !DIGlobalVariable(name: "KERN_CROSS_STREAM", scope: !2, file: !3, line: 87, type: !506, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!512 = distinct !DIGlobalVariable(name: "KERN_OVERRIDE", scope: !2, file: !3, line: 88, type: !506, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!514 = distinct !DIGlobalVariable(name: "TTF_Tolerance", scope: !2, file: !3, line: 57, type: !515, isLocal: true, isDefinition: true)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!517 = distinct !DIGlobalVariable(name: "REPEAT_FLAGS", scope: !2, file: !3, line: 66, type: !506, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!519 = distinct !DIGlobalVariable(name: "XSHORT", scope: !2, file: !3, line: 64, type: !506, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!521 = distinct !DIGlobalVariable(name: "SHORT_X_IS_POS", scope: !2, file: !3, line: 67, type: !506, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!523 = distinct !DIGlobalVariable(name: "NEXT_X_IS_ZERO", scope: !2, file: !3, line: 68, type: !506, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!525 = distinct !DIGlobalVariable(name: "YSHORT", scope: !2, file: !3, line: 65, type: !506, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression(DW_OP_constu, 32, DW_OP_stack_value))
!527 = distinct !DIGlobalVariable(name: "SHORT_Y_IS_POS", scope: !2, file: !3, line: 69, type: !506, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression(DW_OP_constu, 32, DW_OP_stack_value))
!529 = distinct !DIGlobalVariable(name: "NEXT_Y_IS_ZERO", scope: !2, file: !3, line: 70, type: !506, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!531 = distinct !DIGlobalVariable(name: "ARG_1_AND_2_ARE_WORDS", scope: !2, file: !3, line: 73, type: !506, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!533 = distinct !DIGlobalVariable(name: "WE_HAVE_A_SCALE", scope: !2, file: !3, line: 76, type: !506, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression(DW_OP_constu, 64, DW_OP_stack_value))
!535 = distinct !DIGlobalVariable(name: "WE_HAVE_AN_X_AND_Y_SCALE", scope: !2, file: !3, line: 79, type: !506, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression(DW_OP_constu, 128, DW_OP_stack_value))
!537 = distinct !DIGlobalVariable(name: "WE_HAVE_A_TWO_BY_TWO", scope: !2, file: !3, line: 80, type: !506, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!539 = distinct !DIGlobalVariable(name: "ARGS_ARE_XY_VALUES", scope: !2, file: !3, line: 74, type: !506, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression(DW_OP_constu, 512, DW_OP_stack_value))
!541 = distinct !DIGlobalVariable(name: "USE_MY_METRICS", scope: !2, file: !3, line: 82, type: !506, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression(DW_OP_constu, 32, DW_OP_stack_value))
!543 = distinct !DIGlobalVariable(name: "MORE_COMPONENTS", scope: !2, file: !3, line: 78, type: !506, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!545 = distinct !DIGlobalVariable(name: "ONCURVE", scope: !2, file: !3, line: 63, type: !506, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression(DW_OP_constu, 4307583784117748259, DW_OP_stack_value))
!547 = distinct !DIGlobalVariable(name: "COEFF_LIMIT", scope: !2, file: !3, line: 60, type: !515, isLocal: true, isDefinition: true)
!548 = !{!549, !556, !562, !564, !566, !570, !572, !574, !576, !578, !580, !582, !584, !589, !593, !595, !597, !601, !603, !605, !607, !609, !611, !613, !616, !618, !620, !624, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !653, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !691, !695, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !721, !725, !729, !731, !733, !735, !740, !744, !748, !750, !752, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !777, !781, !785, !787, !789, !791, !797, !801, !805, !807, !809, !811, !813, !815, !817, !821, !825, !827, !829, !831, !833, !837, !841, !845, !847, !849, !851, !853, !855, !857, !861, !865, !869, !871, !875, !879, !881, !883, !885, !887, !889, !891, !897, !902, !906, !912, !916, !921, !923, !925, !929, !933, !946, !950, !954, !958, !962, !966, !970, !974, !978, !982, !990, !994, !998, !1000, !1004, !1008, !1012, !1018, !1022, !1026, !1028, !1036, !1040, !1047, !1049, !1053, !1057, !1061, !1065, !1070, !1074, !1078, !1079, !1080, !1081, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1152, !1158, !1162, !1168, !1172, !1176, !1180, !1184, !1186, !1188, !1192, !1196, !1200, !1204, !1208, !1210, !1212, !1214, !1218, !1222, !1226, !1228, !1230, !1231, !1233, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !1251, !1253, !1254, !1255, !1256, !1258, !1260, !1262, !1263, !1265, !1267, !1268}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !551, file: !555, line: 52)
!550 = !DINamespace(name: "std", scope: null)
!551 = !DISubprogram(name: "abs", scope: !552, file: !552, line: 840, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!553 = !DISubroutineType(types: !554)
!554 = !{!13, !13}
!555 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !557, file: !561, line: 83)
!557 = !DISubprogram(name: "acos", scope: !558, file: !558, line: 53, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!559 = !DISubroutineType(types: !560)
!560 = !{!57, !57}
!561 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !563, file: !561, line: 102)
!563 = !DISubprogram(name: "asin", scope: !558, file: !558, line: 55, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !565, file: !561, line: 121)
!565 = !DISubprogram(name: "atan", scope: !558, file: !558, line: 57, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !567, file: !561, line: 140)
!567 = !DISubprogram(name: "atan2", scope: !558, file: !558, line: 59, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{!57, !57, !57}
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !571, file: !561, line: 161)
!571 = !DISubprogram(name: "ceil", scope: !558, file: !558, line: 159, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !573, file: !561, line: 180)
!573 = !DISubprogram(name: "cos", scope: !558, file: !558, line: 62, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !575, file: !561, line: 199)
!575 = !DISubprogram(name: "cosh", scope: !558, file: !558, line: 71, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !577, file: !561, line: 218)
!577 = !DISubprogram(name: "exp", scope: !558, file: !558, line: 95, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !579, file: !561, line: 237)
!579 = !DISubprogram(name: "fabs", scope: !558, file: !558, line: 162, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !581, file: !561, line: 256)
!581 = !DISubprogram(name: "floor", scope: !558, file: !558, line: 165, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !583, file: !561, line: 275)
!583 = !DISubprogram(name: "fmod", scope: !558, file: !558, line: 168, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !585, file: !561, line: 296)
!585 = !DISubprogram(name: "frexp", scope: !558, file: !558, line: 98, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!57, !57, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !590, file: !561, line: 315)
!590 = !DISubprogram(name: "ldexp", scope: !558, file: !558, line: 101, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!57, !57, !13}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !594, file: !561, line: 334)
!594 = !DISubprogram(name: "log", scope: !558, file: !558, line: 104, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !596, file: !561, line: 353)
!596 = !DISubprogram(name: "log10", scope: !558, file: !558, line: 107, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !598, file: !561, line: 372)
!598 = !DISubprogram(name: "modf", scope: !558, file: !558, line: 110, type: !599, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!57, !57, !120}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !602, file: !561, line: 384)
!602 = !DISubprogram(name: "pow", scope: !558, file: !558, line: 140, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !604, file: !561, line: 421)
!604 = !DISubprogram(name: "sin", scope: !558, file: !558, line: 64, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !606, file: !561, line: 440)
!606 = !DISubprogram(name: "sinh", scope: !558, file: !558, line: 73, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !608, file: !561, line: 459)
!608 = !DISubprogram(name: "sqrt", scope: !558, file: !558, line: 143, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !610, file: !561, line: 478)
!610 = !DISubprogram(name: "tan", scope: !558, file: !558, line: 66, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !612, file: !561, line: 497)
!612 = !DISubprogram(name: "tanh", scope: !558, file: !558, line: 75, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !614, file: !561, line: 1065)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !615, line: 150, baseType: !57)
!615 = !DIFile(filename: "/usr/include/math.h", directory: "")
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !617, file: !561, line: 1066)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !615, line: 149, baseType: !45)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !619, file: !561, line: 1069)
!619 = !DISubprogram(name: "acosh", scope: !558, file: !558, line: 85, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !621, file: !561, line: 1070)
!621 = !DISubprogram(name: "acoshf", scope: !558, file: !558, line: 85, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{!45, !45}
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !625, file: !561, line: 1071)
!625 = !DISubprogram(name: "acoshl", scope: !558, file: !558, line: 85, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !628}
!628 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !630, file: !561, line: 1073)
!630 = !DISubprogram(name: "asinh", scope: !558, file: !558, line: 87, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !632, file: !561, line: 1074)
!632 = !DISubprogram(name: "asinhf", scope: !558, file: !558, line: 87, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !634, file: !561, line: 1075)
!634 = !DISubprogram(name: "asinhl", scope: !558, file: !558, line: 87, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !636, file: !561, line: 1077)
!636 = !DISubprogram(name: "atanh", scope: !558, file: !558, line: 89, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !638, file: !561, line: 1078)
!638 = !DISubprogram(name: "atanhf", scope: !558, file: !558, line: 89, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !640, file: !561, line: 1079)
!640 = !DISubprogram(name: "atanhl", scope: !558, file: !558, line: 89, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !642, file: !561, line: 1081)
!642 = !DISubprogram(name: "cbrt", scope: !558, file: !558, line: 152, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !644, file: !561, line: 1082)
!644 = !DISubprogram(name: "cbrtf", scope: !558, file: !558, line: 152, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !646, file: !561, line: 1083)
!646 = !DISubprogram(name: "cbrtl", scope: !558, file: !558, line: 152, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !648, file: !561, line: 1085)
!648 = !DISubprogram(name: "copysign", scope: !558, file: !558, line: 196, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !650, file: !561, line: 1086)
!650 = !DISubprogram(name: "copysignf", scope: !558, file: !558, line: 196, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!45, !45, !45}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !654, file: !561, line: 1087)
!654 = !DISubprogram(name: "copysignl", scope: !558, file: !558, line: 196, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!628, !628, !628}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !658, file: !561, line: 1089)
!658 = !DISubprogram(name: "erf", scope: !558, file: !558, line: 228, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !660, file: !561, line: 1090)
!660 = !DISubprogram(name: "erff", scope: !558, file: !558, line: 228, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !662, file: !561, line: 1091)
!662 = !DISubprogram(name: "erfl", scope: !558, file: !558, line: 228, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !664, file: !561, line: 1093)
!664 = !DISubprogram(name: "erfc", scope: !558, file: !558, line: 229, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !666, file: !561, line: 1094)
!666 = !DISubprogram(name: "erfcf", scope: !558, file: !558, line: 229, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !668, file: !561, line: 1095)
!668 = !DISubprogram(name: "erfcl", scope: !558, file: !558, line: 229, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !670, file: !561, line: 1097)
!670 = !DISubprogram(name: "exp2", scope: !558, file: !558, line: 130, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !672, file: !561, line: 1098)
!672 = !DISubprogram(name: "exp2f", scope: !558, file: !558, line: 130, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !674, file: !561, line: 1099)
!674 = !DISubprogram(name: "exp2l", scope: !558, file: !558, line: 130, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !676, file: !561, line: 1101)
!676 = !DISubprogram(name: "expm1", scope: !558, file: !558, line: 119, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !678, file: !561, line: 1102)
!678 = !DISubprogram(name: "expm1f", scope: !558, file: !558, line: 119, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !680, file: !561, line: 1103)
!680 = !DISubprogram(name: "expm1l", scope: !558, file: !558, line: 119, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !682, file: !561, line: 1105)
!682 = !DISubprogram(name: "fdim", scope: !558, file: !558, line: 326, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !684, file: !561, line: 1106)
!684 = !DISubprogram(name: "fdimf", scope: !558, file: !558, line: 326, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !686, file: !561, line: 1107)
!686 = !DISubprogram(name: "fdiml", scope: !558, file: !558, line: 326, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !688, file: !561, line: 1109)
!688 = !DISubprogram(name: "fma", scope: !558, file: !558, line: 335, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!57, !57, !57, !57}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !692, file: !561, line: 1110)
!692 = !DISubprogram(name: "fmaf", scope: !558, file: !558, line: 335, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{!45, !45, !45, !45}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !696, file: !561, line: 1111)
!696 = !DISubprogram(name: "fmal", scope: !558, file: !558, line: 335, type: !697, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DISubroutineType(types: !698)
!698 = !{!628, !628, !628, !628}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !700, file: !561, line: 1113)
!700 = !DISubprogram(name: "fmax", scope: !558, file: !558, line: 329, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !702, file: !561, line: 1114)
!702 = !DISubprogram(name: "fmaxf", scope: !558, file: !558, line: 329, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !704, file: !561, line: 1115)
!704 = !DISubprogram(name: "fmaxl", scope: !558, file: !558, line: 329, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !706, file: !561, line: 1117)
!706 = !DISubprogram(name: "fmin", scope: !558, file: !558, line: 332, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !708, file: !561, line: 1118)
!708 = !DISubprogram(name: "fminf", scope: !558, file: !558, line: 332, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !710, file: !561, line: 1119)
!710 = !DISubprogram(name: "fminl", scope: !558, file: !558, line: 332, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !712, file: !561, line: 1121)
!712 = !DISubprogram(name: "hypot", scope: !558, file: !558, line: 147, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !714, file: !561, line: 1122)
!714 = !DISubprogram(name: "hypotf", scope: !558, file: !558, line: 147, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !716, file: !561, line: 1123)
!716 = !DISubprogram(name: "hypotl", scope: !558, file: !558, line: 147, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !718, file: !561, line: 1125)
!718 = !DISubprogram(name: "ilogb", scope: !558, file: !558, line: 280, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!13, !57}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !722, file: !561, line: 1126)
!722 = !DISubprogram(name: "ilogbf", scope: !558, file: !558, line: 280, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!13, !45}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !726, file: !561, line: 1127)
!726 = !DISubprogram(name: "ilogbl", scope: !558, file: !558, line: 280, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!13, !628}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !730, file: !561, line: 1129)
!730 = !DISubprogram(name: "lgamma", scope: !558, file: !558, line: 230, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !732, file: !561, line: 1130)
!732 = !DISubprogram(name: "lgammaf", scope: !558, file: !558, line: 230, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !734, file: !561, line: 1131)
!734 = !DISubprogram(name: "lgammal", scope: !558, file: !558, line: 230, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !736, file: !561, line: 1134)
!736 = !DISubprogram(name: "llrint", scope: !558, file: !558, line: 316, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !57}
!739 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !741, file: !561, line: 1135)
!741 = !DISubprogram(name: "llrintf", scope: !558, file: !558, line: 316, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!739, !45}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !745, file: !561, line: 1136)
!745 = !DISubprogram(name: "llrintl", scope: !558, file: !558, line: 316, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!739, !628}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !749, file: !561, line: 1138)
!749 = !DISubprogram(name: "llround", scope: !558, file: !558, line: 322, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !751, file: !561, line: 1139)
!751 = !DISubprogram(name: "llroundf", scope: !558, file: !558, line: 322, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !753, file: !561, line: 1140)
!753 = !DISubprogram(name: "llroundl", scope: !558, file: !558, line: 322, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !755, file: !561, line: 1143)
!755 = !DISubprogram(name: "log1p", scope: !558, file: !558, line: 122, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !757, file: !561, line: 1144)
!757 = !DISubprogram(name: "log1pf", scope: !558, file: !558, line: 122, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !759, file: !561, line: 1145)
!759 = !DISubprogram(name: "log1pl", scope: !558, file: !558, line: 122, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !761, file: !561, line: 1147)
!761 = !DISubprogram(name: "log2", scope: !558, file: !558, line: 133, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !763, file: !561, line: 1148)
!763 = !DISubprogram(name: "log2f", scope: !558, file: !558, line: 133, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !765, file: !561, line: 1149)
!765 = !DISubprogram(name: "log2l", scope: !558, file: !558, line: 133, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !767, file: !561, line: 1151)
!767 = !DISubprogram(name: "logb", scope: !558, file: !558, line: 125, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !769, file: !561, line: 1152)
!769 = !DISubprogram(name: "logbf", scope: !558, file: !558, line: 125, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !771, file: !561, line: 1153)
!771 = !DISubprogram(name: "logbl", scope: !558, file: !558, line: 125, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !773, file: !561, line: 1155)
!773 = !DISubprogram(name: "lrint", scope: !558, file: !558, line: 314, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !57}
!776 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !778, file: !561, line: 1156)
!778 = !DISubprogram(name: "lrintf", scope: !558, file: !558, line: 314, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{!776, !45}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !782, file: !561, line: 1157)
!782 = !DISubprogram(name: "lrintl", scope: !558, file: !558, line: 314, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!776, !628}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !786, file: !561, line: 1159)
!786 = !DISubprogram(name: "lround", scope: !558, file: !558, line: 320, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !788, file: !561, line: 1160)
!788 = !DISubprogram(name: "lroundf", scope: !558, file: !558, line: 320, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !790, file: !561, line: 1161)
!790 = !DISubprogram(name: "lroundl", scope: !558, file: !558, line: 320, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !792, file: !561, line: 1163)
!792 = !DISubprogram(name: "nan", scope: !558, file: !558, line: 201, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!57, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !798, file: !561, line: 1164)
!798 = !DISubprogram(name: "nanf", scope: !558, file: !558, line: 201, type: !799, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DISubroutineType(types: !800)
!800 = !{!45, !795}
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !802, file: !561, line: 1165)
!802 = !DISubprogram(name: "nanl", scope: !558, file: !558, line: 201, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!628, !795}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !806, file: !561, line: 1167)
!806 = !DISubprogram(name: "nearbyint", scope: !558, file: !558, line: 294, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !808, file: !561, line: 1168)
!808 = !DISubprogram(name: "nearbyintf", scope: !558, file: !558, line: 294, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !810, file: !561, line: 1169)
!810 = !DISubprogram(name: "nearbyintl", scope: !558, file: !558, line: 294, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !812, file: !561, line: 1171)
!812 = !DISubprogram(name: "nextafter", scope: !558, file: !558, line: 259, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !814, file: !561, line: 1172)
!814 = !DISubprogram(name: "nextafterf", scope: !558, file: !558, line: 259, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !816, file: !561, line: 1173)
!816 = !DISubprogram(name: "nextafterl", scope: !558, file: !558, line: 259, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !818, file: !561, line: 1175)
!818 = !DISubprogram(name: "nexttoward", scope: !558, file: !558, line: 261, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!57, !57, !628}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !822, file: !561, line: 1176)
!822 = !DISubprogram(name: "nexttowardf", scope: !558, file: !558, line: 261, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!45, !45, !628}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !826, file: !561, line: 1177)
!826 = !DISubprogram(name: "nexttowardl", scope: !558, file: !558, line: 261, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !828, file: !561, line: 1179)
!828 = !DISubprogram(name: "remainder", scope: !558, file: !558, line: 272, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !830, file: !561, line: 1180)
!830 = !DISubprogram(name: "remainderf", scope: !558, file: !558, line: 272, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !832, file: !561, line: 1181)
!832 = !DISubprogram(name: "remainderl", scope: !558, file: !558, line: 272, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !834, file: !561, line: 1183)
!834 = !DISubprogram(name: "remquo", scope: !558, file: !558, line: 307, type: !835, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!57, !57, !57, !588}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !838, file: !561, line: 1184)
!838 = !DISubprogram(name: "remquof", scope: !558, file: !558, line: 307, type: !839, flags: DIFlagPrototyped, spFlags: 0)
!839 = !DISubroutineType(types: !840)
!840 = !{!45, !45, !45, !588}
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !842, file: !561, line: 1185)
!842 = !DISubprogram(name: "remquol", scope: !558, file: !558, line: 307, type: !843, flags: DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{!628, !628, !628, !588}
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !846, file: !561, line: 1187)
!846 = !DISubprogram(name: "rint", scope: !558, file: !558, line: 256, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !848, file: !561, line: 1188)
!848 = !DISubprogram(name: "rintf", scope: !558, file: !558, line: 256, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !850, file: !561, line: 1189)
!850 = !DISubprogram(name: "rintl", scope: !558, file: !558, line: 256, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !852, file: !561, line: 1191)
!852 = !DISubprogram(name: "round", scope: !558, file: !558, line: 298, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !854, file: !561, line: 1192)
!854 = !DISubprogram(name: "roundf", scope: !558, file: !558, line: 298, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !856, file: !561, line: 1193)
!856 = !DISubprogram(name: "roundl", scope: !558, file: !558, line: 298, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !858, file: !561, line: 1195)
!858 = !DISubprogram(name: "scalbln", scope: !558, file: !558, line: 290, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{!57, !57, !776}
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !862, file: !561, line: 1196)
!862 = !DISubprogram(name: "scalblnf", scope: !558, file: !558, line: 290, type: !863, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!45, !45, !776}
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !866, file: !561, line: 1197)
!866 = !DISubprogram(name: "scalblnl", scope: !558, file: !558, line: 290, type: !867, flags: DIFlagPrototyped, spFlags: 0)
!867 = !DISubroutineType(types: !868)
!868 = !{!628, !628, !776}
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !870, file: !561, line: 1199)
!870 = !DISubprogram(name: "scalbn", scope: !558, file: !558, line: 276, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !872, file: !561, line: 1200)
!872 = !DISubprogram(name: "scalbnf", scope: !558, file: !558, line: 276, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!45, !45, !13}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !876, file: !561, line: 1201)
!876 = !DISubprogram(name: "scalbnl", scope: !558, file: !558, line: 276, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!628, !628, !13}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !880, file: !561, line: 1203)
!880 = !DISubprogram(name: "tgamma", scope: !558, file: !558, line: 235, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !882, file: !561, line: 1204)
!882 = !DISubprogram(name: "tgammaf", scope: !558, file: !558, line: 235, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !884, file: !561, line: 1205)
!884 = !DISubprogram(name: "tgammal", scope: !558, file: !558, line: 235, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !886, file: !561, line: 1207)
!886 = !DISubprogram(name: "trunc", scope: !558, file: !558, line: 302, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !888, file: !561, line: 1208)
!888 = !DISubprogram(name: "truncf", scope: !558, file: !558, line: 302, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !890, file: !561, line: 1209)
!890 = !DISubprogram(name: "truncl", scope: !558, file: !558, line: 302, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !282, entity: !892, file: !896, line: 38)
!892 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !550, file: !555, line: 103, type: !893, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !895}
!895 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!896 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !282, entity: !898, file: !896, line: 54)
!898 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !550, file: !561, line: 380, type: !899, flags: DIFlagPrototyped, spFlags: 0)
!899 = !DISubroutineType(types: !900)
!900 = !{!628, !628, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !903, file: !905, line: 127)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !552, line: 62, baseType: !904)
!904 = !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!905 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !907, file: !905, line: 128)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !552, line: 70, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !909, identifier: "_ZTS6ldiv_t")
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !908, file: !552, line: 68, baseType: !776, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !908, file: !552, line: 69, baseType: !776, size: 64, offset: 64)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !913, file: !905, line: 130)
!913 = !DISubprogram(name: "abort", scope: !552, file: !552, line: 591, type: !914, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!914 = !DISubroutineType(types: !915)
!915 = !{null}
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !917, file: !905, line: 134)
!917 = !DISubprogram(name: "atexit", scope: !552, file: !552, line: 595, type: !918, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DISubroutineType(types: !919)
!919 = !{!13, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!921 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !922, file: !905, line: 137)
!922 = !DISubprogram(name: "at_quick_exit", scope: !552, file: !552, line: 600, type: !918, flags: DIFlagPrototyped, spFlags: 0)
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !924, file: !905, line: 140)
!924 = !DISubprogram(name: "atof", scope: !552, file: !552, line: 101, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !926, file: !905, line: 141)
!926 = !DISubprogram(name: "atoi", scope: !552, file: !552, line: 104, type: !927, flags: DIFlagPrototyped, spFlags: 0)
!927 = !DISubroutineType(types: !928)
!928 = !{!13, !795}
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !930, file: !905, line: 142)
!930 = !DISubprogram(name: "atol", scope: !552, file: !552, line: 107, type: !931, flags: DIFlagPrototyped, spFlags: 0)
!931 = !DISubroutineType(types: !932)
!932 = !{!776, !795}
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !934, file: !905, line: 143)
!934 = !DISubprogram(name: "bsearch", scope: !552, file: !552, line: 820, type: !935, flags: DIFlagPrototyped, spFlags: 0)
!935 = !DISubroutineType(types: !936)
!936 = !{!111, !937, !937, !939, !939, !942}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !940, line: 46, baseType: !941)
!940 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!941 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !552, line: 808, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!13, !937, !937}
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !947, file: !905, line: 144)
!947 = !DISubprogram(name: "calloc", scope: !552, file: !552, line: 542, type: !948, flags: DIFlagPrototyped, spFlags: 0)
!948 = !DISubroutineType(types: !949)
!949 = !{!111, !939, !939}
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !951, file: !905, line: 145)
!951 = !DISubprogram(name: "div", scope: !552, file: !552, line: 852, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!903, !13, !13}
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !955, file: !905, line: 146)
!955 = !DISubprogram(name: "exit", scope: !552, file: !552, line: 617, type: !956, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !13}
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !959, file: !905, line: 147)
!959 = !DISubprogram(name: "free", scope: !552, file: !552, line: 565, type: !960, flags: DIFlagPrototyped, spFlags: 0)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !111}
!962 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !550, entity: !963, file: !905, line: 148)
