; ModuleID = 'point.cpp'
source_filename = "point.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Light_Source_Methods", linkageName: "_ZN3pov20Light_Source_MethodsE", scope: !2, file: !3, line: 75, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "point.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !171, !177, !184, !186, !191, !196, !198, !200, !205, !210}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !123, !135}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !118, !119, !120, !121, !122}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, size: 3456, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !59, !63, !64, !65, !67, !68, !73, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !89, !90, !91, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !106, !107, !111}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !36, file: !5, line: 1582, baseType: !19, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !36, file: !5, line: 1582, baseType: !13, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !36, file: !5, line: 1582, baseType: !23, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !36, file: !5, line: 1582, baseType: !23, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !36, file: !5, line: 1582, baseType: !28, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !36, file: !5, line: 1582, baseType: !34, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !36, file: !5, line: 1582, baseType: !48, size: 192, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !50, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !49, file: !5, line: 892, baseType: !52, size: 96)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 96, elements: !56)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !55)
!55 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!56 = !{!57}
!57 = !DISubrange(count: 3)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !49, file: !5, line: 892, baseType: !52, size: 96, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !36, file: !5, line: 1582, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !36, file: !5, line: 1582, baseType: !60, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !36, file: !5, line: 1582, baseType: !55, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !36, file: !5, line: 1582, baseType: !66, size: 32, offset: 928)
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !36, file: !5, line: 1583, baseType: !69, size: 160, offset: 1024)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !5, line: 695, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 5)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1216)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !56)
!76 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1600)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1792)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1984)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2176)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2240)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2304)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !36, file: !5, line: 1586, baseType: !76, size: 64, offset: 2368)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !36, file: !5, line: 1586, baseType: !76, size: 64, offset: 2432)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !36, file: !5, line: 1587, baseType: !34, size: 64, offset: 2496)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2560)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2568)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !36, file: !5, line: 1589, baseType: !92, size: 8, offset: 2584)
!92 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !36, file: !5, line: 1590, baseType: !92, size: 8, offset: 2592)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !36, file: !5, line: 1591, baseType: !88, size: 8, offset: 2600)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !36, file: !5, line: 1591, baseType: !88, size: 8, offset: 2608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !36, file: !5, line: 1592, baseType: !88, size: 8, offset: 2616)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !36, file: !5, line: 1593, baseType: !13, size: 32, offset: 2624)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !36, file: !5, line: 1593, baseType: !13, size: 32, offset: 2656)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !36, file: !5, line: 1594, baseType: !13, size: 32, offset: 2688)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !36, file: !5, line: 1595, baseType: !13, size: 32, offset: 2720)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !36, file: !5, line: 1596, baseType: !13, size: 32, offset: 2752)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !36, file: !5, line: 1597, baseType: !103, size: 64, offset: 2816)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !36, file: !5, line: 1598, baseType: !14, size: 64, offset: 2880)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !36, file: !5, line: 1598, baseType: !14, size: 64, offset: 2944)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !36, file: !5, line: 1599, baseType: !108, size: 64, offset: 3008)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !5, line: 1033, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !5, line: 1059, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Blend_Map_StructE")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !36, file: !5, line: 1600, baseType: !112, size: 384, offset: 3072)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 384, elements: !116)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !2, file: !5, line: 1557, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !2, file: !5, line: 1571, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!116 = !{!117}
!117 = !DISubrange(count: 6)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !48, size: 192, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !60, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !60, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !55, size: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !66, size: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !126, identifier: "_ZTSN3pov10Ray_StructE")
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !125, file: !5, line: 1799, baseType: !74, size: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !125, file: !5, line: 1800, baseType: !74, size: 192, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !125, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !125, file: !5, line: 1802, baseType: !66, size: 32, offset: 416)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !125, file: !5, line: 1803, baseType: !132, size: 6400, offset: 448)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 100)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !138, identifier: "_ZTSN3pov13istack_structE")
!138 = !{!139, !141, !169, !170}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !5, line: 1637, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !137, file: !5, line: 1638, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !144, identifier: "_ZTSN3pov10istk_entryE")
!144 = !{!145, !146, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !143, file: !5, line: 1612, baseType: !76, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !143, file: !5, line: 1613, baseType: !74, size: 192, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !143, file: !5, line: 1614, baseType: !74, size: 192, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !143, file: !5, line: 1615, baseType: !74, size: 192, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !143, file: !5, line: 1616, baseType: !150, size: 128, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !143, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !143, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !143, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !143, file: !5, line: 1625, baseType: !76, size: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !143, file: !5, line: 1625, baseType: !76, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !143, file: !5, line: 1626, baseType: !76, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !143, file: !5, line: 1626, baseType: !76, size: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !143, file: !5, line: 1627, baseType: !76, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !143, file: !5, line: 1627, baseType: !76, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !143, file: !5, line: 1630, baseType: !167, size: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !143, file: !5, line: 1632, baseType: !167, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !137, file: !5, line: 1639, baseType: !66, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !137, file: !5, line: 1640, baseType: !66, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!13, !176, !14}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !176, !14, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !143)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !179)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!167, !14}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !14, !176, !60}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !193)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !199, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !193)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !201, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !14, !60}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !206, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !14}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !211, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !207)
!212 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !227, globals: !228, imports: !229, splitDebugInlining: false, nameTableKind: None)
!213 = !{!214, !220}
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !66, size: 32, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 715, baseType: !66, size: 32, elements: !221)
!221 = !{!222, !223, !224, !225, !226}
!222 = !DIEnumerator(name: "pRED", value: 0, isUnsigned: true)
!223 = !DIEnumerator(name: "pGREEN", value: 1, isUnsigned: true)
!224 = !DIEnumerator(name: "pBLUE", value: 2, isUnsigned: true)
!225 = !DIEnumerator(name: "pFILTER", value: 3, isUnsigned: true)
!226 = !DIEnumerator(name: "pTRANSM", value: 4, isUnsigned: true)
!227 = !{!34, !103, !104, !54, !167}
!228 = !{!0}
!229 = !{!230, !237, !243, !245, !247, !251, !253, !255, !257, !259, !261, !263, !265, !270, !274, !276, !278, !282, !284, !286, !288, !290, !292, !294, !297, !299, !301, !305, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !334, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !372, !376, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !402, !406, !410, !412, !414, !416, !421, !425, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !458, !462, !466, !468, !470, !472, !479, !483, !487, !489, !491, !493, !495, !497, !499, !503, !507, !509, !511, !513, !515, !519, !523, !527, !529, !531, !533, !535, !537, !539, !543, !547, !551, !553, !557, !561, !563, !565, !567, !569, !571, !573, !579, !584, !588, !594, !598, !603, !605, !607, !611, !615, !628, !632, !636, !640, !644, !649, !653, !657, !661, !665, !673, !677, !681, !683, !687, !691, !695, !701, !705, !709, !711, !719, !723, !730, !732, !736, !740, !744, !748, !753, !757, !761, !762, !763, !764, !766, !767, !768, !769, !770, !771, !772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !841, !845, !851, !855, !859, !863, !867, !869, !871, !875, !879, !883, !887, !891, !893, !895, !897, !901, !905, !909, !911, !913, !916, !918, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !943, !945, !947, !949, !950, !951}
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !232, file: !236, line: 52)
!231 = !DINamespace(name: "std", scope: null)
!232 = !DISubprogram(name: "abs", scope: !233, file: !233, line: 840, type: !234, flags: DIFlagPrototyped, spFlags: 0)
!233 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!234 = !DISubroutineType(types: !235)
!235 = !{!13, !13}
!236 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !238, file: !242, line: 83)
!238 = !DISubprogram(name: "acos", scope: !239, file: !239, line: 53, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!239 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!240 = !DISubroutineType(types: !241)
!241 = !{!76, !76}
!242 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !244, file: !242, line: 102)
!244 = !DISubprogram(name: "asin", scope: !239, file: !239, line: 55, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !246, file: !242, line: 121)
!246 = !DISubprogram(name: "atan", scope: !239, file: !239, line: 57, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !248, file: !242, line: 140)
!248 = !DISubprogram(name: "atan2", scope: !239, file: !239, line: 59, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!249 = !DISubroutineType(types: !250)
!250 = !{!76, !76, !76}
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !252, file: !242, line: 161)
!252 = !DISubprogram(name: "ceil", scope: !239, file: !239, line: 159, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !254, file: !242, line: 180)
!254 = !DISubprogram(name: "cos", scope: !239, file: !239, line: 62, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !256, file: !242, line: 199)
!256 = !DISubprogram(name: "cosh", scope: !239, file: !239, line: 71, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !258, file: !242, line: 218)
!258 = !DISubprogram(name: "exp", scope: !239, file: !239, line: 95, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !260, file: !242, line: 237)
!260 = !DISubprogram(name: "fabs", scope: !239, file: !239, line: 162, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !262, file: !242, line: 256)
!262 = !DISubprogram(name: "floor", scope: !239, file: !239, line: 165, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !264, file: !242, line: 275)
!264 = !DISubprogram(name: "fmod", scope: !239, file: !239, line: 168, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !266, file: !242, line: 296)
!266 = !DISubprogram(name: "frexp", scope: !239, file: !239, line: 98, type: !267, flags: DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{!76, !76, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !271, file: !242, line: 315)
!271 = !DISubprogram(name: "ldexp", scope: !239, file: !239, line: 101, type: !272, flags: DIFlagPrototyped, spFlags: 0)
!272 = !DISubroutineType(types: !273)
!273 = !{!76, !76, !13}
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !275, file: !242, line: 334)
!275 = !DISubprogram(name: "log", scope: !239, file: !239, line: 104, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !277, file: !242, line: 353)
!277 = !DISubprogram(name: "log10", scope: !239, file: !239, line: 107, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !279, file: !242, line: 372)
!279 = !DISubprogram(name: "modf", scope: !239, file: !239, line: 110, type: !280, flags: DIFlagPrototyped, spFlags: 0)
!280 = !DISubroutineType(types: !281)
!281 = !{!76, !76, !176}
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !283, file: !242, line: 384)
!283 = !DISubprogram(name: "pow", scope: !239, file: !239, line: 140, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !285, file: !242, line: 421)
!285 = !DISubprogram(name: "sin", scope: !239, file: !239, line: 64, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !287, file: !242, line: 440)
!287 = !DISubprogram(name: "sinh", scope: !239, file: !239, line: 73, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !289, file: !242, line: 459)
!289 = !DISubprogram(name: "sqrt", scope: !239, file: !239, line: 143, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !291, file: !242, line: 478)
!291 = !DISubprogram(name: "tan", scope: !239, file: !239, line: 66, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !293, file: !242, line: 497)
!293 = !DISubprogram(name: "tanh", scope: !239, file: !239, line: 75, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !295, file: !242, line: 1065)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !296, line: 150, baseType: !76)
!296 = !DIFile(filename: "/usr/include/math.h", directory: "")
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !298, file: !242, line: 1066)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !296, line: 149, baseType: !55)
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !300, file: !242, line: 1069)
!300 = !DISubprogram(name: "acosh", scope: !239, file: !239, line: 85, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !302, file: !242, line: 1070)
!302 = !DISubprogram(name: "acoshf", scope: !239, file: !239, line: 85, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{!55, !55}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !306, file: !242, line: 1071)
!306 = !DISubprogram(name: "acoshl", scope: !239, file: !239, line: 85, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !309}
!309 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !311, file: !242, line: 1073)
!311 = !DISubprogram(name: "asinh", scope: !239, file: !239, line: 87, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !313, file: !242, line: 1074)
!313 = !DISubprogram(name: "asinhf", scope: !239, file: !239, line: 87, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !315, file: !242, line: 1075)
!315 = !DISubprogram(name: "asinhl", scope: !239, file: !239, line: 87, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !317, file: !242, line: 1077)
!317 = !DISubprogram(name: "atanh", scope: !239, file: !239, line: 89, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !319, file: !242, line: 1078)
!319 = !DISubprogram(name: "atanhf", scope: !239, file: !239, line: 89, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !321, file: !242, line: 1079)
!321 = !DISubprogram(name: "atanhl", scope: !239, file: !239, line: 89, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !323, file: !242, line: 1081)
!323 = !DISubprogram(name: "cbrt", scope: !239, file: !239, line: 152, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !325, file: !242, line: 1082)
!325 = !DISubprogram(name: "cbrtf", scope: !239, file: !239, line: 152, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !327, file: !242, line: 1083)
!327 = !DISubprogram(name: "cbrtl", scope: !239, file: !239, line: 152, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !329, file: !242, line: 1085)
!329 = !DISubprogram(name: "copysign", scope: !239, file: !239, line: 196, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !331, file: !242, line: 1086)
!331 = !DISubprogram(name: "copysignf", scope: !239, file: !239, line: 196, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!55, !55, !55}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !335, file: !242, line: 1087)
!335 = !DISubprogram(name: "copysignl", scope: !239, file: !239, line: 196, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DISubroutineType(types: !337)
!337 = !{!309, !309, !309}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !339, file: !242, line: 1089)
!339 = !DISubprogram(name: "erf", scope: !239, file: !239, line: 228, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !341, file: !242, line: 1090)
!341 = !DISubprogram(name: "erff", scope: !239, file: !239, line: 228, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !343, file: !242, line: 1091)
!343 = !DISubprogram(name: "erfl", scope: !239, file: !239, line: 228, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !345, file: !242, line: 1093)
!345 = !DISubprogram(name: "erfc", scope: !239, file: !239, line: 229, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !347, file: !242, line: 1094)
!347 = !DISubprogram(name: "erfcf", scope: !239, file: !239, line: 229, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !349, file: !242, line: 1095)
!349 = !DISubprogram(name: "erfcl", scope: !239, file: !239, line: 229, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !351, file: !242, line: 1097)
!351 = !DISubprogram(name: "exp2", scope: !239, file: !239, line: 130, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !353, file: !242, line: 1098)
!353 = !DISubprogram(name: "exp2f", scope: !239, file: !239, line: 130, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !355, file: !242, line: 1099)
!355 = !DISubprogram(name: "exp2l", scope: !239, file: !239, line: 130, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !357, file: !242, line: 1101)
!357 = !DISubprogram(name: "expm1", scope: !239, file: !239, line: 119, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !359, file: !242, line: 1102)
!359 = !DISubprogram(name: "expm1f", scope: !239, file: !239, line: 119, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !361, file: !242, line: 1103)
!361 = !DISubprogram(name: "expm1l", scope: !239, file: !239, line: 119, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !363, file: !242, line: 1105)
!363 = !DISubprogram(name: "fdim", scope: !239, file: !239, line: 326, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !365, file: !242, line: 1106)
!365 = !DISubprogram(name: "fdimf", scope: !239, file: !239, line: 326, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !367, file: !242, line: 1107)
!367 = !DISubprogram(name: "fdiml", scope: !239, file: !239, line: 326, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !369, file: !242, line: 1109)
!369 = !DISubprogram(name: "fma", scope: !239, file: !239, line: 335, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!76, !76, !76, !76}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !373, file: !242, line: 1110)
!373 = !DISubprogram(name: "fmaf", scope: !239, file: !239, line: 335, type: !374, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{!55, !55, !55, !55}
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !377, file: !242, line: 1111)
!377 = !DISubprogram(name: "fmal", scope: !239, file: !239, line: 335, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!309, !309, !309, !309}
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !381, file: !242, line: 1113)
!381 = !DISubprogram(name: "fmax", scope: !239, file: !239, line: 329, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !383, file: !242, line: 1114)
!383 = !DISubprogram(name: "fmaxf", scope: !239, file: !239, line: 329, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !385, file: !242, line: 1115)
!385 = !DISubprogram(name: "fmaxl", scope: !239, file: !239, line: 329, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !387, file: !242, line: 1117)
!387 = !DISubprogram(name: "fmin", scope: !239, file: !239, line: 332, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !389, file: !242, line: 1118)
!389 = !DISubprogram(name: "fminf", scope: !239, file: !239, line: 332, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !391, file: !242, line: 1119)
!391 = !DISubprogram(name: "fminl", scope: !239, file: !239, line: 332, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !393, file: !242, line: 1121)
!393 = !DISubprogram(name: "hypot", scope: !239, file: !239, line: 147, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !395, file: !242, line: 1122)
!395 = !DISubprogram(name: "hypotf", scope: !239, file: !239, line: 147, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !397, file: !242, line: 1123)
!397 = !DISubprogram(name: "hypotl", scope: !239, file: !239, line: 147, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !399, file: !242, line: 1125)
!399 = !DISubprogram(name: "ilogb", scope: !239, file: !239, line: 280, type: !400, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{!13, !76}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !403, file: !242, line: 1126)
!403 = !DISubprogram(name: "ilogbf", scope: !239, file: !239, line: 280, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{!13, !55}
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !407, file: !242, line: 1127)
!407 = !DISubprogram(name: "ilogbl", scope: !239, file: !239, line: 280, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!13, !309}
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !411, file: !242, line: 1129)
!411 = !DISubprogram(name: "lgamma", scope: !239, file: !239, line: 230, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !413, file: !242, line: 1130)
!413 = !DISubprogram(name: "lgammaf", scope: !239, file: !239, line: 230, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !415, file: !242, line: 1131)
!415 = !DISubprogram(name: "lgammal", scope: !239, file: !239, line: 230, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !417, file: !242, line: 1134)
!417 = !DISubprogram(name: "llrint", scope: !239, file: !239, line: 316, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !76}
!420 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !422, file: !242, line: 1135)
!422 = !DISubprogram(name: "llrintf", scope: !239, file: !239, line: 316, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!420, !55}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !426, file: !242, line: 1136)
!426 = !DISubprogram(name: "llrintl", scope: !239, file: !239, line: 316, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!420, !309}
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !430, file: !242, line: 1138)
!430 = !DISubprogram(name: "llround", scope: !239, file: !239, line: 322, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !432, file: !242, line: 1139)
!432 = !DISubprogram(name: "llroundf", scope: !239, file: !239, line: 322, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !434, file: !242, line: 1140)
!434 = !DISubprogram(name: "llroundl", scope: !239, file: !239, line: 322, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !436, file: !242, line: 1143)
!436 = !DISubprogram(name: "log1p", scope: !239, file: !239, line: 122, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !438, file: !242, line: 1144)
!438 = !DISubprogram(name: "log1pf", scope: !239, file: !239, line: 122, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !440, file: !242, line: 1145)
!440 = !DISubprogram(name: "log1pl", scope: !239, file: !239, line: 122, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !442, file: !242, line: 1147)
!442 = !DISubprogram(name: "log2", scope: !239, file: !239, line: 133, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !444, file: !242, line: 1148)
!444 = !DISubprogram(name: "log2f", scope: !239, file: !239, line: 133, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !446, file: !242, line: 1149)
!446 = !DISubprogram(name: "log2l", scope: !239, file: !239, line: 133, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !448, file: !242, line: 1151)
!448 = !DISubprogram(name: "logb", scope: !239, file: !239, line: 125, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !450, file: !242, line: 1152)
!450 = !DISubprogram(name: "logbf", scope: !239, file: !239, line: 125, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !452, file: !242, line: 1153)
!452 = !DISubprogram(name: "logbl", scope: !239, file: !239, line: 125, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !454, file: !242, line: 1155)
!454 = !DISubprogram(name: "lrint", scope: !239, file: !239, line: 314, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !76}
!457 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !459, file: !242, line: 1156)
!459 = !DISubprogram(name: "lrintf", scope: !239, file: !239, line: 314, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!457, !55}
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !463, file: !242, line: 1157)
!463 = !DISubprogram(name: "lrintl", scope: !239, file: !239, line: 314, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{!457, !309}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !467, file: !242, line: 1159)
!467 = !DISubprogram(name: "lround", scope: !239, file: !239, line: 320, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !469, file: !242, line: 1160)
!469 = !DISubprogram(name: "lroundf", scope: !239, file: !239, line: 320, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !471, file: !242, line: 1161)
!471 = !DISubprogram(name: "lroundl", scope: !239, file: !239, line: 320, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !473, file: !242, line: 1163)
!473 = !DISubprogram(name: "nan", scope: !239, file: !239, line: 201, type: !474, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!76, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !480, file: !242, line: 1164)
!480 = !DISubprogram(name: "nanf", scope: !239, file: !239, line: 201, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!55, !476}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !484, file: !242, line: 1165)
!484 = !DISubprogram(name: "nanl", scope: !239, file: !239, line: 201, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!309, !476}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !488, file: !242, line: 1167)
!488 = !DISubprogram(name: "nearbyint", scope: !239, file: !239, line: 294, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !490, file: !242, line: 1168)
!490 = !DISubprogram(name: "nearbyintf", scope: !239, file: !239, line: 294, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !492, file: !242, line: 1169)
!492 = !DISubprogram(name: "nearbyintl", scope: !239, file: !239, line: 294, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !494, file: !242, line: 1171)
!494 = !DISubprogram(name: "nextafter", scope: !239, file: !239, line: 259, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !496, file: !242, line: 1172)
!496 = !DISubprogram(name: "nextafterf", scope: !239, file: !239, line: 259, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !498, file: !242, line: 1173)
!498 = !DISubprogram(name: "nextafterl", scope: !239, file: !239, line: 259, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !500, file: !242, line: 1175)
!500 = !DISubprogram(name: "nexttoward", scope: !239, file: !239, line: 261, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!76, !76, !309}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !504, file: !242, line: 1176)
!504 = !DISubprogram(name: "nexttowardf", scope: !239, file: !239, line: 261, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!55, !55, !309}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !508, file: !242, line: 1177)
!508 = !DISubprogram(name: "nexttowardl", scope: !239, file: !239, line: 261, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !510, file: !242, line: 1179)
!510 = !DISubprogram(name: "remainder", scope: !239, file: !239, line: 272, type: !249, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !512, file: !242, line: 1180)
!512 = !DISubprogram(name: "remainderf", scope: !239, file: !239, line: 272, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !514, file: !242, line: 1181)
!514 = !DISubprogram(name: "remainderl", scope: !239, file: !239, line: 272, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !516, file: !242, line: 1183)
!516 = !DISubprogram(name: "remquo", scope: !239, file: !239, line: 307, type: !517, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{!76, !76, !76, !269}
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !520, file: !242, line: 1184)
!520 = !DISubprogram(name: "remquof", scope: !239, file: !239, line: 307, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{!55, !55, !55, !269}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !524, file: !242, line: 1185)
!524 = !DISubprogram(name: "remquol", scope: !239, file: !239, line: 307, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!309, !309, !309, !269}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !528, file: !242, line: 1187)
!528 = !DISubprogram(name: "rint", scope: !239, file: !239, line: 256, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !530, file: !242, line: 1188)
!530 = !DISubprogram(name: "rintf", scope: !239, file: !239, line: 256, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !532, file: !242, line: 1189)
!532 = !DISubprogram(name: "rintl", scope: !239, file: !239, line: 256, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !534, file: !242, line: 1191)
!534 = !DISubprogram(name: "round", scope: !239, file: !239, line: 298, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !536, file: !242, line: 1192)
!536 = !DISubprogram(name: "roundf", scope: !239, file: !239, line: 298, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !538, file: !242, line: 1193)
!538 = !DISubprogram(name: "roundl", scope: !239, file: !239, line: 298, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !540, file: !242, line: 1195)
!540 = !DISubprogram(name: "scalbln", scope: !239, file: !239, line: 290, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!76, !76, !457}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !544, file: !242, line: 1196)
!544 = !DISubprogram(name: "scalblnf", scope: !239, file: !239, line: 290, type: !545, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{!55, !55, !457}
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !548, file: !242, line: 1197)
!548 = !DISubprogram(name: "scalblnl", scope: !239, file: !239, line: 290, type: !549, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!309, !309, !457}
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !552, file: !242, line: 1199)
!552 = !DISubprogram(name: "scalbn", scope: !239, file: !239, line: 276, type: !272, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !554, file: !242, line: 1200)
!554 = !DISubprogram(name: "scalbnf", scope: !239, file: !239, line: 276, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!55, !55, !13}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !558, file: !242, line: 1201)
!558 = !DISubprogram(name: "scalbnl", scope: !239, file: !239, line: 276, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DISubroutineType(types: !560)
!560 = !{!309, !309, !13}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !562, file: !242, line: 1203)
!562 = !DISubprogram(name: "tgamma", scope: !239, file: !239, line: 235, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !564, file: !242, line: 1204)
!564 = !DISubprogram(name: "tgammaf", scope: !239, file: !239, line: 235, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !566, file: !242, line: 1205)
!566 = !DISubprogram(name: "tgammal", scope: !239, file: !239, line: 235, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !568, file: !242, line: 1207)
!568 = !DISubprogram(name: "trunc", scope: !239, file: !239, line: 302, type: !240, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !570, file: !242, line: 1208)
!570 = !DISubprogram(name: "truncf", scope: !239, file: !239, line: 302, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !572, file: !242, line: 1209)
!572 = !DISubprogram(name: "truncl", scope: !239, file: !239, line: 302, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !212, entity: !574, file: !578, line: 38)
!574 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !231, file: !236, line: 103, type: !575, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !577}
!577 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!578 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !212, entity: !580, file: !578, line: 54)
!580 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !231, file: !242, line: 380, type: !581, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{!309, !309, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !585, file: !587, line: 127)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !233, line: 62, baseType: !586)
!586 = !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!587 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !589, file: !587, line: 128)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !233, line: 70, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !591, identifier: "_ZTS6ldiv_t")
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !590, file: !233, line: 68, baseType: !457, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !590, file: !233, line: 69, baseType: !457, size: 64, offset: 64)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !595, file: !587, line: 130)
!595 = !DISubprogram(name: "abort", scope: !233, file: !233, line: 591, type: !596, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{null}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !599, file: !587, line: 134)
!599 = !DISubprogram(name: "atexit", scope: !233, file: !233, line: 595, type: !600, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{!13, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !604, file: !587, line: 137)
!604 = !DISubprogram(name: "at_quick_exit", scope: !233, file: !233, line: 600, type: !600, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !606, file: !587, line: 140)
!606 = !DISubprogram(name: "atof", scope: !233, file: !233, line: 101, type: !474, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !608, file: !587, line: 141)
!608 = !DISubprogram(name: "atoi", scope: !233, file: !233, line: 104, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!13, !476}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !612, file: !587, line: 142)
!612 = !DISubprogram(name: "atol", scope: !233, file: !233, line: 107, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{!457, !476}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !616, file: !587, line: 143)
!616 = !DISubprogram(name: "bsearch", scope: !233, file: !233, line: 820, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{!167, !619, !619, !621, !621, !624}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !622, line: 46, baseType: !623)
!622 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!623 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !233, line: 808, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!13, !619, !619}
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !629, file: !587, line: 144)
!629 = !DISubprogram(name: "calloc", scope: !233, file: !233, line: 542, type: !630, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{!167, !621, !621}
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !633, file: !587, line: 145)
!633 = !DISubprogram(name: "div", scope: !233, file: !233, line: 852, type: !634, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{!585, !13, !13}
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !637, file: !587, line: 146)
!637 = !DISubprogram(name: "exit", scope: !233, file: !233, line: 617, type: !638, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !13}
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !641, file: !587, line: 147)
!641 = !DISubprogram(name: "free", scope: !233, file: !233, line: 565, type: !642, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !167}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !645, file: !587, line: 148)
!645 = !DISubprogram(name: "getenv", scope: !233, file: !233, line: 634, type: !646, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !476}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !650, file: !587, line: 149)
!650 = !DISubprogram(name: "labs", scope: !233, file: !233, line: 841, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!457, !457}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !654, file: !587, line: 150)
!654 = !DISubprogram(name: "ldiv", scope: !233, file: !233, line: 854, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!589, !457, !457}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !658, file: !587, line: 151)
!658 = !DISubprogram(name: "malloc", scope: !233, file: !233, line: 539, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!167, !621}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !662, file: !587, line: 153)
!662 = !DISubprogram(name: "mblen", scope: !233, file: !233, line: 922, type: !663, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{!13, !476, !621}
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !666, file: !587, line: 154)
!666 = !DISubprogram(name: "mbstowcs", scope: !233, file: !233, line: 933, type: !667, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{!621, !669, !672, !621}
!669 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!672 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !476)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !674, file: !587, line: 155)
!674 = !DISubprogram(name: "mbtowc", scope: !233, file: !233, line: 925, type: !675, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{!13, !669, !672, !621}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !678, file: !587, line: 157)
!678 = !DISubprogram(name: "qsort", scope: !233, file: !233, line: 830, type: !679, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !167, !621, !621, !624}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !682, file: !587, line: 160)
!682 = !DISubprogram(name: "quick_exit", scope: !233, file: !233, line: 623, type: !638, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !684, file: !587, line: 163)
!684 = !DISubprogram(name: "rand", scope: !233, file: !233, line: 453, type: !685, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{!13}
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !688, file: !587, line: 164)
!688 = !DISubprogram(name: "realloc", scope: !233, file: !233, line: 550, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!167, !167, !621}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !692, file: !587, line: 165)
!692 = !DISubprogram(name: "srand", scope: !233, file: !233, line: 455, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !66}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !696, file: !587, line: 166)
!696 = !DISubprogram(name: "strtod", scope: !233, file: !233, line: 117, type: !697, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DISubroutineType(types: !698)
!698 = !{!76, !672, !699}
!699 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !702, file: !587, line: 167)
!702 = !DISubprogram(name: "strtol", scope: !233, file: !233, line: 176, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!457, !672, !699, !13}
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !706, file: !587, line: 168)
!706 = !DISubprogram(name: "strtoul", scope: !233, file: !233, line: 180, type: !707, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DISubroutineType(types: !708)
!708 = !{!623, !672, !699, !13}
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !710, file: !587, line: 169)
!710 = !DISubprogram(name: "system", scope: !233, file: !233, line: 784, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !712, file: !587, line: 171)
!712 = !DISubprogram(name: "wcstombs", scope: !233, file: !233, line: 936, type: !713, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!621, !715, !716, !621}
!715 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !648)
!716 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !720, file: !587, line: 172)
!720 = !DISubprogram(name: "wctomb", scope: !233, file: !233, line: 929, type: !721, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!13, !648, !671}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !725, file: !587, line: 200)
!724 = !DINamespace(name: "__gnu_cxx", scope: null)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !233, line: 80, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !727, identifier: "_ZTS7lldiv_t")
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !726, file: !233, line: 78, baseType: !420, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !726, file: !233, line: 79, baseType: !420, size: 64, offset: 64)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !731, file: !587, line: 206)
!731 = !DISubprogram(name: "_Exit", scope: !233, file: !233, line: 629, type: !638, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !733, file: !587, line: 210)
!733 = !DISubprogram(name: "llabs", scope: !233, file: !233, line: 844, type: !734, flags: DIFlagPrototyped, spFlags: 0)
!734 = !DISubroutineType(types: !735)
!735 = !{!420, !420}
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !737, file: !587, line: 216)
!737 = !DISubprogram(name: "lldiv", scope: !233, file: !233, line: 858, type: !738, flags: DIFlagPrototyped, spFlags: 0)
!738 = !DISubroutineType(types: !739)
!739 = !{!725, !420, !420}
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !741, file: !587, line: 227)
!741 = !DISubprogram(name: "atoll", scope: !233, file: !233, line: 112, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!420, !476}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !745, file: !587, line: 228)
!745 = !DISubprogram(name: "strtoll", scope: !233, file: !233, line: 200, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!420, !672, !699, !13}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !749, file: !587, line: 229)
!749 = !DISubprogram(name: "strtoull", scope: !233, file: !233, line: 205, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !672, !699, !13}
!752 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !754, file: !587, line: 231)
!754 = !DISubprogram(name: "strtof", scope: !233, file: !233, line: 123, type: !755, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DISubroutineType(types: !756)
!756 = !{!55, !672, !699}
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !724, entity: !758, file: !587, line: 232)
!758 = !DISubprogram(name: "strtold", scope: !233, file: !233, line: 126, type: !759, flags: DIFlagPrototyped, spFlags: 0)
!759 = !DISubroutineType(types: !760)
!760 = !{!309, !672, !699}
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !725, file: !587, line: 240)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !731, file: !587, line: 242)
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !733, file: !587, line: 244)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !765, file: !587, line: 245)
!765 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !724, file: !587, line: 213, type: !738, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !737, file: !587, line: 246)
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !741, file: !587, line: 248)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !754, file: !587, line: 249)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !745, file: !587, line: 250)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !749, file: !587, line: 251)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !231, entity: !758, file: !587, line: 252)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !212, entity: !595, file: !773, line: 38)
!773 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
