; ModuleID = 'fpmetric.cpp'
source_filename = "fpmetric.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Parametric_Methods", linkageName: "_ZN3pov18Parametric_MethodsE", scope: !2, file: !3, line: 100, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "fpmetric.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !74, !80, !87, !89, !94, !102, !104, !106, !111, !116}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !17, !38}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !20, identifier: "_ZTSN3pov10Ray_StructE")
!20 = !{!21, !27, !28, !29, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !19, file: !5, line: 1799, baseType: !22, size: 192)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, elements: !25)
!24 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!25 = !{!26}
!26 = !DISubrange(count: 3)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !19, file: !5, line: 1800, baseType: !22, size: 192, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !19, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !19, file: !5, line: 1802, baseType: !30, size: 32, offset: 416)
!30 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !19, file: !5, line: 1803, baseType: !32, size: 6400, offset: 448)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 6400, elements: !36)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!36 = !{!37}
!37 = !DISubrange(count: 100)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !41, identifier: "_ZTSN3pov13istack_structE")
!41 = !{!42, !44, !72, !73}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !5, line: 1637, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !40, file: !5, line: 1638, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN3pov10istk_entryE")
!47 = !{!48, !49, !50, !51, !52, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !71}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !46, file: !5, line: 1612, baseType: !24, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !46, file: !5, line: 1613, baseType: !22, size: 192, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !46, file: !5, line: 1614, baseType: !22, size: 192, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !46, file: !5, line: 1615, baseType: !22, size: 192, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !46, file: !5, line: 1616, baseType: !53, size: 128, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 2)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !46, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !46, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !46, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !46, file: !5, line: 1625, baseType: !24, size: 64, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !46, file: !5, line: 1625, baseType: !24, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !46, file: !5, line: 1626, baseType: !24, size: 64, offset: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !46, file: !5, line: 1626, baseType: !24, size: 64, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !46, file: !5, line: 1627, baseType: !24, size: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !46, file: !5, line: 1627, baseType: !24, size: 64, offset: 1216)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !46, file: !5, line: 1628, baseType: !24, size: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !46, file: !5, line: 1628, baseType: !24, size: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !46, file: !5, line: 1628, baseType: !24, size: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !46, file: !5, line: 1630, baseType: !70, size: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !46, file: !5, line: 1632, baseType: !70, size: 64, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !40, file: !5, line: 1639, baseType: !30, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !40, file: !5, line: 1640, baseType: !30, size: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!13, !79, !14}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !79, !14, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !46)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !82)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!70, !14}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !14, !79, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !107, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !14, !99}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !112, size: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !117, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !113)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "PrecompLastDepth", linkageName: "_ZN3povL16PrecompLastDepthE", scope: !2, file: !3, line: 112, type: !13, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "PrecParData", linkageName: "_ZN3povL11PrecParDataE", scope: !2, file: !3, line: 110, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRECOMP_PAR_DATA", scope: !2, file: !124, line: 60, baseType: !125)
!124 = !DIFile(filename: "./fpmetric.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrecompParValues_Struct", scope: !2, file: !124, line: 62, size: 512, flags: DIFlagTypePassByValue, elements: !126, identifier: "_ZTSN3pov23PrecompParValues_StructE")
!126 = !{!127, !128, !129, !131, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !125, file: !124, line: 64, baseType: !13, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !125, file: !124, line: 64, baseType: !13, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !124, line: 65, baseType: !130, size: 8, offset: 64)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Low", scope: !125, file: !124, line: 67, baseType: !132, size: 192, offset: 128)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 192, elements: !25)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Hi", scope: !125, file: !124, line: 67, baseType: !132, size: 192, offset: 320)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "PrecompParFunc", linkageName: "_ZN3povL14PrecompParFuncE", scope: !2, file: !3, line: 111, type: !136, isLocal: true, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARAMETRIC", scope: !2, file: !124, line: 59, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Parametric_Struct", scope: !2, file: !124, line: 71, size: 2176, flags: DIFlagTypePassByValue, elements: !139, identifier: "_ZTSN3pov17Parametric_StructE")
!139 = !{!140, !142, !143, !144, !148, !149, !150, !151, !152, !156, !166, !167, !168, !169, !170, !176, !177, !178, !179, !180, !181, !182, !183, !184, !197, !198, !199}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !138, file: !124, line: 73, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !138, file: !124, line: 73, baseType: !13, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !138, file: !124, line: 73, baseType: !14, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !138, file: !124, line: 73, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !138, file: !124, line: 73, baseType: !145, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !138, file: !124, line: 73, baseType: !33, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !138, file: !124, line: 73, baseType: !14, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !138, file: !124, line: 73, baseType: !14, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !138, file: !124, line: 73, baseType: !153, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !138, file: !124, line: 73, baseType: !157, size: 192, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !159, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!159 = !{!160, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !158, file: !5, line: 892, baseType: !161, size: 96)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 96, elements: !25)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !164)
!164 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !158, file: !5, line: 892, baseType: !161, size: 96, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !138, file: !124, line: 73, baseType: !99, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !138, file: !124, line: 73, baseType: !99, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !138, file: !124, line: 73, baseType: !164, size: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !138, file: !124, line: 73, baseType: !30, size: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !138, file: !124, line: 74, baseType: !171, size: 192, offset: 960)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !25)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION_PTR", scope: !2, file: !173, line: 41, baseType: !174)
!173 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !2, file: !173, line: 40, baseType: !30)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !138, file: !124, line: 75, baseType: !24, size: 64, offset: 1152)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !138, file: !124, line: 75, baseType: !24, size: 64, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "vmin", scope: !138, file: !124, line: 75, baseType: !24, size: 64, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "vmax", scope: !138, file: !124, line: 75, baseType: !24, size: 64, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !138, file: !124, line: 76, baseType: !24, size: 64, offset: 1408)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "max_gradient", scope: !138, file: !124, line: 77, baseType: !24, size: 64, offset: 1472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Inverted", scope: !138, file: !124, line: 78, baseType: !13, size: 32, offset: 1536)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "container_shape", scope: !138, file: !124, line: 80, baseType: !13, size: 32, offset: 1568)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "container", scope: !138, file: !124, line: 93, baseType: !185, size: 384, offset: 1600)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !124, line: 81, size: 384, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN3pov17Parametric_StructUt_E")
!186 = !{!187, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sphere", scope: !185, file: !124, line: 87, baseType: !188, size: 256)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !124, line: 83, size: 256, flags: DIFlagTypePassByValue, elements: !189, identifier: "_ZTSN3pov17Parametric_StructUt_Ut_E")
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !188, file: !124, line: 85, baseType: !22, size: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !188, file: !124, line: 86, baseType: !24, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !185, file: !124, line: 92, baseType: !193, size: 384)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !124, line: 88, size: 384, flags: DIFlagTypePassByValue, elements: !194, identifier: "_ZTSN3pov17Parametric_StructUt_Ut0_E")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "corner1", scope: !193, file: !124, line: 90, baseType: !22, size: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "corner2", scope: !193, file: !124, line: 91, baseType: !22, size: 192, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "PData", scope: !138, file: !124, line: 96, baseType: !122, size: 64, offset: 1984)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last_u", scope: !138, file: !124, line: 97, baseType: !24, size: 64, offset: 2048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_v", scope: !138, file: !124, line: 97, baseType: !24, size: 64, offset: 2112)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "Intervals_Low", linkageName: "_ZN3povL13Intervals_LowE", scope: !2, file: !3, line: 114, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4096, elements: !203)
!203 = !{!56, !204}
!204 = !DISubrange(count: 32)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "Intervals_Hi", linkageName: "_ZN3povL12Intervals_HiE", scope: !2, file: !3, line: 114, type: !202, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "SectorNum", linkageName: "_ZN3povL9SectorNumE", scope: !2, file: !3, line: 115, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !210)
!210 = !{!204}
!211 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !212, retainedTypes: !350, globals: !351, imports: !359, splitDebugInlining: false, nameTableKind: None)
!212 = !{!213, !219, !346}
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !30, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !220, line: 149, baseType: !30, size: 32, elements: !221, identifier: "_ZTSN3pov5STATSE")
!220 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!222 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!223 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!224 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!225 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!226 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!227 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!228 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!229 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!236 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!237 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!238 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!239 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!255 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!262 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!263 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!264 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!265 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!266 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!267 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!268 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!269 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!270 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!271 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!272 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!273 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!274 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!275 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!276 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!277 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!278 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!279 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!280 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!281 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!282 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!283 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!284 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!285 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!286 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!287 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!288 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!289 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!290 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!291 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!292 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!293 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!294 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!295 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!296 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!297 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!298 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!299 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!300 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!301 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!302 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!303 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!304 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!305 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!306 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!307 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!308 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!309 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!310 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!311 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!312 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!313 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!314 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!315 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!316 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!317 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!318 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!319 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!320 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!321 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!322 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!323 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!324 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!325 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!326 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!327 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!328 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!329 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!330 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!331 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!332 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!333 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!334 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!335 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!336 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!337 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!338 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!339 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!340 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!341 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!342 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!343 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!344 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!345 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !30, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!349 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!350 = !{!136, !70, !122, !79, !14, !163}
!351 = !{!0, !352, !355, !357, !200, !205, !207, !118, !120, !134}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!353 = distinct !DIGlobalVariable(name: "INDEX_U", scope: !2, file: !3, line: 65, type: !354, isLocal: true, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!356 = distinct !DIGlobalVariable(name: "INDEX_V", scope: !2, file: !3, line: 66, type: !354, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression(DW_OP_constu, 10000000, DW_OP_stack_value))
!358 = distinct !DIGlobalVariable(name: "Max_intNumber", scope: !2, file: !3, line: 62, type: !354, isLocal: true, isDefinition: true)
!359 = !{!360, !365, !371, !375, !382, !386, !391, !393, !399, !403, !407, !420, !424, !428, !432, !436, !441, !445, !449, !453, !457, !465, !469, !473, !475, !479, !483, !487, !493, !497, !501, !503, !511, !515, !523, !525, !529, !533, !537, !541, !546, !550, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565, !566, !622, !626, !632, !634, !636, !640, !642, !644, !646, !648, !650, !652, !654, !659, !663, !665, !667, !671, !673, !675, !677, !679, !681, !683, !686, !688, !690, !694, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !722, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !760, !764, !768, !770, !772, !774, !776, !778, !780, !782, !784, !786, !790, !794, !798, !800, !802, !804, !808, !812, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !836, !838, !840, !844, !848, !852, !854, !856, !858, !860, !864, !868, !870, !872, !874, !876, !878, !880, !884, !888, !890, !892, !894, !896, !900, !904, !908, !910, !912, !914, !916, !918, !920, !924, !928, !932, !934, !938, !942, !944, !946, !948, !950, !952, !954, !960, !965, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028, !1034, !1038, !1044, !1048, !1052, !1056, !1060, !1062, !1064, !1068, !1072, !1076, !1080, !1084, !1086, !1088, !1090, !1094, !1098, !1102, !1104, !1106, !1109, !1111, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1133, !1134, !1135, !1137, !1139, !1141, !1143, !1145, !1146, !1148, !1149, !1151, !1153, !1159, !1165, !1170, !1174, !1176, !1178, !1180, !1182, !1189, !1193, !1197, !1201, !1205, !1209, !1213, !1217, !1219, !1223, !1229, !1233, !1237, !1239, !1241, !1245, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1267, !1271, !1275, !1279, !1283, !1287, !1289, !1295, !1299, !1303, !1307, !1309, !1311, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1326, !1328, !1330, !1332, !1333, !1335, !1337}
!360 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !361, entity: !362, file: !364, line: 58)
!361 = !DINamespace(name: "__gnu_debug", scope: null)
!362 = !DINamespace(name: "__debug", scope: !363)
!363 = !DINamespace(name: "std", scope: null)
!364 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !366, file: !370, line: 52)
!366 = !DISubprogram(name: "abs", scope: !367, file: !367, line: 840, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!368 = !DISubroutineType(types: !369)
!369 = !{!13, !13}
!370 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !372, file: !374, line: 127)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !367, line: 62, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!374 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !376, file: !374, line: 128)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !367, line: 70, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !378, identifier: "_ZTS6ldiv_t")
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !377, file: !367, line: 68, baseType: !380, size: 64)
!380 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !377, file: !367, line: 69, baseType: !380, size: 64, offset: 64)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !383, file: !374, line: 130)
!383 = !DISubprogram(name: "abort", scope: !367, file: !367, line: 591, type: !384, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{null}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !387, file: !374, line: 134)
!387 = !DISubprogram(name: "atexit", scope: !367, file: !367, line: 595, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{!13, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !392, file: !374, line: 137)
!392 = !DISubprogram(name: "at_quick_exit", scope: !367, file: !367, line: 600, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !394, file: !374, line: 140)
!394 = !DISubprogram(name: "atof", scope: !367, file: !367, line: 101, type: !395, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DISubroutineType(types: !396)
!396 = !{!24, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !400, file: !374, line: 141)
!400 = !DISubprogram(name: "atoi", scope: !367, file: !367, line: 104, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!13, !397}
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !404, file: !374, line: 142)
!404 = !DISubprogram(name: "atol", scope: !367, file: !367, line: 107, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!380, !397}
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !408, file: !374, line: 143)
!408 = !DISubprogram(name: "bsearch", scope: !367, file: !367, line: 820, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!70, !411, !411, !413, !413, !416}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !414, line: 46, baseType: !415)
!414 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!415 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !367, line: 808, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!13, !411, !411}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !421, file: !374, line: 144)
!421 = !DISubprogram(name: "calloc", scope: !367, file: !367, line: 542, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DISubroutineType(types: !423)
!423 = !{!70, !413, !413}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !425, file: !374, line: 145)
!425 = !DISubprogram(name: "div", scope: !367, file: !367, line: 852, type: !426, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{!372, !13, !13}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !429, file: !374, line: 146)
!429 = !DISubprogram(name: "exit", scope: !367, file: !367, line: 617, type: !430, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !13}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !433, file: !374, line: 147)
!433 = !DISubprogram(name: "free", scope: !367, file: !367, line: 565, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !70}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !437, file: !374, line: 148)
!437 = !DISubprogram(name: "getenv", scope: !367, file: !367, line: 634, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !397}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !442, file: !374, line: 149)
!442 = !DISubprogram(name: "labs", scope: !367, file: !367, line: 841, type: !443, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!380, !380}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !446, file: !374, line: 150)
!446 = !DISubprogram(name: "ldiv", scope: !367, file: !367, line: 854, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{!376, !380, !380}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !450, file: !374, line: 151)
!450 = !DISubprogram(name: "malloc", scope: !367, file: !367, line: 539, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!70, !413}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !454, file: !374, line: 153)
!454 = !DISubprogram(name: "mblen", scope: !367, file: !367, line: 922, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!13, !397, !413}
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !458, file: !374, line: 154)
!458 = !DISubprogram(name: "mbstowcs", scope: !367, file: !367, line: 933, type: !459, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!413, !461, !464, !413}
!461 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !397)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !466, file: !374, line: 155)
!466 = !DISubprogram(name: "mbtowc", scope: !367, file: !367, line: 925, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{!13, !461, !464, !413}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !470, file: !374, line: 157)
!470 = !DISubprogram(name: "qsort", scope: !367, file: !367, line: 830, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !70, !413, !413, !416}
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !474, file: !374, line: 160)
!474 = !DISubprogram(name: "quick_exit", scope: !367, file: !367, line: 623, type: !430, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !476, file: !374, line: 163)
!476 = !DISubprogram(name: "rand", scope: !367, file: !367, line: 453, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!13}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !480, file: !374, line: 164)
!480 = !DISubprogram(name: "realloc", scope: !367, file: !367, line: 550, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!70, !70, !413}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !484, file: !374, line: 165)
!484 = !DISubprogram(name: "srand", scope: !367, file: !367, line: 455, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !30}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !488, file: !374, line: 166)
!488 = !DISubprogram(name: "strtod", scope: !367, file: !367, line: 117, type: !489, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!24, !464, !491}
!491 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !494, file: !374, line: 167)
!494 = !DISubprogram(name: "strtol", scope: !367, file: !367, line: 176, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!380, !464, !491, !13}
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !498, file: !374, line: 168)
!498 = !DISubprogram(name: "strtoul", scope: !367, file: !367, line: 180, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!415, !464, !491, !13}
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !502, file: !374, line: 169)
!502 = !DISubprogram(name: "system", scope: !367, file: !367, line: 784, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !504, file: !374, line: 171)
!504 = !DISubprogram(name: "wcstombs", scope: !367, file: !367, line: 936, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!413, !507, !508, !413}
!507 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !440)
!508 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !512, file: !374, line: 172)
!512 = !DISubprogram(name: "wctomb", scope: !367, file: !367, line: 929, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{!13, !440, !463}
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !517, file: !374, line: 200)
!516 = !DINamespace(name: "__gnu_cxx", scope: null)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !367, line: 80, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !519, identifier: "_ZTS7lldiv_t")
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !518, file: !367, line: 78, baseType: !521, size: 64)
!521 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !518, file: !367, line: 79, baseType: !521, size: 64, offset: 64)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !524, file: !374, line: 206)
!524 = !DISubprogram(name: "_Exit", scope: !367, file: !367, line: 629, type: !430, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !526, file: !374, line: 210)
!526 = !DISubprogram(name: "llabs", scope: !367, file: !367, line: 844, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!521, !521}
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !530, file: !374, line: 216)
!530 = !DISubprogram(name: "lldiv", scope: !367, file: !367, line: 858, type: !531, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{!517, !521, !521}
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !534, file: !374, line: 227)
!534 = !DISubprogram(name: "atoll", scope: !367, file: !367, line: 112, type: !535, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DISubroutineType(types: !536)
!536 = !{!521, !397}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !538, file: !374, line: 228)
!538 = !DISubprogram(name: "strtoll", scope: !367, file: !367, line: 200, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!521, !464, !491, !13}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !542, file: !374, line: 229)
!542 = !DISubprogram(name: "strtoull", scope: !367, file: !367, line: 205, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!545, !464, !491, !13}
!545 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !547, file: !374, line: 231)
!547 = !DISubprogram(name: "strtof", scope: !367, file: !367, line: 123, type: !548, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{!164, !464, !491}
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !516, entity: !551, file: !374, line: 232)
!551 = !DISubprogram(name: "strtold", scope: !367, file: !367, line: 126, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !464, !491}
!554 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !517, file: !374, line: 240)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !524, file: !374, line: 242)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !526, file: !374, line: 244)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !559, file: !374, line: 245)
!559 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !516, file: !374, line: 213, type: !531, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !530, file: !374, line: 246)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !534, file: !374, line: 248)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !547, file: !374, line: 249)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !538, file: !374, line: 250)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !542, file: !374, line: 251)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !551, file: !374, line: 252)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !363, entity: !567, file: !568, line: 58)
