; ModuleID = 'parse.cpp'
source_filename = "parse.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Camera_Struct" = type { [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], double, double, i32, double, double, i32, double, double, double, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Transform_Struct"* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Not_In_Default", linkageName: "_ZN3pov14Not_In_DefaultE", scope: !2, file: !3, line: 126, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "parse.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "Ok_To_Declare", linkageName: "_ZN3pov13Ok_To_DeclareE", scope: !2, file: !3, line: 127, type: !4, isLocal: false, isDefinition: true)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "LValue_Ok", linkageName: "_ZN3pov9LValue_OkE", scope: !2, file: !3, line: 128, type: !4, isLocal: false, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "Default_Camera", linkageName: "_ZN3pov14Default_CameraE", scope: !2, file: !3, line: 134, type: !11, isLocal: false, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "CAMERA", scope: !2, file: !13, line: 64, baseType: !14)
!13 = !DIFile(filename: "./camera.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera_Struct", scope: !2, file: !13, line: 66, size: 2048, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN3pov13Camera_StructE")
!15 = !{!16, !23, !24, !25, !26, !27, !28, !29, !30, !31, !33, !34, !35, !36, !37, !38, !39, !43}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "Location", scope: !14, file: !13, line: 68, baseType: !17, size: 192)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !18, line: 691, baseType: !19)
!18 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, elements: !21)
!20 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!21 = !{!22}
!22 = !DISubrange(count: 3)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !14, file: !13, line: 69, baseType: !17, size: 192, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Up", scope: !14, file: !13, line: 70, baseType: !17, size: 192, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Right", scope: !14, file: !13, line: 71, baseType: !17, size: 192, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Sky", scope: !14, file: !13, line: 72, baseType: !17, size: 192, offset: 768)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Look_At", scope: !14, file: !13, line: 73, baseType: !17, size: 192, offset: 960)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Point", scope: !14, file: !13, line: 74, baseType: !17, size: 192, offset: 1152)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Distance", scope: !14, file: !13, line: 75, baseType: !20, size: 64, offset: 1344)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Aperture", scope: !14, file: !13, line: 75, baseType: !20, size: 64, offset: 1408)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Blur_Samples", scope: !14, file: !13, line: 76, baseType: !32, size: 32, offset: 1472)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !14, file: !13, line: 77, baseType: !20, size: 64, offset: 1536)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !14, file: !13, line: 78, baseType: !20, size: 64, offset: 1600)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !14, file: !13, line: 79, baseType: !32, size: 32, offset: 1664)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Angle", scope: !14, file: !13, line: 80, baseType: !20, size: 64, offset: 1728)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "H_Angle", scope: !14, file: !13, line: 81, baseType: !20, size: 64, offset: 1792)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "V_Angle", scope: !14, file: !13, line: 82, baseType: !20, size: 64, offset: 1856)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !14, file: !13, line: 83, baseType: !40, size: 64, offset: 1920)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !18, line: 1037, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !18, line: 1348, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Tnormal_StructE")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !14, file: !13, line: 84, baseType: !44, size: 64, offset: 1984)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !18, line: 1014, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !18, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN3pov16Transform_StructE")
!47 = !{!48, !53}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !46, file: !18, line: 1018, baseType: !49, size: 1024)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !18, line: 693, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !51)
!51 = !{!52, !52}
!52 = !DISubrange(count: 4)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !46, file: !18, line: 1019, baseType: !49, size: 1024, offset: 1024)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "Brace_Stack", linkageName: "_ZN3povL11Brace_StackE", scope: !2, file: !3, line: 130, type: !56, isLocal: true, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOKEN", scope: !2, file: !18, line: 1855, baseType: !32)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "Brace_Index", linkageName: "_ZN3povL11Brace_IndexE", scope: !2, file: !3, line: 131, type: !32, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "Destroying_Frame", linkageName: "_ZN3povL16Destroying_FrameE", scope: !2, file: !3, line: 132, type: !62, isLocal: true, isDefinition: true)
!62 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!63 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !875, globals: !2109, imports: !2117, splitDebugInlining: false, nameTableKind: None)
!64 = !{!65, !246, !265, !804, !858, !864, !871}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 329, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "base/povmsgid.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!69 = !DIEnumerator(name: "kPOVAttrib_Height", value: 1214605671, isUnsigned: true)
!70 = !DIEnumerator(name: "kPOVAttrib_Width", value: 1466524788, isUnsigned: true)
!71 = !DIEnumerator(name: "kPOVAttrib_TestAbort", value: 1416852545, isUnsigned: true)
!72 = !DIEnumerator(name: "kPOVAttrib_TestAbortCount", value: 1416839491, isUnsigned: true)
!73 = !DIEnumerator(name: "kPOVAttrib_ContinueTrace", value: 1131376212, isUnsigned: true)
!74 = !DIEnumerator(name: "kPOVAttrib_CreateIni", value: 1128885865, isUnsigned: true)
!75 = !DIEnumerator(name: "kPOVAttrib_Clock", value: 1131176811, isUnsigned: true)
!76 = !DIEnumerator(name: "kPOVAttrib_InitialFrame", value: 1229353581, isUnsigned: true)
!77 = !DIEnumerator(name: "kPOVAttrib_FinalFrame", value: 1179021933, isUnsigned: true)
!78 = !DIEnumerator(name: "kPOVAttrib_InitialClock", value: 1229155435, isUnsigned: true)
!79 = !DIEnumerator(name: "kPOVAttrib_FinalClock", value: 1178823787, isUnsigned: true)
!80 = !DIEnumerator(name: "kPOVAttrib_SubsetStartFrame", value: 1397978182, isUnsigned: true)
!81 = !DIEnumerator(name: "kPOVAttrib_SubsetEndFrame", value: 1397059142, isUnsigned: true)
!82 = !DIEnumerator(name: "kPOVAttrib_CyclicAnimation", value: 1132031041, isUnsigned: true)
!83 = !DIEnumerator(name: "kPOVAttrib_FieldRender", value: 1181508690, isUnsigned: true)
!84 = !DIEnumerator(name: "kPOVAttrib_OddField", value: 1331979334, isUnsigned: true)
!85 = !DIEnumerator(name: "kPOVAttrib_PauseWhenDone", value: 1347896431, isUnsigned: true)
!86 = !DIEnumerator(name: "kPOVAttrib_Verbose", value: 1449488994, isUnsigned: true)
!87 = !DIEnumerator(name: "kPOVAttrib_DrawVistas", value: 1148343913, isUnsigned: true)
!88 = !DIEnumerator(name: "kPOVAttrib_Display", value: 1147761520, isUnsigned: true)
!89 = !DIEnumerator(name: "kPOVAttrib_VideoMode", value: 1447915364, isUnsigned: true)
!90 = !DIEnumerator(name: "kPOVAttrib_Palette", value: 1348562036, isUnsigned: true)
!91 = !DIEnumerator(name: "kPOVAttrib_DisplayGamma", value: 1145528685, isUnsigned: true)
!92 = !DIEnumerator(name: "kPOVAttrib_PreviewStartSize", value: 1347646547, isUnsigned: true)
!93 = !DIEnumerator(name: "kPOVAttrib_PreviewEndSize", value: 1346727507, isUnsigned: true)
!94 = !DIEnumerator(name: "kPOVAttrib_OutputToFile", value: 1330933574, isUnsigned: true)
!95 = !DIEnumerator(name: "kPOVAttrib_OutputFileType", value: 1330009209, isUnsigned: true)
!96 = !DIEnumerator(name: "kPOVAttrib_OutputAlpha", value: 1329687664, isUnsigned: true)
!97 = !DIEnumerator(name: "kPOVAttrib_BitsPerColor", value: 1112556399, isUnsigned: true)
!98 = !DIEnumerator(name: "kPOVAttrib_OutputFile", value: 1330007649, isUnsigned: true)
!99 = !DIEnumerator(name: "kPOVAttrib_OutputPath", value: 1330667892, isUnsigned: true)
!100 = !DIEnumerator(name: "kPOVAttrib_Compression", value: 1330004847, isUnsigned: true)
!101 = !DIEnumerator(name: "kPOVAttrib_CreateHistogram", value: 1128819059, isUnsigned: true)
!102 = !DIEnumerator(name: "kPOVAttrib_HistogramFileType", value: 1212568697, isUnsigned: true)
!103 = !DIEnumerator(name: "kPOVAttrib_HistogramFile", value: 1212567137, isUnsigned: true)
!104 = !DIEnumerator(name: "kPOVAttrib_HistogramGridSizeX", value: 1212633944, isUnsigned: true)
!105 = !DIEnumerator(name: "kPOVAttrib_HistogramGridSizeY", value: 1212633945, isUnsigned: true)
!106 = !DIEnumerator(name: "kPOVAttrib_PreSceneCommand", value: 1349669699, isUnsigned: true)
!107 = !DIEnumerator(name: "kPOVAttrib_PreFrameCommand", value: 1349666371, isUnsigned: true)
!108 = !DIEnumerator(name: "kPOVAttrib_PostSceneCommand", value: 1349473123, isUnsigned: true)
!109 = !DIEnumerator(name: "kPOVAttrib_PostFrameCommand", value: 1349469763, isUnsigned: true)
!110 = !DIEnumerator(name: "kPOVAttrib_UserAbortCommand", value: 1430348355, isUnsigned: true)
!111 = !DIEnumerator(name: "kPOVAttrib_FatalErrorCommand", value: 1178956355, isUnsigned: true)
!112 = !DIEnumerator(name: "kPOVAttrib_InputFile", value: 1229344353, isUnsigned: true)
!113 = !DIEnumerator(name: "kPOVAttrib_LibraryPath", value: 1281974864, isUnsigned: true)
!114 = !DIEnumerator(name: "kPOVAttrib_Version", value: 1449489011, isUnsigned: true)
!115 = !DIEnumerator(name: "kPOVAttrib_DebugConsole", value: 1145270126, isUnsigned: true)
!116 = !DIEnumerator(name: "kPOVAttrib_FatalConsole", value: 1178824558, isUnsigned: true)
!117 = !DIEnumerator(name: "kPOVAttrib_RenderConsole", value: 1380151150, isUnsigned: true)
!118 = !DIEnumerator(name: "kPOVAttrib_StatisticsConsole", value: 1396928366, isUnsigned: true)
!119 = !DIEnumerator(name: "kPOVAttrib_WarningConsole", value: 1464037230, isUnsigned: true)
!120 = !DIEnumerator(name: "kPOVAttrib_AllConsole", value: 1094938478, isUnsigned: true)
!121 = !DIEnumerator(name: "kPOVAttrib_Declare", value: 1147495276, isUnsigned: true)
!122 = !DIEnumerator(name: "kPOVAttrib_DebugFile", value: 1145458273, isUnsigned: true)
!123 = !DIEnumerator(name: "kPOVAttrib_FatalFile", value: 1179012705, isUnsigned: true)
!124 = !DIEnumerator(name: "kPOVAttrib_RenderFile", value: 1380339297, isUnsigned: true)
!125 = !DIEnumerator(name: "kPOVAttrib_StatisticsFile", value: 1397116513, isUnsigned: true)
!126 = !DIEnumerator(name: "kPOVAttrib_WarningFile", value: 1464225377, isUnsigned: true)
!127 = !DIEnumerator(name: "kPOVAttrib_WarningLevel", value: 1464624502, isUnsigned: true)
!128 = !DIEnumerator(name: "kPOVAttrib_AllFile", value: 1095126625, isUnsigned: true)
!129 = !DIEnumerator(name: "kPOVAttrib_Quality", value: 1366647148, isUnsigned: true)
!130 = !DIEnumerator(name: "kPOVAttrib_Bounding", value: 1114600814, isUnsigned: true)
!131 = !DIEnumerator(name: "kPOVAttrib_BoundingThreshold", value: 1113871464, isUnsigned: true)
!132 = !DIEnumerator(name: "kPOVAttrib_LightBuffer", value: 1279423846, isUnsigned: true)
!133 = !DIEnumerator(name: "kPOVAttrib_VistaBuffer", value: 1447196006, isUnsigned: true)
!134 = !DIEnumerator(name: "kPOVAttrib_Radiosity", value: 1382114409, isUnsigned: true)
!135 = !DIEnumerator(name: "kPOVAttrib_RemoveBounds", value: 1382892132, isUnsigned: true)
!136 = !DIEnumerator(name: "kPOVAttrib_SplitUnions", value: 1399876693, isUnsigned: true)
!137 = !DIEnumerator(name: "kPOVAttrib_Antialias", value: 1097757801, isUnsigned: true)
!138 = !DIEnumerator(name: "kPOVAttrib_SamplingMethod", value: 1094800205, isUnsigned: true)
!139 = !DIEnumerator(name: "kPOVAttrib_AntialiasThreshold", value: 1094800488, isUnsigned: true)
!140 = !DIEnumerator(name: "kPOVAttrib_AntialiasDepth", value: 1094796389, isUnsigned: true)
!141 = !DIEnumerator(name: "kPOVAttrib_AntialiasClipped", value: 1094796140, isUnsigned: true)
!142 = !DIEnumerator(name: "kPOVAttrib_Jitter", value: 1094797929, isUnsigned: true)
!143 = !DIEnumerator(name: "kPOVAttrib_JitterAmount", value: 1094797889, isUnsigned: true)
!144 = !DIEnumerator(name: "kPOVAttrib_Left", value: 1281713780, isUnsigned: true)
!145 = !DIEnumerator(name: "kPOVAttrib_Top", value: 1416589344, isUnsigned: true)
!146 = !DIEnumerator(name: "kPOVAttrib_Right", value: 1382639464, isUnsigned: true)
!147 = !DIEnumerator(name: "kPOVAttrib_Bottom", value: 1114600564, isUnsigned: true)
!148 = !DIEnumerator(name: "kPOVAttrib_CoreVersion", value: 1131377253, isUnsigned: true)
!149 = !DIEnumerator(name: "kPOVAttrib_PlatformName", value: 1349280116, isUnsigned: true)
!150 = !DIEnumerator(name: "kPOVAttrib_Official", value: 1332110953, isUnsigned: true)
!151 = !DIEnumerator(name: "kPOVAttrib_PrimaryDevs", value: 1349675373, isUnsigned: true)
!152 = !DIEnumerator(name: "kPOVAttrib_ContributingDevs", value: 1131376244, isUnsigned: true)
!153 = !DIEnumerator(name: "kPOVAttrib_ImageLibVersions", value: 1229739621, isUnsigned: true)
!154 = !DIEnumerator(name: "kPOVAttrib_EnglishText", value: 1163163764, isUnsigned: true)
!155 = !DIEnumerator(name: "kPOVAttrib_CurrentToken", value: 1131770452, isUnsigned: true)
!156 = !DIEnumerator(name: "kPOVAttrib_CurrentLine", value: 1131770444, isUnsigned: true)
!157 = !DIEnumerator(name: "kPOVAttrib_LineCount", value: 1279487604, isUnsigned: true)
!158 = !DIEnumerator(name: "kPOVAttrib_AbsoluteCurrentLine", value: 1096971084, isUnsigned: true)
!159 = !DIEnumerator(name: "kPOVAttrib_FiniteObjects", value: 1181306722, isUnsigned: true)
!160 = !DIEnumerator(name: "kPOVAttrib_InfiniteObjects", value: 1231966050, isUnsigned: true)
!161 = !DIEnumerator(name: "kPOVAttrib_LightSources", value: 1281971055, isUnsigned: true)
!162 = !DIEnumerator(name: "kPOVAttrib_CurrentFrame", value: 1131770438, isUnsigned: true)
!163 = !DIEnumerator(name: "kPOVAttrib_FrameCount", value: 1178824308, isUnsigned: true)
!164 = !DIEnumerator(name: "kPOVAttrib_AbsoluteCurFrame", value: 1096971078, isUnsigned: true)
!165 = !DIEnumerator(name: "kPOVAttrib_FirstClock", value: 1181315651, isUnsigned: true)
!166 = !DIEnumerator(name: "kPOVAttrib_CurrentClock", value: 1131770435, isUnsigned: true)
!167 = !DIEnumerator(name: "kPOVAttrib_LastClock", value: 1281454915, isUnsigned: true)
!168 = !DIEnumerator(name: "kPOVAttrib_TotalPhotonCount", value: 1414546286, isUnsigned: true)
!169 = !DIEnumerator(name: "kPOVAttrib_CurrentPhotonCount", value: 1129333614, isUnsigned: true)
!170 = !DIEnumerator(name: "kPOVAttrib_ObjectPhotonCount", value: 1330660206, isUnsigned: true)
!171 = !DIEnumerator(name: "kPOVAttrib_MediaPhotonCount", value: 1297105774, isUnsigned: true)
!172 = !DIEnumerator(name: "kPOVAttrib_PhotonXSamples", value: 1347965793, isUnsigned: true)
!173 = !DIEnumerator(name: "kPOVAttrib_PhotonYSamples", value: 1348031329, isUnsigned: true)
!174 = !DIEnumerator(name: "kPOVAttrib_ProgressStatus", value: 1349676883, isUnsigned: true)
!175 = !DIEnumerator(name: "kPOVAttrib_ParseTime", value: 1348563540, isUnsigned: true)
!176 = !DIEnumerator(name: "kPOVAttrib_PhotonTime", value: 1349021524, isUnsigned: true)
!177 = !DIEnumerator(name: "kPOVAttrib_TraceTime", value: 1416782164, isUnsigned: true)
!178 = !DIEnumerator(name: "kPOVAttrib_TotalTime", value: 1416590420, isUnsigned: true)
!179 = !DIEnumerator(name: "kPOVAttrib_FileName", value: 1181314149, isUnsigned: true)
!180 = !DIEnumerator(name: "kPOVAttrib_Pixels", value: 1349089381, isUnsigned: true)
!181 = !DIEnumerator(name: "kPOVAttrib_PixelSamples", value: 1349089363, isUnsigned: true)
!182 = !DIEnumerator(name: "kPOVAttrib_SuperSampleCount", value: 1397965678, isUnsigned: true)
!183 = !DIEnumerator(name: "kPOVAttrib_MosaicPreviewSize", value: 1297109865, isUnsigned: true)
!184 = !DIEnumerator(name: "kPOVAttrib_Rays", value: 1382119795, isUnsigned: true)
!185 = !DIEnumerator(name: "kPOVAttrib_RaysSaved", value: 1381196150, isUnsigned: true)
!186 = !DIEnumerator(name: "kPOVAttrib_TraceLevel", value: 1414292854, isUnsigned: true)
!187 = !DIEnumerator(name: "kPOVAttrib_MaxTraceLevel", value: 1298233420, isUnsigned: true)
!188 = !DIEnumerator(name: "kPOVAttrib_ObjectIStats", value: 1330205556, isUnsigned: true)
!189 = !DIEnumerator(name: "kPOVAttrib_ShadowTest", value: 1399350356, isUnsigned: true)
!190 = !DIEnumerator(name: "kPOVAttrib_ShadowTestSuc", value: 1399350355, isUnsigned: true)
!191 = !DIEnumerator(name: "kPOVAttrib_PolynomTest", value: 1349414228, isUnsigned: true)
!192 = !DIEnumerator(name: "kPOVAttrib_RootsEliminated", value: 1380281449, isUnsigned: true)
!193 = !DIEnumerator(name: "kPOVAttrib_CallsToNoise", value: 1129598575, isUnsigned: true)
!194 = !DIEnumerator(name: "kPOVAttrib_CallsToDNoise", value: 1129595982, isUnsigned: true)
!195 = !DIEnumerator(name: "kPOVAttrib_MediaSamples", value: 1298486113, isUnsigned: true)
!196 = !DIEnumerator(name: "kPOVAttrib_MediaIntervals", value: 1298483566, isUnsigned: true)
!197 = !DIEnumerator(name: "kPOVAttrib_ReflectedRays", value: 1382444114, isUnsigned: true)
!198 = !DIEnumerator(name: "kPOVAttrib_InnerReflectedRays", value: 1230136658, isUnsigned: true)
!199 = !DIEnumerator(name: "kPOVAttrib_RefractedRays", value: 1382445652, isUnsigned: true)
!200 = !DIEnumerator(name: "kPOVAttrib_TransmittedRays", value: 1416782162, isUnsigned: true)
!201 = !DIEnumerator(name: "kPOVAttrib_IStackOverflow", value: 1230206031, isUnsigned: true)
!202 = !DIEnumerator(name: "kPOVAttrib_RadGatherCount", value: 1380402036, isUnsigned: true)
!203 = !DIEnumerator(name: "kPOVAttrib_RadReuseCount", value: 1381122932, isUnsigned: true)
!204 = !DIEnumerator(name: "kPOVAttrib_MinAlloc", value: 1298755137, isUnsigned: true)
!205 = !DIEnumerator(name: "kPOVAttrib_MaxAlloc", value: 1298233409, isUnsigned: true)
!206 = !DIEnumerator(name: "kPOVAttrib_CallsToAlloc", value: 1129595244, isUnsigned: true)
!207 = !DIEnumerator(name: "kPOVAttrib_CallsToFree", value: 1129596530, isUnsigned: true)
!208 = !DIEnumerator(name: "kPOVAttrib_PeakMemoryUsage", value: 1347245427, isUnsigned: true)
!209 = !DIEnumerator(name: "kPOVAttrib_PhotonsShot", value: 1347643503, isUnsigned: true)
!210 = !DIEnumerator(name: "kPOVAttrib_PhotonsStored", value: 1347646575, isUnsigned: true)
!211 = !DIEnumerator(name: "kPOVAttrib_GlobalPhotonsStored", value: 1196446580, isUnsigned: true)
!212 = !DIEnumerator(name: "kPOVAttrib_MediaPhotonsStored", value: 1297109876, isUnsigned: true)
!213 = !DIEnumerator(name: "kPOVAttrib_PhotonsPriQInsert", value: 1347440969, isUnsigned: true)
!214 = !DIEnumerator(name: "kPOVAttrib_PhotonsPriQRemove", value: 1347440978, isUnsigned: true)
!215 = !DIEnumerator(name: "kPOVAttrib_GatherPerformedCnt", value: 1196442478, isUnsigned: true)
!216 = !DIEnumerator(name: "kPOVAttrib_GatherExpandedCnt", value: 1195721582, isUnsigned: true)
!217 = !DIEnumerator(name: "kPOVAttrib_IsoFindRoot", value: 1229345391, isUnsigned: true)
!218 = !DIEnumerator(name: "kPOVAttrib_FunctionVMCalls", value: 1180060995, isUnsigned: true)
!219 = !DIEnumerator(name: "kPOVAttrib_FunctionVMInstrEst", value: 1180061001, isUnsigned: true)
!220 = !DIEnumerator(name: "kPOVAttrib_State", value: 1400136052, isUnsigned: true)
!221 = !DIEnumerator(name: "kPOVAttrib_Warning", value: 1466004078, isUnsigned: true)
!222 = !DIEnumerator(name: "kPOVAttrib_Line", value: 1281977957, isUnsigned: true)
!223 = !DIEnumerator(name: "kPOVAttrib_Column", value: 1131375733, isUnsigned: true)
!224 = !DIEnumerator(name: "kPOVAttrib_FilePosition", value: 1179676531, isUnsigned: true)
!225 = !DIEnumerator(name: "kPOVAttrib_TokenName", value: 1416588110, isUnsigned: true)
!226 = !DIEnumerator(name: "kPOVAttrib_Error", value: 1165128303, isUnsigned: true)
!227 = !DIEnumerator(name: "kPOVAttrib_ObjectName", value: 1330536813, isUnsigned: true)
!228 = !DIEnumerator(name: "kPOVAttrib_ObjectID", value: 1330209893, isUnsigned: true)
!229 = !DIEnumerator(name: "kPOVAttrib_ISectsTests", value: 1230271348, isUnsigned: true)
!230 = !DIEnumerator(name: "kPOVAttrib_ISectsSucceeded", value: 1230206307, isUnsigned: true)
!231 = !DIEnumerator(name: "kPOVAttrib_CommandString", value: 1131375955, isUnsigned: true)
!232 = !DIEnumerator(name: "kPOVAttrib_ReturnAction", value: 1380017012, isUnsigned: true)
!233 = !DIEnumerator(name: "kPOVAttrib_FrameTime", value: 1179937133, isUnsigned: true)
!234 = !DIEnumerator(name: "kPOVAttrib_AnimationTime", value: 1096051053, isUnsigned: true)
!235 = !DIEnumerator(name: "kPOVAttrib_IncludeHeader", value: 1231971144, isUnsigned: true)
!236 = !DIEnumerator(name: "kPOVAttrib_IncludeIni", value: 1231971145, isUnsigned: true)
!237 = !DIEnumerator(name: "kPOVAttrib_PreviewRefCon", value: 1347577190, isUnsigned: true)
!238 = !DIEnumerator(name: "kPOVAttrib_INIFile", value: 1229351276, isUnsigned: true)
!239 = !DIEnumerator(name: "kPOVAttrib_RenderOptions", value: 1380937844, isUnsigned: true)
!240 = !DIEnumerator(name: "kPOVAttrib_Identifier", value: 1231316334, isUnsigned: true)
!241 = !DIEnumerator(name: "kPOVAttrib_Value", value: 1449225333, isUnsigned: true)
!242 = !DIEnumerator(name: "kPOVAttrib_StartColumn", value: 1281713780, isUnsigned: true)
!243 = !DIEnumerator(name: "kPOVAttrib_EndColumn", value: 1382639464, isUnsigned: true)
!244 = !DIEnumerator(name: "kPOVAttrib_StartRow", value: 1416589344, isUnsigned: true)
!245 = !DIEnumerator(name: "kPOVAttrib_EndRow", value: 1114600564, isUnsigned: true)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !247, line: 183, baseType: !67, size: 32, elements: !248)
!247 = !DIFile(filename: "base/povms.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!249 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453, isUnsigned: true)
!250 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987, isUnsigned: true)
!251 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029, isUnsigned: true)
!252 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978, isUnsigned: true)
!253 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940, isUnsigned: true)
!254 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378, isUnsigned: true)
!255 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546, isUnsigned: true)
!256 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996, isUnsigned: true)
!257 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132, isUnsigned: true)
!258 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136, isUnsigned: true)
!259 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412, isUnsigned: true)
!260 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416, isUnsigned: true)
!261 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900, isUnsigned: true)
!262 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988, isUnsigned: true)
!263 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397, isUnsigned: true)
!264 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TOKEN_IDS", scope: !2, file: !266, line: 39, baseType: !67, size: 32, elements: !267, identifier: "_ZTSN3pov9TOKEN_IDSE")
!266 = !DIFile(filename: "./reswords.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!268 = !DIEnumerator(name: "ABS_TOKEN", value: 0, isUnsigned: true)
!269 = !DIEnumerator(name: "ATAN_TOKEN", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "ATAN2_TOKEN", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "CEIL_TOKEN", value: 3, isUnsigned: true)
!272 = !DIEnumerator(name: "CLOCK_ON_TOKEN", value: 4, isUnsigned: true)
!273 = !DIEnumerator(name: "CLOCK_TOKEN", value: 5, isUnsigned: true)
!274 = !DIEnumerator(name: "COS_TOKEN", value: 6, isUnsigned: true)
!275 = !DIEnumerator(name: "DEGREES_TOKEN", value: 7, isUnsigned: true)
!276 = !DIEnumerator(name: "DIV_TOKEN", value: 8, isUnsigned: true)
!277 = !DIEnumerator(name: "EXP_TOKEN", value: 9, isUnsigned: true)
!278 = !DIEnumerator(name: "FLOAT_ID_TOKEN", value: 10, isUnsigned: true)
!279 = !DIEnumerator(name: "FLOAT_TOKEN", value: 11, isUnsigned: true)
!280 = !DIEnumerator(name: "FLOOR_TOKEN", value: 12, isUnsigned: true)
!281 = !DIEnumerator(name: "FINALCLOCK_TOKEN", value: 13, isUnsigned: true)
!282 = !DIEnumerator(name: "FINALFRAME_TOKEN", value: 14, isUnsigned: true)
!283 = !DIEnumerator(name: "FRAMENUMBER_TOKEN", value: 15, isUnsigned: true)
!284 = !DIEnumerator(name: "IMAGE_WIDTH_TOKEN", value: 16, isUnsigned: true)
!285 = !DIEnumerator(name: "IMAGE_HEIGHT_TOKEN", value: 17, isUnsigned: true)
!286 = !DIEnumerator(name: "INITIALFRAME_TOKEN", value: 18, isUnsigned: true)
!287 = !DIEnumerator(name: "INITIALCLOCK_TOKEN", value: 19, isUnsigned: true)
!288 = !DIEnumerator(name: "INSIDE_TOKEN", value: 20, isUnsigned: true)
!289 = !DIEnumerator(name: "INT_TOKEN", value: 21, isUnsigned: true)
!290 = !DIEnumerator(name: "LN_TOKEN", value: 22, isUnsigned: true)
!291 = !DIEnumerator(name: "LOG_TOKEN", value: 23, isUnsigned: true)
!292 = !DIEnumerator(name: "MAX_TOKEN", value: 24, isUnsigned: true)
!293 = !DIEnumerator(name: "MIN_TOKEN", value: 25, isUnsigned: true)
!294 = !DIEnumerator(name: "MOD_TOKEN", value: 26, isUnsigned: true)
!295 = !DIEnumerator(name: "PI_TOKEN", value: 27, isUnsigned: true)
!296 = !DIEnumerator(name: "POW_TOKEN", value: 28, isUnsigned: true)
!297 = !DIEnumerator(name: "RADIANS_TOKEN", value: 29, isUnsigned: true)
!298 = !DIEnumerator(name: "SELECT_TOKEN", value: 30, isUnsigned: true)
!299 = !DIEnumerator(name: "SIN_TOKEN", value: 31, isUnsigned: true)
!300 = !DIEnumerator(name: "SQRT_TOKEN", value: 32, isUnsigned: true)
!301 = !DIEnumerator(name: "VDOT_TOKEN", value: 33, isUnsigned: true)
!302 = !DIEnumerator(name: "VLENGTH_TOKEN", value: 34, isUnsigned: true)
!303 = !DIEnumerator(name: "VERSION_TOKEN", value: 35, isUnsigned: true)
!304 = !DIEnumerator(name: "ON_TOKEN", value: 36, isUnsigned: true)
!305 = !DIEnumerator(name: "OFF_TOKEN", value: 37, isUnsigned: true)
!306 = !DIEnumerator(name: "TRUE_TOKEN", value: 38, isUnsigned: true)
!307 = !DIEnumerator(name: "FALSE_TOKEN", value: 39, isUnsigned: true)
!308 = !DIEnumerator(name: "YES_TOKEN", value: 40, isUnsigned: true)
!309 = !DIEnumerator(name: "NO_TOKEN", value: 41, isUnsigned: true)
!310 = !DIEnumerator(name: "ACOS_TOKEN", value: 42, isUnsigned: true)
!311 = !DIEnumerator(name: "ASIN_TOKEN", value: 43, isUnsigned: true)
!312 = !DIEnumerator(name: "TAN_TOKEN", value: 44, isUnsigned: true)
!313 = !DIEnumerator(name: "ASC_TOKEN", value: 45, isUnsigned: true)
!314 = !DIEnumerator(name: "STRLEN_TOKEN", value: 46, isUnsigned: true)
!315 = !DIEnumerator(name: "VAL_TOKEN", value: 47, isUnsigned: true)
!316 = !DIEnumerator(name: "FILE_EXISTS_TOKEN", value: 48, isUnsigned: true)
!317 = !DIEnumerator(name: "STRCMP_TOKEN", value: 49, isUnsigned: true)
!318 = !DIEnumerator(name: "SEED_TOKEN", value: 50, isUnsigned: true)
!319 = !DIEnumerator(name: "RAND_TOKEN", value: 51, isUnsigned: true)
!320 = !DIEnumerator(name: "CLOCK_DELTA_TOKEN", value: 52, isUnsigned: true)
!321 = !DIEnumerator(name: "DIMENSIONS_TOKEN", value: 53, isUnsigned: true)
!322 = !DIEnumerator(name: "DIMENSION_SIZE_TOKEN", value: 54, isUnsigned: true)
!323 = !DIEnumerator(name: "DEFINED_TOKEN", value: 55, isUnsigned: true)
!324 = !DIEnumerator(name: "COSH_TOKEN", value: 56, isUnsigned: true)
!325 = !DIEnumerator(name: "SINH_TOKEN", value: 57, isUnsigned: true)
!326 = !DIEnumerator(name: "TANH_TOKEN", value: 58, isUnsigned: true)
!327 = !DIEnumerator(name: "ATANH_TOKEN", value: 59, isUnsigned: true)
!328 = !DIEnumerator(name: "ACOSH_TOKEN", value: 60, isUnsigned: true)
!329 = !DIEnumerator(name: "ASINH_TOKEN", value: 61, isUnsigned: true)
!330 = !DIEnumerator(name: "SUM_TOKEN", value: 62, isUnsigned: true)
!331 = !DIEnumerator(name: "PROD_TOKEN", value: 63, isUnsigned: true)
!332 = !DIEnumerator(name: "FLOAT_FUNCT_TOKEN", value: 64, isUnsigned: true)
!333 = !DIEnumerator(name: "VAXIS_ROTATE_TOKEN", value: 65, isUnsigned: true)
!334 = !DIEnumerator(name: "VCROSS_TOKEN", value: 66, isUnsigned: true)
!335 = !DIEnumerator(name: "VECTOR_ID_TOKEN", value: 67, isUnsigned: true)
!336 = !DIEnumerator(name: "VNORMALIZE_TOKEN", value: 68, isUnsigned: true)
!337 = !DIEnumerator(name: "VROTATE_TOKEN", value: 69, isUnsigned: true)
!338 = !DIEnumerator(name: "VTURBULENCE_TOKEN", value: 70, isUnsigned: true)
!339 = !DIEnumerator(name: "X_TOKEN", value: 71, isUnsigned: true)
!340 = !DIEnumerator(name: "Y_TOKEN", value: 72, isUnsigned: true)
!341 = !DIEnumerator(name: "Z_TOKEN", value: 73, isUnsigned: true)
!342 = !DIEnumerator(name: "TRACE_TOKEN", value: 74, isUnsigned: true)
!343 = !DIEnumerator(name: "MIN_EXTENT_TOKEN", value: 75, isUnsigned: true)
!344 = !DIEnumerator(name: "MAX_EXTENT_TOKEN", value: 76, isUnsigned: true)
!345 = !DIEnumerator(name: "VECTOR_FUNCT_TOKEN", value: 77, isUnsigned: true)
!346 = !DIEnumerator(name: "ALPHA_TOKEN", value: 78, isUnsigned: true)
!347 = !DIEnumerator(name: "BLUE_TOKEN", value: 79, isUnsigned: true)
!348 = !DIEnumerator(name: "FILTER_TOKEN", value: 80, isUnsigned: true)
!349 = !DIEnumerator(name: "TRANSMIT_TOKEN", value: 81, isUnsigned: true)
!350 = !DIEnumerator(name: "GRAY_TOKEN", value: 82, isUnsigned: true)
!351 = !DIEnumerator(name: "GREEN_TOKEN", value: 83, isUnsigned: true)
!352 = !DIEnumerator(name: "RED_TOKEN", value: 84, isUnsigned: true)
!353 = !DIEnumerator(name: "RGBF_TOKEN", value: 85, isUnsigned: true)
!354 = !DIEnumerator(name: "RGBFT_TOKEN", value: 86, isUnsigned: true)
!355 = !DIEnumerator(name: "RGBT_TOKEN", value: 87, isUnsigned: true)
!356 = !DIEnumerator(name: "RGB_TOKEN", value: 88, isUnsigned: true)
!357 = !DIEnumerator(name: "COLOUR_KEY_TOKEN", value: 89, isUnsigned: true)
!358 = !DIEnumerator(name: "COLOR_TOKEN", value: 90, isUnsigned: true)
!359 = !DIEnumerator(name: "COLOUR_TOKEN", value: 91, isUnsigned: true)
!360 = !DIEnumerator(name: "COLOUR_ID_TOKEN", value: 92, isUnsigned: true)
!361 = !DIEnumerator(name: "CHARSET_TOKEN", value: 93, isUnsigned: true)
!362 = !DIEnumerator(name: "ASCII_TOKEN", value: 94, isUnsigned: true)
!363 = !DIEnumerator(name: "UTF8_TOKEN", value: 95, isUnsigned: true)
!364 = !DIEnumerator(name: "ADAPTIVE_TOKEN", value: 96, isUnsigned: true)
!365 = !DIEnumerator(name: "AGATE_TOKEN", value: 97, isUnsigned: true)
!366 = !DIEnumerator(name: "ALL_TOKEN", value: 98, isUnsigned: true)
!367 = !DIEnumerator(name: "ALTITUDE_TOKEN", value: 99, isUnsigned: true)
!368 = !DIEnumerator(name: "AMBIENT_TOKEN", value: 100, isUnsigned: true)
!369 = !DIEnumerator(name: "AMPERSAND_TOKEN", value: 101, isUnsigned: true)
!370 = !DIEnumerator(name: "AREA_LIGHT_TOKEN", value: 102, isUnsigned: true)
!371 = !DIEnumerator(name: "AT_TOKEN", value: 103, isUnsigned: true)
!372 = !DIEnumerator(name: "BACK_QUOTE_TOKEN", value: 104, isUnsigned: true)
!373 = !DIEnumerator(name: "BACK_SLASH_TOKEN", value: 105, isUnsigned: true)
!374 = !DIEnumerator(name: "BAR_TOKEN", value: 106, isUnsigned: true)
!375 = !DIEnumerator(name: "BICUBIC_PATCH_TOKEN", value: 107, isUnsigned: true)
!376 = !DIEnumerator(name: "BLOB_TOKEN", value: 108, isUnsigned: true)
!377 = !DIEnumerator(name: "BOUNDED_BY_TOKEN", value: 109, isUnsigned: true)
!378 = !DIEnumerator(name: "BOX_TOKEN", value: 110, isUnsigned: true)
!379 = !DIEnumerator(name: "BOZO_TOKEN", value: 111, isUnsigned: true)
!380 = !DIEnumerator(name: "BRICK_TOKEN", value: 112, isUnsigned: true)
!381 = !DIEnumerator(name: "BRILLIANCE_TOKEN", value: 113, isUnsigned: true)
!382 = !DIEnumerator(name: "BUMPS_TOKEN", value: 114, isUnsigned: true)
!383 = !DIEnumerator(name: "BUMP_MAP_TOKEN", value: 115, isUnsigned: true)
!384 = !DIEnumerator(name: "BUMP_SIZE_TOKEN", value: 116, isUnsigned: true)
!385 = !DIEnumerator(name: "CAMERA_ID_TOKEN", value: 117, isUnsigned: true)
!386 = !DIEnumerator(name: "CAMERA_TOKEN", value: 118, isUnsigned: true)
!387 = !DIEnumerator(name: "CELLS_TOKEN", value: 119, isUnsigned: true)
!388 = !DIEnumerator(name: "CHECKER_TOKEN", value: 120, isUnsigned: true)
!389 = !DIEnumerator(name: "CLIPPED_BY_TOKEN", value: 121, isUnsigned: true)
!390 = !DIEnumerator(name: "COLON_TOKEN", value: 122, isUnsigned: true)
!391 = !DIEnumerator(name: "COLOR_MAP_TOKEN", value: 123, isUnsigned: true)
!392 = !DIEnumerator(name: "COLOUR_MAP_ID_TOKEN", value: 124, isUnsigned: true)
!393 = !DIEnumerator(name: "COLOUR_MAP_TOKEN", value: 125, isUnsigned: true)
!394 = !DIEnumerator(name: "COMMA_TOKEN", value: 126, isUnsigned: true)
!395 = !DIEnumerator(name: "COMPONENT_TOKEN", value: 127, isUnsigned: true)
!396 = !DIEnumerator(name: "COMPOSITE_TOKEN", value: 128, isUnsigned: true)
!397 = !DIEnumerator(name: "CONE_TOKEN", value: 129, isUnsigned: true)
!398 = !DIEnumerator(name: "CRAND_TOKEN", value: 130, isUnsigned: true)
!399 = !DIEnumerator(name: "CUBIC_TOKEN", value: 131, isUnsigned: true)
!400 = !DIEnumerator(name: "CYLINDER_TOKEN", value: 132, isUnsigned: true)
!401 = !DIEnumerator(name: "DASH_TOKEN", value: 133, isUnsigned: true)
!402 = !DIEnumerator(name: "DECLARE_TOKEN", value: 134, isUnsigned: true)
!403 = !DIEnumerator(name: "DEFAULT_TOKEN", value: 135, isUnsigned: true)
!404 = !DIEnumerator(name: "DENTS_TOKEN", value: 136, isUnsigned: true)
!405 = !DIEnumerator(name: "DIFFERENCE_TOKEN", value: 137, isUnsigned: true)
!406 = !DIEnumerator(name: "DIFFUSE_TOKEN", value: 138, isUnsigned: true)
!407 = !DIEnumerator(name: "DIRECTION_TOKEN", value: 139, isUnsigned: true)
!408 = !DIEnumerator(name: "DISC_TOKEN", value: 140, isUnsigned: true)
!409 = !DIEnumerator(name: "DISTANCE_TOKEN", value: 141, isUnsigned: true)
!410 = !DIEnumerator(name: "DOLLAR_TOKEN", value: 142, isUnsigned: true)
!411 = !DIEnumerator(name: "END_OF_FILE_TOKEN", value: 143, isUnsigned: true)
!412 = !DIEnumerator(name: "EQUALS_TOKEN", value: 144, isUnsigned: true)
!413 = !DIEnumerator(name: "EXCLAMATION_TOKEN", value: 145, isUnsigned: true)
!414 = !DIEnumerator(name: "EXPONENT_TOKEN", value: 146, isUnsigned: true)
!415 = !DIEnumerator(name: "FALLOFF_TOKEN", value: 147, isUnsigned: true)
!416 = !DIEnumerator(name: "FINISH_ID_TOKEN", value: 148, isUnsigned: true)
!417 = !DIEnumerator(name: "FINISH_TOKEN", value: 149, isUnsigned: true)
!418 = !DIEnumerator(name: "FLATNESS_TOKEN", value: 150, isUnsigned: true)
!419 = !DIEnumerator(name: "FOG_TOKEN", value: 151, isUnsigned: true)
!420 = !DIEnumerator(name: "FREQUENCY_TOKEN", value: 152, isUnsigned: true)
!421 = !DIEnumerator(name: "FRESNEL_TOKEN", value: 153, isUnsigned: true)
!422 = !DIEnumerator(name: "GIF_TOKEN", value: 154, isUnsigned: true)
!423 = !DIEnumerator(name: "GRADIENT_TOKEN", value: 155, isUnsigned: true)
!424 = !DIEnumerator(name: "GRANITE_TOKEN", value: 156, isUnsigned: true)
!425 = !DIEnumerator(name: "HASH_TOKEN", value: 157, isUnsigned: true)
!426 = !DIEnumerator(name: "HAT_TOKEN", value: 158, isUnsigned: true)
!427 = !DIEnumerator(name: "HEIGHT_FIELD_TOKEN", value: 159, isUnsigned: true)
!428 = !DIEnumerator(name: "HEXAGON_TOKEN", value: 160, isUnsigned: true)
!429 = !DIEnumerator(name: "IDENTIFIER_TOKEN", value: 161, isUnsigned: true)
!430 = !DIEnumerator(name: "IFF_TOKEN", value: 162, isUnsigned: true)
!431 = !DIEnumerator(name: "IMAGE_MAP_TOKEN", value: 163, isUnsigned: true)
!432 = !DIEnumerator(name: "INCLUDE_TOKEN", value: 164, isUnsigned: true)
!433 = !DIEnumerator(name: "INTERPOLATE_TOKEN", value: 165, isUnsigned: true)
!434 = !DIEnumerator(name: "INTERSECTION_TOKEN", value: 166, isUnsigned: true)
!435 = !DIEnumerator(name: "INVERSE_TOKEN", value: 167, isUnsigned: true)
!436 = !DIEnumerator(name: "IOR_TOKEN", value: 168, isUnsigned: true)
!437 = !DIEnumerator(name: "JITTER_TOKEN", value: 169, isUnsigned: true)
!438 = !DIEnumerator(name: "LAMBDA_TOKEN", value: 170, isUnsigned: true)
!439 = !DIEnumerator(name: "LEFT_ANGLE_TOKEN", value: 171, isUnsigned: true)
!440 = !DIEnumerator(name: "LEFT_CURLY_TOKEN", value: 172, isUnsigned: true)
!441 = !DIEnumerator(name: "LEFT_PAREN_TOKEN", value: 173, isUnsigned: true)
!442 = !DIEnumerator(name: "LEFT_SQUARE_TOKEN", value: 174, isUnsigned: true)
!443 = !DIEnumerator(name: "LEOPARD_TOKEN", value: 175, isUnsigned: true)
!444 = !DIEnumerator(name: "LIGHT_SOURCE_TOKEN", value: 176, isUnsigned: true)
!445 = !DIEnumerator(name: "LOCATION_TOKEN", value: 177, isUnsigned: true)
!446 = !DIEnumerator(name: "LOOKS_LIKE_TOKEN", value: 178, isUnsigned: true)
!447 = !DIEnumerator(name: "LOOK_AT_TOKEN", value: 179, isUnsigned: true)
!448 = !DIEnumerator(name: "MANDEL_TOKEN", value: 180, isUnsigned: true)
!449 = !DIEnumerator(name: "MAP_TYPE_TOKEN", value: 181, isUnsigned: true)
!450 = !DIEnumerator(name: "MARBLE_TOKEN", value: 182, isUnsigned: true)
!451 = !DIEnumerator(name: "MATERIAL_MAP_TOKEN", value: 183, isUnsigned: true)
!452 = !DIEnumerator(name: "MAX_INTERSECTIONS", value: 184, isUnsigned: true)
!453 = !DIEnumerator(name: "MAX_TRACE_LEVEL_TOKEN", value: 185, isUnsigned: true)
!454 = !DIEnumerator(name: "MERGE_TOKEN", value: 186, isUnsigned: true)
!455 = !DIEnumerator(name: "METALLIC_TOKEN", value: 187, isUnsigned: true)
!456 = !DIEnumerator(name: "MORTAR_TOKEN", value: 188, isUnsigned: true)
!457 = !DIEnumerator(name: "NO_SHADOW_TOKEN", value: 189, isUnsigned: true)
!458 = !DIEnumerator(name: "OBJECT_ID_TOKEN", value: 190, isUnsigned: true)
!459 = !DIEnumerator(name: "OBJECT_TOKEN", value: 191, isUnsigned: true)
!460 = !DIEnumerator(name: "OCTAVES_TOKEN", value: 192, isUnsigned: true)
!461 = !DIEnumerator(name: "OMEGA_TOKEN", value: 193, isUnsigned: true)
!462 = !DIEnumerator(name: "ONCE_TOKEN", value: 194, isUnsigned: true)
!463 = !DIEnumerator(name: "ONION_TOKEN", value: 195, isUnsigned: true)
!464 = !DIEnumerator(name: "PERCENT_TOKEN", value: 196, isUnsigned: true)
!465 = !DIEnumerator(name: "PHASE_TOKEN", value: 197, isUnsigned: true)
!466 = !DIEnumerator(name: "PHONG_SIZE_TOKEN", value: 198, isUnsigned: true)
!467 = !DIEnumerator(name: "PHONG_TOKEN", value: 199, isUnsigned: true)
!468 = !DIEnumerator(name: "PIGMENT_ID_TOKEN", value: 200, isUnsigned: true)
!469 = !DIEnumerator(name: "PIGMENT_TOKEN", value: 201, isUnsigned: true)
!470 = !DIEnumerator(name: "PLANE_TOKEN", value: 202, isUnsigned: true)
!471 = !DIEnumerator(name: "PLUS_TOKEN", value: 203, isUnsigned: true)
!472 = !DIEnumerator(name: "POINT_AT_TOKEN", value: 204, isUnsigned: true)
!473 = !DIEnumerator(name: "POLY_TOKEN", value: 205, isUnsigned: true)
!474 = !DIEnumerator(name: "POT_TOKEN", value: 206, isUnsigned: true)
!475 = !DIEnumerator(name: "QUADRIC_TOKEN", value: 207, isUnsigned: true)
!476 = !DIEnumerator(name: "QUARTIC_TOKEN", value: 208, isUnsigned: true)
!477 = !DIEnumerator(name: "QUESTION_TOKEN", value: 209, isUnsigned: true)
!478 = !DIEnumerator(name: "QUICK_COLOR_TOKEN", value: 210, isUnsigned: true)
!479 = !DIEnumerator(name: "QUICK_COLOUR_TOKEN", value: 211, isUnsigned: true)
!480 = !DIEnumerator(name: "RADIAL_TOKEN", value: 212, isUnsigned: true)
!481 = !DIEnumerator(name: "RADIUS_TOKEN", value: 213, isUnsigned: true)
!482 = !DIEnumerator(name: "BRICK_SIZE_TOKEN", value: 214, isUnsigned: true)
!483 = !DIEnumerator(name: "REFLECTION_TOKEN", value: 215, isUnsigned: true)
!484 = !DIEnumerator(name: "REFRACTION_TOKEN", value: 216, isUnsigned: true)
!485 = !DIEnumerator(name: "RIGHT_ANGLE_TOKEN", value: 217, isUnsigned: true)
!486 = !DIEnumerator(name: "RIGHT_CURLY_TOKEN", value: 218, isUnsigned: true)
!487 = !DIEnumerator(name: "RIGHT_PAREN_TOKEN", value: 219, isUnsigned: true)
!488 = !DIEnumerator(name: "RIGHT_SQUARE_TOKEN", value: 220, isUnsigned: true)
!489 = !DIEnumerator(name: "RIGHT_TOKEN", value: 221, isUnsigned: true)
!490 = !DIEnumerator(name: "RIPPLES_TOKEN", value: 222, isUnsigned: true)
!491 = !DIEnumerator(name: "ROTATE_TOKEN", value: 223, isUnsigned: true)
!492 = !DIEnumerator(name: "ROUGHNESS_TOKEN", value: 224, isUnsigned: true)
!493 = !DIEnumerator(name: "SCALE_TOKEN", value: 225, isUnsigned: true)
!494 = !DIEnumerator(name: "SEMI_COLON_TOKEN", value: 226, isUnsigned: true)
!495 = !DIEnumerator(name: "SINGLE_QUOTE_TOKEN", value: 227, isUnsigned: true)
!496 = !DIEnumerator(name: "SKY_TOKEN", value: 228, isUnsigned: true)
!497 = !DIEnumerator(name: "SLASH_TOKEN", value: 229, isUnsigned: true)
!498 = !DIEnumerator(name: "SMOOTH_TOKEN", value: 230, isUnsigned: true)
!499 = !DIEnumerator(name: "SMOOTH_TRIANGLE_TOKEN", value: 231, isUnsigned: true)
!500 = !DIEnumerator(name: "SPECULAR_TOKEN", value: 232, isUnsigned: true)
!501 = !DIEnumerator(name: "SPHERE_TOKEN", value: 233, isUnsigned: true)
!502 = !DIEnumerator(name: "SPOTLIGHT_TOKEN", value: 234, isUnsigned: true)
!503 = !DIEnumerator(name: "SPOTTED_TOKEN", value: 235, isUnsigned: true)
!504 = !DIEnumerator(name: "STAR_TOKEN", value: 236, isUnsigned: true)
!505 = !DIEnumerator(name: "STRING_LITERAL_TOKEN", value: 237, isUnsigned: true)
!506 = !DIEnumerator(name: "STURM_TOKEN", value: 238, isUnsigned: true)
!507 = !DIEnumerator(name: "TEXTURE_ID_TOKEN", value: 239, isUnsigned: true)
!508 = !DIEnumerator(name: "TEXTURE_TOKEN", value: 240, isUnsigned: true)
!509 = !DIEnumerator(name: "INTERIOR_TEXTURE_TOKEN", value: 241, isUnsigned: true)
!510 = !DIEnumerator(name: "TGA_TOKEN", value: 242, isUnsigned: true)
!511 = !DIEnumerator(name: "THRESHOLD_TOKEN", value: 243, isUnsigned: true)
!512 = !DIEnumerator(name: "TIFF_TOKEN", value: 244, isUnsigned: true)
!513 = !DIEnumerator(name: "TIGHTNESS_TOKEN", value: 245, isUnsigned: true)
!514 = !DIEnumerator(name: "TILDE_TOKEN", value: 246, isUnsigned: true)
!515 = !DIEnumerator(name: "TILE2_TOKEN", value: 247, isUnsigned: true)
!516 = !DIEnumerator(name: "TILES_TOKEN", value: 248, isUnsigned: true)
!517 = !DIEnumerator(name: "TNORMAL_ID_TOKEN", value: 249, isUnsigned: true)
!518 = !DIEnumerator(name: "TNORMAL_TOKEN", value: 250, isUnsigned: true)
!519 = !DIEnumerator(name: "TORUS_TOKEN", value: 251, isUnsigned: true)
!520 = !DIEnumerator(name: "TRANSFORM_ID_TOKEN", value: 252, isUnsigned: true)
!521 = !DIEnumerator(name: "TRANSFORM_TOKEN", value: 253, isUnsigned: true)
!522 = !DIEnumerator(name: "TRANSLATE_TOKEN", value: 254, isUnsigned: true)
!523 = !DIEnumerator(name: "TRIANGLE_TOKEN", value: 255, isUnsigned: true)
!524 = !DIEnumerator(name: "TURBULENCE_TOKEN", value: 256, isUnsigned: true)
!525 = !DIEnumerator(name: "TYPE_TOKEN", value: 257, isUnsigned: true)
!526 = !DIEnumerator(name: "UNION_TOKEN", value: 258, isUnsigned: true)
!527 = !DIEnumerator(name: "UP_TOKEN", value: 259, isUnsigned: true)
!528 = !DIEnumerator(name: "USE_COLOR_TOKEN", value: 260, isUnsigned: true)
!529 = !DIEnumerator(name: "USE_COLOUR_TOKEN", value: 261, isUnsigned: true)
!530 = !DIEnumerator(name: "USE_INDEX_TOKEN", value: 262, isUnsigned: true)
!531 = !DIEnumerator(name: "U_STEPS_TOKEN", value: 263, isUnsigned: true)
!532 = !DIEnumerator(name: "V_STEPS_TOKEN", value: 264, isUnsigned: true)
!533 = !DIEnumerator(name: "WATER_LEVEL_TOKEN", value: 265, isUnsigned: true)
!534 = !DIEnumerator(name: "WAVES_TOKEN", value: 266, isUnsigned: true)
!535 = !DIEnumerator(name: "WOOD_TOKEN", value: 267, isUnsigned: true)
!536 = !DIEnumerator(name: "WRINKLES_TOKEN", value: 268, isUnsigned: true)
!537 = !DIEnumerator(name: "BACKGROUND_TOKEN", value: 269, isUnsigned: true)
!538 = !DIEnumerator(name: "OPEN_TOKEN", value: 270, isUnsigned: true)
!539 = !DIEnumerator(name: "AGATE_TURB_TOKEN", value: 271, isUnsigned: true)
!540 = !DIEnumerator(name: "IRID_TOKEN", value: 272, isUnsigned: true)
!541 = !DIEnumerator(name: "THICKNESS_TOKEN", value: 273, isUnsigned: true)
!542 = !DIEnumerator(name: "IRID_WAVELENGTH_TOKEN", value: 274, isUnsigned: true)
!543 = !DIEnumerator(name: "CRACKLE_TOKEN", value: 275, isUnsigned: true)
!544 = !DIEnumerator(name: "ADC_BAILOUT_TOKEN", value: 276, isUnsigned: true)
!545 = !DIEnumerator(name: "FILL_LIGHT_TOKEN", value: 277, isUnsigned: true)
!546 = !DIEnumerator(name: "NUMBER_OF_WAVES_TOKEN", value: 278, isUnsigned: true)
!547 = !DIEnumerator(name: "FOG_TYPE_TOKEN", value: 279, isUnsigned: true)
!548 = !DIEnumerator(name: "FOG_ALT_TOKEN", value: 280, isUnsigned: true)
!549 = !DIEnumerator(name: "FOG_OFFSET_TOKEN", value: 281, isUnsigned: true)
!550 = !DIEnumerator(name: "TEXT_TOKEN", value: 282, isUnsigned: true)
!551 = !DIEnumerator(name: "TTF_TOKEN", value: 283, isUnsigned: true)
!552 = !DIEnumerator(name: "REL_GE_TOKEN", value: 284, isUnsigned: true)
!553 = !DIEnumerator(name: "REL_LE_TOKEN", value: 285, isUnsigned: true)
!554 = !DIEnumerator(name: "REL_NE_TOKEN", value: 286, isUnsigned: true)
!555 = !DIEnumerator(name: "APERTURE_TOKEN", value: 287, isUnsigned: true)
!556 = !DIEnumerator(name: "BLUR_SAMPLES_TOKEN", value: 288, isUnsigned: true)
!557 = !DIEnumerator(name: "FOCAL_POINT_TOKEN", value: 289, isUnsigned: true)
!558 = !DIEnumerator(name: "QUILTED_TOKEN", value: 290, isUnsigned: true)
!559 = !DIEnumerator(name: "CONTROL0_TOKEN", value: 291, isUnsigned: true)
!560 = !DIEnumerator(name: "CONTROL1_TOKEN", value: 292, isUnsigned: true)
!561 = !DIEnumerator(name: "RAINBOW_TOKEN", value: 293, isUnsigned: true)
!562 = !DIEnumerator(name: "SKYSPHERE_TOKEN", value: 294, isUnsigned: true)
!563 = !DIEnumerator(name: "ANGLE_TOKEN", value: 295, isUnsigned: true)
!564 = !DIEnumerator(name: "WIDTH_TOKEN", value: 296, isUnsigned: true)
!565 = !DIEnumerator(name: "ARC_ANGLE_TOKEN", value: 297, isUnsigned: true)
!566 = !DIEnumerator(name: "PERSPECTIVE_TOKEN", value: 298, isUnsigned: true)
!567 = !DIEnumerator(name: "ORTHOGRAPHIC_TOKEN", value: 299, isUnsigned: true)
!568 = !DIEnumerator(name: "FISHEYE_TOKEN", value: 300, isUnsigned: true)
!569 = !DIEnumerator(name: "ULTRA_WIDE_ANGLE_TOKEN", value: 301, isUnsigned: true)
!570 = !DIEnumerator(name: "OMNIMAX_TOKEN", value: 302, isUnsigned: true)
!571 = !DIEnumerator(name: "PANORAMIC_TOKEN", value: 303, isUnsigned: true)
!572 = !DIEnumerator(name: "LATHE_TOKEN", value: 304, isUnsigned: true)
!573 = !DIEnumerator(name: "LINEAR_SPLINE_TOKEN", value: 305, isUnsigned: true)
!574 = !DIEnumerator(name: "QUADRATIC_SPLINE_TOKEN", value: 306, isUnsigned: true)
!575 = !DIEnumerator(name: "CUBIC_SPLINE_TOKEN", value: 307, isUnsigned: true)
!576 = !DIEnumerator(name: "BEZIER_SPLINE_TOKEN", value: 308, isUnsigned: true)
!577 = !DIEnumerator(name: "POLYGON_TOKEN", value: 309, isUnsigned: true)
!578 = !DIEnumerator(name: "PRISM_TOKEN", value: 310, isUnsigned: true)
!579 = !DIEnumerator(name: "LINEAR_SWEEP_TOKEN", value: 311, isUnsigned: true)
!580 = !DIEnumerator(name: "CONIC_SWEEP_TOKEN", value: 312, isUnsigned: true)
!581 = !DIEnumerator(name: "SOR_TOKEN", value: 313, isUnsigned: true)
!582 = !DIEnumerator(name: "SPIRAL1_TOKEN", value: 314, isUnsigned: true)
!583 = !DIEnumerator(name: "SPIRAL2_TOKEN", value: 315, isUnsigned: true)
!584 = !DIEnumerator(name: "STRENGTH_TOKEN", value: 316, isUnsigned: true)
!585 = !DIEnumerator(name: "HIERARCHY_TOKEN", value: 317, isUnsigned: true)
!586 = !DIEnumerator(name: "RAMP_WAVE_TOKEN", value: 318, isUnsigned: true)
!587 = !DIEnumerator(name: "TRIANGLE_WAVE_TOKEN", value: 319, isUnsigned: true)
!588 = !DIEnumerator(name: "SINE_WAVE_TOKEN", value: 320, isUnsigned: true)
!589 = !DIEnumerator(name: "SCALLOP_WAVE_TOKEN", value: 321, isUnsigned: true)
!590 = !DIEnumerator(name: "PIGMENT_MAP_TOKEN", value: 322, isUnsigned: true)
!591 = !DIEnumerator(name: "NORMAL_MAP_TOKEN", value: 323, isUnsigned: true)
!592 = !DIEnumerator(name: "SLOPE_MAP_TOKEN", value: 324, isUnsigned: true)
!593 = !DIEnumerator(name: "TEXTURE_MAP_TOKEN", value: 325, isUnsigned: true)
!594 = !DIEnumerator(name: "PIGMENT_MAP_ID_TOKEN", value: 326, isUnsigned: true)
!595 = !DIEnumerator(name: "NORMAL_MAP_ID_TOKEN", value: 327, isUnsigned: true)
!596 = !DIEnumerator(name: "SLOPE_MAP_ID_TOKEN", value: 328, isUnsigned: true)
!597 = !DIEnumerator(name: "TEXTURE_MAP_ID_TOKEN", value: 329, isUnsigned: true)
!598 = !DIEnumerator(name: "SUPERELLIPSOID_TOKEN", value: 330, isUnsigned: true)
!599 = !DIEnumerator(name: "QUATERNION_TOKEN", value: 331, isUnsigned: true)
!600 = !DIEnumerator(name: "CUBE_TOKEN", value: 332, isUnsigned: true)
!601 = !DIEnumerator(name: "MAX_ITERATION_TOKEN", value: 333, isUnsigned: true)
!602 = !DIEnumerator(name: "HYPERCOMPLEX_TOKEN", value: 334, isUnsigned: true)
!603 = !DIEnumerator(name: "RAINBOW_ID_TOKEN", value: 335, isUnsigned: true)
!604 = !DIEnumerator(name: "FOG_ID_TOKEN", value: 336, isUnsigned: true)
!605 = !DIEnumerator(name: "SKYSPHERE_ID_TOKEN", value: 337, isUnsigned: true)
!606 = !DIEnumerator(name: "FADE_POWER_TOKEN", value: 338, isUnsigned: true)
!607 = !DIEnumerator(name: "FADE_COLOUR_TOKEN", value: 339, isUnsigned: true)
!608 = !DIEnumerator(name: "FADE_COLOR_TOKEN", value: 340, isUnsigned: true)
!609 = !DIEnumerator(name: "FADE_DISTANCE_TOKEN", value: 341, isUnsigned: true)
!610 = !DIEnumerator(name: "TURB_DEPTH_TOKEN", value: 342, isUnsigned: true)
!611 = !DIEnumerator(name: "PPM_TOKEN", value: 343, isUnsigned: true)
!612 = !DIEnumerator(name: "PGM_TOKEN", value: 344, isUnsigned: true)
!613 = !DIEnumerator(name: "AVERAGE_TOKEN", value: 345, isUnsigned: true)
!614 = !DIEnumerator(name: "MESH_TOKEN", value: 346, isUnsigned: true)
!615 = !DIEnumerator(name: "WARP_TOKEN", value: 347, isUnsigned: true)
!616 = !DIEnumerator(name: "OFFSET_TOKEN", value: 348, isUnsigned: true)
!617 = !DIEnumerator(name: "REPEAT_TOKEN", value: 349, isUnsigned: true)
!618 = !DIEnumerator(name: "BLACK_HOLE_TOKEN", value: 350, isUnsigned: true)
!619 = !DIEnumerator(name: "FLIP_TOKEN", value: 351, isUnsigned: true)
!620 = !DIEnumerator(name: "AMBIENT_LIGHT_TOKEN", value: 352, isUnsigned: true)
!621 = !DIEnumerator(name: "IF_TOKEN", value: 353, isUnsigned: true)
!622 = !DIEnumerator(name: "ELSE_TOKEN", value: 354, isUnsigned: true)
!623 = !DIEnumerator(name: "END_TOKEN", value: 355, isUnsigned: true)
!624 = !DIEnumerator(name: "SWITCH_TOKEN", value: 356, isUnsigned: true)
!625 = !DIEnumerator(name: "CASE_TOKEN", value: 357, isUnsigned: true)
!626 = !DIEnumerator(name: "RANGE_TOKEN", value: 358, isUnsigned: true)
!627 = !DIEnumerator(name: "WHILE_TOKEN", value: 359, isUnsigned: true)
!628 = !DIEnumerator(name: "BREAK_TOKEN", value: 360, isUnsigned: true)
!629 = !DIEnumerator(name: "FALLOFF_ANGLE_TOKEN", value: 361, isUnsigned: true)
!630 = !DIEnumerator(name: "CAUSTICS_TOKEN", value: 362, isUnsigned: true)
!631 = !DIEnumerator(name: "JULIA_FRACTAL_TOKEN", value: 363, isUnsigned: true)
!632 = !DIEnumerator(name: "SQR_TOKEN", value: 364, isUnsigned: true)
!633 = !DIEnumerator(name: "RECIPROCAL_TOKEN", value: 365, isUnsigned: true)
!634 = !DIEnumerator(name: "STR_TOKEN", value: 366, isUnsigned: true)
!635 = !DIEnumerator(name: "VSTR_TOKEN", value: 367, isUnsigned: true)
!636 = !DIEnumerator(name: "CONCAT_TOKEN", value: 368, isUnsigned: true)
!637 = !DIEnumerator(name: "CHR_TOKEN", value: 369, isUnsigned: true)
!638 = !DIEnumerator(name: "SUBSTR_TOKEN", value: 370, isUnsigned: true)
!639 = !DIEnumerator(name: "STRING_ID_TOKEN", value: 371, isUnsigned: true)
!640 = !DIEnumerator(name: "WARNING_TOKEN", value: 372, isUnsigned: true)
!641 = !DIEnumerator(name: "ERROR_TOKEN", value: 373, isUnsigned: true)
!642 = !DIEnumerator(name: "RENDER_TOKEN", value: 374, isUnsigned: true)
!643 = !DIEnumerator(name: "STATISTICS_TOKEN", value: 375, isUnsigned: true)
!644 = !DIEnumerator(name: "DEBUG_TOKEN", value: 376, isUnsigned: true)
!645 = !DIEnumerator(name: "VARIANCE_TOKEN", value: 377, isUnsigned: true)
!646 = !DIEnumerator(name: "CONFIDENCE_TOKEN", value: 378, isUnsigned: true)
!647 = !DIEnumerator(name: "RADIOSITY_TOKEN", value: 379, isUnsigned: true)
!648 = !DIEnumerator(name: "BRIGHTNESS_TOKEN", value: 380, isUnsigned: true)
!649 = !DIEnumerator(name: "COUNT_TOKEN", value: 381, isUnsigned: true)
!650 = !DIEnumerator(name: "DISTANCE_MAXIMUM_TOKEN", value: 382, isUnsigned: true)
!651 = !DIEnumerator(name: "ERROR_BOUND_TOKEN", value: 383, isUnsigned: true)
!652 = !DIEnumerator(name: "GRAY_THRESHOLD_TOKEN", value: 384, isUnsigned: true)
!653 = !DIEnumerator(name: "LOW_ERROR_FACTOR_TOKEN", value: 385, isUnsigned: true)
!654 = !DIEnumerator(name: "MINIMUM_REUSE_TOKEN", value: 386, isUnsigned: true)
!655 = !DIEnumerator(name: "NEAREST_COUNT_TOKEN", value: 387, isUnsigned: true)
!656 = !DIEnumerator(name: "RECURSION_LIMIT_TOKEN", value: 388, isUnsigned: true)
!657 = !DIEnumerator(name: "HF_GRAY_16_TOKEN", value: 389, isUnsigned: true)
!658 = !DIEnumerator(name: "GLOBAL_SETTINGS_TOKEN", value: 390, isUnsigned: true)
!659 = !DIEnumerator(name: "ECCENTRICITY_TOKEN", value: 391, isUnsigned: true)
!660 = !DIEnumerator(name: "HOLLOW_TOKEN", value: 392, isUnsigned: true)
!661 = !DIEnumerator(name: "MEDIA_ATTENUATION_TOKEN", value: 393, isUnsigned: true)
!662 = !DIEnumerator(name: "MEDIA_INTERACTION_TOKEN", value: 394, isUnsigned: true)
!663 = !DIEnumerator(name: "MATRIX_TOKEN", value: 395, isUnsigned: true)
!664 = !DIEnumerator(name: "PERIOD_TOKEN", value: 396, isUnsigned: true)
!665 = !DIEnumerator(name: "SYS_TOKEN", value: 397, isUnsigned: true)
!666 = !DIEnumerator(name: "STRUPR_TOKEN", value: 398, isUnsigned: true)
!667 = !DIEnumerator(name: "STRLWR_TOKEN", value: 399, isUnsigned: true)
!668 = !DIEnumerator(name: "U_TOKEN", value: 400, isUnsigned: true)
!669 = !DIEnumerator(name: "V_TOKEN", value: 401, isUnsigned: true)
!670 = !DIEnumerator(name: "IFDEF_TOKEN", value: 402, isUnsigned: true)
!671 = !DIEnumerator(name: "PNG_TOKEN", value: 403, isUnsigned: true)
!672 = !DIEnumerator(name: "PRECISION_TOKEN", value: 404, isUnsigned: true)
!673 = !DIEnumerator(name: "SLICE_TOKEN", value: 405, isUnsigned: true)
!674 = !DIEnumerator(name: "ASSUMED_GAMMA_TOKEN", value: 406, isUnsigned: true)
!675 = !DIEnumerator(name: "PWR_TOKEN", value: 407, isUnsigned: true)
!676 = !DIEnumerator(name: "T_TOKEN", value: 408, isUnsigned: true)
!677 = !DIEnumerator(name: "IFNDEF_TOKEN", value: 409, isUnsigned: true)
!678 = !DIEnumerator(name: "MEDIA_TOKEN", value: 410, isUnsigned: true)
!679 = !DIEnumerator(name: "MEDIA_ID_TOKEN", value: 411, isUnsigned: true)
!680 = !DIEnumerator(name: "DENSITY_ID_TOKEN", value: 412, isUnsigned: true)
!681 = !DIEnumerator(name: "DENSITY_TOKEN", value: 413, isUnsigned: true)
!682 = !DIEnumerator(name: "DENSITY_FILE_TOKEN", value: 414, isUnsigned: true)
!683 = !DIEnumerator(name: "RATIO_TOKEN", value: 415, isUnsigned: true)
!684 = !DIEnumerator(name: "SCATTERING_TOKEN", value: 416, isUnsigned: true)
!685 = !DIEnumerator(name: "EMISSION_TOKEN", value: 417, isUnsigned: true)
!686 = !DIEnumerator(name: "ABSORPTION_TOKEN", value: 418, isUnsigned: true)
!687 = !DIEnumerator(name: "SAMPLES_TOKEN", value: 419, isUnsigned: true)
!688 = !DIEnumerator(name: "INTERVALS_TOKEN", value: 420, isUnsigned: true)
!689 = !DIEnumerator(name: "INTERIOR_TOKEN", value: 421, isUnsigned: true)
!690 = !DIEnumerator(name: "INTERIOR_ID_TOKEN", value: 422, isUnsigned: true)
!691 = !DIEnumerator(name: "EXTERIOR_TOKEN", value: 423, isUnsigned: true)
!692 = !DIEnumerator(name: "LOCAL_TOKEN", value: 424, isUnsigned: true)
!693 = !DIEnumerator(name: "UNDEF_TOKEN", value: 425, isUnsigned: true)
!694 = !DIEnumerator(name: "MACRO_TOKEN", value: 426, isUnsigned: true)
!695 = !DIEnumerator(name: "MACRO_ID_TOKEN", value: 427, isUnsigned: true)
!696 = !DIEnumerator(name: "TEMPORARY_MACRO_ID_TOKEN", value: 428, isUnsigned: true)
!697 = !DIEnumerator(name: "PARAMETER_ID_TOKEN", value: 429, isUnsigned: true)
!698 = !DIEnumerator(name: "ARRAY_TOKEN", value: 430, isUnsigned: true)
!699 = !DIEnumerator(name: "ARRAY_ID_TOKEN", value: 431, isUnsigned: true)
!700 = !DIEnumerator(name: "EMPTY_ARRAY_TOKEN", value: 432, isUnsigned: true)
!701 = !DIEnumerator(name: "FILE_ID_TOKEN", value: 433, isUnsigned: true)
!702 = !DIEnumerator(name: "FOPEN_TOKEN", value: 434, isUnsigned: true)
!703 = !DIEnumerator(name: "FCLOSE_TOKEN", value: 435, isUnsigned: true)
!704 = !DIEnumerator(name: "WRITE_TOKEN", value: 436, isUnsigned: true)
!705 = !DIEnumerator(name: "READ_TOKEN", value: 437, isUnsigned: true)
!706 = !DIEnumerator(name: "APPEND_TOKEN", value: 438, isUnsigned: true)
!707 = !DIEnumerator(name: "PLANAR_TOKEN", value: 439, isUnsigned: true)
!708 = !DIEnumerator(name: "SPHERICAL_TOKEN", value: 440, isUnsigned: true)
!709 = !DIEnumerator(name: "BOXED_TOKEN", value: 441, isUnsigned: true)
!710 = !DIEnumerator(name: "CYLINDRICAL_TOKEN", value: 442, isUnsigned: true)
!711 = !DIEnumerator(name: "CUBIC_WAVE_TOKEN", value: 443, isUnsigned: true)
!712 = !DIEnumerator(name: "POLY_WAVE_TOKEN", value: 444, isUnsigned: true)
!713 = !DIEnumerator(name: "DENSITY_MAP_TOKEN", value: 445, isUnsigned: true)
!714 = !DIEnumerator(name: "DENSITY_MAP_ID_TOKEN", value: 446, isUnsigned: true)
!715 = !DIEnumerator(name: "REFLECTION_EXPONENT_TOKEN", value: 447, isUnsigned: true)
!716 = !DIEnumerator(name: "DF3_TOKEN", value: 448, isUnsigned: true)
!717 = !DIEnumerator(name: "EXTINCTION_TOKEN", value: 449, isUnsigned: true)
!718 = !DIEnumerator(name: "MATERIAL_TOKEN", value: 450, isUnsigned: true)
!719 = !DIEnumerator(name: "MATERIAL_ID_TOKEN", value: 451, isUnsigned: true)
!720 = !DIEnumerator(name: "UV_ID_TOKEN", value: 452, isUnsigned: true)
!721 = !DIEnumerator(name: "VECTOR_4D_ID_TOKEN", value: 453, isUnsigned: true)
!722 = !DIEnumerator(name: "UV_MAPPING_TOKEN", value: 454, isUnsigned: true)
!723 = !DIEnumerator(name: "UV_VECTORS_TOKEN", value: 455, isUnsigned: true)
!724 = !DIEnumerator(name: "MESH2_TOKEN", value: 456, isUnsigned: true)
!725 = !DIEnumerator(name: "VERTEX_VECTORS_TOKEN", value: 457, isUnsigned: true)
!726 = !DIEnumerator(name: "NORMAL_VECTORS_TOKEN", value: 458, isUnsigned: true)
!727 = !DIEnumerator(name: "FACE_INDICES_TOKEN", value: 459, isUnsigned: true)
!728 = !DIEnumerator(name: "NORMAL_INDICES_TOKEN", value: 460, isUnsigned: true)
!729 = !DIEnumerator(name: "UV_INDICES_TOKEN", value: 461, isUnsigned: true)
!730 = !DIEnumerator(name: "TEXTURE_LIST_TOKEN", value: 462, isUnsigned: true)
!731 = !DIEnumerator(name: "IMAGE_PATTERN_TOKEN", value: 463, isUnsigned: true)
!732 = !DIEnumerator(name: "USE_ALPHA_TOKEN", value: 464, isUnsigned: true)
!733 = !DIEnumerator(name: "DOUBLE_ILLUMINATE_TOKEN", value: 465, isUnsigned: true)
!734 = !DIEnumerator(name: "INSIDE_VECTOR_TOKEN", value: 466, isUnsigned: true)
!735 = !DIEnumerator(name: "PHOTONS_TOKEN", value: 467, isUnsigned: true)
!736 = !DIEnumerator(name: "STEPS_TOKEN", value: 468, isUnsigned: true)
!737 = !DIEnumerator(name: "PASS_THROUGH_TOKEN", value: 469, isUnsigned: true)
!738 = !DIEnumerator(name: "COLLECT_TOKEN", value: 470, isUnsigned: true)
!739 = !DIEnumerator(name: "AUTOSTOP_TOKEN", value: 471, isUnsigned: true)
!740 = !DIEnumerator(name: "GATHER_TOKEN", value: 472, isUnsigned: true)
!741 = !DIEnumerator(name: "SPLIT_UNION_TOKEN", value: 473, isUnsigned: true)
!742 = !DIEnumerator(name: "EXPAND_THRESHOLDS_TOKEN", value: 474, isUnsigned: true)
!743 = !DIEnumerator(name: "SPACING_TOKEN", value: 475, isUnsigned: true)
!744 = !DIEnumerator(name: "TARGET_TOKEN", value: 476, isUnsigned: true)
!745 = !DIEnumerator(name: "PARAMETRIC_TOKEN", value: 477, isUnsigned: true)
!746 = !DIEnumerator(name: "PRECOMPUTE_TOKEN", value: 478, isUnsigned: true)
!747 = !DIEnumerator(name: "CONTAINED_BY_TOKEN", value: 479, isUnsigned: true)
!748 = !DIEnumerator(name: "ISOSURFACE_TOKEN", value: 480, isUnsigned: true)
!749 = !DIEnumerator(name: "METHOD_TOKEN", value: 481, isUnsigned: true)
!750 = !DIEnumerator(name: "ACCURACY_TOKEN", value: 482, isUnsigned: true)
!751 = !DIEnumerator(name: "MAX_GRADIENT_TOKEN", value: 483, isUnsigned: true)
!752 = !DIEnumerator(name: "MAX_TRACE_TOKEN", value: 484, isUnsigned: true)
!753 = !DIEnumerator(name: "FUNCTION_TOKEN", value: 485, isUnsigned: true)
!754 = !DIEnumerator(name: "EVALUATE_TOKEN", value: 486, isUnsigned: true)
!755 = !DIEnumerator(name: "FUNCT_ID_TOKEN", value: 487, isUnsigned: true)
!756 = !DIEnumerator(name: "VECTFUNCT_ID_TOKEN", value: 488, isUnsigned: true)
!757 = !DIEnumerator(name: "ALL_INTERSECTIONS_TOKEN", value: 489, isUnsigned: true)
!758 = !DIEnumerator(name: "DISPERSION_TOKEN", value: 490, isUnsigned: true)
!759 = !DIEnumerator(name: "DISPERSION_SAMPLES_TOKEN", value: 491, isUnsigned: true)
!760 = !DIEnumerator(name: "ORIENT_TOKEN", value: 492, isUnsigned: true)
!761 = !DIEnumerator(name: "CIRCULAR_TOKEN", value: 493, isUnsigned: true)
!762 = !DIEnumerator(name: "NO_IMAGE_TOKEN", value: 494, isUnsigned: true)
!763 = !DIEnumerator(name: "NO_REFLECTION_TOKEN", value: 495, isUnsigned: true)
!764 = !DIEnumerator(name: "LIGHT_GROUP_TOKEN", value: 496, isUnsigned: true)
!765 = !DIEnumerator(name: "NATURAL_SPLINE_TOKEN", value: 497, isUnsigned: true)
!766 = !DIEnumerator(name: "B_SPLINE_TOKEN", value: 498, isUnsigned: true)
!767 = !DIEnumerator(name: "TOLERANCE_TOKEN", value: 499, isUnsigned: true)
!768 = !DIEnumerator(name: "PROJECTED_THROUGH_TOKEN", value: 500, isUnsigned: true)
!769 = !DIEnumerator(name: "PARALLEL_TOKEN", value: 501, isUnsigned: true)
!770 = !DIEnumerator(name: "SPHERE_SWEEP_TOKEN", value: 502, isUnsigned: true)
!771 = !DIEnumerator(name: "SPLINE_TOKEN", value: 503, isUnsigned: true)
!772 = !DIEnumerator(name: "SPLINE_ID_TOKEN", value: 504, isUnsigned: true)
!773 = !DIEnumerator(name: "PATTERN_TOKEN", value: 505, isUnsigned: true)
!774 = !DIEnumerator(name: "FACETS_TOKEN", value: 506, isUnsigned: true)
!775 = !DIEnumerator(name: "SLOPE_TOKEN", value: 507, isUnsigned: true)
!776 = !DIEnumerator(name: "SOLID_TOKEN", value: 508, isUnsigned: true)
!777 = !DIEnumerator(name: "COORDS_TOKEN", value: 509, isUnsigned: true)
!778 = !DIEnumerator(name: "SIZE_TOKEN", value: 510, isUnsigned: true)
!779 = !DIEnumerator(name: "METRIC_TOKEN", value: 511, isUnsigned: true)
!780 = !DIEnumerator(name: "FORM_TOKEN", value: 512, isUnsigned: true)
!781 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513, isUnsigned: true)
!782 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514, isUnsigned: true)
!783 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515, isUnsigned: true)
!784 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516, isUnsigned: true)
!785 = !DIEnumerator(name: "JPEG_TOKEN", value: 517, isUnsigned: true)
!786 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518, isUnsigned: true)
!787 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519, isUnsigned: true)
!788 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520, isUnsigned: true)
!789 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521, isUnsigned: true)
!790 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522, isUnsigned: true)
!791 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523, isUnsigned: true)
!792 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524, isUnsigned: true)
!793 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525, isUnsigned: true)
!794 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526, isUnsigned: true)
!795 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527, isUnsigned: true)
!796 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528, isUnsigned: true)
!797 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529, isUnsigned: true)
!798 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530, isUnsigned: true)
!799 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531, isUnsigned: true)
!800 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532, isUnsigned: true)
!801 = !DIEnumerator(name: "JULIA_TOKEN", value: 533, isUnsigned: true)
!802 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534, isUnsigned: true)
!803 = !DIEnumerator(name: "LAST_TOKEN", value: 535, isUnsigned: true)
!804 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !2, file: !805, line: 47, baseType: !67, size: 32, elements: !806, identifier: "_ZTSN3pov11PATTERN_IDSE")
!805 = !DIFile(filename: "./pattern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!807 = !DIEnumerator(name: "NO_PATTERN", value: 0, isUnsigned: true)
!808 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1, isUnsigned: true)
!809 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2, isUnsigned: true)
!810 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3, isUnsigned: true)
!811 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4, isUnsigned: true)
!812 = !DIEnumerator(name: "WAVES_PATTERN", value: 5, isUnsigned: true)
!813 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6, isUnsigned: true)
!814 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7, isUnsigned: true)
!815 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8, isUnsigned: true)
!816 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9, isUnsigned: true)
!817 = !DIEnumerator(name: "FACETS_PATTERN", value: 10, isUnsigned: true)
!818 = !DIEnumerator(name: "DENTS_PATTERN", value: 11, isUnsigned: true)
!819 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12, isUnsigned: true)
!820 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13, isUnsigned: true)
!821 = !DIEnumerator(name: "BRICK_PATTERN", value: 14, isUnsigned: true)
!822 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15, isUnsigned: true)
!823 = !DIEnumerator(name: "BOZO_PATTERN", value: 16, isUnsigned: true)
!824 = !DIEnumerator(name: "CELLS_PATTERN", value: 17, isUnsigned: true)
!825 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18, isUnsigned: true)
!826 = !DIEnumerator(name: "WOOD_PATTERN", value: 19, isUnsigned: true)
!827 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20, isUnsigned: true)
!828 = !DIEnumerator(name: "AGATE_PATTERN", value: 21, isUnsigned: true)
!829 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22, isUnsigned: true)
!830 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23, isUnsigned: true)
!831 = !DIEnumerator(name: "ONION_PATTERN", value: 24, isUnsigned: true)
!832 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25, isUnsigned: true)
!833 = !DIEnumerator(name: "JULIA_PATTERN", value: 26, isUnsigned: true)
!834 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27, isUnsigned: true)
!835 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28, isUnsigned: true)
!836 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29, isUnsigned: true)
!837 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30, isUnsigned: true)
!838 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31, isUnsigned: true)
!839 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32, isUnsigned: true)
!840 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33, isUnsigned: true)
!841 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34, isUnsigned: true)
!842 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35, isUnsigned: true)
!843 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36, isUnsigned: true)
!844 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37, isUnsigned: true)
!845 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38, isUnsigned: true)
!846 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39, isUnsigned: true)
!847 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40, isUnsigned: true)
!848 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41, isUnsigned: true)
!849 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42, isUnsigned: true)
!850 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43, isUnsigned: true)
!851 = !DIEnumerator(name: "BOXED_PATTERN", value: 44, isUnsigned: true)
!852 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45, isUnsigned: true)
!853 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46, isUnsigned: true)
!854 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47, isUnsigned: true)
!855 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48, isUnsigned: true)
!856 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49, isUnsigned: true)
!857 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50, isUnsigned: true)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !18, line: 706, baseType: !67, size: 32, elements: !859)
!859 = !{!860, !861, !862, !863}
!860 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!861 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!862 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!863 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !18, line: 715, baseType: !67, size: 32, elements: !865)
!865 = !{!866, !867, !868, !869, !870}
!866 = !DIEnumerator(name: "pRED", value: 0, isUnsigned: true)
!867 = !DIEnumerator(name: "pGREEN", value: 1, isUnsigned: true)
!868 = !DIEnumerator(name: "pBLUE", value: 2, isUnsigned: true)
!869 = !DIEnumerator(name: "pFILTER", value: 3, isUnsigned: true)
!870 = !DIEnumerator(name: "pTRANSM", value: 4, isUnsigned: true)
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !18, line: 700, baseType: !67, size: 32, elements: !872)
!872 = !{!873, !874}
!873 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!874 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!875 = !{!56, !876, !878, !879, !880, !32, !1264, !1285, !1309, !44, !1310, !1320, !1248, !1036, !1321, !1322, !938, !40, !1188, !1173, !1326, !891, !913, !11, !1333, !1350, !1366, !1374, !1377, !1388, !1401, !1405, !909, !1194, !1408, !1415, !1447, !1140, !1002, !1318, !1514, !4, !1214, !1567, !1615, !1680, !1701, !1723, !1737, !1758, !1782, !1806, !1827, !1848, !1877, !1881, !1921, !1951, !1478, !1439, !1483, !1467, !1971, !2008, !2034, !2063, !2088, !67}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !18, line: 678, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !18, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !883, identifier: "_ZTSN3pov13Object_StructE")
!883 = !{!884, !888, !889, !890, !1171, !1172, !1191, !1192, !1193, !1259, !1260, !1261, !1262, !1263}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !882, file: !18, line: 1537, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !18, line: 1432, baseType: !887)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !18, line: 1517, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Method_StructE")
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !882, file: !18, line: 1537, baseType: !32, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !882, file: !18, line: 1537, baseType: !880, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !882, file: !18, line: 1537, baseType: !891, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !18, line: 1035, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !18, line: 1359, size: 1664, flags: DIFlagTypePassByValue, elements: !894, identifier: "_ZTSN3pov14Texture_StructE")
!894 = !{!895, !897, !898, !899, !900, !902, !903, !904, !908, !912, !1071, !1136, !1137, !1138, !1139, !1169, !1170}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !893, file: !18, line: 1361, baseType: !896, size: 16)
!896 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !893, file: !18, line: 1361, baseType: !896, size: 16, offset: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !893, file: !18, line: 1361, baseType: !896, size: 16, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !893, file: !18, line: 1361, baseType: !32, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !893, file: !18, line: 1361, baseType: !901, size: 32, offset: 96)
!901 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !893, file: !18, line: 1361, baseType: !901, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !893, file: !18, line: 1361, baseType: !901, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !893, file: !18, line: 1361, baseType: !905, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !18, line: 1040, baseType: !907)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !18, line: 1387, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Warps_StructE")
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !893, file: !18, line: 1361, baseType: !909, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !18, line: 1034, baseType: !911)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !18, line: 1337, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pattern_StructE")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !893, file: !18, line: 1361, baseType: !913, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !18, line: 1033, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !18, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !916, identifier: "_ZTSN3pov16Blend_Map_StructE")
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !915, file: !18, line: 1061, baseType: !32, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !915, file: !18, line: 1062, baseType: !4, size: 16, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !915, file: !18, line: 1063, baseType: !877, size: 8, offset: 48)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !915, file: !18, line: 1063, baseType: !877, size: 8, offset: 56)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !915, file: !18, line: 1064, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !18, line: 1032, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !18, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !925, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!925 = !{!926, !927, !929}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !924, file: !18, line: 1047, baseType: !901, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !924, file: !18, line: 1048, baseType: !928, size: 8, offset: 32)
!928 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !924, file: !18, line: 1056, baseType: !930, size: 192, offset: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !924, file: !18, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !931, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!931 = !{!932, !937, !1068, !1069, !1070}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !930, file: !18, line: 1051, baseType: !933, size: 160)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !18, line: 695, baseType: !934)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 160, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 5)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !930, file: !18, line: 1052, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !18, line: 1036, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !18, line: 1342, size: 1472, flags: DIFlagTypePassByValue, elements: !941, identifier: "_ZTSN3pov14Pigment_StructE")
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !1067}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !940, file: !18, line: 1344, baseType: !896, size: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !940, file: !18, line: 1344, baseType: !896, size: 16, offset: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !940, file: !18, line: 1344, baseType: !896, size: 16, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !940, file: !18, line: 1344, baseType: !32, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !940, file: !18, line: 1344, baseType: !901, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !940, file: !18, line: 1344, baseType: !901, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !940, file: !18, line: 1344, baseType: !901, size: 32, offset: 160)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !940, file: !18, line: 1344, baseType: !905, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !940, file: !18, line: 1344, baseType: !909, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !940, file: !18, line: 1344, baseType: !913, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !940, file: !18, line: 1344, baseType: !953, size: 896, offset: 384)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !940, file: !18, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !954, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!954 = !{!955, !959, !1006, !1007, !1008, !1009, !1010, !1011, !1016, !1021, !1027, !1039, !1050, !1060, !1065, !1066}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !953, file: !18, line: 1344, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !18, line: 1280, baseType: !958)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !18, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !953, file: !18, line: 1344, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !18, line: 1232, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !18, line: 1234, size: 960, flags: DIFlagTypePassByValue, elements: !963, identifier: "_ZTSN3pov12Image_StructE")
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !982, !983, !984, !988, !989}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !962, file: !18, line: 1236, baseType: !32, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !962, file: !18, line: 1237, baseType: !32, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !962, file: !18, line: 1238, baseType: !32, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !962, file: !18, line: 1239, baseType: !32, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !962, file: !18, line: 1240, baseType: !32, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !962, file: !18, line: 1241, baseType: !32, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !962, file: !18, line: 1241, baseType: !32, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !962, file: !18, line: 1242, baseType: !4, size: 16, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !962, file: !18, line: 1243, baseType: !877, size: 8, offset: 240)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !962, file: !18, line: 1244, baseType: !877, size: 8, offset: 248)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !962, file: !18, line: 1245, baseType: !17, size: 192, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !962, file: !18, line: 1246, baseType: !901, size: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !962, file: !18, line: 1246, baseType: !901, size: 32, offset: 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !962, file: !18, line: 1247, baseType: !978, size: 128, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !18, line: 690, baseType: !979)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 2)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !962, file: !18, line: 1248, baseType: !20, size: 64, offset: 640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !962, file: !18, line: 1248, baseType: !20, size: 64, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !962, file: !18, line: 1249, baseType: !985, size: 64, offset: 768)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !2, file: !18, line: 1169, baseType: !987)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !2, file: !18, line: 1175, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Image_Colour_StructE")
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !962, file: !18, line: 1250, baseType: !879, size: 64, offset: 832)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !962, file: !18, line: 1257, baseType: !990, size: 64, offset: 896)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !18, line: 1251, size: 64, flags: DIFlagTypePassByValue, elements: !991, identifier: "_ZTSN3pov12Image_StructUt_E")
!991 = !{!992, !996, !1000, !1003}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !990, file: !18, line: 1253, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !2, file: !18, line: 1171, baseType: !995)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !2, file: !18, line: 1180, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov18Image8_Line_StructE")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !990, file: !18, line: 1254, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !2, file: !18, line: 1173, baseType: !999)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !2, file: !18, line: 1185, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Image16_Line_StructE")
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !990, file: !18, line: 1255, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !990, file: !18, line: 1256, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !953, file: !18, line: 1344, baseType: !17, size: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !953, file: !18, line: 1344, baseType: !901, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !953, file: !18, line: 1344, baseType: !4, size: 16)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !953, file: !18, line: 1344, baseType: !4, size: 16)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !953, file: !18, line: 1344, baseType: !4, size: 16)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !953, file: !18, line: 1344, baseType: !1012, size: 256)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 256, flags: DIFlagTypePassByValue, elements: !1013, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !1012, file: !18, line: 1344, baseType: !901, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1012, file: !18, line: 1344, baseType: !17, size: 192, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !953, file: !18, line: 1344, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 64, flags: DIFlagTypePassByValue, elements: !1018, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !1017, file: !18, line: 1344, baseType: !901, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !1017, file: !18, line: 1344, baseType: !901, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !953, file: !18, line: 1344, baseType: !1022, size: 320)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 320, flags: DIFlagTypePassByValue, elements: !1023, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!1023 = !{!1024, !1025, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !1022, file: !18, line: 1344, baseType: !20, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !1022, file: !18, line: 1344, baseType: !20, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !1022, file: !18, line: 1344, baseType: !17, size: 192, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !953, file: !18, line: 1344, baseType: !1028, size: 896)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !1029, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1037, !1038}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !1028, file: !18, line: 1344, baseType: !17, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !1028, file: !18, line: 1344, baseType: !17, size: 192, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !1028, file: !18, line: 1344, baseType: !20, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !1028, file: !18, line: 1344, baseType: !20, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !1028, file: !18, line: 1344, baseType: !4, size: 16, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !1028, file: !18, line: 1344, baseType: !1036, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !1028, file: !18, line: 1344, baseType: !32, size: 32, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !1028, file: !18, line: 1344, baseType: !17, size: 192, offset: 704)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !953, file: !18, line: 1344, baseType: !1040, size: 832)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 832, flags: DIFlagTypePassByValue, elements: !1041, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !1040, file: !18, line: 1344, baseType: !17, size: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !1040, file: !18, line: 1344, baseType: !17, size: 192, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !1040, file: !18, line: 1344, baseType: !4, size: 16, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !1040, file: !18, line: 1344, baseType: !4, size: 16, offset: 400)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !1040, file: !18, line: 1344, baseType: !20, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !1040, file: !18, line: 1344, baseType: !20, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !1040, file: !18, line: 1344, baseType: !978, size: 128, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !1040, file: !18, line: 1344, baseType: !978, size: 128, offset: 704)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !953, file: !18, line: 1344, baseType: !1051, size: 384)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !18, line: 1344, size: 384, flags: DIFlagTypePassByValue, elements: !1052, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!1052 = !{!1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !1051, file: !18, line: 1344, baseType: !978, size: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !1051, file: !18, line: 1344, baseType: !4, size: 16, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !1051, file: !18, line: 1344, baseType: !4, size: 16, offset: 144)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !1051, file: !18, line: 1344, baseType: !4, size: 16, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !1051, file: !18, line: 1344, baseType: !20, size: 64, offset: 192)
