; ModuleID = 'pigment.cpp'
source_filename = "pigment.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Pigment_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, [5 x float] }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.0 }
%union.anon.0 = type { %struct.anon.5 }
%struct.anon.5 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::istk_entry" = type { double, [3 x double], [3 x double], [3 x double], [2 x double], %"struct.pov::Object_Struct"*, i32, i32, double, double, double, double, double, double, double, double, double, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Brick_Entries", linkageName: "_ZN3povL13Brick_EntriesE", scope: !2, file: !3, line: 131, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "pigment.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !117)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !6, line: 1032, baseType: !7)
!6 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !6, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!8 = !{!9, !11, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !7, file: !6, line: 1047, baseType: !10, size: 32)
!10 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !7, file: !6, line: 1048, baseType: !12, size: 8, offset: 32)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !7, file: !6, line: 1056, baseType: !14, size: 192, offset: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!15 = !{!16, !21, !269, !273, !274}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !14, file: !6, line: 1051, baseType: !17, size: 160)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !6, line: 695, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 5)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !14, file: !6, line: 1052, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !6, line: 1036, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !6, line: 1342, size: 1472, flags: DIFlagTypePassByValue, elements: !25, identifier: "_ZTSN3pov14Pigment_StructE")
!25 = !{!26, !28, !29, !30, !32, !33, !34, !35, !39, !43, !56, !268}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !24, file: !6, line: 1344, baseType: !27, size: 16)
!27 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !24, file: !6, line: 1344, baseType: !27, size: 16, offset: 16)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !24, file: !6, line: 1344, baseType: !27, size: 16, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !24, file: !6, line: 1344, baseType: !31, size: 32, offset: 64)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !24, file: !6, line: 1344, baseType: !10, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !24, file: !6, line: 1344, baseType: !10, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !24, file: !6, line: 1344, baseType: !10, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !24, file: !6, line: 1344, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !6, line: 1040, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !6, line: 1387, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Warps_StructE")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !24, file: !6, line: 1344, baseType: !40, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !6, line: 1034, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !6, line: 1337, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pattern_StructE")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !24, file: !6, line: 1344, baseType: !44, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !6, line: 1033, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !6, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN3pov16Blend_Map_StructE")
!47 = !{!48, !49, !51, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !46, file: !6, line: 1061, baseType: !31, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !46, file: !6, line: 1062, baseType: !50, size: 16, offset: 32)
!50 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !46, file: !6, line: 1063, baseType: !52, size: 8, offset: 48)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !46, file: !6, line: 1063, baseType: !52, size: 8, offset: 56)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !46, file: !6, line: 1064, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !24, file: !6, line: 1344, baseType: !57, size: 896, offset: 384)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !24, file: !6, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !58, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!58 = !{!59, !63, !67, !73, !74, !75, !76, !77, !82, !87, !93, !105, !120, !130, !136, !137}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !57, file: !6, line: 1344, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !6, line: 1280, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !6, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !57, file: !6, line: 1344, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !6, line: 1232, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !6, line: 1234, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Image_StructE")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !57, file: !6, line: 1344, baseType: !68, size: 192)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !6, line: 691, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, elements: !71)
!70 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!71 = !{!72}
!72 = !DISubrange(count: 3)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !57, file: !6, line: 1344, baseType: !10, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !57, file: !6, line: 1344, baseType: !50, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !57, file: !6, line: 1344, baseType: !50, size: 16)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !57, file: !6, line: 1344, baseType: !50, size: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !57, file: !6, line: 1344, baseType: !78, size: 256)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 256, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !78, file: !6, line: 1344, baseType: !10, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !78, file: !6, line: 1344, baseType: !68, size: 192, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !57, file: !6, line: 1344, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 64, flags: DIFlagTypePassByValue, elements: !84, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !83, file: !6, line: 1344, baseType: !10, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !83, file: !6, line: 1344, baseType: !10, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !57, file: !6, line: 1344, baseType: !88, size: 320)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 320, flags: DIFlagTypePassByValue, elements: !89, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !88, file: !6, line: 1344, baseType: !70, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !88, file: !6, line: 1344, baseType: !70, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !88, file: !6, line: 1344, baseType: !68, size: 192, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !57, file: !6, line: 1344, baseType: !94, size: 896)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !95, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!95 = !{!96, !97, !98, !99, !100, !101, !103, !104}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !94, file: !6, line: 1344, baseType: !68, size: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !94, file: !6, line: 1344, baseType: !68, size: 192, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !94, file: !6, line: 1344, baseType: !70, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !94, file: !6, line: 1344, baseType: !70, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !94, file: !6, line: 1344, baseType: !50, size: 16, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !94, file: !6, line: 1344, baseType: !102, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !94, file: !6, line: 1344, baseType: !31, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !94, file: !6, line: 1344, baseType: !68, size: 192, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !57, file: !6, line: 1344, baseType: !106, size: 832)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 832, flags: DIFlagTypePassByValue, elements: !107, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !119}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !106, file: !6, line: 1344, baseType: !68, size: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !106, file: !6, line: 1344, baseType: !68, size: 192, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !106, file: !6, line: 1344, baseType: !50, size: 16, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !106, file: !6, line: 1344, baseType: !50, size: 16, offset: 400)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !106, file: !6, line: 1344, baseType: !70, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !106, file: !6, line: 1344, baseType: !70, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !106, file: !6, line: 1344, baseType: !115, size: 128, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !6, line: 690, baseType: !116)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 2)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !106, file: !6, line: 1344, baseType: !115, size: 128, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !57, file: !6, line: 1344, baseType: !121, size: 384)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 384, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!122 = !{!123, !124, !125, !126, !127, !128, !129}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !121, file: !6, line: 1344, baseType: !115, size: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !121, file: !6, line: 1344, baseType: !50, size: 16, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !121, file: !6, line: 1344, baseType: !50, size: 16, offset: 144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !121, file: !6, line: 1344, baseType: !50, size: 16, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !121, file: !6, line: 1344, baseType: !70, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !121, file: !6, line: 1344, baseType: !70, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !121, file: !6, line: 1344, baseType: !31, size: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !57, file: !6, line: 1344, baseType: !131, size: 128)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !6, line: 1344, size: 128, flags: DIFlagTypePassByValue, elements: !132, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !131, file: !6, line: 1344, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !131, file: !6, line: 1344, baseType: !134, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !57, file: !6, line: 1344, baseType: !22, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !57, file: !6, line: 1344, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !6, line: 678, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !6, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !141, identifier: "_ZTSN3pov13Object_StructE")
!141 = !{!142, !238, !239, !240, !244, !245, !249, !250, !251, !255, !264, !265, !266, !267}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !140, file: !6, line: 1537, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !6, line: 1432, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !6, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !146, identifier: "_ZTSN3pov13Method_StructE")
!146 = !{!147, !187, !193, !200, !202, !207, !222, !224, !226, !231, !236}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !145, file: !6, line: 1519, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !6, line: 1434, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!31, !138, !152, !155}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !6, line: 680, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !6, line: 1797, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov10Ray_StructE")
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !6, line: 681, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !6, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !158, identifier: "_ZTSN3pov13istack_structE")
!158 = !{!159, !161, !184, !186}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !6, line: 1637, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !157, file: !6, line: 1638, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !6, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !164, identifier: "_ZTSN3pov10istk_entryE")
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !163, file: !6, line: 1612, baseType: !70, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !163, file: !6, line: 1613, baseType: !68, size: 192, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !163, file: !6, line: 1614, baseType: !68, size: 192, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !163, file: !6, line: 1615, baseType: !68, size: 192, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !163, file: !6, line: 1616, baseType: !115, size: 128, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !163, file: !6, line: 1617, baseType: !138, size: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !163, file: !6, line: 1624, baseType: !31, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !163, file: !6, line: 1624, baseType: !31, size: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !163, file: !6, line: 1625, baseType: !70, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !163, file: !6, line: 1625, baseType: !70, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !163, file: !6, line: 1626, baseType: !70, size: 64, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !163, file: !6, line: 1626, baseType: !70, size: 64, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !163, file: !6, line: 1627, baseType: !70, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !163, file: !6, line: 1627, baseType: !70, size: 64, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !163, file: !6, line: 1628, baseType: !70, size: 64, offset: 1280)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !163, file: !6, line: 1628, baseType: !70, size: 64, offset: 1344)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !163, file: !6, line: 1628, baseType: !70, size: 64, offset: 1408)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !163, file: !6, line: 1630, baseType: !134, size: 64, offset: 1472)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !163, file: !6, line: 1632, baseType: !134, size: 64, offset: 1536)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !157, file: !6, line: 1639, baseType: !185, size: 32, offset: 128)
!185 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !157, file: !6, line: 1640, baseType: !185, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !145, file: !6, line: 1520, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !6, line: 1435, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!31, !192, !138}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !145, file: !6, line: 1521, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !6, line: 1436, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !192, !138, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !6, line: 682, baseType: !163)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !145, file: !6, line: 1522, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !6, line: 1437, baseType: !195)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !145, file: !6, line: 1523, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !6, line: 1438, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!134, !138}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !145, file: !6, line: 1524, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !6, line: 1439, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !138, !192, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !6, line: 1014, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !6, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !215, identifier: "_ZTSN3pov16Transform_StructE")
!215 = !{!216, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !214, file: !6, line: 1018, baseType: !217, size: 1024)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !6, line: 693, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, elements: !219)
!219 = !{!220, !220}
!220 = !DISubrange(count: 4)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !214, file: !6, line: 1019, baseType: !217, size: 1024, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !145, file: !6, line: 1525, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !6, line: 1440, baseType: !209)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !145, file: !6, line: 1526, baseType: !225, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !6, line: 1441, baseType: !209)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !145, file: !6, line: 1527, baseType: !227, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !6, line: 1442, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !138, !212}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !145, file: !6, line: 1528, baseType: !232, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !6, line: 1443, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !138}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !145, file: !6, line: 1529, baseType: !237, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !6, line: 1444, baseType: !233)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !140, file: !6, line: 1537, baseType: !31, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !140, file: !6, line: 1537, baseType: !138, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !140, file: !6, line: 1537, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !6, line: 1035, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !6, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !140, file: !6, line: 1537, baseType: !241, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !140, file: !6, line: 1537, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !6, line: 1124, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !6, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !140, file: !6, line: 1537, baseType: !138, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !140, file: !6, line: 1537, baseType: !138, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !140, file: !6, line: 1537, baseType: !252, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !6, line: 1041, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !6, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !140, file: !6, line: 1537, baseType: !256, size: 192, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !6, line: 888, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !6, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !258, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!258 = !{!259, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !257, file: !6, line: 892, baseType: !260, size: 96)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !6, line: 886, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !71)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !6, line: 884, baseType: !10)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !257, file: !6, line: 892, baseType: !260, size: 96, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !140, file: !6, line: 1537, baseType: !212, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !140, file: !6, line: 1537, baseType: !212, size: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !140, file: !6, line: 1537, baseType: !10, size: 32, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !140, file: !6, line: 1537, baseType: !185, size: 32, offset: 928)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !24, file: !6, line: 1345, baseType: !17, size: 160, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !14, file: !6, line: 1053, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !6, line: 1037, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !6, line: 1348, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Tnormal_StructE")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !14, file: !6, line: 1054, baseType: !241, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !14, file: !6, line: 1055, baseType: !115, size: 128)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "Brick_Default_Map", linkageName: "_ZN3pov17Brick_Default_MapE", scope: !2, file: !3, line: 135, type: !45, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "Hex_Entries", linkageName: "_ZN3povL11Hex_EntriesE", scope: !2, file: !3, line: 138, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 768, elements: !71)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "Hex_Default_Map", linkageName: "_ZN3pov15Hex_Default_MapE", scope: !2, file: !3, line: 143, type: !45, isLocal: false, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "Check_Default_Map", linkageName: "_ZN3pov17Check_Default_MapE", scope: !2, file: !3, line: 146, type: !45, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "Bozo_Default_Map", linkageName: "_ZN3povL16Bozo_Default_MapE", scope: !2, file: !3, line: 83, type: !45, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "Wood_Default_Map", linkageName: "_ZN3povL16Wood_Default_MapE", scope: !2, file: !3, line: 90, type: !45, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "Mandel_Default_Map", linkageName: "_ZN3povL18Mandel_Default_MapE", scope: !2, file: !3, line: 100, type: !45, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "Radial_Default_Map", linkageName: "_ZN3povL18Radial_Default_MapE", scope: !2, file: !3, line: 120, type: !45, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "Agate_Default_Map", linkageName: "_ZN3povL17Agate_Default_MapE", scope: !2, file: !3, line: 111, type: !45, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "Marble_Default_Map", linkageName: "_ZN3povL18Marble_Default_MapE", scope: !2, file: !3, line: 128, type: !45, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "Gray_Default_Map", linkageName: "_ZN3povL16Gray_Default_MapE", scope: !2, file: !3, line: 72, type: !45, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "Made", scope: !300, file: !3, line: 666, type: !12, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "Make_Pigment_Entries", linkageName: "_ZN3pov20Make_Pigment_EntriesEv", scope: !2, file: !3, line: 664, type: !301, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !303, retainedNodes: !1115)
!301 = !DISubroutineType(types: !302)
!302 = !{null}
!303 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !304, retainedTypes: !376, globals: !377, imports: !398, splitDebugInlining: false, nameTableKind: None)
!304 = !{!305, !359, !366, !370}
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !2, file: !306, line: 47, baseType: !185, size: 32, elements: !307, identifier: "_ZTSN3pov11PATTERN_IDSE")
!306 = !DIFile(filename: "./pattern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!308 = !DIEnumerator(name: "NO_PATTERN", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3, isUnsigned: true)
!312 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4, isUnsigned: true)
!313 = !DIEnumerator(name: "WAVES_PATTERN", value: 5, isUnsigned: true)
!314 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6, isUnsigned: true)
!315 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7, isUnsigned: true)
!316 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8, isUnsigned: true)
!317 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9, isUnsigned: true)
!318 = !DIEnumerator(name: "FACETS_PATTERN", value: 10, isUnsigned: true)
!319 = !DIEnumerator(name: "DENTS_PATTERN", value: 11, isUnsigned: true)
!320 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12, isUnsigned: true)
!321 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13, isUnsigned: true)
!322 = !DIEnumerator(name: "BRICK_PATTERN", value: 14, isUnsigned: true)
!323 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15, isUnsigned: true)
!324 = !DIEnumerator(name: "BOZO_PATTERN", value: 16, isUnsigned: true)
!325 = !DIEnumerator(name: "CELLS_PATTERN", value: 17, isUnsigned: true)
!326 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18, isUnsigned: true)
!327 = !DIEnumerator(name: "WOOD_PATTERN", value: 19, isUnsigned: true)
!328 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20, isUnsigned: true)
!329 = !DIEnumerator(name: "AGATE_PATTERN", value: 21, isUnsigned: true)
!330 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22, isUnsigned: true)
!331 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23, isUnsigned: true)
!332 = !DIEnumerator(name: "ONION_PATTERN", value: 24, isUnsigned: true)
!333 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25, isUnsigned: true)
!334 = !DIEnumerator(name: "JULIA_PATTERN", value: 26, isUnsigned: true)
!335 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27, isUnsigned: true)
!336 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28, isUnsigned: true)
!337 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29, isUnsigned: true)
!338 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30, isUnsigned: true)
!339 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31, isUnsigned: true)
!340 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32, isUnsigned: true)
!341 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33, isUnsigned: true)
!342 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34, isUnsigned: true)
!343 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35, isUnsigned: true)
!344 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36, isUnsigned: true)
!345 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37, isUnsigned: true)
!346 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38, isUnsigned: true)
!347 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39, isUnsigned: true)
!348 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40, isUnsigned: true)
!349 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41, isUnsigned: true)
!350 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42, isUnsigned: true)
!351 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43, isUnsigned: true)
!352 = !DIEnumerator(name: "BOXED_PATTERN", value: 44, isUnsigned: true)
!353 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45, isUnsigned: true)
!354 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46, isUnsigned: true)
!355 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47, isUnsigned: true)
!356 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48, isUnsigned: true)
!357 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49, isUnsigned: true)
!358 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50, isUnsigned: true)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !6, line: 715, baseType: !185, size: 32, elements: !360)
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIEnumerator(name: "pRED", value: 0, isUnsigned: true)
!362 = !DIEnumerator(name: "pGREEN", value: 1, isUnsigned: true)
!363 = !DIEnumerator(name: "pBLUE", value: 2, isUnsigned: true)
!364 = !DIEnumerator(name: "pFILTER", value: 3, isUnsigned: true)
!365 = !DIEnumerator(name: "pTRANSM", value: 4, isUnsigned: true)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !6, line: 700, baseType: !185, size: 32, elements: !367)
!367 = !{!368, !369}
!368 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!369 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !6, line: 706, baseType: !185, size: 32, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!376 = !{!22, !40, !134}
!377 = !{!275, !280, !282, !298, !0, !277, !284, !286, !288, !290, !292, !294, !296, !378, !380, !385, !387, !390, !392, !396}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "Black_White_Entries", linkageName: "_ZN3povL19Black_White_EntriesE", scope: !2, file: !3, line: 68, type: !4, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "Bozo_Entries", linkageName: "_ZN3povL12Bozo_EntriesE", scope: !2, file: !3, line: 75, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1536, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 6)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "Wood_Entries", linkageName: "_ZN3povL12Wood_EntriesE", scope: !2, file: !3, line: 86, type: !4, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "Mandel_Entries", linkageName: "_ZN3povL14Mandel_EntriesE", scope: !2, file: !3, line: 93, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1280, elements: !19)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "Agate_Entries", linkageName: "_ZN3povL13Agate_EntriesE", scope: !2, file: !3, line: 103, type: !382, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "Radial_Entries", linkageName: "_ZN3povL14Radial_EntriesE", scope: !2, file: !3, line: 114, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, elements: !395)
!395 = !{!220}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "Marble_Entries", linkageName: "_ZN3povL14Marble_EntriesE", scope: !2, file: !3, line: 123, type: !279, isLocal: true, isDefinition: true)
!398 = !{!399, !406, !412, !414, !416, !420, !422, !424, !426, !428, !430, !432, !434, !439, !443, !445, !447, !451, !453, !455, !457, !459, !461, !463, !466, !468, !470, !474, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !503, !507, !509, !511, !513, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !541, !545, !549, !551, !553, !555, !557, !559, !561, !563, !565, !567, !571, !575, !579, !581, !583, !585, !590, !594, !598, !600, !602, !604, !606, !608, !610, !612, !614, !616, !618, !620, !622, !627, !631, !635, !637, !639, !641, !647, !651, !655, !657, !659, !661, !663, !665, !667, !671, !675, !677, !679, !681, !683, !687, !691, !695, !697, !699, !701, !703, !705, !707, !711, !715, !719, !721, !725, !729, !731, !733, !735, !737, !739, !741, !747, !752, !756, !762, !764, !769, !771, !773, !777, !781, !794, !798, !802, !806, !810, !815, !819, !823, !827, !831, !839, !843, !847, !849, !853, !857, !861, !867, !871, !875, !877, !885, !889, !896, !898, !902, !906, !910, !914, !919, !923, !927, !928, !929, !930, !932, !933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !975, !977, !979, !981, !983, !985, !987, !989, !991, !993, !995, !997, !999, !1001, !1007, !1011, !1017, !1021, !1025, !1029, !1033, !1035, !1037, !1041, !1045, !1049, !1053, !1057, !1059, !1061, !1063, !1067, !1071, !1075, !1077, !1079, !1082, !1084, !1085, !1087, !1089, !1090, !1092, !1094, !1096, !1098, !1100, !1102, !1104, !1106, !1108, !1110, !1112, !1114}
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !401, file: !405, line: 52)
!400 = !DINamespace(name: "std", scope: null)
!401 = !DISubprogram(name: "abs", scope: !402, file: !402, line: 840, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!403 = !DISubroutineType(types: !404)
!404 = !{!31, !31}
!405 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !407, file: !411, line: 83)
!407 = !DISubprogram(name: "acos", scope: !408, file: !408, line: 53, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!409 = !DISubroutineType(types: !410)
!410 = !{!70, !70}
!411 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !413, file: !411, line: 102)
!413 = !DISubprogram(name: "asin", scope: !408, file: !408, line: 55, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !415, file: !411, line: 121)
!415 = !DISubprogram(name: "atan", scope: !408, file: !408, line: 57, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !417, file: !411, line: 140)
!417 = !DISubprogram(name: "atan2", scope: !408, file: !408, line: 59, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{!70, !70, !70}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !421, file: !411, line: 161)
!421 = !DISubprogram(name: "ceil", scope: !408, file: !408, line: 159, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !423, file: !411, line: 180)
!423 = !DISubprogram(name: "cos", scope: !408, file: !408, line: 62, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !425, file: !411, line: 199)
!425 = !DISubprogram(name: "cosh", scope: !408, file: !408, line: 71, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !427, file: !411, line: 218)
!427 = !DISubprogram(name: "exp", scope: !408, file: !408, line: 95, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !429, file: !411, line: 237)
!429 = !DISubprogram(name: "fabs", scope: !408, file: !408, line: 162, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !431, file: !411, line: 256)
!431 = !DISubprogram(name: "floor", scope: !408, file: !408, line: 165, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !433, file: !411, line: 275)
!433 = !DISubprogram(name: "fmod", scope: !408, file: !408, line: 168, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !435, file: !411, line: 296)
!435 = !DISubprogram(name: "frexp", scope: !408, file: !408, line: 98, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!70, !70, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !440, file: !411, line: 315)
!440 = !DISubprogram(name: "ldexp", scope: !408, file: !408, line: 101, type: !441, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!70, !70, !31}
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !444, file: !411, line: 334)
!444 = !DISubprogram(name: "log", scope: !408, file: !408, line: 104, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !446, file: !411, line: 353)
!446 = !DISubprogram(name: "log10", scope: !408, file: !408, line: 107, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !448, file: !411, line: 372)
!448 = !DISubprogram(name: "modf", scope: !408, file: !408, line: 110, type: !449, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DISubroutineType(types: !450)
!450 = !{!70, !70, !192}
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !452, file: !411, line: 384)
!452 = !DISubprogram(name: "pow", scope: !408, file: !408, line: 140, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !454, file: !411, line: 421)
!454 = !DISubprogram(name: "sin", scope: !408, file: !408, line: 64, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !456, file: !411, line: 440)
!456 = !DISubprogram(name: "sinh", scope: !408, file: !408, line: 73, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !458, file: !411, line: 459)
!458 = !DISubprogram(name: "sqrt", scope: !408, file: !408, line: 143, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !460, file: !411, line: 478)
!460 = !DISubprogram(name: "tan", scope: !408, file: !408, line: 66, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !462, file: !411, line: 497)
!462 = !DISubprogram(name: "tanh", scope: !408, file: !408, line: 75, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !464, file: !411, line: 1065)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !465, line: 150, baseType: !70)
!465 = !DIFile(filename: "/usr/include/math.h", directory: "")
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !467, file: !411, line: 1066)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !465, line: 149, baseType: !10)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !469, file: !411, line: 1069)
!469 = !DISubprogram(name: "acosh", scope: !408, file: !408, line: 85, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !471, file: !411, line: 1070)
!471 = !DISubprogram(name: "acoshf", scope: !408, file: !408, line: 85, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{!10, !10}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !475, file: !411, line: 1071)
!475 = !DISubprogram(name: "acoshl", scope: !408, file: !408, line: 85, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !478}
!478 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !480, file: !411, line: 1073)
!480 = !DISubprogram(name: "asinh", scope: !408, file: !408, line: 87, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !482, file: !411, line: 1074)
!482 = !DISubprogram(name: "asinhf", scope: !408, file: !408, line: 87, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !484, file: !411, line: 1075)
!484 = !DISubprogram(name: "asinhl", scope: !408, file: !408, line: 87, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !486, file: !411, line: 1077)
!486 = !DISubprogram(name: "atanh", scope: !408, file: !408, line: 89, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !488, file: !411, line: 1078)
!488 = !DISubprogram(name: "atanhf", scope: !408, file: !408, line: 89, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !490, file: !411, line: 1079)
!490 = !DISubprogram(name: "atanhl", scope: !408, file: !408, line: 89, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !492, file: !411, line: 1081)
!492 = !DISubprogram(name: "cbrt", scope: !408, file: !408, line: 152, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !494, file: !411, line: 1082)
!494 = !DISubprogram(name: "cbrtf", scope: !408, file: !408, line: 152, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !496, file: !411, line: 1083)
!496 = !DISubprogram(name: "cbrtl", scope: !408, file: !408, line: 152, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !498, file: !411, line: 1085)
!498 = !DISubprogram(name: "copysign", scope: !408, file: !408, line: 196, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !500, file: !411, line: 1086)
!500 = !DISubprogram(name: "copysignf", scope: !408, file: !408, line: 196, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!10, !10, !10}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !504, file: !411, line: 1087)
!504 = !DISubprogram(name: "copysignl", scope: !408, file: !408, line: 196, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!478, !478, !478}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !508, file: !411, line: 1089)
!508 = !DISubprogram(name: "erf", scope: !408, file: !408, line: 228, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !510, file: !411, line: 1090)
!510 = !DISubprogram(name: "erff", scope: !408, file: !408, line: 228, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !512, file: !411, line: 1091)
!512 = !DISubprogram(name: "erfl", scope: !408, file: !408, line: 228, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !514, file: !411, line: 1093)
!514 = !DISubprogram(name: "erfc", scope: !408, file: !408, line: 229, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !516, file: !411, line: 1094)
!516 = !DISubprogram(name: "erfcf", scope: !408, file: !408, line: 229, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !518, file: !411, line: 1095)
!518 = !DISubprogram(name: "erfcl", scope: !408, file: !408, line: 229, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !520, file: !411, line: 1097)
!520 = !DISubprogram(name: "exp2", scope: !408, file: !408, line: 130, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !522, file: !411, line: 1098)
!522 = !DISubprogram(name: "exp2f", scope: !408, file: !408, line: 130, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !524, file: !411, line: 1099)
!524 = !DISubprogram(name: "exp2l", scope: !408, file: !408, line: 130, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !526, file: !411, line: 1101)
!526 = !DISubprogram(name: "expm1", scope: !408, file: !408, line: 119, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !528, file: !411, line: 1102)
!528 = !DISubprogram(name: "expm1f", scope: !408, file: !408, line: 119, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !530, file: !411, line: 1103)
!530 = !DISubprogram(name: "expm1l", scope: !408, file: !408, line: 119, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !532, file: !411, line: 1105)
!532 = !DISubprogram(name: "fdim", scope: !408, file: !408, line: 326, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !534, file: !411, line: 1106)
!534 = !DISubprogram(name: "fdimf", scope: !408, file: !408, line: 326, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !536, file: !411, line: 1107)
!536 = !DISubprogram(name: "fdiml", scope: !408, file: !408, line: 326, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !538, file: !411, line: 1109)
!538 = !DISubprogram(name: "fma", scope: !408, file: !408, line: 335, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!70, !70, !70, !70}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !542, file: !411, line: 1110)
!542 = !DISubprogram(name: "fmaf", scope: !408, file: !408, line: 335, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!10, !10, !10, !10}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !546, file: !411, line: 1111)
!546 = !DISubprogram(name: "fmal", scope: !408, file: !408, line: 335, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!478, !478, !478, !478}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !550, file: !411, line: 1113)
!550 = !DISubprogram(name: "fmax", scope: !408, file: !408, line: 329, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !552, file: !411, line: 1114)
!552 = !DISubprogram(name: "fmaxf", scope: !408, file: !408, line: 329, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !554, file: !411, line: 1115)
!554 = !DISubprogram(name: "fmaxl", scope: !408, file: !408, line: 329, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !556, file: !411, line: 1117)
!556 = !DISubprogram(name: "fmin", scope: !408, file: !408, line: 332, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !558, file: !411, line: 1118)
!558 = !DISubprogram(name: "fminf", scope: !408, file: !408, line: 332, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !560, file: !411, line: 1119)
!560 = !DISubprogram(name: "fminl", scope: !408, file: !408, line: 332, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !562, file: !411, line: 1121)
!562 = !DISubprogram(name: "hypot", scope: !408, file: !408, line: 147, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !564, file: !411, line: 1122)
!564 = !DISubprogram(name: "hypotf", scope: !408, file: !408, line: 147, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !566, file: !411, line: 1123)
!566 = !DISubprogram(name: "hypotl", scope: !408, file: !408, line: 147, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !568, file: !411, line: 1125)
!568 = !DISubprogram(name: "ilogb", scope: !408, file: !408, line: 280, type: !569, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{!31, !70}
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !572, file: !411, line: 1126)
!572 = !DISubprogram(name: "ilogbf", scope: !408, file: !408, line: 280, type: !573, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!31, !10}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !576, file: !411, line: 1127)
!576 = !DISubprogram(name: "ilogbl", scope: !408, file: !408, line: 280, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!31, !478}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !580, file: !411, line: 1129)
!580 = !DISubprogram(name: "lgamma", scope: !408, file: !408, line: 230, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !582, file: !411, line: 1130)
!582 = !DISubprogram(name: "lgammaf", scope: !408, file: !408, line: 230, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !584, file: !411, line: 1131)
!584 = !DISubprogram(name: "lgammal", scope: !408, file: !408, line: 230, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !586, file: !411, line: 1134)
!586 = !DISubprogram(name: "llrint", scope: !408, file: !408, line: 316, type: !587, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DISubroutineType(types: !588)
!588 = !{!589, !70}
!589 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !591, file: !411, line: 1135)
!591 = !DISubprogram(name: "llrintf", scope: !408, file: !408, line: 316, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!589, !10}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !595, file: !411, line: 1136)
!595 = !DISubprogram(name: "llrintl", scope: !408, file: !408, line: 316, type: !596, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{!589, !478}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !599, file: !411, line: 1138)
!599 = !DISubprogram(name: "llround", scope: !408, file: !408, line: 322, type: !587, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !601, file: !411, line: 1139)
!601 = !DISubprogram(name: "llroundf", scope: !408, file: !408, line: 322, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !603, file: !411, line: 1140)
!603 = !DISubprogram(name: "llroundl", scope: !408, file: !408, line: 322, type: !596, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !605, file: !411, line: 1143)
!605 = !DISubprogram(name: "log1p", scope: !408, file: !408, line: 122, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !607, file: !411, line: 1144)
!607 = !DISubprogram(name: "log1pf", scope: !408, file: !408, line: 122, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !609, file: !411, line: 1145)
!609 = !DISubprogram(name: "log1pl", scope: !408, file: !408, line: 122, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !611, file: !411, line: 1147)
!611 = !DISubprogram(name: "log2", scope: !408, file: !408, line: 133, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !613, file: !411, line: 1148)
!613 = !DISubprogram(name: "log2f", scope: !408, file: !408, line: 133, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !615, file: !411, line: 1149)
!615 = !DISubprogram(name: "log2l", scope: !408, file: !408, line: 133, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !617, file: !411, line: 1151)
!617 = !DISubprogram(name: "logb", scope: !408, file: !408, line: 125, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !619, file: !411, line: 1152)
!619 = !DISubprogram(name: "logbf", scope: !408, file: !408, line: 125, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !621, file: !411, line: 1153)
!621 = !DISubprogram(name: "logbl", scope: !408, file: !408, line: 125, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !623, file: !411, line: 1155)
!623 = !DISubprogram(name: "lrint", scope: !408, file: !408, line: 314, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!626, !70}
!626 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !628, file: !411, line: 1156)
!628 = !DISubprogram(name: "lrintf", scope: !408, file: !408, line: 314, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!626, !10}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !632, file: !411, line: 1157)
!632 = !DISubprogram(name: "lrintl", scope: !408, file: !408, line: 314, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!626, !478}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !636, file: !411, line: 1159)
!636 = !DISubprogram(name: "lround", scope: !408, file: !408, line: 320, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !638, file: !411, line: 1160)
!638 = !DISubprogram(name: "lroundf", scope: !408, file: !408, line: 320, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !640, file: !411, line: 1161)
!640 = !DISubprogram(name: "lroundl", scope: !408, file: !408, line: 320, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !642, file: !411, line: 1163)
!642 = !DISubprogram(name: "nan", scope: !408, file: !408, line: 201, type: !643, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DISubroutineType(types: !644)
!644 = !{!70, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !648, file: !411, line: 1164)
!648 = !DISubprogram(name: "nanf", scope: !408, file: !408, line: 201, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!10, !645}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !652, file: !411, line: 1165)
!652 = !DISubprogram(name: "nanl", scope: !408, file: !408, line: 201, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!478, !645}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !656, file: !411, line: 1167)
!656 = !DISubprogram(name: "nearbyint", scope: !408, file: !408, line: 294, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !658, file: !411, line: 1168)
!658 = !DISubprogram(name: "nearbyintf", scope: !408, file: !408, line: 294, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !660, file: !411, line: 1169)
!660 = !DISubprogram(name: "nearbyintl", scope: !408, file: !408, line: 294, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !662, file: !411, line: 1171)
!662 = !DISubprogram(name: "nextafter", scope: !408, file: !408, line: 259, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !664, file: !411, line: 1172)
!664 = !DISubprogram(name: "nextafterf", scope: !408, file: !408, line: 259, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !666, file: !411, line: 1173)
!666 = !DISubprogram(name: "nextafterl", scope: !408, file: !408, line: 259, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !668, file: !411, line: 1175)
!668 = !DISubprogram(name: "nexttoward", scope: !408, file: !408, line: 261, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!70, !70, !478}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !672, file: !411, line: 1176)
!672 = !DISubprogram(name: "nexttowardf", scope: !408, file: !408, line: 261, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!10, !10, !478}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !676, file: !411, line: 1177)
!676 = !DISubprogram(name: "nexttowardl", scope: !408, file: !408, line: 261, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !678, file: !411, line: 1179)
!678 = !DISubprogram(name: "remainder", scope: !408, file: !408, line: 272, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !680, file: !411, line: 1180)
!680 = !DISubprogram(name: "remainderf", scope: !408, file: !408, line: 272, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !682, file: !411, line: 1181)
!682 = !DISubprogram(name: "remainderl", scope: !408, file: !408, line: 272, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !684, file: !411, line: 1183)
!684 = !DISubprogram(name: "remquo", scope: !408, file: !408, line: 307, type: !685, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{!70, !70, !70, !438}
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !688, file: !411, line: 1184)
!688 = !DISubprogram(name: "remquof", scope: !408, file: !408, line: 307, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!10, !10, !10, !438}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !692, file: !411, line: 1185)
!692 = !DISubprogram(name: "remquol", scope: !408, file: !408, line: 307, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{!478, !478, !478, !438}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !696, file: !411, line: 1187)
!696 = !DISubprogram(name: "rint", scope: !408, file: !408, line: 256, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !698, file: !411, line: 1188)
!698 = !DISubprogram(name: "rintf", scope: !408, file: !408, line: 256, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !700, file: !411, line: 1189)
!700 = !DISubprogram(name: "rintl", scope: !408, file: !408, line: 256, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !702, file: !411, line: 1191)
!702 = !DISubprogram(name: "round", scope: !408, file: !408, line: 298, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !704, file: !411, line: 1192)
!704 = !DISubprogram(name: "roundf", scope: !408, file: !408, line: 298, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !706, file: !411, line: 1193)
!706 = !DISubprogram(name: "roundl", scope: !408, file: !408, line: 298, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !708, file: !411, line: 1195)
!708 = !DISubprogram(name: "scalbln", scope: !408, file: !408, line: 290, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{!70, !70, !626}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !712, file: !411, line: 1196)
!712 = !DISubprogram(name: "scalblnf", scope: !408, file: !408, line: 290, type: !713, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!10, !10, !626}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !716, file: !411, line: 1197)
!716 = !DISubprogram(name: "scalblnl", scope: !408, file: !408, line: 290, type: !717, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!478, !478, !626}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !720, file: !411, line: 1199)
!720 = !DISubprogram(name: "scalbn", scope: !408, file: !408, line: 276, type: !441, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !722, file: !411, line: 1200)
!722 = !DISubprogram(name: "scalbnf", scope: !408, file: !408, line: 276, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!10, !10, !31}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !726, file: !411, line: 1201)
!726 = !DISubprogram(name: "scalbnl", scope: !408, file: !408, line: 276, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!478, !478, !31}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !730, file: !411, line: 1203)
!730 = !DISubprogram(name: "tgamma", scope: !408, file: !408, line: 235, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !732, file: !411, line: 1204)
!732 = !DISubprogram(name: "tgammaf", scope: !408, file: !408, line: 235, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !734, file: !411, line: 1205)
!734 = !DISubprogram(name: "tgammal", scope: !408, file: !408, line: 235, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !736, file: !411, line: 1207)
!736 = !DISubprogram(name: "trunc", scope: !408, file: !408, line: 302, type: !409, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !738, file: !411, line: 1208)
!738 = !DISubprogram(name: "truncf", scope: !408, file: !408, line: 302, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !740, file: !411, line: 1209)
!740 = !DISubprogram(name: "truncl", scope: !408, file: !408, line: 302, type: !476, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !742, file: !746, line: 38)
!742 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !400, file: !405, line: 103, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!745, !745}
!745 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!746 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !748, file: !746, line: 54)
!748 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !400, file: !411, line: 380, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!478, !478, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !753, file: !755, line: 127)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !402, line: 62, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!755 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !757, file: !755, line: 128)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !402, line: 70, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !759, identifier: "_ZTS6ldiv_t")
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !758, file: !402, line: 68, baseType: !626, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !758, file: !402, line: 69, baseType: !626, size: 64, offset: 64)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !763, file: !755, line: 130)
!763 = !DISubprogram(name: "abort", scope: !402, file: !402, line: 591, type: !301, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !765, file: !755, line: 134)
!765 = !DISubprogram(name: "atexit", scope: !402, file: !402, line: 595, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!31, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !770, file: !755, line: 137)
!770 = !DISubprogram(name: "at_quick_exit", scope: !402, file: !402, line: 600, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !772, file: !755, line: 140)
!772 = !DISubprogram(name: "atof", scope: !402, file: !402, line: 101, type: !643, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !774, file: !755, line: 141)
!774 = !DISubprogram(name: "atoi", scope: !402, file: !402, line: 104, type: !775, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!31, !645}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !778, file: !755, line: 142)
!778 = !DISubprogram(name: "atol", scope: !402, file: !402, line: 107, type: !779, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DISubroutineType(types: !780)
!780 = !{!626, !645}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !782, file: !755, line: 143)
!782 = !DISubprogram(name: "bsearch", scope: !402, file: !402, line: 820, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!134, !785, !785, !787, !787, !790}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !788, line: 46, baseType: !789)
!788 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!789 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !402, line: 808, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!31, !785, !785}
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !795, file: !755, line: 144)
!795 = !DISubprogram(name: "calloc", scope: !402, file: !402, line: 542, type: !796, flags: DIFlagPrototyped, spFlags: 0)
!796 = !DISubroutineType(types: !797)
!797 = !{!134, !787, !787}
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !799, file: !755, line: 145)
!799 = !DISubprogram(name: "div", scope: !402, file: !402, line: 852, type: !800, flags: DIFlagPrototyped, spFlags: 0)
!800 = !DISubroutineType(types: !801)
!801 = !{!753, !31, !31}
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !803, file: !755, line: 146)
!803 = !DISubprogram(name: "exit", scope: !402, file: !402, line: 617, type: !804, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !31}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !807, file: !755, line: 147)
!807 = !DISubprogram(name: "free", scope: !402, file: !402, line: 565, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !134}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !811, file: !755, line: 148)
!811 = !DISubprogram(name: "getenv", scope: !402, file: !402, line: 634, type: !812, flags: DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !645}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !816, file: !755, line: 149)
!816 = !DISubprogram(name: "labs", scope: !402, file: !402, line: 841, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!626, !626}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !820, file: !755, line: 150)
!820 = !DISubprogram(name: "ldiv", scope: !402, file: !402, line: 854, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!757, !626, !626}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !824, file: !755, line: 151)
!824 = !DISubprogram(name: "malloc", scope: !402, file: !402, line: 539, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!134, !787}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !828, file: !755, line: 153)
!828 = !DISubprogram(name: "mblen", scope: !402, file: !402, line: 922, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!31, !645, !787}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !832, file: !755, line: 154)
!832 = !DISubprogram(name: "mbstowcs", scope: !402, file: !402, line: 933, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!787, !835, !838, !787}
!835 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!838 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !645)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !840, file: !755, line: 155)
!840 = !DISubprogram(name: "mbtowc", scope: !402, file: !402, line: 925, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!31, !835, !838, !787}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !844, file: !755, line: 157)
!844 = !DISubprogram(name: "qsort", scope: !402, file: !402, line: 830, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !134, !787, !787, !790}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !848, file: !755, line: 160)
!848 = !DISubprogram(name: "quick_exit", scope: !402, file: !402, line: 623, type: !804, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !850, file: !755, line: 163)
!850 = !DISubprogram(name: "rand", scope: !402, file: !402, line: 453, type: !851, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DISubroutineType(types: !852)
!852 = !{!31}
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !854, file: !755, line: 164)
!854 = !DISubprogram(name: "realloc", scope: !402, file: !402, line: 550, type: !855, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DISubroutineType(types: !856)
!856 = !{!134, !134, !787}
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !858, file: !755, line: 165)
!858 = !DISubprogram(name: "srand", scope: !402, file: !402, line: 455, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !185}
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !862, file: !755, line: 166)
!862 = !DISubprogram(name: "strtod", scope: !402, file: !402, line: 117, type: !863, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!70, !838, !865}
!865 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !868, file: !755, line: 167)
!868 = !DISubprogram(name: "strtol", scope: !402, file: !402, line: 176, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!626, !838, !865, !31}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !872, file: !755, line: 168)
!872 = !DISubprogram(name: "strtoul", scope: !402, file: !402, line: 180, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!789, !838, !865, !31}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !876, file: !755, line: 169)
!876 = !DISubprogram(name: "system", scope: !402, file: !402, line: 784, type: !775, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !878, file: !755, line: 171)
!878 = !DISubprogram(name: "wcstombs", scope: !402, file: !402, line: 936, type: !879, flags: DIFlagPrototyped, spFlags: 0)
!879 = !DISubroutineType(types: !880)
!880 = !{!787, !881, !882, !787}
!881 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !814)
!882 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !886, file: !755, line: 172)
!886 = !DISubprogram(name: "wctomb", scope: !402, file: !402, line: 929, type: !887, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{!31, !814, !837}
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !891, file: !755, line: 200)
!890 = !DINamespace(name: "__gnu_cxx", scope: null)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !402, line: 80, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !893, identifier: "_ZTS7lldiv_t")
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !892, file: !402, line: 78, baseType: !589, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !892, file: !402, line: 79, baseType: !589, size: 64, offset: 64)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !897, file: !755, line: 206)
!897 = !DISubprogram(name: "_Exit", scope: !402, file: !402, line: 629, type: !804, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !899, file: !755, line: 210)
!899 = !DISubprogram(name: "llabs", scope: !402, file: !402, line: 844, type: !900, flags: DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{!589, !589}
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !903, file: !755, line: 216)
!903 = !DISubprogram(name: "lldiv", scope: !402, file: !402, line: 858, type: !904, flags: DIFlagPrototyped, spFlags: 0)
!904 = !DISubroutineType(types: !905)
!905 = !{!891, !589, !589}
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !907, file: !755, line: 227)
!907 = !DISubprogram(name: "atoll", scope: !402, file: !402, line: 112, type: !908, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DISubroutineType(types: !909)
!909 = !{!589, !645}
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !911, file: !755, line: 228)
!911 = !DISubprogram(name: "strtoll", scope: !402, file: !402, line: 200, type: !912, flags: DIFlagPrototyped, spFlags: 0)
!912 = !DISubroutineType(types: !913)
!913 = !{!589, !838, !865, !31}
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !915, file: !755, line: 229)
!915 = !DISubprogram(name: "strtoull", scope: !402, file: !402, line: 205, type: !916, flags: DIFlagPrototyped, spFlags: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{!918, !838, !865, !31}
!918 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !920, file: !755, line: 231)
!920 = !DISubprogram(name: "strtof", scope: !402, file: !402, line: 123, type: !921, flags: DIFlagPrototyped, spFlags: 0)
!921 = !DISubroutineType(types: !922)
!922 = !{!10, !838, !865}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !890, entity: !924, file: !755, line: 232)
!924 = !DISubprogram(name: "strtold", scope: !402, file: !402, line: 126, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DISubroutineType(types: !926)
!926 = !{!478, !838, !865}
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !891, file: !755, line: 240)
!928 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !897, file: !755, line: 242)
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !899, file: !755, line: 244)
!930 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !931, file: !755, line: 245)
!931 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !890, file: !755, line: 213, type: !904, flags: DIFlagPrototyped, spFlags: 0)
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !903, file: !755, line: 246)
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !907, file: !755, line: 248)
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !920, file: !755, line: 249)
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !911, file: !755, line: 250)
!936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !915, file: !755, line: 251)
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !400, entity: !924, file: !755, line: 252)
!938 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !303, entity: !763, file: !939, line: 38)
!939 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
