; ModuleID = 'spheres.cpp'
source_filename = "spheres.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Sphere_Methods", linkageName: "_ZN3pov14Sphere_MethodsE", scope: !2, file: !3, line: 72, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "spheres.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "Ellipsoid_Methods", linkageName: "_ZN3pov17Ellipsoid_MethodsE", scope: !2, file: !3, line: 84, type: !4, isLocal: false, isDefinition: true)
!151 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !152, retainedTypes: !290, globals: !312, imports: !316, splitDebugInlining: false, nameTableKind: None)
!152 = !{!153, !280, !286}
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !154, line: 149, baseType: !56, size: 32, elements: !155, identifier: "_ZTSN3pov5STATSE")
!154 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!156 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!157 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!158 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!159 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!160 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!161 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!162 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!163 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!164 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!165 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!166 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!167 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!170 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!171 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!172 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!173 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!206 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!207 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!216 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!217 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!234 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!235 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!238 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!239 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!244 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!245 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!246 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!247 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!251 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!252 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!253 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!254 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!255 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!256 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!257 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!258 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!259 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!260 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!261 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!262 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!263 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!264 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!265 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!266 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!267 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!268 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!269 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!270 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!271 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!272 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!273 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!274 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!275 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!276 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!277 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!278 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!279 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !56, size: 32, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!290 = !{!291, !104, !44}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHERE", scope: !2, file: !293, line: 49, baseType: !294)
!293 = !DIFile(filename: "./spheres.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sphere_Struct", scope: !2, file: !293, line: 51, size: 1216, flags: DIFlagTypePassByValue, elements: !295, identifier: "_ZTSN3pov13Sphere_StructE")
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !294, file: !293, line: 53, baseType: !19, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !294, file: !293, line: 53, baseType: !13, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !294, file: !293, line: 53, baseType: !14, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !294, file: !293, line: 53, baseType: !23, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !294, file: !293, line: 53, baseType: !23, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !294, file: !293, line: 53, baseType: !28, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !294, file: !293, line: 53, baseType: !14, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !294, file: !293, line: 53, baseType: !14, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !294, file: !293, line: 53, baseType: !34, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !294, file: !293, line: 53, baseType: !38, size: 192, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !294, file: !293, line: 53, baseType: !50, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !294, file: !293, line: 53, baseType: !50, size: 64, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !294, file: !293, line: 53, baseType: !45, size: 32, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !294, file: !293, line: 53, baseType: !56, size: 32, offset: 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !294, file: !293, line: 54, baseType: !62, size: 192, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !294, file: !293, line: 55, baseType: !64, size: 64, offset: 1152)
!312 = !{!0, !149, !313}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!314 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 46, type: !315, isLocal: true, isDefinition: true)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!316 = !{!317, !324, !330, !332, !334, !338, !340, !342, !344, !346, !348, !350, !352, !357, !361, !363, !365, !369, !371, !373, !375, !377, !379, !381, !384, !386, !388, !392, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !421, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !459, !463, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !489, !493, !497, !499, !501, !503, !508, !512, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !545, !549, !553, !555, !557, !559, !566, !570, !574, !576, !578, !580, !582, !584, !586, !590, !594, !596, !598, !600, !602, !606, !610, !614, !616, !618, !620, !622, !624, !626, !630, !634, !638, !640, !644, !648, !650, !652, !654, !656, !658, !660, !666, !671, !675, !681, !685, !690, !692, !694, !698, !702, !715, !719, !723, !727, !731, !736, !740, !744, !748, !752, !760, !764, !768, !770, !774, !778, !782, !788, !792, !796, !798, !806, !810, !817, !819, !823, !827, !831, !835, !840, !844, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !928, !932, !938, !942, !946, !950, !954, !956, !958, !962, !966, !970, !974, !978, !980, !982, !984, !988, !992, !996, !998, !1000, !1003, !1005, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1027, !1028, !1029, !1031, !1033, !1035, !1036}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !319, file: !323, line: 52)
!318 = !DINamespace(name: "std", scope: null)
!319 = !DISubprogram(name: "abs", scope: !320, file: !320, line: 840, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!321 = !DISubroutineType(types: !322)
!322 = !{!13, !13}
!323 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !325, file: !329, line: 83)
!325 = !DISubprogram(name: "acos", scope: !326, file: !326, line: 53, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!327 = !DISubroutineType(types: !328)
!328 = !{!64, !64}
!329 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !331, file: !329, line: 102)
!331 = !DISubprogram(name: "asin", scope: !326, file: !326, line: 55, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !333, file: !329, line: 121)
!333 = !DISubprogram(name: "atan", scope: !326, file: !326, line: 57, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !335, file: !329, line: 140)
!335 = !DISubprogram(name: "atan2", scope: !326, file: !326, line: 59, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DISubroutineType(types: !337)
!337 = !{!64, !64, !64}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !339, file: !329, line: 161)
!339 = !DISubprogram(name: "ceil", scope: !326, file: !326, line: 159, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !341, file: !329, line: 180)
!341 = !DISubprogram(name: "cos", scope: !326, file: !326, line: 62, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !343, file: !329, line: 199)
!343 = !DISubprogram(name: "cosh", scope: !326, file: !326, line: 71, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !345, file: !329, line: 218)
!345 = !DISubprogram(name: "exp", scope: !326, file: !326, line: 95, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !347, file: !329, line: 237)
!347 = !DISubprogram(name: "fabs", scope: !326, file: !326, line: 162, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !349, file: !329, line: 256)
!349 = !DISubprogram(name: "floor", scope: !326, file: !326, line: 165, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !351, file: !329, line: 275)
!351 = !DISubprogram(name: "fmod", scope: !326, file: !326, line: 168, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !353, file: !329, line: 296)
!353 = !DISubprogram(name: "frexp", scope: !326, file: !326, line: 98, type: !354, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DISubroutineType(types: !355)
!355 = !{!64, !64, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !358, file: !329, line: 315)
!358 = !DISubprogram(name: "ldexp", scope: !326, file: !326, line: 101, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!64, !64, !13}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !362, file: !329, line: 334)
!362 = !DISubprogram(name: "log", scope: !326, file: !326, line: 104, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !364, file: !329, line: 353)
!364 = !DISubprogram(name: "log10", scope: !326, file: !326, line: 107, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !366, file: !329, line: 372)
!366 = !DISubprogram(name: "modf", scope: !326, file: !326, line: 110, type: !367, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!64, !64, !113}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !370, file: !329, line: 384)
!370 = !DISubprogram(name: "pow", scope: !326, file: !326, line: 140, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !372, file: !329, line: 421)
!372 = !DISubprogram(name: "sin", scope: !326, file: !326, line: 64, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !374, file: !329, line: 440)
!374 = !DISubprogram(name: "sinh", scope: !326, file: !326, line: 73, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !376, file: !329, line: 459)
!376 = !DISubprogram(name: "sqrt", scope: !326, file: !326, line: 143, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !378, file: !329, line: 478)
!378 = !DISubprogram(name: "tan", scope: !326, file: !326, line: 66, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !380, file: !329, line: 497)
!380 = !DISubprogram(name: "tanh", scope: !326, file: !326, line: 75, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !382, file: !329, line: 1065)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !383, line: 150, baseType: !64)
!383 = !DIFile(filename: "/usr/include/math.h", directory: "")
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !385, file: !329, line: 1066)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !383, line: 149, baseType: !45)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !387, file: !329, line: 1069)
!387 = !DISubprogram(name: "acosh", scope: !326, file: !326, line: 85, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !389, file: !329, line: 1070)
!389 = !DISubprogram(name: "acoshf", scope: !326, file: !326, line: 85, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{!45, !45}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !393, file: !329, line: 1071)
!393 = !DISubprogram(name: "acoshl", scope: !326, file: !326, line: 85, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !396}
!396 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !398, file: !329, line: 1073)
!398 = !DISubprogram(name: "asinh", scope: !326, file: !326, line: 87, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !400, file: !329, line: 1074)
!400 = !DISubprogram(name: "asinhf", scope: !326, file: !326, line: 87, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !402, file: !329, line: 1075)
!402 = !DISubprogram(name: "asinhl", scope: !326, file: !326, line: 87, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !404, file: !329, line: 1077)
!404 = !DISubprogram(name: "atanh", scope: !326, file: !326, line: 89, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !406, file: !329, line: 1078)
!406 = !DISubprogram(name: "atanhf", scope: !326, file: !326, line: 89, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !408, file: !329, line: 1079)
!408 = !DISubprogram(name: "atanhl", scope: !326, file: !326, line: 89, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !410, file: !329, line: 1081)
!410 = !DISubprogram(name: "cbrt", scope: !326, file: !326, line: 152, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !412, file: !329, line: 1082)
!412 = !DISubprogram(name: "cbrtf", scope: !326, file: !326, line: 152, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !414, file: !329, line: 1083)
!414 = !DISubprogram(name: "cbrtl", scope: !326, file: !326, line: 152, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !416, file: !329, line: 1085)
!416 = !DISubprogram(name: "copysign", scope: !326, file: !326, line: 196, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !418, file: !329, line: 1086)
!418 = !DISubprogram(name: "copysignf", scope: !326, file: !326, line: 196, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DISubroutineType(types: !420)
!420 = !{!45, !45, !45}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !422, file: !329, line: 1087)
!422 = !DISubprogram(name: "copysignl", scope: !326, file: !326, line: 196, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!396, !396, !396}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !426, file: !329, line: 1089)
!426 = !DISubprogram(name: "erf", scope: !326, file: !326, line: 228, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !428, file: !329, line: 1090)
!428 = !DISubprogram(name: "erff", scope: !326, file: !326, line: 228, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !430, file: !329, line: 1091)
!430 = !DISubprogram(name: "erfl", scope: !326, file: !326, line: 228, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !432, file: !329, line: 1093)
!432 = !DISubprogram(name: "erfc", scope: !326, file: !326, line: 229, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !434, file: !329, line: 1094)
!434 = !DISubprogram(name: "erfcf", scope: !326, file: !326, line: 229, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !436, file: !329, line: 1095)
!436 = !DISubprogram(name: "erfcl", scope: !326, file: !326, line: 229, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !438, file: !329, line: 1097)
!438 = !DISubprogram(name: "exp2", scope: !326, file: !326, line: 130, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !440, file: !329, line: 1098)
!440 = !DISubprogram(name: "exp2f", scope: !326, file: !326, line: 130, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !442, file: !329, line: 1099)
!442 = !DISubprogram(name: "exp2l", scope: !326, file: !326, line: 130, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !444, file: !329, line: 1101)
!444 = !DISubprogram(name: "expm1", scope: !326, file: !326, line: 119, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !446, file: !329, line: 1102)
!446 = !DISubprogram(name: "expm1f", scope: !326, file: !326, line: 119, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !448, file: !329, line: 1103)
!448 = !DISubprogram(name: "expm1l", scope: !326, file: !326, line: 119, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !450, file: !329, line: 1105)
!450 = !DISubprogram(name: "fdim", scope: !326, file: !326, line: 326, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !452, file: !329, line: 1106)
!452 = !DISubprogram(name: "fdimf", scope: !326, file: !326, line: 326, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !454, file: !329, line: 1107)
!454 = !DISubprogram(name: "fdiml", scope: !326, file: !326, line: 326, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !456, file: !329, line: 1109)
!456 = !DISubprogram(name: "fma", scope: !326, file: !326, line: 335, type: !457, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!64, !64, !64, !64}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !460, file: !329, line: 1110)
!460 = !DISubprogram(name: "fmaf", scope: !326, file: !326, line: 335, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!45, !45, !45, !45}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !464, file: !329, line: 1111)
!464 = !DISubprogram(name: "fmal", scope: !326, file: !326, line: 335, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!396, !396, !396, !396}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !468, file: !329, line: 1113)
!468 = !DISubprogram(name: "fmax", scope: !326, file: !326, line: 329, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !470, file: !329, line: 1114)
!470 = !DISubprogram(name: "fmaxf", scope: !326, file: !326, line: 329, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !472, file: !329, line: 1115)
!472 = !DISubprogram(name: "fmaxl", scope: !326, file: !326, line: 329, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !474, file: !329, line: 1117)
!474 = !DISubprogram(name: "fmin", scope: !326, file: !326, line: 332, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !476, file: !329, line: 1118)
!476 = !DISubprogram(name: "fminf", scope: !326, file: !326, line: 332, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !478, file: !329, line: 1119)
!478 = !DISubprogram(name: "fminl", scope: !326, file: !326, line: 332, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !480, file: !329, line: 1121)
!480 = !DISubprogram(name: "hypot", scope: !326, file: !326, line: 147, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !482, file: !329, line: 1122)
!482 = !DISubprogram(name: "hypotf", scope: !326, file: !326, line: 147, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !484, file: !329, line: 1123)
!484 = !DISubprogram(name: "hypotl", scope: !326, file: !326, line: 147, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !486, file: !329, line: 1125)
!486 = !DISubprogram(name: "ilogb", scope: !326, file: !326, line: 280, type: !487, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{!13, !64}
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !490, file: !329, line: 1126)
!490 = !DISubprogram(name: "ilogbf", scope: !326, file: !326, line: 280, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!13, !45}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !494, file: !329, line: 1127)
!494 = !DISubprogram(name: "ilogbl", scope: !326, file: !326, line: 280, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!13, !396}
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !498, file: !329, line: 1129)
!498 = !DISubprogram(name: "lgamma", scope: !326, file: !326, line: 230, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !500, file: !329, line: 1130)
!500 = !DISubprogram(name: "lgammaf", scope: !326, file: !326, line: 230, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !502, file: !329, line: 1131)
!502 = !DISubprogram(name: "lgammal", scope: !326, file: !326, line: 230, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !504, file: !329, line: 1134)
!504 = !DISubprogram(name: "llrint", scope: !326, file: !326, line: 316, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !64}
!507 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !509, file: !329, line: 1135)
!509 = !DISubprogram(name: "llrintf", scope: !326, file: !326, line: 316, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!507, !45}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !513, file: !329, line: 1136)
!513 = !DISubprogram(name: "llrintl", scope: !326, file: !326, line: 316, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!507, !396}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !517, file: !329, line: 1138)
!517 = !DISubprogram(name: "llround", scope: !326, file: !326, line: 322, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !519, file: !329, line: 1139)
!519 = !DISubprogram(name: "llroundf", scope: !326, file: !326, line: 322, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !521, file: !329, line: 1140)
!521 = !DISubprogram(name: "llroundl", scope: !326, file: !326, line: 322, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !523, file: !329, line: 1143)
!523 = !DISubprogram(name: "log1p", scope: !326, file: !326, line: 122, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !525, file: !329, line: 1144)
!525 = !DISubprogram(name: "log1pf", scope: !326, file: !326, line: 122, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !527, file: !329, line: 1145)
!527 = !DISubprogram(name: "log1pl", scope: !326, file: !326, line: 122, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !529, file: !329, line: 1147)
!529 = !DISubprogram(name: "log2", scope: !326, file: !326, line: 133, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !531, file: !329, line: 1148)
!531 = !DISubprogram(name: "log2f", scope: !326, file: !326, line: 133, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !533, file: !329, line: 1149)
!533 = !DISubprogram(name: "log2l", scope: !326, file: !326, line: 133, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !535, file: !329, line: 1151)
!535 = !DISubprogram(name: "logb", scope: !326, file: !326, line: 125, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !537, file: !329, line: 1152)
!537 = !DISubprogram(name: "logbf", scope: !326, file: !326, line: 125, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !539, file: !329, line: 1153)
!539 = !DISubprogram(name: "logbl", scope: !326, file: !326, line: 125, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !541, file: !329, line: 1155)
!541 = !DISubprogram(name: "lrint", scope: !326, file: !326, line: 314, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !64}
!544 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !546, file: !329, line: 1156)
!546 = !DISubprogram(name: "lrintf", scope: !326, file: !326, line: 314, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!544, !45}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !550, file: !329, line: 1157)
!550 = !DISubprogram(name: "lrintl", scope: !326, file: !326, line: 314, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!544, !396}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !554, file: !329, line: 1159)
!554 = !DISubprogram(name: "lround", scope: !326, file: !326, line: 320, type: !542, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !556, file: !329, line: 1160)
!556 = !DISubprogram(name: "lroundf", scope: !326, file: !326, line: 320, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !558, file: !329, line: 1161)
!558 = !DISubprogram(name: "lroundl", scope: !326, file: !326, line: 320, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !560, file: !329, line: 1163)
!560 = !DISubprogram(name: "nan", scope: !326, file: !326, line: 201, type: !561, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!64, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !567, file: !329, line: 1164)
!567 = !DISubprogram(name: "nanf", scope: !326, file: !326, line: 201, type: !568, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{!45, !563}
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !571, file: !329, line: 1165)
!571 = !DISubprogram(name: "nanl", scope: !326, file: !326, line: 201, type: !572, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!396, !563}
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !575, file: !329, line: 1167)
!575 = !DISubprogram(name: "nearbyint", scope: !326, file: !326, line: 294, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !577, file: !329, line: 1168)
!577 = !DISubprogram(name: "nearbyintf", scope: !326, file: !326, line: 294, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !579, file: !329, line: 1169)
!579 = !DISubprogram(name: "nearbyintl", scope: !326, file: !326, line: 294, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !581, file: !329, line: 1171)
!581 = !DISubprogram(name: "nextafter", scope: !326, file: !326, line: 259, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !583, file: !329, line: 1172)
!583 = !DISubprogram(name: "nextafterf", scope: !326, file: !326, line: 259, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !585, file: !329, line: 1173)
!585 = !DISubprogram(name: "nextafterl", scope: !326, file: !326, line: 259, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !587, file: !329, line: 1175)
!587 = !DISubprogram(name: "nexttoward", scope: !326, file: !326, line: 261, type: !588, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!64, !64, !396}
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !591, file: !329, line: 1176)
!591 = !DISubprogram(name: "nexttowardf", scope: !326, file: !326, line: 261, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!45, !45, !396}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !595, file: !329, line: 1177)
!595 = !DISubprogram(name: "nexttowardl", scope: !326, file: !326, line: 261, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !597, file: !329, line: 1179)
!597 = !DISubprogram(name: "remainder", scope: !326, file: !326, line: 272, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !599, file: !329, line: 1180)
!599 = !DISubprogram(name: "remainderf", scope: !326, file: !326, line: 272, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !601, file: !329, line: 1181)
!601 = !DISubprogram(name: "remainderl", scope: !326, file: !326, line: 272, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !603, file: !329, line: 1183)
!603 = !DISubprogram(name: "remquo", scope: !326, file: !326, line: 307, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DISubroutineType(types: !605)
!605 = !{!64, !64, !64, !356}
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !607, file: !329, line: 1184)
!607 = !DISubprogram(name: "remquof", scope: !326, file: !326, line: 307, type: !608, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!45, !45, !45, !356}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !611, file: !329, line: 1185)
!611 = !DISubprogram(name: "remquol", scope: !326, file: !326, line: 307, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!396, !396, !396, !356}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !615, file: !329, line: 1187)
!615 = !DISubprogram(name: "rint", scope: !326, file: !326, line: 256, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !617, file: !329, line: 1188)
!617 = !DISubprogram(name: "rintf", scope: !326, file: !326, line: 256, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !619, file: !329, line: 1189)
!619 = !DISubprogram(name: "rintl", scope: !326, file: !326, line: 256, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !621, file: !329, line: 1191)
!621 = !DISubprogram(name: "round", scope: !326, file: !326, line: 298, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !623, file: !329, line: 1192)
!623 = !DISubprogram(name: "roundf", scope: !326, file: !326, line: 298, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !625, file: !329, line: 1193)
!625 = !DISubprogram(name: "roundl", scope: !326, file: !326, line: 298, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !627, file: !329, line: 1195)
!627 = !DISubprogram(name: "scalbln", scope: !326, file: !326, line: 290, type: !628, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!64, !64, !544}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !631, file: !329, line: 1196)
!631 = !DISubprogram(name: "scalblnf", scope: !326, file: !326, line: 290, type: !632, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DISubroutineType(types: !633)
!633 = !{!45, !45, !544}
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !635, file: !329, line: 1197)
!635 = !DISubprogram(name: "scalblnl", scope: !326, file: !326, line: 290, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!396, !396, !544}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !639, file: !329, line: 1199)
!639 = !DISubprogram(name: "scalbn", scope: !326, file: !326, line: 276, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !641, file: !329, line: 1200)
!641 = !DISubprogram(name: "scalbnf", scope: !326, file: !326, line: 276, type: !642, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DISubroutineType(types: !643)
!643 = !{!45, !45, !13}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !645, file: !329, line: 1201)
!645 = !DISubprogram(name: "scalbnl", scope: !326, file: !326, line: 276, type: !646, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!396, !396, !13}
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !649, file: !329, line: 1203)
!649 = !DISubprogram(name: "tgamma", scope: !326, file: !326, line: 235, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !651, file: !329, line: 1204)
!651 = !DISubprogram(name: "tgammaf", scope: !326, file: !326, line: 235, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !653, file: !329, line: 1205)
!653 = !DISubprogram(name: "tgammal", scope: !326, file: !326, line: 235, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !655, file: !329, line: 1207)
!655 = !DISubprogram(name: "trunc", scope: !326, file: !326, line: 302, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !657, file: !329, line: 1208)
!657 = !DISubprogram(name: "truncf", scope: !326, file: !326, line: 302, type: !390, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !659, file: !329, line: 1209)
!659 = !DISubprogram(name: "truncl", scope: !326, file: !326, line: 302, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !151, entity: !661, file: !665, line: 38)
!661 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !318, file: !323, line: 103, type: !662, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DISubroutineType(types: !663)
!663 = !{!664, !664}
!664 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!665 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !151, entity: !667, file: !665, line: 54)
!667 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !318, file: !329, line: 380, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{!396, !396, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !672, file: !674, line: 127)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !320, line: 62, baseType: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!674 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !676, file: !674, line: 128)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !320, line: 70, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !678, identifier: "_ZTS6ldiv_t")
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !677, file: !320, line: 68, baseType: !544, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !677, file: !320, line: 69, baseType: !544, size: 64, offset: 64)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !682, file: !674, line: 130)
!682 = !DISubprogram(name: "abort", scope: !320, file: !320, line: 591, type: !683, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!683 = !DISubroutineType(types: !684)
!684 = !{null}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !686, file: !674, line: 134)
!686 = !DISubprogram(name: "atexit", scope: !320, file: !320, line: 595, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!13, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !691, file: !674, line: 137)
!691 = !DISubprogram(name: "at_quick_exit", scope: !320, file: !320, line: 600, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !693, file: !674, line: 140)
!693 = !DISubprogram(name: "atof", scope: !320, file: !320, line: 101, type: !561, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !695, file: !674, line: 141)
!695 = !DISubprogram(name: "atoi", scope: !320, file: !320, line: 104, type: !696, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DISubroutineType(types: !697)
!697 = !{!13, !563}
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !699, file: !674, line: 142)
!699 = !DISubprogram(name: "atol", scope: !320, file: !320, line: 107, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{!544, !563}
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !703, file: !674, line: 143)
!703 = !DISubprogram(name: "bsearch", scope: !320, file: !320, line: 820, type: !704, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DISubroutineType(types: !705)
!705 = !{!104, !706, !706, !708, !708, !711}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !709, line: 46, baseType: !710)
!709 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!710 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !320, line: 808, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!13, !706, !706}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !716, file: !674, line: 144)
!716 = !DISubprogram(name: "calloc", scope: !320, file: !320, line: 542, type: !717, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!104, !708, !708}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !720, file: !674, line: 145)
!720 = !DISubprogram(name: "div", scope: !320, file: !320, line: 852, type: !721, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!672, !13, !13}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !724, file: !674, line: 146)
!724 = !DISubprogram(name: "exit", scope: !320, file: !320, line: 617, type: !725, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !13}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !728, file: !674, line: 147)
!728 = !DISubprogram(name: "free", scope: !320, file: !320, line: 565, type: !729, flags: DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !104}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !732, file: !674, line: 148)
!732 = !DISubprogram(name: "getenv", scope: !320, file: !320, line: 634, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !563}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !737, file: !674, line: 149)
!737 = !DISubprogram(name: "labs", scope: !320, file: !320, line: 841, type: !738, flags: DIFlagPrototyped, spFlags: 0)
!738 = !DISubroutineType(types: !739)
!739 = !{!544, !544}
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !741, file: !674, line: 150)
!741 = !DISubprogram(name: "ldiv", scope: !320, file: !320, line: 854, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!676, !544, !544}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !745, file: !674, line: 151)
!745 = !DISubprogram(name: "malloc", scope: !320, file: !320, line: 539, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!104, !708}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !749, file: !674, line: 153)
!749 = !DISubprogram(name: "mblen", scope: !320, file: !320, line: 922, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!13, !563, !708}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !753, file: !674, line: 154)
!753 = !DISubprogram(name: "mbstowcs", scope: !320, file: !320, line: 933, type: !754, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!708, !756, !759, !708}
!756 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!759 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !563)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !761, file: !674, line: 155)
!761 = !DISubprogram(name: "mbtowc", scope: !320, file: !320, line: 925, type: !762, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!13, !756, !759, !708}
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !765, file: !674, line: 157)
!765 = !DISubprogram(name: "qsort", scope: !320, file: !320, line: 830, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !104, !708, !708, !711}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !769, file: !674, line: 160)
!769 = !DISubprogram(name: "quick_exit", scope: !320, file: !320, line: 623, type: !725, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !771, file: !674, line: 163)
!771 = !DISubprogram(name: "rand", scope: !320, file: !320, line: 453, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DISubroutineType(types: !773)
!773 = !{!13}
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !775, file: !674, line: 164)
!775 = !DISubprogram(name: "realloc", scope: !320, file: !320, line: 550, type: !776, flags: DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!104, !104, !708}
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !779, file: !674, line: 165)
!779 = !DISubprogram(name: "srand", scope: !320, file: !320, line: 455, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !56}
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !783, file: !674, line: 166)
!783 = !DISubprogram(name: "strtod", scope: !320, file: !320, line: 117, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!64, !759, !786}
!786 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !789, file: !674, line: 167)
!789 = !DISubprogram(name: "strtol", scope: !320, file: !320, line: 176, type: !790, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{!544, !759, !786, !13}
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !793, file: !674, line: 168)
!793 = !DISubprogram(name: "strtoul", scope: !320, file: !320, line: 180, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!710, !759, !786, !13}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !797, file: !674, line: 169)
!797 = !DISubprogram(name: "system", scope: !320, file: !320, line: 784, type: !696, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !799, file: !674, line: 171)
!799 = !DISubprogram(name: "wcstombs", scope: !320, file: !320, line: 936, type: !800, flags: DIFlagPrototyped, spFlags: 0)
!800 = !DISubroutineType(types: !801)
!801 = !{!708, !802, !803, !708}
!802 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !735)
!803 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !807, file: !674, line: 172)
!807 = !DISubprogram(name: "wctomb", scope: !320, file: !320, line: 929, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!13, !735, !758}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !812, file: !674, line: 200)
!811 = !DINamespace(name: "__gnu_cxx", scope: null)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !320, line: 80, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !814, identifier: "_ZTS7lldiv_t")
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !813, file: !320, line: 78, baseType: !507, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !813, file: !320, line: 79, baseType: !507, size: 64, offset: 64)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !818, file: !674, line: 206)
!818 = !DISubprogram(name: "_Exit", scope: !320, file: !320, line: 629, type: !725, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !820, file: !674, line: 210)
!820 = !DISubprogram(name: "llabs", scope: !320, file: !320, line: 844, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!507, !507}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !824, file: !674, line: 216)
!824 = !DISubprogram(name: "lldiv", scope: !320, file: !320, line: 858, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!812, !507, !507}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !828, file: !674, line: 227)
!828 = !DISubprogram(name: "atoll", scope: !320, file: !320, line: 112, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!507, !563}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !832, file: !674, line: 228)
!832 = !DISubprogram(name: "strtoll", scope: !320, file: !320, line: 200, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!507, !759, !786, !13}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !836, file: !674, line: 229)
!836 = !DISubprogram(name: "strtoull", scope: !320, file: !320, line: 205, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!839, !759, !786, !13}
!839 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !841, file: !674, line: 231)
!841 = !DISubprogram(name: "strtof", scope: !320, file: !320, line: 123, type: !842, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!45, !759, !786}
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !811, entity: !845, file: !674, line: 232)
!845 = !DISubprogram(name: "strtold", scope: !320, file: !320, line: 126, type: !846, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!396, !759, !786}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !812, file: !674, line: 240)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !818, file: !674, line: 242)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !820, file: !674, line: 244)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !852, file: !674, line: 245)
!852 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !811, file: !674, line: 213, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !824, file: !674, line: 246)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !828, file: !674, line: 248)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !841, file: !674, line: 249)
!856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !832, file: !674, line: 250)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !836, file: !674, line: 251)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !318, entity: !845, file: !674, line: 252)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !151, entity: !682, file: !860, line: 38)
!860 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
