; ModuleID = 'texture.cpp'
source_filename = "texture.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], float, float, i32, i32, double, i8, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [4096 x i8], [6 x %"struct.pov::shelldata"], [4096 x i8], [4096 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }

!170 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !13, line: 706, baseType: !4, size: 32, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!175 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !2, file: !177, line: 47, baseType: !4, size: 32, elements: !178, identifier: "_ZTSN3pov11PATTERN_IDSE")
!177 = !DIFile(filename: "./pattern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!179 = !DIEnumerator(name: "NO_PATTERN", value: 0, isUnsigned: true)
!180 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1, isUnsigned: true)
!181 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2, isUnsigned: true)
!182 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3, isUnsigned: true)
!183 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4, isUnsigned: true)
!184 = !DIEnumerator(name: "WAVES_PATTERN", value: 5, isUnsigned: true)
!185 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6, isUnsigned: true)
!186 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7, isUnsigned: true)
!187 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8, isUnsigned: true)
!188 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9, isUnsigned: true)
!189 = !DIEnumerator(name: "FACETS_PATTERN", value: 10, isUnsigned: true)
!190 = !DIEnumerator(name: "DENTS_PATTERN", value: 11, isUnsigned: true)
!191 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12, isUnsigned: true)
!192 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13, isUnsigned: true)
!193 = !DIEnumerator(name: "BRICK_PATTERN", value: 14, isUnsigned: true)
!194 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15, isUnsigned: true)
!195 = !DIEnumerator(name: "BOZO_PATTERN", value: 16, isUnsigned: true)
!196 = !DIEnumerator(name: "CELLS_PATTERN", value: 17, isUnsigned: true)
!197 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18, isUnsigned: true)
!198 = !DIEnumerator(name: "WOOD_PATTERN", value: 19, isUnsigned: true)
!199 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20, isUnsigned: true)
!200 = !DIEnumerator(name: "AGATE_PATTERN", value: 21, isUnsigned: true)
!201 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22, isUnsigned: true)
!202 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23, isUnsigned: true)
!203 = !DIEnumerator(name: "ONION_PATTERN", value: 24, isUnsigned: true)
!204 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25, isUnsigned: true)
!205 = !DIEnumerator(name: "JULIA_PATTERN", value: 26, isUnsigned: true)
!206 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27, isUnsigned: true)
!207 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28, isUnsigned: true)
!208 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29, isUnsigned: true)
!209 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30, isUnsigned: true)
!210 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31, isUnsigned: true)
!211 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32, isUnsigned: true)
!212 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33, isUnsigned: true)
!213 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34, isUnsigned: true)
!214 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35, isUnsigned: true)
!215 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36, isUnsigned: true)
!216 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37, isUnsigned: true)
!217 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38, isUnsigned: true)
!218 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39, isUnsigned: true)
!219 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40, isUnsigned: true)
!220 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41, isUnsigned: true)
!221 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42, isUnsigned: true)
!222 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43, isUnsigned: true)
!223 = !DIEnumerator(name: "BOXED_PATTERN", value: 44, isUnsigned: true)
!224 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45, isUnsigned: true)
!225 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46, isUnsigned: true)
!226 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47, isUnsigned: true)
!227 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48, isUnsigned: true)
!228 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49, isUnsigned: true)
!229 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50, isUnsigned: true)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !13, line: 715, baseType: !4, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236}
!232 = !DIEnumerator(name: "pRED", value: 0, isUnsigned: true)
!233 = !DIEnumerator(name: "pGREEN", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "pBLUE", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "pFILTER", value: 3, isUnsigned: true)
!236 = !DIEnumerator(name: "pTRANSM", value: 4, isUnsigned: true)
!237 = !{!7, !11, !8, !238, !40, !239, !499, !582, !4}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !13, line: 1034, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !13, line: 1337, size: 1280, flags: DIFlagTypePassByValue, elements: !242, identifier: "_ZTSN3pov14Pattern_StructE")
!242 = !{!243, !244, !245, !246, !247, !249, !250, !251, !255, !256, !614}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !241, file: !13, line: 1339, baseType: !20, size: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !241, file: !13, line: 1339, baseType: !20, size: 16, offset: 16)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !241, file: !13, line: 1339, baseType: !20, size: 16, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !241, file: !13, line: 1339, baseType: !40, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !241, file: !13, line: 1339, baseType: !248, size: 32, offset: 96)
!248 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !241, file: !13, line: 1339, baseType: !248, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !241, file: !13, line: 1339, baseType: !248, size: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !241, file: !13, line: 1339, baseType: !252, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !13, line: 1040, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !13, line: 1387, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Warps_StructE")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !241, file: !13, line: 1339, baseType: !239, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !241, file: !13, line: 1339, baseType: !257, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !13, line: 1033, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !13, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !260, identifier: "_ZTSN3pov16Blend_Map_StructE")
!260 = !{!261, !262, !264, !266, !267}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !259, file: !13, line: 1061, baseType: !40, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !259, file: !13, line: 1062, baseType: !263, size: 16, offset: 32)
!263 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !259, file: !13, line: 1063, baseType: !265, size: 8, offset: 48)
!265 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !259, file: !13, line: 1063, baseType: !265, size: 8, offset: 56)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !259, file: !13, line: 1064, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !13, line: 1032, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !13, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !271, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!271 = !{!272, !273, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !270, file: !13, line: 1047, baseType: !248, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !270, file: !13, line: 1048, baseType: !274, size: 8, offset: 32)
!274 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !270, file: !13, line: 1056, baseType: !276, size: 192, offset: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !13, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !277, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!277 = !{!278, !283, !416, !498, !613}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !276, file: !13, line: 1051, baseType: !279, size: 160)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !13, line: 695, baseType: !280)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !276, file: !13, line: 1052, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !13, line: 1036, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !13, line: 1342, size: 1472, flags: DIFlagTypePassByValue, elements: !287, identifier: "_ZTSN3pov14Pigment_StructE")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !415}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !286, file: !13, line: 1344, baseType: !20, size: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !286, file: !13, line: 1344, baseType: !20, size: 16, offset: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !286, file: !13, line: 1344, baseType: !20, size: 16, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !286, file: !13, line: 1344, baseType: !40, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !286, file: !13, line: 1344, baseType: !248, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !286, file: !13, line: 1344, baseType: !248, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !286, file: !13, line: 1344, baseType: !248, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !286, file: !13, line: 1344, baseType: !252, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !286, file: !13, line: 1344, baseType: !239, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !286, file: !13, line: 1344, baseType: !257, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !286, file: !13, line: 1344, baseType: !299, size: 896, offset: 384)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !286, file: !13, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !300, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!300 = !{!301, !305, !352, !353, !354, !355, !356, !357, !362, !367, !373, !384, !395, !405, !410, !411}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !299, file: !13, line: 1344, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !13, line: 1280, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !13, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !299, file: !13, line: 1344, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !13, line: 1232, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !13, line: 1234, size: 960, flags: DIFlagTypePassByValue, elements: !309, identifier: "_ZTSN3pov12Image_StructE")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !328, !329, !330, !334, !335}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !308, file: !13, line: 1236, baseType: !40, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !308, file: !13, line: 1237, baseType: !40, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !308, file: !13, line: 1238, baseType: !40, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !308, file: !13, line: 1239, baseType: !40, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !308, file: !13, line: 1240, baseType: !40, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !308, file: !13, line: 1241, baseType: !40, size: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !308, file: !13, line: 1241, baseType: !40, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !308, file: !13, line: 1242, baseType: !263, size: 16, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !308, file: !13, line: 1243, baseType: !265, size: 8, offset: 240)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !308, file: !13, line: 1244, baseType: !265, size: 8, offset: 248)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !308, file: !13, line: 1245, baseType: !12, size: 192, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !308, file: !13, line: 1246, baseType: !248, size: 32, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !308, file: !13, line: 1246, baseType: !248, size: 32, offset: 480)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !308, file: !13, line: 1247, baseType: !324, size: 128, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !13, line: 690, baseType: !325)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !308, file: !13, line: 1248, baseType: !8, size: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !308, file: !13, line: 1248, baseType: !8, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !308, file: !13, line: 1249, baseType: !331, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !2, file: !13, line: 1169, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !2, file: !13, line: 1175, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Image_Colour_StructE")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !308, file: !13, line: 1250, baseType: !238, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !13, line: 1257, baseType: !336, size: 64, offset: 896)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !308, file: !13, line: 1251, size: 64, flags: DIFlagTypePassByValue, elements: !337, identifier: "_ZTSN3pov12Image_StructUt_E")
!337 = !{!338, !342, !346, !349}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !336, file: !13, line: 1253, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !2, file: !13, line: 1171, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !2, file: !13, line: 1180, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov18Image8_Line_StructE")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !336, file: !13, line: 1254, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !2, file: !13, line: 1173, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !2, file: !13, line: 1185, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Image16_Line_StructE")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !336, file: !13, line: 1255, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !336, file: !13, line: 1256, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !299, file: !13, line: 1344, baseType: !12, size: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !299, file: !13, line: 1344, baseType: !248, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !299, file: !13, line: 1344, baseType: !263, size: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !299, file: !13, line: 1344, baseType: !263, size: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !299, file: !13, line: 1344, baseType: !263, size: 16)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !299, file: !13, line: 1344, baseType: !358, size: 256)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 256, flags: DIFlagTypePassByValue, elements: !359, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !358, file: !13, line: 1344, baseType: !248, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !358, file: !13, line: 1344, baseType: !12, size: 192, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !299, file: !13, line: 1344, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 64, flags: DIFlagTypePassByValue, elements: !364, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !363, file: !13, line: 1344, baseType: !248, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !363, file: !13, line: 1344, baseType: !248, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !299, file: !13, line: 1344, baseType: !368, size: 320)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 320, flags: DIFlagTypePassByValue, elements: !369, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !368, file: !13, line: 1344, baseType: !8, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !368, file: !13, line: 1344, baseType: !8, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !368, file: !13, line: 1344, baseType: !12, size: 192, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !299, file: !13, line: 1344, baseType: !374, size: 896)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !375, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !374, file: !13, line: 1344, baseType: !12, size: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !374, file: !13, line: 1344, baseType: !12, size: 192, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !374, file: !13, line: 1344, baseType: !8, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !374, file: !13, line: 1344, baseType: !8, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !374, file: !13, line: 1344, baseType: !263, size: 16, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !374, file: !13, line: 1344, baseType: !11, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !374, file: !13, line: 1344, baseType: !40, size: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !374, file: !13, line: 1344, baseType: !12, size: 192, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !299, file: !13, line: 1344, baseType: !385, size: 832)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 832, flags: DIFlagTypePassByValue, elements: !386, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !385, file: !13, line: 1344, baseType: !12, size: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !385, file: !13, line: 1344, baseType: !12, size: 192, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !385, file: !13, line: 1344, baseType: !263, size: 16, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !385, file: !13, line: 1344, baseType: !263, size: 16, offset: 400)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !385, file: !13, line: 1344, baseType: !8, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !385, file: !13, line: 1344, baseType: !8, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !385, file: !13, line: 1344, baseType: !324, size: 128, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !385, file: !13, line: 1344, baseType: !324, size: 128, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !299, file: !13, line: 1344, baseType: !396, size: 384)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 384, flags: DIFlagTypePassByValue, elements: !397, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!397 = !{!398, !399, !400, !401, !402, !403, !404}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !396, file: !13, line: 1344, baseType: !324, size: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !396, file: !13, line: 1344, baseType: !263, size: 16, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !396, file: !13, line: 1344, baseType: !263, size: 16, offset: 144)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !396, file: !13, line: 1344, baseType: !263, size: 16, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !396, file: !13, line: 1344, baseType: !8, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !396, file: !13, line: 1344, baseType: !8, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !396, file: !13, line: 1344, baseType: !40, size: 32, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !299, file: !13, line: 1344, baseType: !406, size: 128)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !13, line: 1344, size: 128, flags: DIFlagTypePassByValue, elements: !407, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !406, file: !13, line: 1344, baseType: !238, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !406, file: !13, line: 1344, baseType: !238, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !299, file: !13, line: 1344, baseType: !284, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !299, file: !13, line: 1344, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !13, line: 678, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !13, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !286, file: !13, line: 1345, baseType: !279, size: 160, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !276, file: !13, line: 1053, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !13, line: 1037, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !13, line: 1348, size: 1344, flags: DIFlagTypePassByValue, elements: !420, identifier: "_ZTSN3pov14Tnormal_StructE")
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !496, !497}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !419, file: !13, line: 1350, baseType: !20, size: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !419, file: !13, line: 1350, baseType: !20, size: 16, offset: 16)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !419, file: !13, line: 1350, baseType: !20, size: 16, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !419, file: !13, line: 1350, baseType: !40, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !419, file: !13, line: 1350, baseType: !248, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !419, file: !13, line: 1350, baseType: !248, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !419, file: !13, line: 1350, baseType: !248, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !419, file: !13, line: 1350, baseType: !252, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !419, file: !13, line: 1350, baseType: !239, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !419, file: !13, line: 1350, baseType: !257, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !419, file: !13, line: 1350, baseType: !432, size: 896, offset: 384)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !419, file: !13, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !433, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !446, !451, !457, !468, !479, !489, !494, !495}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !432, file: !13, line: 1350, baseType: !302, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !432, file: !13, line: 1350, baseType: !306, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !432, file: !13, line: 1350, baseType: !12, size: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !432, file: !13, line: 1350, baseType: !248, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !432, file: !13, line: 1350, baseType: !263, size: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !432, file: !13, line: 1350, baseType: !263, size: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !432, file: !13, line: 1350, baseType: !263, size: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !432, file: !13, line: 1350, baseType: !442, size: 256)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 256, flags: DIFlagTypePassByValue, elements: !443, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !442, file: !13, line: 1350, baseType: !248, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !442, file: !13, line: 1350, baseType: !12, size: 192, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !432, file: !13, line: 1350, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 64, flags: DIFlagTypePassByValue, elements: !448, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !447, file: !13, line: 1350, baseType: !248, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !447, file: !13, line: 1350, baseType: !248, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !432, file: !13, line: 1350, baseType: !452, size: 320)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 320, flags: DIFlagTypePassByValue, elements: !453, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !452, file: !13, line: 1350, baseType: !8, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !452, file: !13, line: 1350, baseType: !8, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !452, file: !13, line: 1350, baseType: !12, size: 192, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !432, file: !13, line: 1350, baseType: !458, size: 896)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !459, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !458, file: !13, line: 1350, baseType: !12, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !458, file: !13, line: 1350, baseType: !12, size: 192, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !458, file: !13, line: 1350, baseType: !8, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !458, file: !13, line: 1350, baseType: !8, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !458, file: !13, line: 1350, baseType: !263, size: 16, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !458, file: !13, line: 1350, baseType: !11, size: 64, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !458, file: !13, line: 1350, baseType: !40, size: 32, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !458, file: !13, line: 1350, baseType: !12, size: 192, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !432, file: !13, line: 1350, baseType: !469, size: 832)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 832, flags: DIFlagTypePassByValue, elements: !470, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !469, file: !13, line: 1350, baseType: !12, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !469, file: !13, line: 1350, baseType: !12, size: 192, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !469, file: !13, line: 1350, baseType: !263, size: 16, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !469, file: !13, line: 1350, baseType: !263, size: 16, offset: 400)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !469, file: !13, line: 1350, baseType: !8, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !469, file: !13, line: 1350, baseType: !8, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !469, file: !13, line: 1350, baseType: !324, size: 128, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !469, file: !13, line: 1350, baseType: !324, size: 128, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !432, file: !13, line: 1350, baseType: !480, size: 384)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 384, flags: DIFlagTypePassByValue, elements: !481, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!481 = !{!482, !483, !484, !485, !486, !487, !488}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !480, file: !13, line: 1350, baseType: !324, size: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !480, file: !13, line: 1350, baseType: !263, size: 16, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !480, file: !13, line: 1350, baseType: !263, size: 16, offset: 144)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !480, file: !13, line: 1350, baseType: !263, size: 16, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !480, file: !13, line: 1350, baseType: !8, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !480, file: !13, line: 1350, baseType: !8, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !480, file: !13, line: 1350, baseType: !40, size: 32, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !432, file: !13, line: 1350, baseType: !490, size: 128)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !13, line: 1350, size: 128, flags: DIFlagTypePassByValue, elements: !491, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !490, file: !13, line: 1350, baseType: !238, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !490, file: !13, line: 1350, baseType: !238, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !432, file: !13, line: 1350, baseType: !284, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !432, file: !13, line: 1350, baseType: !412, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !419, file: !13, line: 1351, baseType: !248, size: 32, offset: 1280)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !419, file: !13, line: 1352, baseType: !248, size: 32, offset: 1312)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !276, file: !13, line: 1054, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !13, line: 1035, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !13, line: 1359, size: 1664, flags: DIFlagTypePassByValue, elements: !502, identifier: "_ZTSN3pov14Texture_StructE")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !578, !579, !580, !581, !611, !612}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !501, file: !13, line: 1361, baseType: !20, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !501, file: !13, line: 1361, baseType: !20, size: 16, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !501, file: !13, line: 1361, baseType: !20, size: 16, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !501, file: !13, line: 1361, baseType: !40, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !501, file: !13, line: 1361, baseType: !248, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !501, file: !13, line: 1361, baseType: !248, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !501, file: !13, line: 1361, baseType: !248, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !501, file: !13, line: 1361, baseType: !252, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !501, file: !13, line: 1361, baseType: !239, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !501, file: !13, line: 1361, baseType: !257, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !501, file: !13, line: 1361, baseType: !514, size: 896, offset: 384)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !501, file: !13, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !515, identifier: "_ZTSN3pov14Texture_StructUt_E")
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !528, !533, !539, !550, !561, !571, !576, !577}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !514, file: !13, line: 1361, baseType: !302, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !514, file: !13, line: 1361, baseType: !306, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !514, file: !13, line: 1361, baseType: !12, size: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !514, file: !13, line: 1361, baseType: !248, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !514, file: !13, line: 1361, baseType: !263, size: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !514, file: !13, line: 1361, baseType: !263, size: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !514, file: !13, line: 1361, baseType: !263, size: 16)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !514, file: !13, line: 1361, baseType: !524, size: 256)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 256, flags: DIFlagTypePassByValue, elements: !525, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !524, file: !13, line: 1361, baseType: !248, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !524, file: !13, line: 1361, baseType: !12, size: 192, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !514, file: !13, line: 1361, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 64, flags: DIFlagTypePassByValue, elements: !530, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !529, file: !13, line: 1361, baseType: !248, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !529, file: !13, line: 1361, baseType: !248, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !514, file: !13, line: 1361, baseType: !534, size: 320)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 320, flags: DIFlagTypePassByValue, elements: !535, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !534, file: !13, line: 1361, baseType: !8, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !534, file: !13, line: 1361, baseType: !8, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !534, file: !13, line: 1361, baseType: !12, size: 192, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !514, file: !13, line: 1361, baseType: !540, size: 896)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !541, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !540, file: !13, line: 1361, baseType: !12, size: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !540, file: !13, line: 1361, baseType: !12, size: 192, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !540, file: !13, line: 1361, baseType: !8, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !540, file: !13, line: 1361, baseType: !8, size: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !540, file: !13, line: 1361, baseType: !263, size: 16, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !540, file: !13, line: 1361, baseType: !11, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !540, file: !13, line: 1361, baseType: !40, size: 32, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !540, file: !13, line: 1361, baseType: !12, size: 192, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !514, file: !13, line: 1361, baseType: !551, size: 832)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 832, flags: DIFlagTypePassByValue, elements: !552, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !551, file: !13, line: 1361, baseType: !12, size: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !551, file: !13, line: 1361, baseType: !12, size: 192, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !551, file: !13, line: 1361, baseType: !263, size: 16, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !551, file: !13, line: 1361, baseType: !263, size: 16, offset: 400)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !551, file: !13, line: 1361, baseType: !8, size: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !551, file: !13, line: 1361, baseType: !8, size: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !551, file: !13, line: 1361, baseType: !324, size: 128, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !551, file: !13, line: 1361, baseType: !324, size: 128, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !514, file: !13, line: 1361, baseType: !562, size: 384)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 384, flags: DIFlagTypePassByValue, elements: !563, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!563 = !{!564, !565, !566, !567, !568, !569, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !562, file: !13, line: 1361, baseType: !324, size: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !562, file: !13, line: 1361, baseType: !263, size: 16, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !562, file: !13, line: 1361, baseType: !263, size: 16, offset: 144)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !562, file: !13, line: 1361, baseType: !263, size: 16, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !562, file: !13, line: 1361, baseType: !8, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !562, file: !13, line: 1361, baseType: !8, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !562, file: !13, line: 1361, baseType: !40, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !514, file: !13, line: 1361, baseType: !572, size: 128)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !13, line: 1361, size: 128, flags: DIFlagTypePassByValue, elements: !573, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !572, file: !13, line: 1361, baseType: !238, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !572, file: !13, line: 1361, baseType: !238, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !514, file: !13, line: 1361, baseType: !284, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !514, file: !13, line: 1361, baseType: !412, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !501, file: !13, line: 1361, baseType: !499, size: 64, offset: 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !501, file: !13, line: 1362, baseType: !284, size: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !501, file: !13, line: 1363, baseType: !417, size: 64, offset: 1408)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !501, file: !13, line: 1364, baseType: !582, size: 64, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !2, file: !13, line: 1038, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !2, file: !13, line: 1370, size: 928, flags: DIFlagTypePassByValue, elements: !585, identifier: "_ZTSN3pov13Finish_StructE")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !607, !608, !609, !610}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !584, file: !13, line: 1372, baseType: !248, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !584, file: !13, line: 1372, baseType: !248, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !584, file: !13, line: 1373, baseType: !248, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !584, file: !13, line: 1373, baseType: !248, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !584, file: !13, line: 1374, baseType: !248, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !584, file: !13, line: 1374, baseType: !248, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !584, file: !13, line: 1375, baseType: !248, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !584, file: !13, line: 1375, baseType: !248, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !584, file: !13, line: 1375, baseType: !248, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !584, file: !13, line: 1376, baseType: !248, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !584, file: !13, line: 1376, baseType: !248, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !584, file: !13, line: 1376, baseType: !248, size: 32, offset: 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !584, file: !13, line: 1376, baseType: !248, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !584, file: !13, line: 1376, baseType: !248, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !584, file: !13, line: 1377, baseType: !248, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !584, file: !13, line: 1377, baseType: !248, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !584, file: !13, line: 1378, baseType: !603, size: 96, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !2, file: !13, line: 696, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 96, elements: !15)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !584, file: !13, line: 1378, baseType: !603, size: 96, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !584, file: !13, line: 1378, baseType: !603, size: 96, offset: 704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !584, file: !13, line: 1379, baseType: !248, size: 32, offset: 800)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !584, file: !13, line: 1380, baseType: !40, size: 32, offset: 832)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !584, file: !13, line: 1381, baseType: !248, size: 32, offset: 864)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !584, file: !13, line: 1382, baseType: !40, size: 32, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !501, file: !13, line: 1365, baseType: !499, size: 64, offset: 1536)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !501, file: !13, line: 1366, baseType: !40, size: 32, offset: 1600)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !276, file: !13, line: 1055, baseType: !324, size: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !241, file: !13, line: 1339, baseType: !615, size: 896, offset: 384)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !13, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !616, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !629, !634, !640, !651, !662, !672, !677, !678}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !615, file: !13, line: 1339, baseType: !302, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !615, file: !13, line: 1339, baseType: !306, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !615, file: !13, line: 1339, baseType: !12, size: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !615, file: !13, line: 1339, baseType: !248, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !615, file: !13, line: 1339, baseType: !263, size: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !615, file: !13, line: 1339, baseType: !263, size: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !615, file: !13, line: 1339, baseType: !263, size: 16)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !615, file: !13, line: 1339, baseType: !625, size: 256)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 256, flags: DIFlagTypePassByValue, elements: !626, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !625, file: !13, line: 1339, baseType: !248, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !625, file: !13, line: 1339, baseType: !12, size: 192, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !615, file: !13, line: 1339, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 64, flags: DIFlagTypePassByValue, elements: !631, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !630, file: !13, line: 1339, baseType: !248, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !630, file: !13, line: 1339, baseType: !248, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !615, file: !13, line: 1339, baseType: !635, size: 320)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 320, flags: DIFlagTypePassByValue, elements: !636, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !635, file: !13, line: 1339, baseType: !8, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !635, file: !13, line: 1339, baseType: !8, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !635, file: !13, line: 1339, baseType: !12, size: 192, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !615, file: !13, line: 1339, baseType: !641, size: 896)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !642, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !641, file: !13, line: 1339, baseType: !12, size: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !641, file: !13, line: 1339, baseType: !12, size: 192, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !641, file: !13, line: 1339, baseType: !8, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !641, file: !13, line: 1339, baseType: !8, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !641, file: !13, line: 1339, baseType: !263, size: 16, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !641, file: !13, line: 1339, baseType: !11, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !641, file: !13, line: 1339, baseType: !40, size: 32, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !641, file: !13, line: 1339, baseType: !12, size: 192, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !615, file: !13, line: 1339, baseType: !652, size: 832)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 832, flags: DIFlagTypePassByValue, elements: !653, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !652, file: !13, line: 1339, baseType: !12, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !652, file: !13, line: 1339, baseType: !12, size: 192, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !652, file: !13, line: 1339, baseType: !263, size: 16, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !652, file: !13, line: 1339, baseType: !263, size: 16, offset: 400)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !652, file: !13, line: 1339, baseType: !8, size: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !652, file: !13, line: 1339, baseType: !8, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !652, file: !13, line: 1339, baseType: !324, size: 128, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !652, file: !13, line: 1339, baseType: !324, size: 128, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !615, file: !13, line: 1339, baseType: !663, size: 384)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 384, flags: DIFlagTypePassByValue, elements: !664, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!664 = !{!665, !666, !667, !668, !669, !670, !671}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !663, file: !13, line: 1339, baseType: !324, size: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !663, file: !13, line: 1339, baseType: !263, size: 16, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !663, file: !13, line: 1339, baseType: !263, size: 16, offset: 144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !663, file: !13, line: 1339, baseType: !263, size: 16, offset: 160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !663, file: !13, line: 1339, baseType: !8, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !663, file: !13, line: 1339, baseType: !8, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !663, file: !13, line: 1339, baseType: !40, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !615, file: !13, line: 1339, baseType: !673, size: 128)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !615, file: !13, line: 1339, size: 128, flags: DIFlagTypePassByValue, elements: !674, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !673, file: !13, line: 1339, baseType: !238, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !673, file: !13, line: 1339, baseType: !238, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !615, file: !13, line: 1339, baseType: !284, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !615, file: !13, line: 1339, baseType: !412, size: 64)
!679 = !{!0, !5, !9, !17, !23, !680, !683, !685, !687, !28, !689, !32, !37, !691, !30}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression(DW_OP_constu, 1000, DW_OP_stack_value))
!681 = distinct !DIGlobalVariable(name: "SINTABSIZE", scope: !2, file: !3, line: 76, type: !682, isLocal: true, isDefinition: true)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression(DW_OP_constu, 18446744073709541616, DW_OP_stack_value))
!684 = distinct !DIGlobalVariable(name: "MINX", scope: !2, file: !3, line: 72, type: !682, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression(DW_OP_constu, 18446744073709541616, DW_OP_stack_value))
!686 = distinct !DIGlobalVariable(name: "MINY", scope: !2, file: !3, line: 73, type: !682, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression(DW_OP_constu, 18446744073709541616, DW_OP_stack_value))
!688 = distinct !DIGlobalVariable(name: "MINZ", scope: !2, file: !3, line: 74, type: !682, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_constu, 2048, DW_OP_stack_value))
!690 = distinct !DIGlobalVariable(name: "NoiseEntries", scope: !2, file: !3, line: 669, type: !682, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression(DW_OP_constu, 4711630319734600754, DW_OP_stack_value))
!692 = distinct !DIGlobalVariable(name: "ROLLOVER", scope: !2, file: !3, line: 673, type: !693, isLocal: true, isDefinition: true)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!694 = !{!695, !702, !708, !710, !712, !716, !718, !720, !722, !724, !726, !728, !730, !735, !739, !741, !743, !747, !749, !751, !753, !755, !757, !759, !762, !764, !766, !770, !775, !777, !779, !781, !783, !785, !787, !789, !791, !793, !795, !799, !803, !805, !807, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !837, !841, !845, !847, !849, !851, !853, !855, !857, !859, !861, !863, !867, !871, !875, !877, !879, !881, !886, !890, !894, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !923, !927, !931, !933, !935, !937, !943, !947, !951, !953, !955, !957, !959, !961, !963, !967, !971, !973, !975, !977, !979, !983, !987, !991, !993, !995, !997, !999, !1001, !1003, !1007, !1011, !1015, !1017, !1021, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1043, !1048, !1052, !1058, !1062, !1067, !1069, !1071, !1075, !1079, !1092, !1096, !1100, !1104, !1108, !1113, !1117, !1121, !1125, !1129, !1137, !1141, !1145, !1147, !1151, !1155, !1159, !1165, !1169, !1173, !1175, !1183, !1187, !1194, !1196, !1200, !1204, !1208, !1212, !1217, !1221, !1225, !1226, !1227, !1228, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1275, !1277, !1279, !1281, !1283, !1285, !1287, !1289, !1291, !1293, !1295, !1297, !1299, !1305, !1309, !1315, !1319, !1323, !1327, !1331, !1333, !1335, !1339, !1343, !1347, !1351, !1355, !1357, !1359, !1361, !1365, !1369, !1373, !1375, !1377, !1380, !1382, !1383, !1385, !1387, !1389, !1391, !1393, !1395, !1397, !1399, !1401, !1403, !1404, !1405, !1406, !1408, !1409, !1411, !1413, !1415, !1417, !1419, !1421, !1423, !1425, !1429, !1485, !1489}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !697, file: !701, line: 52)
!696 = !DINamespace(name: "std", scope: null)
!697 = !DISubprogram(name: "abs", scope: !698, file: !698, line: 840, type: !699, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!699 = !DISubroutineType(types: !700)
!700 = !{!40, !40}
!701 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !703, file: !707, line: 83)
!703 = !DISubprogram(name: "acos", scope: !704, file: !704, line: 53, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!705 = !DISubroutineType(types: !706)
!706 = !{!8, !8}
!707 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !709, file: !707, line: 102)
!709 = !DISubprogram(name: "asin", scope: !704, file: !704, line: 55, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !711, file: !707, line: 121)
!711 = !DISubprogram(name: "atan", scope: !704, file: !704, line: 57, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !713, file: !707, line: 140)
!713 = !DISubprogram(name: "atan2", scope: !704, file: !704, line: 59, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{!8, !8, !8}
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !717, file: !707, line: 161)
!717 = !DISubprogram(name: "ceil", scope: !704, file: !704, line: 159, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !719, file: !707, line: 180)
!719 = !DISubprogram(name: "cos", scope: !704, file: !704, line: 62, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !721, file: !707, line: 199)
!721 = !DISubprogram(name: "cosh", scope: !704, file: !704, line: 71, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !723, file: !707, line: 218)
!723 = !DISubprogram(name: "exp", scope: !704, file: !704, line: 95, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !725, file: !707, line: 237)
!725 = !DISubprogram(name: "fabs", scope: !704, file: !704, line: 162, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !727, file: !707, line: 256)
!727 = !DISubprogram(name: "floor", scope: !704, file: !704, line: 165, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !729, file: !707, line: 275)
!729 = !DISubprogram(name: "fmod", scope: !704, file: !704, line: 168, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !731, file: !707, line: 296)
!731 = !DISubprogram(name: "frexp", scope: !704, file: !704, line: 98, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!8, !8, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !736, file: !707, line: 315)
!736 = !DISubprogram(name: "ldexp", scope: !704, file: !704, line: 101, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!8, !8, !40}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !740, file: !707, line: 334)
!740 = !DISubprogram(name: "log", scope: !704, file: !704, line: 104, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !742, file: !707, line: 353)
!742 = !DISubprogram(name: "log10", scope: !704, file: !704, line: 107, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !744, file: !707, line: 372)
!744 = !DISubprogram(name: "modf", scope: !704, file: !704, line: 110, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!8, !8, !7}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !748, file: !707, line: 384)
!748 = !DISubprogram(name: "pow", scope: !704, file: !704, line: 140, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !750, file: !707, line: 421)
!750 = !DISubprogram(name: "sin", scope: !704, file: !704, line: 64, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !752, file: !707, line: 440)
!752 = !DISubprogram(name: "sinh", scope: !704, file: !704, line: 73, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !754, file: !707, line: 459)
!754 = !DISubprogram(name: "sqrt", scope: !704, file: !704, line: 143, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !756, file: !707, line: 478)
!756 = !DISubprogram(name: "tan", scope: !704, file: !704, line: 66, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !758, file: !707, line: 497)
!758 = !DISubprogram(name: "tanh", scope: !704, file: !704, line: 75, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !760, file: !707, line: 1065)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !761, line: 150, baseType: !8)
!761 = !DIFile(filename: "/usr/include/math.h", directory: "")
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !763, file: !707, line: 1066)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !761, line: 149, baseType: !248)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !765, file: !707, line: 1069)
!765 = !DISubprogram(name: "acosh", scope: !704, file: !704, line: 85, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !767, file: !707, line: 1070)
!767 = !DISubprogram(name: "acoshf", scope: !704, file: !704, line: 85, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{!248, !248}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !771, file: !707, line: 1071)
!771 = !DISubprogram(name: "acoshl", scope: !704, file: !704, line: 85, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !774}
!774 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !776, file: !707, line: 1073)
!776 = !DISubprogram(name: "asinh", scope: !704, file: !704, line: 87, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !778, file: !707, line: 1074)
!778 = !DISubprogram(name: "asinhf", scope: !704, file: !704, line: 87, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !780, file: !707, line: 1075)
!780 = !DISubprogram(name: "asinhl", scope: !704, file: !704, line: 87, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !782, file: !707, line: 1077)
!782 = !DISubprogram(name: "atanh", scope: !704, file: !704, line: 89, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !784, file: !707, line: 1078)
!784 = !DISubprogram(name: "atanhf", scope: !704, file: !704, line: 89, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !786, file: !707, line: 1079)
!786 = !DISubprogram(name: "atanhl", scope: !704, file: !704, line: 89, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !788, file: !707, line: 1081)
!788 = !DISubprogram(name: "cbrt", scope: !704, file: !704, line: 152, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !790, file: !707, line: 1082)
!790 = !DISubprogram(name: "cbrtf", scope: !704, file: !704, line: 152, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !792, file: !707, line: 1083)
!792 = !DISubprogram(name: "cbrtl", scope: !704, file: !704, line: 152, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !794, file: !707, line: 1085)
!794 = !DISubprogram(name: "copysign", scope: !704, file: !704, line: 196, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !796, file: !707, line: 1086)
!796 = !DISubprogram(name: "copysignf", scope: !704, file: !704, line: 196, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!248, !248, !248}
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !800, file: !707, line: 1087)
!800 = !DISubprogram(name: "copysignl", scope: !704, file: !704, line: 196, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{!774, !774, !774}
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !804, file: !707, line: 1089)
!804 = !DISubprogram(name: "erf", scope: !704, file: !704, line: 228, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !806, file: !707, line: 1090)
!806 = !DISubprogram(name: "erff", scope: !704, file: !704, line: 228, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !808, file: !707, line: 1091)
!808 = !DISubprogram(name: "erfl", scope: !704, file: !704, line: 228, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !810, file: !707, line: 1093)
!810 = !DISubprogram(name: "erfc", scope: !704, file: !704, line: 229, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !812, file: !707, line: 1094)
!812 = !DISubprogram(name: "erfcf", scope: !704, file: !704, line: 229, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !814, file: !707, line: 1095)
!814 = !DISubprogram(name: "erfcl", scope: !704, file: !704, line: 229, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !816, file: !707, line: 1097)
!816 = !DISubprogram(name: "exp2", scope: !704, file: !704, line: 130, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !818, file: !707, line: 1098)
!818 = !DISubprogram(name: "exp2f", scope: !704, file: !704, line: 130, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !820, file: !707, line: 1099)
!820 = !DISubprogram(name: "exp2l", scope: !704, file: !704, line: 130, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !822, file: !707, line: 1101)
!822 = !DISubprogram(name: "expm1", scope: !704, file: !704, line: 119, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !824, file: !707, line: 1102)
!824 = !DISubprogram(name: "expm1f", scope: !704, file: !704, line: 119, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !826, file: !707, line: 1103)
!826 = !DISubprogram(name: "expm1l", scope: !704, file: !704, line: 119, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !828, file: !707, line: 1105)
!828 = !DISubprogram(name: "fdim", scope: !704, file: !704, line: 326, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !830, file: !707, line: 1106)
!830 = !DISubprogram(name: "fdimf", scope: !704, file: !704, line: 326, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !832, file: !707, line: 1107)
!832 = !DISubprogram(name: "fdiml", scope: !704, file: !704, line: 326, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !834, file: !707, line: 1109)
!834 = !DISubprogram(name: "fma", scope: !704, file: !704, line: 335, type: !835, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!8, !8, !8, !8}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !838, file: !707, line: 1110)
!838 = !DISubprogram(name: "fmaf", scope: !704, file: !704, line: 335, type: !839, flags: DIFlagPrototyped, spFlags: 0)
!839 = !DISubroutineType(types: !840)
!840 = !{!248, !248, !248, !248}
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !842, file: !707, line: 1111)
!842 = !DISubprogram(name: "fmal", scope: !704, file: !704, line: 335, type: !843, flags: DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{!774, !774, !774, !774}
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !846, file: !707, line: 1113)
!846 = !DISubprogram(name: "fmax", scope: !704, file: !704, line: 329, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !848, file: !707, line: 1114)
!848 = !DISubprogram(name: "fmaxf", scope: !704, file: !704, line: 329, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !850, file: !707, line: 1115)
!850 = !DISubprogram(name: "fmaxl", scope: !704, file: !704, line: 329, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !852, file: !707, line: 1117)
!852 = !DISubprogram(name: "fmin", scope: !704, file: !704, line: 332, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !854, file: !707, line: 1118)
!854 = !DISubprogram(name: "fminf", scope: !704, file: !704, line: 332, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !856, file: !707, line: 1119)
!856 = !DISubprogram(name: "fminl", scope: !704, file: !704, line: 332, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !858, file: !707, line: 1121)
!858 = !DISubprogram(name: "hypot", scope: !704, file: !704, line: 147, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !860, file: !707, line: 1122)
!860 = !DISubprogram(name: "hypotf", scope: !704, file: !704, line: 147, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !862, file: !707, line: 1123)
!862 = !DISubprogram(name: "hypotl", scope: !704, file: !704, line: 147, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !864, file: !707, line: 1125)
!864 = !DISubprogram(name: "ilogb", scope: !704, file: !704, line: 280, type: !865, flags: DIFlagPrototyped, spFlags: 0)
!865 = !DISubroutineType(types: !866)
!866 = !{!40, !8}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !868, file: !707, line: 1126)
!868 = !DISubprogram(name: "ilogbf", scope: !704, file: !704, line: 280, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!40, !248}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !872, file: !707, line: 1127)
!872 = !DISubprogram(name: "ilogbl", scope: !704, file: !704, line: 280, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!40, !774}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !876, file: !707, line: 1129)
!876 = !DISubprogram(name: "lgamma", scope: !704, file: !704, line: 230, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !878, file: !707, line: 1130)
!878 = !DISubprogram(name: "lgammaf", scope: !704, file: !704, line: 230, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !880, file: !707, line: 1131)
!880 = !DISubprogram(name: "lgammal", scope: !704, file: !704, line: 230, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !882, file: !707, line: 1134)
!882 = !DISubprogram(name: "llrint", scope: !704, file: !704, line: 316, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !8}
!885 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !887, file: !707, line: 1135)
!887 = !DISubprogram(name: "llrintf", scope: !704, file: !704, line: 316, type: !888, flags: DIFlagPrototyped, spFlags: 0)
!888 = !DISubroutineType(types: !889)
!889 = !{!885, !248}
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !891, file: !707, line: 1136)
!891 = !DISubprogram(name: "llrintl", scope: !704, file: !704, line: 316, type: !892, flags: DIFlagPrototyped, spFlags: 0)
!892 = !DISubroutineType(types: !893)
!893 = !{!885, !774}
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !895, file: !707, line: 1138)
!895 = !DISubprogram(name: "llround", scope: !704, file: !704, line: 322, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !897, file: !707, line: 1139)
!897 = !DISubprogram(name: "llroundf", scope: !704, file: !704, line: 322, type: !888, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !899, file: !707, line: 1140)
!899 = !DISubprogram(name: "llroundl", scope: !704, file: !704, line: 322, type: !892, flags: DIFlagPrototyped, spFlags: 0)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !901, file: !707, line: 1143)
!901 = !DISubprogram(name: "log1p", scope: !704, file: !704, line: 122, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !903, file: !707, line: 1144)
!903 = !DISubprogram(name: "log1pf", scope: !704, file: !704, line: 122, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !905, file: !707, line: 1145)
!905 = !DISubprogram(name: "log1pl", scope: !704, file: !704, line: 122, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !907, file: !707, line: 1147)
!907 = !DISubprogram(name: "log2", scope: !704, file: !704, line: 133, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !909, file: !707, line: 1148)
!909 = !DISubprogram(name: "log2f", scope: !704, file: !704, line: 133, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !911, file: !707, line: 1149)
!911 = !DISubprogram(name: "log2l", scope: !704, file: !704, line: 133, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !913, file: !707, line: 1151)
!913 = !DISubprogram(name: "logb", scope: !704, file: !704, line: 125, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !915, file: !707, line: 1152)
!915 = !DISubprogram(name: "logbf", scope: !704, file: !704, line: 125, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !917, file: !707, line: 1153)
!917 = !DISubprogram(name: "logbl", scope: !704, file: !704, line: 125, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !919, file: !707, line: 1155)
!919 = !DISubprogram(name: "lrint", scope: !704, file: !704, line: 314, type: !920, flags: DIFlagPrototyped, spFlags: 0)
!920 = !DISubroutineType(types: !921)
!921 = !{!922, !8}
!922 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !924, file: !707, line: 1156)
!924 = !DISubprogram(name: "lrintf", scope: !704, file: !704, line: 314, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DISubroutineType(types: !926)
!926 = !{!922, !248}
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !928, file: !707, line: 1157)
!928 = !DISubprogram(name: "lrintl", scope: !704, file: !704, line: 314, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!929 = !DISubroutineType(types: !930)
!930 = !{!922, !774}
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !932, file: !707, line: 1159)
!932 = !DISubprogram(name: "lround", scope: !704, file: !704, line: 320, type: !920, flags: DIFlagPrototyped, spFlags: 0)
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !934, file: !707, line: 1160)
!934 = !DISubprogram(name: "lroundf", scope: !704, file: !704, line: 320, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !936, file: !707, line: 1161)
!936 = !DISubprogram(name: "lroundl", scope: !704, file: !704, line: 320, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !938, file: !707, line: 1163)
!938 = !DISubprogram(name: "nan", scope: !704, file: !704, line: 201, type: !939, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DISubroutineType(types: !940)
!940 = !{!8, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !944, file: !707, line: 1164)
!944 = !DISubprogram(name: "nanf", scope: !704, file: !704, line: 201, type: !945, flags: DIFlagPrototyped, spFlags: 0)
!945 = !DISubroutineType(types: !946)
!946 = !{!248, !941}
!947 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !948, file: !707, line: 1165)
!948 = !DISubprogram(name: "nanl", scope: !704, file: !704, line: 201, type: !949, flags: DIFlagPrototyped, spFlags: 0)
!949 = !DISubroutineType(types: !950)
!950 = !{!774, !941}
!951 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !952, file: !707, line: 1167)
!952 = !DISubprogram(name: "nearbyint", scope: !704, file: !704, line: 294, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!953 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !954, file: !707, line: 1168)
!954 = !DISubprogram(name: "nearbyintf", scope: !704, file: !704, line: 294, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !956, file: !707, line: 1169)
!956 = !DISubprogram(name: "nearbyintl", scope: !704, file: !704, line: 294, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!957 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !958, file: !707, line: 1171)
!958 = !DISubprogram(name: "nextafter", scope: !704, file: !704, line: 259, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!959 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !960, file: !707, line: 1172)
!960 = !DISubprogram(name: "nextafterf", scope: !704, file: !704, line: 259, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !962, file: !707, line: 1173)
!962 = !DISubprogram(name: "nextafterl", scope: !704, file: !704, line: 259, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!963 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !964, file: !707, line: 1175)
!964 = !DISubprogram(name: "nexttoward", scope: !704, file: !704, line: 261, type: !965, flags: DIFlagPrototyped, spFlags: 0)
!965 = !DISubroutineType(types: !966)
!966 = !{!8, !8, !774}
!967 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !968, file: !707, line: 1176)
!968 = !DISubprogram(name: "nexttowardf", scope: !704, file: !704, line: 261, type: !969, flags: DIFlagPrototyped, spFlags: 0)
!969 = !DISubroutineType(types: !970)
!970 = !{!248, !248, !774}
!971 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !972, file: !707, line: 1177)
!972 = !DISubprogram(name: "nexttowardl", scope: !704, file: !704, line: 261, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!973 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !974, file: !707, line: 1179)
!974 = !DISubprogram(name: "remainder", scope: !704, file: !704, line: 272, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!975 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !976, file: !707, line: 1180)
!976 = !DISubprogram(name: "remainderf", scope: !704, file: !704, line: 272, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !978, file: !707, line: 1181)
!978 = !DISubprogram(name: "remainderl", scope: !704, file: !704, line: 272, type: !801, flags: DIFlagPrototyped, spFlags: 0)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !980, file: !707, line: 1183)
!980 = !DISubprogram(name: "remquo", scope: !704, file: !704, line: 307, type: !981, flags: DIFlagPrototyped, spFlags: 0)
!981 = !DISubroutineType(types: !982)
!982 = !{!8, !8, !8, !734}
!983 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !984, file: !707, line: 1184)
!984 = !DISubprogram(name: "remquof", scope: !704, file: !704, line: 307, type: !985, flags: DIFlagPrototyped, spFlags: 0)
!985 = !DISubroutineType(types: !986)
!986 = !{!248, !248, !248, !734}
!987 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !988, file: !707, line: 1185)
!988 = !DISubprogram(name: "remquol", scope: !704, file: !704, line: 307, type: !989, flags: DIFlagPrototyped, spFlags: 0)
!989 = !DISubroutineType(types: !990)
!990 = !{!774, !774, !774, !734}
!991 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !992, file: !707, line: 1187)
!992 = !DISubprogram(name: "rint", scope: !704, file: !704, line: 256, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !994, file: !707, line: 1188)
!994 = !DISubprogram(name: "rintf", scope: !704, file: !704, line: 256, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!995 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !996, file: !707, line: 1189)
!996 = !DISubprogram(name: "rintl", scope: !704, file: !704, line: 256, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!997 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !998, file: !707, line: 1191)
!998 = !DISubprogram(name: "round", scope: !704, file: !704, line: 298, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!999 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1000, file: !707, line: 1192)
!1000 = !DISubprogram(name: "roundf", scope: !704, file: !704, line: 298, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!1001 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1002, file: !707, line: 1193)
!1002 = !DISubprogram(name: "roundl", scope: !704, file: !704, line: 298, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!1003 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1004, file: !707, line: 1195)
!1004 = !DISubprogram(name: "scalbln", scope: !704, file: !704, line: 290, type: !1005, flags: DIFlagPrototyped, spFlags: 0)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!8, !8, !922}
!1007 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1008, file: !707, line: 1196)
!1008 = !DISubprogram(name: "scalblnf", scope: !704, file: !704, line: 290, type: !1009, flags: DIFlagPrototyped, spFlags: 0)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!248, !248, !922}
!1011 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1012, file: !707, line: 1197)
!1012 = !DISubprogram(name: "scalblnl", scope: !704, file: !704, line: 290, type: !1013, flags: DIFlagPrototyped, spFlags: 0)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!774, !774, !922}
!1015 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1016, file: !707, line: 1199)
!1016 = !DISubprogram(name: "scalbn", scope: !704, file: !704, line: 276, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!1017 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1018, file: !707, line: 1200)
!1018 = !DISubprogram(name: "scalbnf", scope: !704, file: !704, line: 276, type: !1019, flags: DIFlagPrototyped, spFlags: 0)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!248, !248, !40}
!1021 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1022, file: !707, line: 1201)
!1022 = !DISubprogram(name: "scalbnl", scope: !704, file: !704, line: 276, type: !1023, flags: DIFlagPrototyped, spFlags: 0)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!774, !774, !40}
!1025 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1026, file: !707, line: 1203)
!1026 = !DISubprogram(name: "tgamma", scope: !704, file: !704, line: 235, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!1027 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1028, file: !707, line: 1204)
!1028 = !DISubprogram(name: "tgammaf", scope: !704, file: !704, line: 235, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!1029 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1030, file: !707, line: 1205)
!1030 = !DISubprogram(name: "tgammal", scope: !704, file: !704, line: 235, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!1031 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1032, file: !707, line: 1207)
!1032 = !DISubprogram(name: "trunc", scope: !704, file: !704, line: 302, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!1033 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1034, file: !707, line: 1208)
!1034 = !DISubprogram(name: "truncf", scope: !704, file: !704, line: 302, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!1035 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1036, file: !707, line: 1209)
!1036 = !DISubprogram(name: "truncl", scope: !704, file: !704, line: 302, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!1037 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !41, entity: !1038, file: !1042, line: 38)
!1038 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !696, file: !701, line: 103, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !1041}
!1041 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!1042 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!1043 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !41, entity: !1044, file: !1042, line: 54)
!1044 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !696, file: !707, line: 380, type: !1045, flags: DIFlagPrototyped, spFlags: 0)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!774, !774, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!1048 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !696, entity: !1049, file: !1051, line: 127)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !698, line: 62, baseType: !1050)
