; ModuleID = 'parstxtr.cpp'
source_filename = "parstxtr.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Texture_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, %"struct.pov::Texture_Struct"*, %"struct.pov::Pigment_Struct"*, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Finish_Struct"*, %"struct.pov::Texture_Struct"*, i32 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Default_Texture", linkageName: "_ZN3pov15Default_TextureE", scope: !2, file: !3, line: 83, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "parstxtr.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !6, line: 1035, baseType: !7)
!6 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !6, line: 1359, size: 1664, flags: DIFlagTypePassByValue, elements: !8, identifier: "_ZTSN3pov14Texture_StructE")
!8 = !{!9, !11, !12, !13, !15, !17, !18, !19, !27, !390, !391, !456, !457, !458, !459, !489, !490}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !7, file: !6, line: 1361, baseType: !10, size: 16)
!10 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !7, file: !6, line: 1361, baseType: !10, size: 16, offset: 16)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !7, file: !6, line: 1361, baseType: !10, size: 16, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !7, file: !6, line: 1361, baseType: !14, size: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !7, file: !6, line: 1361, baseType: !16, size: 32, offset: 96)
!16 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !7, file: !6, line: 1361, baseType: !16, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !7, file: !6, line: 1361, baseType: !16, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !7, file: !6, line: 1361, baseType: !20, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !6, line: 1040, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !6, line: 1387, size: 192, flags: DIFlagTypePassByValue, elements: !23, identifier: "_ZTSN3pov12Warps_StructE")
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !22, file: !6, line: 1389, baseType: !10, size: 16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !22, file: !6, line: 1389, baseType: !20, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !22, file: !6, line: 1389, baseType: !20, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !7, file: !6, line: 1361, baseType: !28, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !6, line: 1034, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !6, line: 1337, size: 1280, flags: DIFlagTypePassByValue, elements: !31, identifier: "_ZTSN3pov14Pattern_StructE")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !325}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !30, file: !6, line: 1339, baseType: !10, size: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !30, file: !6, line: 1339, baseType: !10, size: 16, offset: 16)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !30, file: !6, line: 1339, baseType: !10, size: 16, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !30, file: !6, line: 1339, baseType: !14, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !30, file: !6, line: 1339, baseType: !16, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !30, file: !6, line: 1339, baseType: !16, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !30, file: !6, line: 1339, baseType: !16, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !30, file: !6, line: 1339, baseType: !20, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !30, file: !6, line: 1339, baseType: !28, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !30, file: !6, line: 1339, baseType: !42, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !6, line: 1033, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !6, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !45, identifier: "_ZTSN3pov16Blend_Map_StructE")
!45 = !{!46, !47, !49, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !44, file: !6, line: 1061, baseType: !14, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !44, file: !6, line: 1062, baseType: !48, size: 16, offset: 32)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !44, file: !6, line: 1063, baseType: !50, size: 8, offset: 48)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !44, file: !6, line: 1063, baseType: !50, size: 8, offset: 56)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !44, file: !6, line: 1064, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !6, line: 1032, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !6, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!56 = !{!57, !58, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !6, line: 1047, baseType: !16, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !55, file: !6, line: 1048, baseType: !59, size: 8, offset: 32)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !55, file: !6, line: 1056, baseType: !61, size: 192, offset: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !55, file: !6, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !62, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!62 = !{!63, !68, !241, !323, !324}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !61, file: !6, line: 1051, baseType: !64, size: 160)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !6, line: 695, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 5)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !61, file: !6, line: 1052, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !6, line: 1036, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !6, line: 1342, size: 1472, flags: DIFlagTypePassByValue, elements: !72, identifier: "_ZTSN3pov14Pigment_StructE")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !240}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !71, file: !6, line: 1344, baseType: !10, size: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !71, file: !6, line: 1344, baseType: !10, size: 16, offset: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !71, file: !6, line: 1344, baseType: !10, size: 16, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !71, file: !6, line: 1344, baseType: !14, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !71, file: !6, line: 1344, baseType: !16, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !71, file: !6, line: 1344, baseType: !16, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !71, file: !6, line: 1344, baseType: !16, size: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !71, file: !6, line: 1344, baseType: !20, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !71, file: !6, line: 1344, baseType: !28, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !71, file: !6, line: 1344, baseType: !42, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !71, file: !6, line: 1344, baseType: !84, size: 896, offset: 384)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !6, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !85, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!85 = !{!86, !114, !176, !177, !178, !179, !180, !181, !186, !191, !197, !209, !220, !230, !235, !236}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !84, file: !6, line: 1344, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !6, line: 1280, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !6, line: 1283, size: 128, flags: DIFlagTypePassByValue, elements: !90, identifier: "_ZTSN3pov19Density_file_StructE")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !89, file: !6, line: 1285, baseType: !14, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !89, file: !6, line: 1286, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !2, file: !6, line: 1281, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !2, file: !6, line: 1289, size: 320, flags: DIFlagTypePassByValue, elements: !96, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!96 = !{!97, !98, !100, !101, !102, !103, !104}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !95, file: !6, line: 1291, baseType: !14, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !95, file: !6, line: 1292, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !95, file: !6, line: 1293, baseType: !14, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !95, file: !6, line: 1293, baseType: !14, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !95, file: !6, line: 1293, baseType: !14, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !95, file: !6, line: 1294, baseType: !14, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !6, line: 1295, baseType: !105, size: 64, offset: 256)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !6, line: 1295, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !106, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!106 = !{!107, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !105, file: !6, line: 1297, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !105, file: !6, line: 1298, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !105, file: !6, line: 1299, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !84, file: !6, line: 1344, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !6, line: 1232, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !6, line: 1234, size: 960, flags: DIFlagTypePassByValue, elements: !118, identifier: "_ZTSN3pov12Image_StructE")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !135, !136, !137, !142, !143, !144, !154, !156}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !117, file: !6, line: 1236, baseType: !14, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !117, file: !6, line: 1237, baseType: !14, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !117, file: !6, line: 1238, baseType: !14, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !117, file: !6, line: 1239, baseType: !14, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !117, file: !6, line: 1240, baseType: !14, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !117, file: !6, line: 1241, baseType: !14, size: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !117, file: !6, line: 1241, baseType: !14, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !117, file: !6, line: 1242, baseType: !48, size: 16, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !117, file: !6, line: 1243, baseType: !50, size: 8, offset: 240)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !117, file: !6, line: 1244, baseType: !50, size: 8, offset: 248)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !117, file: !6, line: 1245, baseType: !130, size: 192, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !6, line: 691, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !133)
!132 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!133 = !{!134}
!134 = !DISubrange(count: 3)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !117, file: !6, line: 1246, baseType: !16, size: 32, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !117, file: !6, line: 1246, baseType: !16, size: 32, offset: 480)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !117, file: !6, line: 1247, baseType: !138, size: 128, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !6, line: 690, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !117, file: !6, line: 1248, baseType: !132, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !117, file: !6, line: 1248, baseType: !132, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !117, file: !6, line: 1249, baseType: !145, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !2, file: !6, line: 1169, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !2, file: !6, line: 1175, size: 80, flags: DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN3pov19Image_Colour_StructE")
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !147, file: !6, line: 1177, baseType: !10, size: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !147, file: !6, line: 1177, baseType: !10, size: 16, offset: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !147, file: !6, line: 1177, baseType: !10, size: 16, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !147, file: !6, line: 1177, baseType: !10, size: 16, offset: 48)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !147, file: !6, line: 1177, baseType: !10, size: 16, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !117, file: !6, line: 1250, baseType: !155, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !6, line: 1257, baseType: !157, size: 64, offset: 896)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !117, file: !6, line: 1251, size: 64, flags: DIFlagTypePassByValue, elements: !158, identifier: "_ZTSN3pov12Image_StructUt_E")
!158 = !{!159, !163, !172, !174}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !157, file: !6, line: 1253, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !2, file: !6, line: 1171, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !2, file: !6, line: 1180, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov18Image8_Line_StructE")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !157, file: !6, line: 1254, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !2, file: !6, line: 1173, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !2, file: !6, line: 1185, size: 256, flags: DIFlagTypePassByValue, elements: !167, identifier: "_ZTSN3pov19Image16_Line_StructE")
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !166, file: !6, line: 1187, baseType: !110, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !166, file: !6, line: 1187, baseType: !110, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !166, file: !6, line: 1187, baseType: !110, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !166, file: !6, line: 1187, baseType: !110, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !157, file: !6, line: 1255, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !157, file: !6, line: 1256, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !84, file: !6, line: 1344, baseType: !130, size: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !84, file: !6, line: 1344, baseType: !16, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !84, file: !6, line: 1344, baseType: !48, size: 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !84, file: !6, line: 1344, baseType: !48, size: 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !84, file: !6, line: 1344, baseType: !48, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !84, file: !6, line: 1344, baseType: !182, size: 256)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 256, flags: DIFlagTypePassByValue, elements: !183, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !182, file: !6, line: 1344, baseType: !16, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !182, file: !6, line: 1344, baseType: !130, size: 192, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !84, file: !6, line: 1344, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 64, flags: DIFlagTypePassByValue, elements: !188, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !187, file: !6, line: 1344, baseType: !16, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !187, file: !6, line: 1344, baseType: !16, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !84, file: !6, line: 1344, baseType: !192, size: 320)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 320, flags: DIFlagTypePassByValue, elements: !193, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !192, file: !6, line: 1344, baseType: !132, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !192, file: !6, line: 1344, baseType: !132, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !192, file: !6, line: 1344, baseType: !130, size: 192, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !84, file: !6, line: 1344, baseType: !198, size: 896)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 896, flags: DIFlagTypePassByValue, elements: !199, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!199 = !{!200, !201, !202, !203, !204, !205, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !198, file: !6, line: 1344, baseType: !130, size: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !198, file: !6, line: 1344, baseType: !130, size: 192, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !198, file: !6, line: 1344, baseType: !132, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !198, file: !6, line: 1344, baseType: !132, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !198, file: !6, line: 1344, baseType: !48, size: 16, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !198, file: !6, line: 1344, baseType: !206, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !198, file: !6, line: 1344, baseType: !14, size: 32, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !198, file: !6, line: 1344, baseType: !130, size: 192, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !84, file: !6, line: 1344, baseType: !210, size: 832)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 832, flags: DIFlagTypePassByValue, elements: !211, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !210, file: !6, line: 1344, baseType: !130, size: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !210, file: !6, line: 1344, baseType: !130, size: 192, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !210, file: !6, line: 1344, baseType: !48, size: 16, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !210, file: !6, line: 1344, baseType: !48, size: 16, offset: 400)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !210, file: !6, line: 1344, baseType: !132, size: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !210, file: !6, line: 1344, baseType: !132, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !210, file: !6, line: 1344, baseType: !138, size: 128, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !210, file: !6, line: 1344, baseType: !138, size: 128, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !84, file: !6, line: 1344, baseType: !221, size: 384)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 384, flags: DIFlagTypePassByValue, elements: !222, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!222 = !{!223, !224, !225, !226, !227, !228, !229}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !221, file: !6, line: 1344, baseType: !138, size: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !221, file: !6, line: 1344, baseType: !48, size: 16, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !221, file: !6, line: 1344, baseType: !48, size: 16, offset: 144)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !221, file: !6, line: 1344, baseType: !48, size: 16, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !221, file: !6, line: 1344, baseType: !132, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !221, file: !6, line: 1344, baseType: !132, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !221, file: !6, line: 1344, baseType: !14, size: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !84, file: !6, line: 1344, baseType: !231, size: 128)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !6, line: 1344, size: 128, flags: DIFlagTypePassByValue, elements: !232, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !231, file: !6, line: 1344, baseType: !155, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !231, file: !6, line: 1344, baseType: !155, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !84, file: !6, line: 1344, baseType: !69, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !84, file: !6, line: 1344, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !6, line: 678, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !6, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !71, file: !6, line: 1345, baseType: !64, size: 160, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !61, file: !6, line: 1053, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !6, line: 1037, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !6, line: 1348, size: 1344, flags: DIFlagTypePassByValue, elements: !245, identifier: "_ZTSN3pov14Tnormal_StructE")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !321, !322}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !244, file: !6, line: 1350, baseType: !10, size: 16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !244, file: !6, line: 1350, baseType: !10, size: 16, offset: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !244, file: !6, line: 1350, baseType: !10, size: 16, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !244, file: !6, line: 1350, baseType: !14, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !244, file: !6, line: 1350, baseType: !16, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !244, file: !6, line: 1350, baseType: !16, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !244, file: !6, line: 1350, baseType: !16, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !244, file: !6, line: 1350, baseType: !20, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !244, file: !6, line: 1350, baseType: !28, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !244, file: !6, line: 1350, baseType: !42, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !244, file: !6, line: 1350, baseType: !257, size: 896, offset: 384)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !6, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !258, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !271, !276, !282, !293, !304, !314, !319, !320}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !257, file: !6, line: 1350, baseType: !87, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !257, file: !6, line: 1350, baseType: !115, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !257, file: !6, line: 1350, baseType: !130, size: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !257, file: !6, line: 1350, baseType: !16, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !257, file: !6, line: 1350, baseType: !48, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !257, file: !6, line: 1350, baseType: !48, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !257, file: !6, line: 1350, baseType: !48, size: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !257, file: !6, line: 1350, baseType: !267, size: 256)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 256, flags: DIFlagTypePassByValue, elements: !268, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !267, file: !6, line: 1350, baseType: !16, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !267, file: !6, line: 1350, baseType: !130, size: 192, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !257, file: !6, line: 1350, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 64, flags: DIFlagTypePassByValue, elements: !273, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !272, file: !6, line: 1350, baseType: !16, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !272, file: !6, line: 1350, baseType: !16, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !257, file: !6, line: 1350, baseType: !277, size: 320)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 320, flags: DIFlagTypePassByValue, elements: !278, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !277, file: !6, line: 1350, baseType: !132, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !277, file: !6, line: 1350, baseType: !132, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !277, file: !6, line: 1350, baseType: !130, size: 192, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !257, file: !6, line: 1350, baseType: !283, size: 896)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 896, flags: DIFlagTypePassByValue, elements: !284, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !283, file: !6, line: 1350, baseType: !130, size: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !283, file: !6, line: 1350, baseType: !130, size: 192, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !283, file: !6, line: 1350, baseType: !132, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !283, file: !6, line: 1350, baseType: !132, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !283, file: !6, line: 1350, baseType: !48, size: 16, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !283, file: !6, line: 1350, baseType: !206, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !283, file: !6, line: 1350, baseType: !14, size: 32, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !283, file: !6, line: 1350, baseType: !130, size: 192, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !257, file: !6, line: 1350, baseType: !294, size: 832)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 832, flags: DIFlagTypePassByValue, elements: !295, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !294, file: !6, line: 1350, baseType: !130, size: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !294, file: !6, line: 1350, baseType: !130, size: 192, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !294, file: !6, line: 1350, baseType: !48, size: 16, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !294, file: !6, line: 1350, baseType: !48, size: 16, offset: 400)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !294, file: !6, line: 1350, baseType: !132, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !294, file: !6, line: 1350, baseType: !132, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !294, file: !6, line: 1350, baseType: !138, size: 128, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !294, file: !6, line: 1350, baseType: !138, size: 128, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !257, file: !6, line: 1350, baseType: !305, size: 384)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 384, flags: DIFlagTypePassByValue, elements: !306, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!306 = !{!307, !308, !309, !310, !311, !312, !313}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !305, file: !6, line: 1350, baseType: !138, size: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !305, file: !6, line: 1350, baseType: !48, size: 16, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !305, file: !6, line: 1350, baseType: !48, size: 16, offset: 144)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !305, file: !6, line: 1350, baseType: !48, size: 16, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !305, file: !6, line: 1350, baseType: !132, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !305, file: !6, line: 1350, baseType: !132, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !305, file: !6, line: 1350, baseType: !14, size: 32, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !257, file: !6, line: 1350, baseType: !315, size: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !6, line: 1350, size: 128, flags: DIFlagTypePassByValue, elements: !316, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !315, file: !6, line: 1350, baseType: !155, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !315, file: !6, line: 1350, baseType: !155, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !257, file: !6, line: 1350, baseType: !69, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !257, file: !6, line: 1350, baseType: !237, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !244, file: !6, line: 1351, baseType: !16, size: 32, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !244, file: !6, line: 1352, baseType: !16, size: 32, offset: 1312)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !61, file: !6, line: 1054, baseType: !4, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !61, file: !6, line: 1055, baseType: !138, size: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !30, file: !6, line: 1339, baseType: !326, size: 896, offset: 384)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !30, file: !6, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !327, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !340, !345, !351, !362, !373, !383, !388, !389}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !326, file: !6, line: 1339, baseType: !87, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !326, file: !6, line: 1339, baseType: !115, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !326, file: !6, line: 1339, baseType: !130, size: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !326, file: !6, line: 1339, baseType: !16, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !326, file: !6, line: 1339, baseType: !48, size: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !326, file: !6, line: 1339, baseType: !48, size: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !326, file: !6, line: 1339, baseType: !48, size: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !326, file: !6, line: 1339, baseType: !336, size: 256)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 256, flags: DIFlagTypePassByValue, elements: !337, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !336, file: !6, line: 1339, baseType: !16, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !336, file: !6, line: 1339, baseType: !130, size: 192, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !326, file: !6, line: 1339, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 64, flags: DIFlagTypePassByValue, elements: !342, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !341, file: !6, line: 1339, baseType: !16, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !341, file: !6, line: 1339, baseType: !16, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !326, file: !6, line: 1339, baseType: !346, size: 320)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 320, flags: DIFlagTypePassByValue, elements: !347, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!347 = !{!348, !349, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !346, file: !6, line: 1339, baseType: !132, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !346, file: !6, line: 1339, baseType: !132, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !346, file: !6, line: 1339, baseType: !130, size: 192, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !326, file: !6, line: 1339, baseType: !352, size: 896)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !353, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !352, file: !6, line: 1339, baseType: !130, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !352, file: !6, line: 1339, baseType: !130, size: 192, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !352, file: !6, line: 1339, baseType: !132, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !352, file: !6, line: 1339, baseType: !132, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !352, file: !6, line: 1339, baseType: !48, size: 16, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !352, file: !6, line: 1339, baseType: !206, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !352, file: !6, line: 1339, baseType: !14, size: 32, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !352, file: !6, line: 1339, baseType: !130, size: 192, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !326, file: !6, line: 1339, baseType: !363, size: 832)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 832, flags: DIFlagTypePassByValue, elements: !364, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !363, file: !6, line: 1339, baseType: !130, size: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !363, file: !6, line: 1339, baseType: !130, size: 192, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !363, file: !6, line: 1339, baseType: !48, size: 16, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !363, file: !6, line: 1339, baseType: !48, size: 16, offset: 400)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !363, file: !6, line: 1339, baseType: !132, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !363, file: !6, line: 1339, baseType: !132, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !363, file: !6, line: 1339, baseType: !138, size: 128, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !363, file: !6, line: 1339, baseType: !138, size: 128, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !326, file: !6, line: 1339, baseType: !374, size: 384)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 384, flags: DIFlagTypePassByValue, elements: !375, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!375 = !{!376, !377, !378, !379, !380, !381, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !374, file: !6, line: 1339, baseType: !138, size: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !374, file: !6, line: 1339, baseType: !48, size: 16, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !374, file: !6, line: 1339, baseType: !48, size: 16, offset: 144)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !374, file: !6, line: 1339, baseType: !48, size: 16, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !374, file: !6, line: 1339, baseType: !132, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !374, file: !6, line: 1339, baseType: !132, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !374, file: !6, line: 1339, baseType: !14, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !326, file: !6, line: 1339, baseType: !384, size: 128)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !6, line: 1339, size: 128, flags: DIFlagTypePassByValue, elements: !385, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !384, file: !6, line: 1339, baseType: !155, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !384, file: !6, line: 1339, baseType: !155, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !326, file: !6, line: 1339, baseType: !69, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !326, file: !6, line: 1339, baseType: !237, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !7, file: !6, line: 1361, baseType: !42, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !7, file: !6, line: 1361, baseType: !392, size: 896, offset: 384)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !393, identifier: "_ZTSN3pov14Texture_StructUt_E")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !406, !411, !417, !428, !439, !449, !454, !455}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !392, file: !6, line: 1361, baseType: !87, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !392, file: !6, line: 1361, baseType: !115, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !392, file: !6, line: 1361, baseType: !130, size: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !392, file: !6, line: 1361, baseType: !16, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !392, file: !6, line: 1361, baseType: !48, size: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !392, file: !6, line: 1361, baseType: !48, size: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !392, file: !6, line: 1361, baseType: !48, size: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !392, file: !6, line: 1361, baseType: !402, size: 256)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 256, flags: DIFlagTypePassByValue, elements: !403, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !402, file: !6, line: 1361, baseType: !16, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !402, file: !6, line: 1361, baseType: !130, size: 192, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !392, file: !6, line: 1361, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 64, flags: DIFlagTypePassByValue, elements: !408, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !407, file: !6, line: 1361, baseType: !16, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !407, file: !6, line: 1361, baseType: !16, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !392, file: !6, line: 1361, baseType: !412, size: 320)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 320, flags: DIFlagTypePassByValue, elements: !413, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !412, file: !6, line: 1361, baseType: !132, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !412, file: !6, line: 1361, baseType: !132, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !412, file: !6, line: 1361, baseType: !130, size: 192, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !392, file: !6, line: 1361, baseType: !418, size: 896)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !419, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !418, file: !6, line: 1361, baseType: !130, size: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !418, file: !6, line: 1361, baseType: !130, size: 192, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !418, file: !6, line: 1361, baseType: !132, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !418, file: !6, line: 1361, baseType: !132, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !418, file: !6, line: 1361, baseType: !48, size: 16, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !418, file: !6, line: 1361, baseType: !206, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !418, file: !6, line: 1361, baseType: !14, size: 32, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !418, file: !6, line: 1361, baseType: !130, size: 192, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !392, file: !6, line: 1361, baseType: !429, size: 832)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 832, flags: DIFlagTypePassByValue, elements: !430, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !429, file: !6, line: 1361, baseType: !130, size: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !429, file: !6, line: 1361, baseType: !130, size: 192, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !429, file: !6, line: 1361, baseType: !48, size: 16, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !429, file: !6, line: 1361, baseType: !48, size: 16, offset: 400)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !429, file: !6, line: 1361, baseType: !132, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !429, file: !6, line: 1361, baseType: !132, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !429, file: !6, line: 1361, baseType: !138, size: 128, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !429, file: !6, line: 1361, baseType: !138, size: 128, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !392, file: !6, line: 1361, baseType: !440, size: 384)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 384, flags: DIFlagTypePassByValue, elements: !441, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!441 = !{!442, !443, !444, !445, !446, !447, !448}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !440, file: !6, line: 1361, baseType: !138, size: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !440, file: !6, line: 1361, baseType: !48, size: 16, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !440, file: !6, line: 1361, baseType: !48, size: 16, offset: 144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !440, file: !6, line: 1361, baseType: !48, size: 16, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !440, file: !6, line: 1361, baseType: !132, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !440, file: !6, line: 1361, baseType: !132, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !440, file: !6, line: 1361, baseType: !14, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !392, file: !6, line: 1361, baseType: !450, size: 128)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !6, line: 1361, size: 128, flags: DIFlagTypePassByValue, elements: !451, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !450, file: !6, line: 1361, baseType: !155, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !450, file: !6, line: 1361, baseType: !155, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !392, file: !6, line: 1361, baseType: !69, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !392, file: !6, line: 1361, baseType: !237, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !7, file: !6, line: 1361, baseType: !4, size: 64, offset: 1280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !7, file: !6, line: 1362, baseType: !69, size: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !7, file: !6, line: 1363, baseType: !242, size: 64, offset: 1408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !7, file: !6, line: 1364, baseType: !460, size: 64, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !2, file: !6, line: 1038, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !2, file: !6, line: 1370, size: 928, flags: DIFlagTypePassByValue, elements: !463, identifier: "_ZTSN3pov13Finish_StructE")
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !483, !484, !485, !486, !487, !488}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !462, file: !6, line: 1372, baseType: !16, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !462, file: !6, line: 1372, baseType: !16, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !462, file: !6, line: 1373, baseType: !16, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !462, file: !6, line: 1373, baseType: !16, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !462, file: !6, line: 1374, baseType: !16, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !462, file: !6, line: 1374, baseType: !16, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !462, file: !6, line: 1375, baseType: !16, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !462, file: !6, line: 1375, baseType: !16, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !462, file: !6, line: 1375, baseType: !16, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !462, file: !6, line: 1376, baseType: !16, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !462, file: !6, line: 1376, baseType: !16, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !462, file: !6, line: 1376, baseType: !16, size: 32, offset: 352)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !462, file: !6, line: 1376, baseType: !16, size: 32, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !462, file: !6, line: 1376, baseType: !16, size: 32, offset: 416)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !462, file: !6, line: 1377, baseType: !16, size: 32, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !462, file: !6, line: 1377, baseType: !16, size: 32, offset: 480)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !462, file: !6, line: 1378, baseType: !481, size: 96, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !2, file: !6, line: 696, baseType: !482)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, elements: !133)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !462, file: !6, line: 1378, baseType: !481, size: 96, offset: 608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !462, file: !6, line: 1378, baseType: !481, size: 96, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !462, file: !6, line: 1379, baseType: !16, size: 32, offset: 800)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !462, file: !6, line: 1380, baseType: !14, size: 32, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !462, file: !6, line: 1381, baseType: !16, size: 32, offset: 864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !462, file: !6, line: 1382, baseType: !14, size: 32, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !7, file: !6, line: 1365, baseType: !4, size: 64, offset: 1536)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !7, file: !6, line: 1366, baseType: !14, size: 32, offset: 1600)
!491 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, retainedTypes: !1103, globals: !1286, imports: !1287, splitDebugInlining: false, nameTableKind: None)
!492 = !{!493, !1032, !1086, !1093, !1099}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TOKEN_IDS", scope: !2, file: !494, line: 39, baseType: !113, size: 32, elements: !495, identifier: "_ZTSN3pov9TOKEN_IDSE")
!494 = !DIFile(filename: "./reswords.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!496 = !DIEnumerator(name: "ABS_TOKEN", value: 0, isUnsigned: true)
!497 = !DIEnumerator(name: "ATAN_TOKEN", value: 1, isUnsigned: true)
!498 = !DIEnumerator(name: "ATAN2_TOKEN", value: 2, isUnsigned: true)
!499 = !DIEnumerator(name: "CEIL_TOKEN", value: 3, isUnsigned: true)
!500 = !DIEnumerator(name: "CLOCK_ON_TOKEN", value: 4, isUnsigned: true)
!501 = !DIEnumerator(name: "CLOCK_TOKEN", value: 5, isUnsigned: true)
!502 = !DIEnumerator(name: "COS_TOKEN", value: 6, isUnsigned: true)
!503 = !DIEnumerator(name: "DEGREES_TOKEN", value: 7, isUnsigned: true)
!504 = !DIEnumerator(name: "DIV_TOKEN", value: 8, isUnsigned: true)
!505 = !DIEnumerator(name: "EXP_TOKEN", value: 9, isUnsigned: true)
!506 = !DIEnumerator(name: "FLOAT_ID_TOKEN", value: 10, isUnsigned: true)
!507 = !DIEnumerator(name: "FLOAT_TOKEN", value: 11, isUnsigned: true)
!508 = !DIEnumerator(name: "FLOOR_TOKEN", value: 12, isUnsigned: true)
!509 = !DIEnumerator(name: "FINALCLOCK_TOKEN", value: 13, isUnsigned: true)
!510 = !DIEnumerator(name: "FINALFRAME_TOKEN", value: 14, isUnsigned: true)
!511 = !DIEnumerator(name: "FRAMENUMBER_TOKEN", value: 15, isUnsigned: true)
!512 = !DIEnumerator(name: "IMAGE_WIDTH_TOKEN", value: 16, isUnsigned: true)
!513 = !DIEnumerator(name: "IMAGE_HEIGHT_TOKEN", value: 17, isUnsigned: true)
!514 = !DIEnumerator(name: "INITIALFRAME_TOKEN", value: 18, isUnsigned: true)
!515 = !DIEnumerator(name: "INITIALCLOCK_TOKEN", value: 19, isUnsigned: true)
!516 = !DIEnumerator(name: "INSIDE_TOKEN", value: 20, isUnsigned: true)
!517 = !DIEnumerator(name: "INT_TOKEN", value: 21, isUnsigned: true)
!518 = !DIEnumerator(name: "LN_TOKEN", value: 22, isUnsigned: true)
!519 = !DIEnumerator(name: "LOG_TOKEN", value: 23, isUnsigned: true)
!520 = !DIEnumerator(name: "MAX_TOKEN", value: 24, isUnsigned: true)
!521 = !DIEnumerator(name: "MIN_TOKEN", value: 25, isUnsigned: true)
!522 = !DIEnumerator(name: "MOD_TOKEN", value: 26, isUnsigned: true)
!523 = !DIEnumerator(name: "PI_TOKEN", value: 27, isUnsigned: true)
!524 = !DIEnumerator(name: "POW_TOKEN", value: 28, isUnsigned: true)
!525 = !DIEnumerator(name: "RADIANS_TOKEN", value: 29, isUnsigned: true)
!526 = !DIEnumerator(name: "SELECT_TOKEN", value: 30, isUnsigned: true)
!527 = !DIEnumerator(name: "SIN_TOKEN", value: 31, isUnsigned: true)
!528 = !DIEnumerator(name: "SQRT_TOKEN", value: 32, isUnsigned: true)
!529 = !DIEnumerator(name: "VDOT_TOKEN", value: 33, isUnsigned: true)
!530 = !DIEnumerator(name: "VLENGTH_TOKEN", value: 34, isUnsigned: true)
!531 = !DIEnumerator(name: "VERSION_TOKEN", value: 35, isUnsigned: true)
!532 = !DIEnumerator(name: "ON_TOKEN", value: 36, isUnsigned: true)
!533 = !DIEnumerator(name: "OFF_TOKEN", value: 37, isUnsigned: true)
!534 = !DIEnumerator(name: "TRUE_TOKEN", value: 38, isUnsigned: true)
!535 = !DIEnumerator(name: "FALSE_TOKEN", value: 39, isUnsigned: true)
!536 = !DIEnumerator(name: "YES_TOKEN", value: 40, isUnsigned: true)
!537 = !DIEnumerator(name: "NO_TOKEN", value: 41, isUnsigned: true)
!538 = !DIEnumerator(name: "ACOS_TOKEN", value: 42, isUnsigned: true)
!539 = !DIEnumerator(name: "ASIN_TOKEN", value: 43, isUnsigned: true)
!540 = !DIEnumerator(name: "TAN_TOKEN", value: 44, isUnsigned: true)
!541 = !DIEnumerator(name: "ASC_TOKEN", value: 45, isUnsigned: true)
!542 = !DIEnumerator(name: "STRLEN_TOKEN", value: 46, isUnsigned: true)
!543 = !DIEnumerator(name: "VAL_TOKEN", value: 47, isUnsigned: true)
!544 = !DIEnumerator(name: "FILE_EXISTS_TOKEN", value: 48, isUnsigned: true)
!545 = !DIEnumerator(name: "STRCMP_TOKEN", value: 49, isUnsigned: true)
!546 = !DIEnumerator(name: "SEED_TOKEN", value: 50, isUnsigned: true)
!547 = !DIEnumerator(name: "RAND_TOKEN", value: 51, isUnsigned: true)
!548 = !DIEnumerator(name: "CLOCK_DELTA_TOKEN", value: 52, isUnsigned: true)
!549 = !DIEnumerator(name: "DIMENSIONS_TOKEN", value: 53, isUnsigned: true)
!550 = !DIEnumerator(name: "DIMENSION_SIZE_TOKEN", value: 54, isUnsigned: true)
!551 = !DIEnumerator(name: "DEFINED_TOKEN", value: 55, isUnsigned: true)
!552 = !DIEnumerator(name: "COSH_TOKEN", value: 56, isUnsigned: true)
!553 = !DIEnumerator(name: "SINH_TOKEN", value: 57, isUnsigned: true)
!554 = !DIEnumerator(name: "TANH_TOKEN", value: 58, isUnsigned: true)
!555 = !DIEnumerator(name: "ATANH_TOKEN", value: 59, isUnsigned: true)
!556 = !DIEnumerator(name: "ACOSH_TOKEN", value: 60, isUnsigned: true)
!557 = !DIEnumerator(name: "ASINH_TOKEN", value: 61, isUnsigned: true)
!558 = !DIEnumerator(name: "SUM_TOKEN", value: 62, isUnsigned: true)
!559 = !DIEnumerator(name: "PROD_TOKEN", value: 63, isUnsigned: true)
!560 = !DIEnumerator(name: "FLOAT_FUNCT_TOKEN", value: 64, isUnsigned: true)
!561 = !DIEnumerator(name: "VAXIS_ROTATE_TOKEN", value: 65, isUnsigned: true)
!562 = !DIEnumerator(name: "VCROSS_TOKEN", value: 66, isUnsigned: true)
!563 = !DIEnumerator(name: "VECTOR_ID_TOKEN", value: 67, isUnsigned: true)
!564 = !DIEnumerator(name: "VNORMALIZE_TOKEN", value: 68, isUnsigned: true)
!565 = !DIEnumerator(name: "VROTATE_TOKEN", value: 69, isUnsigned: true)
!566 = !DIEnumerator(name: "VTURBULENCE_TOKEN", value: 70, isUnsigned: true)
!567 = !DIEnumerator(name: "X_TOKEN", value: 71, isUnsigned: true)
!568 = !DIEnumerator(name: "Y_TOKEN", value: 72, isUnsigned: true)
!569 = !DIEnumerator(name: "Z_TOKEN", value: 73, isUnsigned: true)
!570 = !DIEnumerator(name: "TRACE_TOKEN", value: 74, isUnsigned: true)
!571 = !DIEnumerator(name: "MIN_EXTENT_TOKEN", value: 75, isUnsigned: true)
!572 = !DIEnumerator(name: "MAX_EXTENT_TOKEN", value: 76, isUnsigned: true)
!573 = !DIEnumerator(name: "VECTOR_FUNCT_TOKEN", value: 77, isUnsigned: true)
!574 = !DIEnumerator(name: "ALPHA_TOKEN", value: 78, isUnsigned: true)
!575 = !DIEnumerator(name: "BLUE_TOKEN", value: 79, isUnsigned: true)
!576 = !DIEnumerator(name: "FILTER_TOKEN", value: 80, isUnsigned: true)
!577 = !DIEnumerator(name: "TRANSMIT_TOKEN", value: 81, isUnsigned: true)
!578 = !DIEnumerator(name: "GRAY_TOKEN", value: 82, isUnsigned: true)
!579 = !DIEnumerator(name: "GREEN_TOKEN", value: 83, isUnsigned: true)
!580 = !DIEnumerator(name: "RED_TOKEN", value: 84, isUnsigned: true)
!581 = !DIEnumerator(name: "RGBF_TOKEN", value: 85, isUnsigned: true)
!582 = !DIEnumerator(name: "RGBFT_TOKEN", value: 86, isUnsigned: true)
!583 = !DIEnumerator(name: "RGBT_TOKEN", value: 87, isUnsigned: true)
!584 = !DIEnumerator(name: "RGB_TOKEN", value: 88, isUnsigned: true)
!585 = !DIEnumerator(name: "COLOUR_KEY_TOKEN", value: 89, isUnsigned: true)
!586 = !DIEnumerator(name: "COLOR_TOKEN", value: 90, isUnsigned: true)
!587 = !DIEnumerator(name: "COLOUR_TOKEN", value: 91, isUnsigned: true)
!588 = !DIEnumerator(name: "COLOUR_ID_TOKEN", value: 92, isUnsigned: true)
!589 = !DIEnumerator(name: "CHARSET_TOKEN", value: 93, isUnsigned: true)
!590 = !DIEnumerator(name: "ASCII_TOKEN", value: 94, isUnsigned: true)
!591 = !DIEnumerator(name: "UTF8_TOKEN", value: 95, isUnsigned: true)
!592 = !DIEnumerator(name: "ADAPTIVE_TOKEN", value: 96, isUnsigned: true)
!593 = !DIEnumerator(name: "AGATE_TOKEN", value: 97, isUnsigned: true)
!594 = !DIEnumerator(name: "ALL_TOKEN", value: 98, isUnsigned: true)
!595 = !DIEnumerator(name: "ALTITUDE_TOKEN", value: 99, isUnsigned: true)
!596 = !DIEnumerator(name: "AMBIENT_TOKEN", value: 100, isUnsigned: true)
!597 = !DIEnumerator(name: "AMPERSAND_TOKEN", value: 101, isUnsigned: true)
!598 = !DIEnumerator(name: "AREA_LIGHT_TOKEN", value: 102, isUnsigned: true)
!599 = !DIEnumerator(name: "AT_TOKEN", value: 103, isUnsigned: true)
!600 = !DIEnumerator(name: "BACK_QUOTE_TOKEN", value: 104, isUnsigned: true)
!601 = !DIEnumerator(name: "BACK_SLASH_TOKEN", value: 105, isUnsigned: true)
!602 = !DIEnumerator(name: "BAR_TOKEN", value: 106, isUnsigned: true)
!603 = !DIEnumerator(name: "BICUBIC_PATCH_TOKEN", value: 107, isUnsigned: true)
!604 = !DIEnumerator(name: "BLOB_TOKEN", value: 108, isUnsigned: true)
!605 = !DIEnumerator(name: "BOUNDED_BY_TOKEN", value: 109, isUnsigned: true)
!606 = !DIEnumerator(name: "BOX_TOKEN", value: 110, isUnsigned: true)
!607 = !DIEnumerator(name: "BOZO_TOKEN", value: 111, isUnsigned: true)
!608 = !DIEnumerator(name: "BRICK_TOKEN", value: 112, isUnsigned: true)
!609 = !DIEnumerator(name: "BRILLIANCE_TOKEN", value: 113, isUnsigned: true)
!610 = !DIEnumerator(name: "BUMPS_TOKEN", value: 114, isUnsigned: true)
!611 = !DIEnumerator(name: "BUMP_MAP_TOKEN", value: 115, isUnsigned: true)
!612 = !DIEnumerator(name: "BUMP_SIZE_TOKEN", value: 116, isUnsigned: true)
!613 = !DIEnumerator(name: "CAMERA_ID_TOKEN", value: 117, isUnsigned: true)
!614 = !DIEnumerator(name: "CAMERA_TOKEN", value: 118, isUnsigned: true)
!615 = !DIEnumerator(name: "CELLS_TOKEN", value: 119, isUnsigned: true)
!616 = !DIEnumerator(name: "CHECKER_TOKEN", value: 120, isUnsigned: true)
!617 = !DIEnumerator(name: "CLIPPED_BY_TOKEN", value: 121, isUnsigned: true)
!618 = !DIEnumerator(name: "COLON_TOKEN", value: 122, isUnsigned: true)
!619 = !DIEnumerator(name: "COLOR_MAP_TOKEN", value: 123, isUnsigned: true)
!620 = !DIEnumerator(name: "COLOUR_MAP_ID_TOKEN", value: 124, isUnsigned: true)
!621 = !DIEnumerator(name: "COLOUR_MAP_TOKEN", value: 125, isUnsigned: true)
!622 = !DIEnumerator(name: "COMMA_TOKEN", value: 126, isUnsigned: true)
!623 = !DIEnumerator(name: "COMPONENT_TOKEN", value: 127, isUnsigned: true)
!624 = !DIEnumerator(name: "COMPOSITE_TOKEN", value: 128, isUnsigned: true)
!625 = !DIEnumerator(name: "CONE_TOKEN", value: 129, isUnsigned: true)
!626 = !DIEnumerator(name: "CRAND_TOKEN", value: 130, isUnsigned: true)
!627 = !DIEnumerator(name: "CUBIC_TOKEN", value: 131, isUnsigned: true)
!628 = !DIEnumerator(name: "CYLINDER_TOKEN", value: 132, isUnsigned: true)
!629 = !DIEnumerator(name: "DASH_TOKEN", value: 133, isUnsigned: true)
!630 = !DIEnumerator(name: "DECLARE_TOKEN", value: 134, isUnsigned: true)
!631 = !DIEnumerator(name: "DEFAULT_TOKEN", value: 135, isUnsigned: true)
!632 = !DIEnumerator(name: "DENTS_TOKEN", value: 136, isUnsigned: true)
!633 = !DIEnumerator(name: "DIFFERENCE_TOKEN", value: 137, isUnsigned: true)
!634 = !DIEnumerator(name: "DIFFUSE_TOKEN", value: 138, isUnsigned: true)
!635 = !DIEnumerator(name: "DIRECTION_TOKEN", value: 139, isUnsigned: true)
!636 = !DIEnumerator(name: "DISC_TOKEN", value: 140, isUnsigned: true)
!637 = !DIEnumerator(name: "DISTANCE_TOKEN", value: 141, isUnsigned: true)
!638 = !DIEnumerator(name: "DOLLAR_TOKEN", value: 142, isUnsigned: true)
!639 = !DIEnumerator(name: "END_OF_FILE_TOKEN", value: 143, isUnsigned: true)
!640 = !DIEnumerator(name: "EQUALS_TOKEN", value: 144, isUnsigned: true)
!641 = !DIEnumerator(name: "EXCLAMATION_TOKEN", value: 145, isUnsigned: true)
!642 = !DIEnumerator(name: "EXPONENT_TOKEN", value: 146, isUnsigned: true)
!643 = !DIEnumerator(name: "FALLOFF_TOKEN", value: 147, isUnsigned: true)
!644 = !DIEnumerator(name: "FINISH_ID_TOKEN", value: 148, isUnsigned: true)
!645 = !DIEnumerator(name: "FINISH_TOKEN", value: 149, isUnsigned: true)
!646 = !DIEnumerator(name: "FLATNESS_TOKEN", value: 150, isUnsigned: true)
!647 = !DIEnumerator(name: "FOG_TOKEN", value: 151, isUnsigned: true)
!648 = !DIEnumerator(name: "FREQUENCY_TOKEN", value: 152, isUnsigned: true)
!649 = !DIEnumerator(name: "FRESNEL_TOKEN", value: 153, isUnsigned: true)
!650 = !DIEnumerator(name: "GIF_TOKEN", value: 154, isUnsigned: true)
!651 = !DIEnumerator(name: "GRADIENT_TOKEN", value: 155, isUnsigned: true)
!652 = !DIEnumerator(name: "GRANITE_TOKEN", value: 156, isUnsigned: true)
!653 = !DIEnumerator(name: "HASH_TOKEN", value: 157, isUnsigned: true)
!654 = !DIEnumerator(name: "HAT_TOKEN", value: 158, isUnsigned: true)
!655 = !DIEnumerator(name: "HEIGHT_FIELD_TOKEN", value: 159, isUnsigned: true)
!656 = !DIEnumerator(name: "HEXAGON_TOKEN", value: 160, isUnsigned: true)
!657 = !DIEnumerator(name: "IDENTIFIER_TOKEN", value: 161, isUnsigned: true)
!658 = !DIEnumerator(name: "IFF_TOKEN", value: 162, isUnsigned: true)
!659 = !DIEnumerator(name: "IMAGE_MAP_TOKEN", value: 163, isUnsigned: true)
!660 = !DIEnumerator(name: "INCLUDE_TOKEN", value: 164, isUnsigned: true)
!661 = !DIEnumerator(name: "INTERPOLATE_TOKEN", value: 165, isUnsigned: true)
!662 = !DIEnumerator(name: "INTERSECTION_TOKEN", value: 166, isUnsigned: true)
!663 = !DIEnumerator(name: "INVERSE_TOKEN", value: 167, isUnsigned: true)
!664 = !DIEnumerator(name: "IOR_TOKEN", value: 168, isUnsigned: true)
!665 = !DIEnumerator(name: "JITTER_TOKEN", value: 169, isUnsigned: true)
!666 = !DIEnumerator(name: "LAMBDA_TOKEN", value: 170, isUnsigned: true)
!667 = !DIEnumerator(name: "LEFT_ANGLE_TOKEN", value: 171, isUnsigned: true)
!668 = !DIEnumerator(name: "LEFT_CURLY_TOKEN", value: 172, isUnsigned: true)
!669 = !DIEnumerator(name: "LEFT_PAREN_TOKEN", value: 173, isUnsigned: true)
!670 = !DIEnumerator(name: "LEFT_SQUARE_TOKEN", value: 174, isUnsigned: true)
!671 = !DIEnumerator(name: "LEOPARD_TOKEN", value: 175, isUnsigned: true)
!672 = !DIEnumerator(name: "LIGHT_SOURCE_TOKEN", value: 176, isUnsigned: true)
!673 = !DIEnumerator(name: "LOCATION_TOKEN", value: 177, isUnsigned: true)
!674 = !DIEnumerator(name: "LOOKS_LIKE_TOKEN", value: 178, isUnsigned: true)
!675 = !DIEnumerator(name: "LOOK_AT_TOKEN", value: 179, isUnsigned: true)
!676 = !DIEnumerator(name: "MANDEL_TOKEN", value: 180, isUnsigned: true)
!677 = !DIEnumerator(name: "MAP_TYPE_TOKEN", value: 181, isUnsigned: true)
!678 = !DIEnumerator(name: "MARBLE_TOKEN", value: 182, isUnsigned: true)
!679 = !DIEnumerator(name: "MATERIAL_MAP_TOKEN", value: 183, isUnsigned: true)
!680 = !DIEnumerator(name: "MAX_INTERSECTIONS", value: 184, isUnsigned: true)
!681 = !DIEnumerator(name: "MAX_TRACE_LEVEL_TOKEN", value: 185, isUnsigned: true)
!682 = !DIEnumerator(name: "MERGE_TOKEN", value: 186, isUnsigned: true)
!683 = !DIEnumerator(name: "METALLIC_TOKEN", value: 187, isUnsigned: true)
!684 = !DIEnumerator(name: "MORTAR_TOKEN", value: 188, isUnsigned: true)
!685 = !DIEnumerator(name: "NO_SHADOW_TOKEN", value: 189, isUnsigned: true)
!686 = !DIEnumerator(name: "OBJECT_ID_TOKEN", value: 190, isUnsigned: true)
!687 = !DIEnumerator(name: "OBJECT_TOKEN", value: 191, isUnsigned: true)
!688 = !DIEnumerator(name: "OCTAVES_TOKEN", value: 192, isUnsigned: true)
!689 = !DIEnumerator(name: "OMEGA_TOKEN", value: 193, isUnsigned: true)
!690 = !DIEnumerator(name: "ONCE_TOKEN", value: 194, isUnsigned: true)
!691 = !DIEnumerator(name: "ONION_TOKEN", value: 195, isUnsigned: true)
!692 = !DIEnumerator(name: "PERCENT_TOKEN", value: 196, isUnsigned: true)
!693 = !DIEnumerator(name: "PHASE_TOKEN", value: 197, isUnsigned: true)
!694 = !DIEnumerator(name: "PHONG_SIZE_TOKEN", value: 198, isUnsigned: true)
!695 = !DIEnumerator(name: "PHONG_TOKEN", value: 199, isUnsigned: true)
!696 = !DIEnumerator(name: "PIGMENT_ID_TOKEN", value: 200, isUnsigned: true)
!697 = !DIEnumerator(name: "PIGMENT_TOKEN", value: 201, isUnsigned: true)
!698 = !DIEnumerator(name: "PLANE_TOKEN", value: 202, isUnsigned: true)
!699 = !DIEnumerator(name: "PLUS_TOKEN", value: 203, isUnsigned: true)
!700 = !DIEnumerator(name: "POINT_AT_TOKEN", value: 204, isUnsigned: true)
!701 = !DIEnumerator(name: "POLY_TOKEN", value: 205, isUnsigned: true)
!702 = !DIEnumerator(name: "POT_TOKEN", value: 206, isUnsigned: true)
!703 = !DIEnumerator(name: "QUADRIC_TOKEN", value: 207, isUnsigned: true)
!704 = !DIEnumerator(name: "QUARTIC_TOKEN", value: 208, isUnsigned: true)
!705 = !DIEnumerator(name: "QUESTION_TOKEN", value: 209, isUnsigned: true)
!706 = !DIEnumerator(name: "QUICK_COLOR_TOKEN", value: 210, isUnsigned: true)
!707 = !DIEnumerator(name: "QUICK_COLOUR_TOKEN", value: 211, isUnsigned: true)
!708 = !DIEnumerator(name: "RADIAL_TOKEN", value: 212, isUnsigned: true)
!709 = !DIEnumerator(name: "RADIUS_TOKEN", value: 213, isUnsigned: true)
!710 = !DIEnumerator(name: "BRICK_SIZE_TOKEN", value: 214, isUnsigned: true)
!711 = !DIEnumerator(name: "REFLECTION_TOKEN", value: 215, isUnsigned: true)
!712 = !DIEnumerator(name: "REFRACTION_TOKEN", value: 216, isUnsigned: true)
!713 = !DIEnumerator(name: "RIGHT_ANGLE_TOKEN", value: 217, isUnsigned: true)
!714 = !DIEnumerator(name: "RIGHT_CURLY_TOKEN", value: 218, isUnsigned: true)
!715 = !DIEnumerator(name: "RIGHT_PAREN_TOKEN", value: 219, isUnsigned: true)
!716 = !DIEnumerator(name: "RIGHT_SQUARE_TOKEN", value: 220, isUnsigned: true)
!717 = !DIEnumerator(name: "RIGHT_TOKEN", value: 221, isUnsigned: true)
!718 = !DIEnumerator(name: "RIPPLES_TOKEN", value: 222, isUnsigned: true)
!719 = !DIEnumerator(name: "ROTATE_TOKEN", value: 223, isUnsigned: true)
!720 = !DIEnumerator(name: "ROUGHNESS_TOKEN", value: 224, isUnsigned: true)
!721 = !DIEnumerator(name: "SCALE_TOKEN", value: 225, isUnsigned: true)
!722 = !DIEnumerator(name: "SEMI_COLON_TOKEN", value: 226, isUnsigned: true)
!723 = !DIEnumerator(name: "SINGLE_QUOTE_TOKEN", value: 227, isUnsigned: true)
!724 = !DIEnumerator(name: "SKY_TOKEN", value: 228, isUnsigned: true)
!725 = !DIEnumerator(name: "SLASH_TOKEN", value: 229, isUnsigned: true)
!726 = !DIEnumerator(name: "SMOOTH_TOKEN", value: 230, isUnsigned: true)
!727 = !DIEnumerator(name: "SMOOTH_TRIANGLE_TOKEN", value: 231, isUnsigned: true)
!728 = !DIEnumerator(name: "SPECULAR_TOKEN", value: 232, isUnsigned: true)
!729 = !DIEnumerator(name: "SPHERE_TOKEN", value: 233, isUnsigned: true)
!730 = !DIEnumerator(name: "SPOTLIGHT_TOKEN", value: 234, isUnsigned: true)
!731 = !DIEnumerator(name: "SPOTTED_TOKEN", value: 235, isUnsigned: true)
!732 = !DIEnumerator(name: "STAR_TOKEN", value: 236, isUnsigned: true)
!733 = !DIEnumerator(name: "STRING_LITERAL_TOKEN", value: 237, isUnsigned: true)
!734 = !DIEnumerator(name: "STURM_TOKEN", value: 238, isUnsigned: true)
!735 = !DIEnumerator(name: "TEXTURE_ID_TOKEN", value: 239, isUnsigned: true)
!736 = !DIEnumerator(name: "TEXTURE_TOKEN", value: 240, isUnsigned: true)
!737 = !DIEnumerator(name: "INTERIOR_TEXTURE_TOKEN", value: 241, isUnsigned: true)
!738 = !DIEnumerator(name: "TGA_TOKEN", value: 242, isUnsigned: true)
!739 = !DIEnumerator(name: "THRESHOLD_TOKEN", value: 243, isUnsigned: true)
!740 = !DIEnumerator(name: "TIFF_TOKEN", value: 244, isUnsigned: true)
!741 = !DIEnumerator(name: "TIGHTNESS_TOKEN", value: 245, isUnsigned: true)
!742 = !DIEnumerator(name: "TILDE_TOKEN", value: 246, isUnsigned: true)
!743 = !DIEnumerator(name: "TILE2_TOKEN", value: 247, isUnsigned: true)
!744 = !DIEnumerator(name: "TILES_TOKEN", value: 248, isUnsigned: true)
!745 = !DIEnumerator(name: "TNORMAL_ID_TOKEN", value: 249, isUnsigned: true)
!746 = !DIEnumerator(name: "TNORMAL_TOKEN", value: 250, isUnsigned: true)
!747 = !DIEnumerator(name: "TORUS_TOKEN", value: 251, isUnsigned: true)
!748 = !DIEnumerator(name: "TRANSFORM_ID_TOKEN", value: 252, isUnsigned: true)
!749 = !DIEnumerator(name: "TRANSFORM_TOKEN", value: 253, isUnsigned: true)
!750 = !DIEnumerator(name: "TRANSLATE_TOKEN", value: 254, isUnsigned: true)
!751 = !DIEnumerator(name: "TRIANGLE_TOKEN", value: 255, isUnsigned: true)
!752 = !DIEnumerator(name: "TURBULENCE_TOKEN", value: 256, isUnsigned: true)
!753 = !DIEnumerator(name: "TYPE_TOKEN", value: 257, isUnsigned: true)
!754 = !DIEnumerator(name: "UNION_TOKEN", value: 258, isUnsigned: true)
!755 = !DIEnumerator(name: "UP_TOKEN", value: 259, isUnsigned: true)
!756 = !DIEnumerator(name: "USE_COLOR_TOKEN", value: 260, isUnsigned: true)
!757 = !DIEnumerator(name: "USE_COLOUR_TOKEN", value: 261, isUnsigned: true)
!758 = !DIEnumerator(name: "USE_INDEX_TOKEN", value: 262, isUnsigned: true)
!759 = !DIEnumerator(name: "U_STEPS_TOKEN", value: 263, isUnsigned: true)
!760 = !DIEnumerator(name: "V_STEPS_TOKEN", value: 264, isUnsigned: true)
!761 = !DIEnumerator(name: "WATER_LEVEL_TOKEN", value: 265, isUnsigned: true)
!762 = !DIEnumerator(name: "WAVES_TOKEN", value: 266, isUnsigned: true)
!763 = !DIEnumerator(name: "WOOD_TOKEN", value: 267, isUnsigned: true)
!764 = !DIEnumerator(name: "WRINKLES_TOKEN", value: 268, isUnsigned: true)
!765 = !DIEnumerator(name: "BACKGROUND_TOKEN", value: 269, isUnsigned: true)
!766 = !DIEnumerator(name: "OPEN_TOKEN", value: 270, isUnsigned: true)
!767 = !DIEnumerator(name: "AGATE_TURB_TOKEN", value: 271, isUnsigned: true)
!768 = !DIEnumerator(name: "IRID_TOKEN", value: 272, isUnsigned: true)
!769 = !DIEnumerator(name: "THICKNESS_TOKEN", value: 273, isUnsigned: true)
!770 = !DIEnumerator(name: "IRID_WAVELENGTH_TOKEN", value: 274, isUnsigned: true)
!771 = !DIEnumerator(name: "CRACKLE_TOKEN", value: 275, isUnsigned: true)
!772 = !DIEnumerator(name: "ADC_BAILOUT_TOKEN", value: 276, isUnsigned: true)
!773 = !DIEnumerator(name: "FILL_LIGHT_TOKEN", value: 277, isUnsigned: true)
!774 = !DIEnumerator(name: "NUMBER_OF_WAVES_TOKEN", value: 278, isUnsigned: true)
!775 = !DIEnumerator(name: "FOG_TYPE_TOKEN", value: 279, isUnsigned: true)
!776 = !DIEnumerator(name: "FOG_ALT_TOKEN", value: 280, isUnsigned: true)
!777 = !DIEnumerator(name: "FOG_OFFSET_TOKEN", value: 281, isUnsigned: true)
!778 = !DIEnumerator(name: "TEXT_TOKEN", value: 282, isUnsigned: true)
!779 = !DIEnumerator(name: "TTF_TOKEN", value: 283, isUnsigned: true)
!780 = !DIEnumerator(name: "REL_GE_TOKEN", value: 284, isUnsigned: true)
!781 = !DIEnumerator(name: "REL_LE_TOKEN", value: 285, isUnsigned: true)
!782 = !DIEnumerator(name: "REL_NE_TOKEN", value: 286, isUnsigned: true)
!783 = !DIEnumerator(name: "APERTURE_TOKEN", value: 287, isUnsigned: true)
!784 = !DIEnumerator(name: "BLUR_SAMPLES_TOKEN", value: 288, isUnsigned: true)
!785 = !DIEnumerator(name: "FOCAL_POINT_TOKEN", value: 289, isUnsigned: true)
!786 = !DIEnumerator(name: "QUILTED_TOKEN", value: 290, isUnsigned: true)
!787 = !DIEnumerator(name: "CONTROL0_TOKEN", value: 291, isUnsigned: true)
!788 = !DIEnumerator(name: "CONTROL1_TOKEN", value: 292, isUnsigned: true)
!789 = !DIEnumerator(name: "RAINBOW_TOKEN", value: 293, isUnsigned: true)
!790 = !DIEnumerator(name: "SKYSPHERE_TOKEN", value: 294, isUnsigned: true)
!791 = !DIEnumerator(name: "ANGLE_TOKEN", value: 295, isUnsigned: true)
!792 = !DIEnumerator(name: "WIDTH_TOKEN", value: 296, isUnsigned: true)
!793 = !DIEnumerator(name: "ARC_ANGLE_TOKEN", value: 297, isUnsigned: true)
!794 = !DIEnumerator(name: "PERSPECTIVE_TOKEN", value: 298, isUnsigned: true)
!795 = !DIEnumerator(name: "ORTHOGRAPHIC_TOKEN", value: 299, isUnsigned: true)
!796 = !DIEnumerator(name: "FISHEYE_TOKEN", value: 300, isUnsigned: true)
!797 = !DIEnumerator(name: "ULTRA_WIDE_ANGLE_TOKEN", value: 301, isUnsigned: true)
!798 = !DIEnumerator(name: "OMNIMAX_TOKEN", value: 302, isUnsigned: true)
!799 = !DIEnumerator(name: "PANORAMIC_TOKEN", value: 303, isUnsigned: true)
!800 = !DIEnumerator(name: "LATHE_TOKEN", value: 304, isUnsigned: true)
!801 = !DIEnumerator(name: "LINEAR_SPLINE_TOKEN", value: 305, isUnsigned: true)
!802 = !DIEnumerator(name: "QUADRATIC_SPLINE_TOKEN", value: 306, isUnsigned: true)
!803 = !DIEnumerator(name: "CUBIC_SPLINE_TOKEN", value: 307, isUnsigned: true)
!804 = !DIEnumerator(name: "BEZIER_SPLINE_TOKEN", value: 308, isUnsigned: true)
!805 = !DIEnumerator(name: "POLYGON_TOKEN", value: 309, isUnsigned: true)
!806 = !DIEnumerator(name: "PRISM_TOKEN", value: 310, isUnsigned: true)
!807 = !DIEnumerator(name: "LINEAR_SWEEP_TOKEN", value: 311, isUnsigned: true)
!808 = !DIEnumerator(name: "CONIC_SWEEP_TOKEN", value: 312, isUnsigned: true)
!809 = !DIEnumerator(name: "SOR_TOKEN", value: 313, isUnsigned: true)
!810 = !DIEnumerator(name: "SPIRAL1_TOKEN", value: 314, isUnsigned: true)
!811 = !DIEnumerator(name: "SPIRAL2_TOKEN", value: 315, isUnsigned: true)
!812 = !DIEnumerator(name: "STRENGTH_TOKEN", value: 316, isUnsigned: true)
!813 = !DIEnumerator(name: "HIERARCHY_TOKEN", value: 317, isUnsigned: true)
!814 = !DIEnumerator(name: "RAMP_WAVE_TOKEN", value: 318, isUnsigned: true)
!815 = !DIEnumerator(name: "TRIANGLE_WAVE_TOKEN", value: 319, isUnsigned: true)
!816 = !DIEnumerator(name: "SINE_WAVE_TOKEN", value: 320, isUnsigned: true)
!817 = !DIEnumerator(name: "SCALLOP_WAVE_TOKEN", value: 321, isUnsigned: true)
!818 = !DIEnumerator(name: "PIGMENT_MAP_TOKEN", value: 322, isUnsigned: true)
!819 = !DIEnumerator(name: "NORMAL_MAP_TOKEN", value: 323, isUnsigned: true)
!820 = !DIEnumerator(name: "SLOPE_MAP_TOKEN", value: 324, isUnsigned: true)
!821 = !DIEnumerator(name: "TEXTURE_MAP_TOKEN", value: 325, isUnsigned: true)
!822 = !DIEnumerator(name: "PIGMENT_MAP_ID_TOKEN", value: 326, isUnsigned: true)
!823 = !DIEnumerator(name: "NORMAL_MAP_ID_TOKEN", value: 327, isUnsigned: true)
!824 = !DIEnumerator(name: "SLOPE_MAP_ID_TOKEN", value: 328, isUnsigned: true)
!825 = !DIEnumerator(name: "TEXTURE_MAP_ID_TOKEN", value: 329, isUnsigned: true)
!826 = !DIEnumerator(name: "SUPERELLIPSOID_TOKEN", value: 330, isUnsigned: true)
!827 = !DIEnumerator(name: "QUATERNION_TOKEN", value: 331, isUnsigned: true)
!828 = !DIEnumerator(name: "CUBE_TOKEN", value: 332, isUnsigned: true)
!829 = !DIEnumerator(name: "MAX_ITERATION_TOKEN", value: 333, isUnsigned: true)
!830 = !DIEnumerator(name: "HYPERCOMPLEX_TOKEN", value: 334, isUnsigned: true)
!831 = !DIEnumerator(name: "RAINBOW_ID_TOKEN", value: 335, isUnsigned: true)
!832 = !DIEnumerator(name: "FOG_ID_TOKEN", value: 336, isUnsigned: true)
!833 = !DIEnumerator(name: "SKYSPHERE_ID_TOKEN", value: 337, isUnsigned: true)
!834 = !DIEnumerator(name: "FADE_POWER_TOKEN", value: 338, isUnsigned: true)
!835 = !DIEnumerator(name: "FADE_COLOUR_TOKEN", value: 339, isUnsigned: true)
!836 = !DIEnumerator(name: "FADE_COLOR_TOKEN", value: 340, isUnsigned: true)
!837 = !DIEnumerator(name: "FADE_DISTANCE_TOKEN", value: 341, isUnsigned: true)
!838 = !DIEnumerator(name: "TURB_DEPTH_TOKEN", value: 342, isUnsigned: true)
!839 = !DIEnumerator(name: "PPM_TOKEN", value: 343, isUnsigned: true)
!840 = !DIEnumerator(name: "PGM_TOKEN", value: 344, isUnsigned: true)
!841 = !DIEnumerator(name: "AVERAGE_TOKEN", value: 345, isUnsigned: true)
!842 = !DIEnumerator(name: "MESH_TOKEN", value: 346, isUnsigned: true)
!843 = !DIEnumerator(name: "WARP_TOKEN", value: 347, isUnsigned: true)
!844 = !DIEnumerator(name: "OFFSET_TOKEN", value: 348, isUnsigned: true)
!845 = !DIEnumerator(name: "REPEAT_TOKEN", value: 349, isUnsigned: true)
!846 = !DIEnumerator(name: "BLACK_HOLE_TOKEN", value: 350, isUnsigned: true)
!847 = !DIEnumerator(name: "FLIP_TOKEN", value: 351, isUnsigned: true)
!848 = !DIEnumerator(name: "AMBIENT_LIGHT_TOKEN", value: 352, isUnsigned: true)
!849 = !DIEnumerator(name: "IF_TOKEN", value: 353, isUnsigned: true)
!850 = !DIEnumerator(name: "ELSE_TOKEN", value: 354, isUnsigned: true)
!851 = !DIEnumerator(name: "END_TOKEN", value: 355, isUnsigned: true)
!852 = !DIEnumerator(name: "SWITCH_TOKEN", value: 356, isUnsigned: true)
!853 = !DIEnumerator(name: "CASE_TOKEN", value: 357, isUnsigned: true)
!854 = !DIEnumerator(name: "RANGE_TOKEN", value: 358, isUnsigned: true)
!855 = !DIEnumerator(name: "WHILE_TOKEN", value: 359, isUnsigned: true)
!856 = !DIEnumerator(name: "BREAK_TOKEN", value: 360, isUnsigned: true)
!857 = !DIEnumerator(name: "FALLOFF_ANGLE_TOKEN", value: 361, isUnsigned: true)
!858 = !DIEnumerator(name: "CAUSTICS_TOKEN", value: 362, isUnsigned: true)
!859 = !DIEnumerator(name: "JULIA_FRACTAL_TOKEN", value: 363, isUnsigned: true)
!860 = !DIEnumerator(name: "SQR_TOKEN", value: 364, isUnsigned: true)
!861 = !DIEnumerator(name: "RECIPROCAL_TOKEN", value: 365, isUnsigned: true)
!862 = !DIEnumerator(name: "STR_TOKEN", value: 366, isUnsigned: true)
!863 = !DIEnumerator(name: "VSTR_TOKEN", value: 367, isUnsigned: true)
!864 = !DIEnumerator(name: "CONCAT_TOKEN", value: 368, isUnsigned: true)
!865 = !DIEnumerator(name: "CHR_TOKEN", value: 369, isUnsigned: true)
!866 = !DIEnumerator(name: "SUBSTR_TOKEN", value: 370, isUnsigned: true)
!867 = !DIEnumerator(name: "STRING_ID_TOKEN", value: 371, isUnsigned: true)
!868 = !DIEnumerator(name: "WARNING_TOKEN", value: 372, isUnsigned: true)
!869 = !DIEnumerator(name: "ERROR_TOKEN", value: 373, isUnsigned: true)
!870 = !DIEnumerator(name: "RENDER_TOKEN", value: 374, isUnsigned: true)
!871 = !DIEnumerator(name: "STATISTICS_TOKEN", value: 375, isUnsigned: true)
!872 = !DIEnumerator(name: "DEBUG_TOKEN", value: 376, isUnsigned: true)
!873 = !DIEnumerator(name: "VARIANCE_TOKEN", value: 377, isUnsigned: true)
!874 = !DIEnumerator(name: "CONFIDENCE_TOKEN", value: 378, isUnsigned: true)
!875 = !DIEnumerator(name: "RADIOSITY_TOKEN", value: 379, isUnsigned: true)
!876 = !DIEnumerator(name: "BRIGHTNESS_TOKEN", value: 380, isUnsigned: true)
!877 = !DIEnumerator(name: "COUNT_TOKEN", value: 381, isUnsigned: true)
!878 = !DIEnumerator(name: "DISTANCE_MAXIMUM_TOKEN", value: 382, isUnsigned: true)
!879 = !DIEnumerator(name: "ERROR_BOUND_TOKEN", value: 383, isUnsigned: true)
!880 = !DIEnumerator(name: "GRAY_THRESHOLD_TOKEN", value: 384, isUnsigned: true)
!881 = !DIEnumerator(name: "LOW_ERROR_FACTOR_TOKEN", value: 385, isUnsigned: true)
!882 = !DIEnumerator(name: "MINIMUM_REUSE_TOKEN", value: 386, isUnsigned: true)
!883 = !DIEnumerator(name: "NEAREST_COUNT_TOKEN", value: 387, isUnsigned: true)
!884 = !DIEnumerator(name: "RECURSION_LIMIT_TOKEN", value: 388, isUnsigned: true)
!885 = !DIEnumerator(name: "HF_GRAY_16_TOKEN", value: 389, isUnsigned: true)
!886 = !DIEnumerator(name: "GLOBAL_SETTINGS_TOKEN", value: 390, isUnsigned: true)
!887 = !DIEnumerator(name: "ECCENTRICITY_TOKEN", value: 391, isUnsigned: true)
!888 = !DIEnumerator(name: "HOLLOW_TOKEN", value: 392, isUnsigned: true)
!889 = !DIEnumerator(name: "MEDIA_ATTENUATION_TOKEN", value: 393, isUnsigned: true)
!890 = !DIEnumerator(name: "MEDIA_INTERACTION_TOKEN", value: 394, isUnsigned: true)
!891 = !DIEnumerator(name: "MATRIX_TOKEN", value: 395, isUnsigned: true)
!892 = !DIEnumerator(name: "PERIOD_TOKEN", value: 396, isUnsigned: true)
!893 = !DIEnumerator(name: "SYS_TOKEN", value: 397, isUnsigned: true)
!894 = !DIEnumerator(name: "STRUPR_TOKEN", value: 398, isUnsigned: true)
!895 = !DIEnumerator(name: "STRLWR_TOKEN", value: 399, isUnsigned: true)
!896 = !DIEnumerator(name: "U_TOKEN", value: 400, isUnsigned: true)
!897 = !DIEnumerator(name: "V_TOKEN", value: 401, isUnsigned: true)
!898 = !DIEnumerator(name: "IFDEF_TOKEN", value: 402, isUnsigned: true)
!899 = !DIEnumerator(name: "PNG_TOKEN", value: 403, isUnsigned: true)
!900 = !DIEnumerator(name: "PRECISION_TOKEN", value: 404, isUnsigned: true)
!901 = !DIEnumerator(name: "SLICE_TOKEN", value: 405, isUnsigned: true)
!902 = !DIEnumerator(name: "ASSUMED_GAMMA_TOKEN", value: 406, isUnsigned: true)
!903 = !DIEnumerator(name: "PWR_TOKEN", value: 407, isUnsigned: true)
!904 = !DIEnumerator(name: "T_TOKEN", value: 408, isUnsigned: true)
!905 = !DIEnumerator(name: "IFNDEF_TOKEN", value: 409, isUnsigned: true)
!906 = !DIEnumerator(name: "MEDIA_TOKEN", value: 410, isUnsigned: true)
!907 = !DIEnumerator(name: "MEDIA_ID_TOKEN", value: 411, isUnsigned: true)
!908 = !DIEnumerator(name: "DENSITY_ID_TOKEN", value: 412, isUnsigned: true)
!909 = !DIEnumerator(name: "DENSITY_TOKEN", value: 413, isUnsigned: true)
!910 = !DIEnumerator(name: "DENSITY_FILE_TOKEN", value: 414, isUnsigned: true)
!911 = !DIEnumerator(name: "RATIO_TOKEN", value: 415, isUnsigned: true)
!912 = !DIEnumerator(name: "SCATTERING_TOKEN", value: 416, isUnsigned: true)
!913 = !DIEnumerator(name: "EMISSION_TOKEN", value: 417, isUnsigned: true)
!914 = !DIEnumerator(name: "ABSORPTION_TOKEN", value: 418, isUnsigned: true)
!915 = !DIEnumerator(name: "SAMPLES_TOKEN", value: 419, isUnsigned: true)
!916 = !DIEnumerator(name: "INTERVALS_TOKEN", value: 420, isUnsigned: true)
!917 = !DIEnumerator(name: "INTERIOR_TOKEN", value: 421, isUnsigned: true)
!918 = !DIEnumerator(name: "INTERIOR_ID_TOKEN", value: 422, isUnsigned: true)
!919 = !DIEnumerator(name: "EXTERIOR_TOKEN", value: 423, isUnsigned: true)
!920 = !DIEnumerator(name: "LOCAL_TOKEN", value: 424, isUnsigned: true)
!921 = !DIEnumerator(name: "UNDEF_TOKEN", value: 425, isUnsigned: true)
!922 = !DIEnumerator(name: "MACRO_TOKEN", value: 426, isUnsigned: true)
!923 = !DIEnumerator(name: "MACRO_ID_TOKEN", value: 427, isUnsigned: true)
!924 = !DIEnumerator(name: "TEMPORARY_MACRO_ID_TOKEN", value: 428, isUnsigned: true)
!925 = !DIEnumerator(name: "PARAMETER_ID_TOKEN", value: 429, isUnsigned: true)
!926 = !DIEnumerator(name: "ARRAY_TOKEN", value: 430, isUnsigned: true)
!927 = !DIEnumerator(name: "ARRAY_ID_TOKEN", value: 431, isUnsigned: true)
!928 = !DIEnumerator(name: "EMPTY_ARRAY_TOKEN", value: 432, isUnsigned: true)
!929 = !DIEnumerator(name: "FILE_ID_TOKEN", value: 433, isUnsigned: true)
!930 = !DIEnumerator(name: "FOPEN_TOKEN", value: 434, isUnsigned: true)
!931 = !DIEnumerator(name: "FCLOSE_TOKEN", value: 435, isUnsigned: true)
!932 = !DIEnumerator(name: "WRITE_TOKEN", value: 436, isUnsigned: true)
!933 = !DIEnumerator(name: "READ_TOKEN", value: 437, isUnsigned: true)
!934 = !DIEnumerator(name: "APPEND_TOKEN", value: 438, isUnsigned: true)
!935 = !DIEnumerator(name: "PLANAR_TOKEN", value: 439, isUnsigned: true)
!936 = !DIEnumerator(name: "SPHERICAL_TOKEN", value: 440, isUnsigned: true)
!937 = !DIEnumerator(name: "BOXED_TOKEN", value: 441, isUnsigned: true)
!938 = !DIEnumerator(name: "CYLINDRICAL_TOKEN", value: 442, isUnsigned: true)
!939 = !DIEnumerator(name: "CUBIC_WAVE_TOKEN", value: 443, isUnsigned: true)
!940 = !DIEnumerator(name: "POLY_WAVE_TOKEN", value: 444, isUnsigned: true)
!941 = !DIEnumerator(name: "DENSITY_MAP_TOKEN", value: 445, isUnsigned: true)
!942 = !DIEnumerator(name: "DENSITY_MAP_ID_TOKEN", value: 446, isUnsigned: true)
!943 = !DIEnumerator(name: "REFLECTION_EXPONENT_TOKEN", value: 447, isUnsigned: true)
!944 = !DIEnumerator(name: "DF3_TOKEN", value: 448, isUnsigned: true)
!945 = !DIEnumerator(name: "EXTINCTION_TOKEN", value: 449, isUnsigned: true)
!946 = !DIEnumerator(name: "MATERIAL_TOKEN", value: 450, isUnsigned: true)
!947 = !DIEnumerator(name: "MATERIAL_ID_TOKEN", value: 451, isUnsigned: true)
!948 = !DIEnumerator(name: "UV_ID_TOKEN", value: 452, isUnsigned: true)
!949 = !DIEnumerator(name: "VECTOR_4D_ID_TOKEN", value: 453, isUnsigned: true)
!950 = !DIEnumerator(name: "UV_MAPPING_TOKEN", value: 454, isUnsigned: true)
!951 = !DIEnumerator(name: "UV_VECTORS_TOKEN", value: 455, isUnsigned: true)
!952 = !DIEnumerator(name: "MESH2_TOKEN", value: 456, isUnsigned: true)
!953 = !DIEnumerator(name: "VERTEX_VECTORS_TOKEN", value: 457, isUnsigned: true)
!954 = !DIEnumerator(name: "NORMAL_VECTORS_TOKEN", value: 458, isUnsigned: true)
!955 = !DIEnumerator(name: "FACE_INDICES_TOKEN", value: 459, isUnsigned: true)
!956 = !DIEnumerator(name: "NORMAL_INDICES_TOKEN", value: 460, isUnsigned: true)
!957 = !DIEnumerator(name: "UV_INDICES_TOKEN", value: 461, isUnsigned: true)
!958 = !DIEnumerator(name: "TEXTURE_LIST_TOKEN", value: 462, isUnsigned: true)
!959 = !DIEnumerator(name: "IMAGE_PATTERN_TOKEN", value: 463, isUnsigned: true)
