; ModuleID = 'csg.cpp'
source_filename = "csg.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CSG_Union_Methods", linkageName: "_ZN3pov17CSG_Union_MethodsE", scope: !2, file: !3, line: 81, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "csg.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !171, !177, !184, !186, !191, !196, !198, !200, !205, !210}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !123, !135}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !118, !119, !120, !121, !122}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, size: 3456, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !59, !63, !64, !65, !67, !68, !73, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !89, !90, !91, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !106, !107, !111}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !36, file: !5, line: 1582, baseType: !19, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !36, file: !5, line: 1582, baseType: !13, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !36, file: !5, line: 1582, baseType: !23, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !36, file: !5, line: 1582, baseType: !23, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !36, file: !5, line: 1582, baseType: !28, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !36, file: !5, line: 1582, baseType: !34, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !36, file: !5, line: 1582, baseType: !48, size: 192, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !50, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !49, file: !5, line: 892, baseType: !52, size: 96)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 96, elements: !56)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !55)
!55 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!56 = !{!57}
!57 = !DISubrange(count: 3)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !49, file: !5, line: 892, baseType: !52, size: 96, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !36, file: !5, line: 1582, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !36, file: !5, line: 1582, baseType: !60, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !36, file: !5, line: 1582, baseType: !55, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !36, file: !5, line: 1582, baseType: !66, size: 32, offset: 928)
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !36, file: !5, line: 1582, baseType: !14, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !36, file: !5, line: 1583, baseType: !69, size: 160, offset: 1024)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !5, line: 695, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 5)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1216)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !56)
!76 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1600)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1792)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !36, file: !5, line: 1584, baseType: !74, size: 192, offset: 1984)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2176)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2240)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !36, file: !5, line: 1585, baseType: !76, size: 64, offset: 2304)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !36, file: !5, line: 1586, baseType: !76, size: 64, offset: 2368)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !36, file: !5, line: 1586, baseType: !76, size: 64, offset: 2432)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !36, file: !5, line: 1587, baseType: !34, size: 64, offset: 2496)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2560)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2568)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !36, file: !5, line: 1588, baseType: !88, size: 8, offset: 2576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !36, file: !5, line: 1589, baseType: !92, size: 8, offset: 2584)
!92 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !36, file: !5, line: 1590, baseType: !92, size: 8, offset: 2592)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !36, file: !5, line: 1591, baseType: !88, size: 8, offset: 2600)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !36, file: !5, line: 1591, baseType: !88, size: 8, offset: 2608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !36, file: !5, line: 1592, baseType: !88, size: 8, offset: 2616)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !36, file: !5, line: 1593, baseType: !13, size: 32, offset: 2624)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !36, file: !5, line: 1593, baseType: !13, size: 32, offset: 2656)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !36, file: !5, line: 1594, baseType: !13, size: 32, offset: 2688)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !36, file: !5, line: 1595, baseType: !13, size: 32, offset: 2720)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !36, file: !5, line: 1596, baseType: !13, size: 32, offset: 2752)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !36, file: !5, line: 1597, baseType: !103, size: 64, offset: 2816)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !36, file: !5, line: 1598, baseType: !14, size: 64, offset: 2880)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !36, file: !5, line: 1598, baseType: !14, size: 64, offset: 2944)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !36, file: !5, line: 1599, baseType: !108, size: 64, offset: 3008)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !5, line: 1033, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !5, line: 1059, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Blend_Map_StructE")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !36, file: !5, line: 1600, baseType: !112, size: 384, offset: 3072)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 384, elements: !116)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !2, file: !5, line: 1557, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !2, file: !5, line: 1571, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!116 = !{!117}
!117 = !DISubrange(count: 6)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !48, size: 192, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !60, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !60, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !55, size: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !66, size: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !126, identifier: "_ZTSN3pov10Ray_StructE")
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !125, file: !5, line: 1799, baseType: !74, size: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !125, file: !5, line: 1800, baseType: !74, size: 192, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !125, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !125, file: !5, line: 1802, baseType: !66, size: 32, offset: 416)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !125, file: !5, line: 1803, baseType: !132, size: 6400, offset: 448)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 100)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !138, identifier: "_ZTSN3pov13istack_structE")
!138 = !{!139, !141, !169, !170}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !5, line: 1637, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !137, file: !5, line: 1638, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !144, identifier: "_ZTSN3pov10istk_entryE")
!144 = !{!145, !146, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !143, file: !5, line: 1612, baseType: !76, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !143, file: !5, line: 1613, baseType: !74, size: 192, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !143, file: !5, line: 1614, baseType: !74, size: 192, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !143, file: !5, line: 1615, baseType: !74, size: 192, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !143, file: !5, line: 1616, baseType: !150, size: 128, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !143, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !143, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !143, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !143, file: !5, line: 1625, baseType: !76, size: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !143, file: !5, line: 1625, baseType: !76, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !143, file: !5, line: 1626, baseType: !76, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !143, file: !5, line: 1626, baseType: !76, size: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !143, file: !5, line: 1627, baseType: !76, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !143, file: !5, line: 1627, baseType: !76, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !143, file: !5, line: 1628, baseType: !76, size: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !143, file: !5, line: 1630, baseType: !167, size: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !143, file: !5, line: 1632, baseType: !167, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !137, file: !5, line: 1639, baseType: !66, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !137, file: !5, line: 1640, baseType: !66, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!13, !176, !14}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !176, !14, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !143)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !179)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!167, !14}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !14, !176, !60}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !193)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !199, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !193)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !201, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !14, !60}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !206, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !14}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !211, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !207)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "CSG_Merge_Methods", linkageName: "_ZN3pov17CSG_Merge_MethodsE", scope: !2, file: !3, line: 90, type: !4, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "CSG_Intersection_Methods", linkageName: "_ZN3pov24CSG_Intersection_MethodsE", scope: !2, file: !3, line: 99, type: !4, isLocal: false, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !217, retainedTypes: !351, globals: !402, imports: !403, splitDebugInlining: false, nameTableKind: None)
!217 = !{!218, !224}
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !66, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!221 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!222 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!223 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !225, line: 149, baseType: !66, size: 32, elements: !226, identifier: "_ZTSN3pov5STATSE")
!225 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!227 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!231 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!232 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!233 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!234 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!241 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!242 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!243 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!244 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!255 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!262 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!263 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!264 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!265 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!266 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!267 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!268 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!269 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!270 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!271 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!272 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!273 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!274 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!275 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!276 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!277 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!278 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!279 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!280 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!281 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!282 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!283 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!284 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!285 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!286 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!287 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!288 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!289 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!290 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!291 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!292 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!293 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!294 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!295 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!296 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!297 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!298 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!299 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!300 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!301 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!302 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!303 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!304 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!305 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!306 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!307 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!308 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!309 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!310 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!311 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!312 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!313 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!314 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!315 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!316 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!317 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!318 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!319 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!320 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!321 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!322 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!323 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!324 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!325 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!326 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!327 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!328 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!329 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!330 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!331 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!332 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!333 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!334 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!335 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!336 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!337 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!338 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!339 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!340 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!341 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!342 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!343 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!344 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!345 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!346 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!347 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!348 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!349 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!350 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!351 = !{!352, !373, !374, !398, !167, !34, !54}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSG", scope: !2, file: !354, line: 60, baseType: !355)
!354 = !DIFile(filename: "./csg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CSG_Struct", scope: !2, file: !354, line: 62, size: 1088, flags: DIFlagTypePassByValue, elements: !356, identifier: "_ZTSN3pov10CSG_StructE")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !355, file: !354, line: 64, baseType: !19, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !355, file: !354, line: 64, baseType: !13, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !355, file: !354, line: 64, baseType: !14, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !355, file: !354, line: 64, baseType: !23, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !355, file: !354, line: 64, baseType: !23, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !355, file: !354, line: 64, baseType: !28, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !355, file: !354, line: 64, baseType: !14, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !355, file: !354, line: 64, baseType: !14, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !355, file: !354, line: 64, baseType: !34, size: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !355, file: !354, line: 64, baseType: !48, size: 192, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !355, file: !354, line: 64, baseType: !60, size: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !355, file: !354, line: 64, baseType: !60, size: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !355, file: !354, line: 64, baseType: !55, size: 32, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !355, file: !354, line: 64, baseType: !66, size: 32, offset: 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !355, file: !354, line: 64, baseType: !14, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "do_split", scope: !355, file: !354, line: 65, baseType: !13, size: 32, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUADRIC", scope: !2, file: !376, line: 52, baseType: !377)
!376 = !DIFile(filename: "./quadrics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Quadric_Struct", scope: !2, file: !376, line: 54, size: 1664, flags: DIFlagTypePassByValue, elements: !378, identifier: "_ZTSN3pov14Quadric_StructE")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !377, file: !376, line: 56, baseType: !19, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !377, file: !376, line: 56, baseType: !13, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !377, file: !376, line: 56, baseType: !14, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !377, file: !376, line: 56, baseType: !23, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !377, file: !376, line: 56, baseType: !23, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !377, file: !376, line: 56, baseType: !28, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !377, file: !376, line: 56, baseType: !14, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !377, file: !376, line: 56, baseType: !14, size: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !377, file: !376, line: 56, baseType: !34, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !377, file: !376, line: 56, baseType: !48, size: 192, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !377, file: !376, line: 56, baseType: !60, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !377, file: !376, line: 56, baseType: !60, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !377, file: !376, line: 56, baseType: !55, size: 32, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !377, file: !376, line: 56, baseType: !66, size: 32, offset: 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Square_Terms", scope: !377, file: !376, line: 57, baseType: !74, size: 192, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Mixed_Terms", scope: !377, file: !376, line: 58, baseType: !74, size: 192, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", scope: !377, file: !376, line: 59, baseType: !74, size: 192, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Constant", scope: !377, file: !376, line: 60, baseType: !76, size: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Automatic_Bounds", scope: !377, file: !376, line: 61, baseType: !92, size: 8, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLANE", scope: !2, file: !400, line: 50, baseType: !401)
!400 = !DIFile(filename: "./planes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Plane_Struct", scope: !2, file: !400, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Plane_StructE")
!402 = !{!0, !212, !214}
!403 = !{!404, !411, !417, !419, !421, !425, !427, !429, !431, !433, !435, !437, !439, !444, !448, !450, !452, !456, !458, !460, !462, !464, !466, !468, !471, !473, !475, !479, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !508, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !546, !550, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !576, !580, !584, !586, !588, !590, !595, !599, !603, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !632, !636, !640, !642, !644, !646, !653, !657, !661, !663, !665, !667, !669, !671, !673, !677, !681, !683, !685, !687, !689, !693, !697, !701, !703, !705, !707, !709, !711, !713, !717, !721, !725, !727, !731, !735, !737, !739, !741, !743, !745, !747, !753, !758, !762, !768, !772, !777, !779, !781, !785, !789, !802, !806, !810, !814, !818, !823, !827, !831, !835, !839, !847, !851, !855, !857, !861, !865, !869, !875, !879, !883, !885, !893, !897, !904, !906, !910, !914, !918, !922, !927, !931, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !946, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !983, !985, !987, !989, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1015, !1019, !1025, !1029, !1033, !1037, !1041, !1043, !1045, !1049, !1053, !1057, !1061, !1065, !1067, !1069, !1071, !1075, !1079, !1083, !1085, !1087, !1090, !1092, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1110, !1112, !1113, !1114, !1115, !1117, !1119, !1121, !1123, !1125, !1126, !1127, !1129, !1131, !1133, !1137, !1192, !1196}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !406, file: !410, line: 52)
!405 = !DINamespace(name: "std", scope: null)
!406 = !DISubprogram(name: "abs", scope: !407, file: !407, line: 840, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!408 = !DISubroutineType(types: !409)
!409 = !{!13, !13}
!410 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !412, file: !416, line: 83)
!412 = !DISubprogram(name: "acos", scope: !413, file: !413, line: 53, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!414 = !DISubroutineType(types: !415)
!415 = !{!76, !76}
!416 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !418, file: !416, line: 102)
!418 = !DISubprogram(name: "asin", scope: !413, file: !413, line: 55, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !420, file: !416, line: 121)
!420 = !DISubprogram(name: "atan", scope: !413, file: !413, line: 57, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !422, file: !416, line: 140)
!422 = !DISubprogram(name: "atan2", scope: !413, file: !413, line: 59, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!76, !76, !76}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !426, file: !416, line: 161)
!426 = !DISubprogram(name: "ceil", scope: !413, file: !413, line: 159, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !428, file: !416, line: 180)
!428 = !DISubprogram(name: "cos", scope: !413, file: !413, line: 62, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !430, file: !416, line: 199)
!430 = !DISubprogram(name: "cosh", scope: !413, file: !413, line: 71, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !432, file: !416, line: 218)
!432 = !DISubprogram(name: "exp", scope: !413, file: !413, line: 95, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !434, file: !416, line: 237)
!434 = !DISubprogram(name: "fabs", scope: !413, file: !413, line: 162, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !436, file: !416, line: 256)
!436 = !DISubprogram(name: "floor", scope: !413, file: !413, line: 165, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !438, file: !416, line: 275)
!438 = !DISubprogram(name: "fmod", scope: !413, file: !413, line: 168, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !440, file: !416, line: 296)
!440 = !DISubprogram(name: "frexp", scope: !413, file: !413, line: 98, type: !441, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!76, !76, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !445, file: !416, line: 315)
!445 = !DISubprogram(name: "ldexp", scope: !413, file: !413, line: 101, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!76, !76, !13}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !449, file: !416, line: 334)
!449 = !DISubprogram(name: "log", scope: !413, file: !413, line: 104, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !451, file: !416, line: 353)
!451 = !DISubprogram(name: "log10", scope: !413, file: !413, line: 107, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !453, file: !416, line: 372)
!453 = !DISubprogram(name: "modf", scope: !413, file: !413, line: 110, type: !454, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DISubroutineType(types: !455)
!455 = !{!76, !76, !176}
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !457, file: !416, line: 384)
!457 = !DISubprogram(name: "pow", scope: !413, file: !413, line: 140, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !459, file: !416, line: 421)
!459 = !DISubprogram(name: "sin", scope: !413, file: !413, line: 64, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !461, file: !416, line: 440)
!461 = !DISubprogram(name: "sinh", scope: !413, file: !413, line: 73, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !463, file: !416, line: 459)
!463 = !DISubprogram(name: "sqrt", scope: !413, file: !413, line: 143, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !465, file: !416, line: 478)
!465 = !DISubprogram(name: "tan", scope: !413, file: !413, line: 66, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !467, file: !416, line: 497)
!467 = !DISubprogram(name: "tanh", scope: !413, file: !413, line: 75, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !469, file: !416, line: 1065)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !470, line: 150, baseType: !76)
!470 = !DIFile(filename: "/usr/include/math.h", directory: "")
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !472, file: !416, line: 1066)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !470, line: 149, baseType: !55)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !474, file: !416, line: 1069)
!474 = !DISubprogram(name: "acosh", scope: !413, file: !413, line: 85, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !476, file: !416, line: 1070)
!476 = !DISubprogram(name: "acoshf", scope: !413, file: !413, line: 85, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!55, !55}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !480, file: !416, line: 1071)
!480 = !DISubprogram(name: "acoshl", scope: !413, file: !413, line: 85, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !483}
!483 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !485, file: !416, line: 1073)
!485 = !DISubprogram(name: "asinh", scope: !413, file: !413, line: 87, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !487, file: !416, line: 1074)
!487 = !DISubprogram(name: "asinhf", scope: !413, file: !413, line: 87, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !489, file: !416, line: 1075)
!489 = !DISubprogram(name: "asinhl", scope: !413, file: !413, line: 87, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !491, file: !416, line: 1077)
!491 = !DISubprogram(name: "atanh", scope: !413, file: !413, line: 89, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !493, file: !416, line: 1078)
!493 = !DISubprogram(name: "atanhf", scope: !413, file: !413, line: 89, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !495, file: !416, line: 1079)
!495 = !DISubprogram(name: "atanhl", scope: !413, file: !413, line: 89, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !497, file: !416, line: 1081)
!497 = !DISubprogram(name: "cbrt", scope: !413, file: !413, line: 152, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !499, file: !416, line: 1082)
!499 = !DISubprogram(name: "cbrtf", scope: !413, file: !413, line: 152, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !501, file: !416, line: 1083)
!501 = !DISubprogram(name: "cbrtl", scope: !413, file: !413, line: 152, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !503, file: !416, line: 1085)
!503 = !DISubprogram(name: "copysign", scope: !413, file: !413, line: 196, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !505, file: !416, line: 1086)
!505 = !DISubprogram(name: "copysignf", scope: !413, file: !413, line: 196, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!55, !55, !55}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !509, file: !416, line: 1087)
!509 = !DISubprogram(name: "copysignl", scope: !413, file: !413, line: 196, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!483, !483, !483}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !513, file: !416, line: 1089)
!513 = !DISubprogram(name: "erf", scope: !413, file: !413, line: 228, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !515, file: !416, line: 1090)
!515 = !DISubprogram(name: "erff", scope: !413, file: !413, line: 228, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !517, file: !416, line: 1091)
!517 = !DISubprogram(name: "erfl", scope: !413, file: !413, line: 228, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !519, file: !416, line: 1093)
!519 = !DISubprogram(name: "erfc", scope: !413, file: !413, line: 229, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !521, file: !416, line: 1094)
!521 = !DISubprogram(name: "erfcf", scope: !413, file: !413, line: 229, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !523, file: !416, line: 1095)
!523 = !DISubprogram(name: "erfcl", scope: !413, file: !413, line: 229, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !525, file: !416, line: 1097)
!525 = !DISubprogram(name: "exp2", scope: !413, file: !413, line: 130, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !527, file: !416, line: 1098)
!527 = !DISubprogram(name: "exp2f", scope: !413, file: !413, line: 130, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !529, file: !416, line: 1099)
!529 = !DISubprogram(name: "exp2l", scope: !413, file: !413, line: 130, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !531, file: !416, line: 1101)
!531 = !DISubprogram(name: "expm1", scope: !413, file: !413, line: 119, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !533, file: !416, line: 1102)
!533 = !DISubprogram(name: "expm1f", scope: !413, file: !413, line: 119, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !535, file: !416, line: 1103)
!535 = !DISubprogram(name: "expm1l", scope: !413, file: !413, line: 119, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !537, file: !416, line: 1105)
!537 = !DISubprogram(name: "fdim", scope: !413, file: !413, line: 326, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !539, file: !416, line: 1106)
!539 = !DISubprogram(name: "fdimf", scope: !413, file: !413, line: 326, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !541, file: !416, line: 1107)
!541 = !DISubprogram(name: "fdiml", scope: !413, file: !413, line: 326, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !543, file: !416, line: 1109)
!543 = !DISubprogram(name: "fma", scope: !413, file: !413, line: 335, type: !544, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{!76, !76, !76, !76}
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !547, file: !416, line: 1110)
!547 = !DISubprogram(name: "fmaf", scope: !413, file: !413, line: 335, type: !548, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{!55, !55, !55, !55}
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !551, file: !416, line: 1111)
!551 = !DISubprogram(name: "fmal", scope: !413, file: !413, line: 335, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!483, !483, !483, !483}
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !555, file: !416, line: 1113)
!555 = !DISubprogram(name: "fmax", scope: !413, file: !413, line: 329, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !557, file: !416, line: 1114)
!557 = !DISubprogram(name: "fmaxf", scope: !413, file: !413, line: 329, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !559, file: !416, line: 1115)
!559 = !DISubprogram(name: "fmaxl", scope: !413, file: !413, line: 329, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !561, file: !416, line: 1117)
!561 = !DISubprogram(name: "fmin", scope: !413, file: !413, line: 332, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !563, file: !416, line: 1118)
!563 = !DISubprogram(name: "fminf", scope: !413, file: !413, line: 332, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !565, file: !416, line: 1119)
!565 = !DISubprogram(name: "fminl", scope: !413, file: !413, line: 332, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !567, file: !416, line: 1121)
!567 = !DISubprogram(name: "hypot", scope: !413, file: !413, line: 147, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !569, file: !416, line: 1122)
!569 = !DISubprogram(name: "hypotf", scope: !413, file: !413, line: 147, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !571, file: !416, line: 1123)
!571 = !DISubprogram(name: "hypotl", scope: !413, file: !413, line: 147, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !573, file: !416, line: 1125)
!573 = !DISubprogram(name: "ilogb", scope: !413, file: !413, line: 280, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!13, !76}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !577, file: !416, line: 1126)
!577 = !DISubprogram(name: "ilogbf", scope: !413, file: !413, line: 280, type: !578, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!13, !55}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !581, file: !416, line: 1127)
!581 = !DISubprogram(name: "ilogbl", scope: !413, file: !413, line: 280, type: !582, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DISubroutineType(types: !583)
!583 = !{!13, !483}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !585, file: !416, line: 1129)
!585 = !DISubprogram(name: "lgamma", scope: !413, file: !413, line: 230, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !587, file: !416, line: 1130)
!587 = !DISubprogram(name: "lgammaf", scope: !413, file: !413, line: 230, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !589, file: !416, line: 1131)
!589 = !DISubprogram(name: "lgammal", scope: !413, file: !413, line: 230, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !591, file: !416, line: 1134)
!591 = !DISubprogram(name: "llrint", scope: !413, file: !413, line: 316, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !76}
!594 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !596, file: !416, line: 1135)
!596 = !DISubprogram(name: "llrintf", scope: !413, file: !413, line: 316, type: !597, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DISubroutineType(types: !598)
!598 = !{!594, !55}
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !600, file: !416, line: 1136)
!600 = !DISubprogram(name: "llrintl", scope: !413, file: !413, line: 316, type: !601, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DISubroutineType(types: !602)
!602 = !{!594, !483}
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !604, file: !416, line: 1138)
!604 = !DISubprogram(name: "llround", scope: !413, file: !413, line: 322, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !606, file: !416, line: 1139)
!606 = !DISubprogram(name: "llroundf", scope: !413, file: !413, line: 322, type: !597, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !608, file: !416, line: 1140)
!608 = !DISubprogram(name: "llroundl", scope: !413, file: !413, line: 322, type: !601, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !610, file: !416, line: 1143)
!610 = !DISubprogram(name: "log1p", scope: !413, file: !413, line: 122, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !612, file: !416, line: 1144)
!612 = !DISubprogram(name: "log1pf", scope: !413, file: !413, line: 122, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !614, file: !416, line: 1145)
!614 = !DISubprogram(name: "log1pl", scope: !413, file: !413, line: 122, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !616, file: !416, line: 1147)
!616 = !DISubprogram(name: "log2", scope: !413, file: !413, line: 133, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !618, file: !416, line: 1148)
!618 = !DISubprogram(name: "log2f", scope: !413, file: !413, line: 133, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !620, file: !416, line: 1149)
!620 = !DISubprogram(name: "log2l", scope: !413, file: !413, line: 133, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !622, file: !416, line: 1151)
!622 = !DISubprogram(name: "logb", scope: !413, file: !413, line: 125, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !624, file: !416, line: 1152)
!624 = !DISubprogram(name: "logbf", scope: !413, file: !413, line: 125, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !626, file: !416, line: 1153)
!626 = !DISubprogram(name: "logbl", scope: !413, file: !413, line: 125, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !628, file: !416, line: 1155)
!628 = !DISubprogram(name: "lrint", scope: !413, file: !413, line: 314, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!631, !76}
!631 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !633, file: !416, line: 1156)
!633 = !DISubprogram(name: "lrintf", scope: !413, file: !413, line: 314, type: !634, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{!631, !55}
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !637, file: !416, line: 1157)
!637 = !DISubprogram(name: "lrintl", scope: !413, file: !413, line: 314, type: !638, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{!631, !483}
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !641, file: !416, line: 1159)
!641 = !DISubprogram(name: "lround", scope: !413, file: !413, line: 320, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !643, file: !416, line: 1160)
!643 = !DISubprogram(name: "lroundf", scope: !413, file: !413, line: 320, type: !634, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !645, file: !416, line: 1161)
!645 = !DISubprogram(name: "lroundl", scope: !413, file: !413, line: 320, type: !638, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !647, file: !416, line: 1163)
!647 = !DISubprogram(name: "nan", scope: !413, file: !413, line: 201, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!76, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !654, file: !416, line: 1164)
!654 = !DISubprogram(name: "nanf", scope: !413, file: !413, line: 201, type: !655, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{!55, !650}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !658, file: !416, line: 1165)
!658 = !DISubprogram(name: "nanl", scope: !413, file: !413, line: 201, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!483, !650}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !662, file: !416, line: 1167)
!662 = !DISubprogram(name: "nearbyint", scope: !413, file: !413, line: 294, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !664, file: !416, line: 1168)
!664 = !DISubprogram(name: "nearbyintf", scope: !413, file: !413, line: 294, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !666, file: !416, line: 1169)
!666 = !DISubprogram(name: "nearbyintl", scope: !413, file: !413, line: 294, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !668, file: !416, line: 1171)
!668 = !DISubprogram(name: "nextafter", scope: !413, file: !413, line: 259, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !670, file: !416, line: 1172)
!670 = !DISubprogram(name: "nextafterf", scope: !413, file: !413, line: 259, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !672, file: !416, line: 1173)
!672 = !DISubprogram(name: "nextafterl", scope: !413, file: !413, line: 259, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !674, file: !416, line: 1175)
!674 = !DISubprogram(name: "nexttoward", scope: !413, file: !413, line: 261, type: !675, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{!76, !76, !483}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !678, file: !416, line: 1176)
!678 = !DISubprogram(name: "nexttowardf", scope: !413, file: !413, line: 261, type: !679, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{!55, !55, !483}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !682, file: !416, line: 1177)
!682 = !DISubprogram(name: "nexttowardl", scope: !413, file: !413, line: 261, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !684, file: !416, line: 1179)
!684 = !DISubprogram(name: "remainder", scope: !413, file: !413, line: 272, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !686, file: !416, line: 1180)
!686 = !DISubprogram(name: "remainderf", scope: !413, file: !413, line: 272, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !688, file: !416, line: 1181)
!688 = !DISubprogram(name: "remainderl", scope: !413, file: !413, line: 272, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !690, file: !416, line: 1183)
!690 = !DISubprogram(name: "remquo", scope: !413, file: !413, line: 307, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{!76, !76, !76, !443}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !694, file: !416, line: 1184)
!694 = !DISubprogram(name: "remquof", scope: !413, file: !413, line: 307, type: !695, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!55, !55, !55, !443}
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !698, file: !416, line: 1185)
!698 = !DISubprogram(name: "remquol", scope: !413, file: !413, line: 307, type: !699, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DISubroutineType(types: !700)
!700 = !{!483, !483, !483, !443}
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !702, file: !416, line: 1187)
!702 = !DISubprogram(name: "rint", scope: !413, file: !413, line: 256, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !704, file: !416, line: 1188)
!704 = !DISubprogram(name: "rintf", scope: !413, file: !413, line: 256, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !706, file: !416, line: 1189)
!706 = !DISubprogram(name: "rintl", scope: !413, file: !413, line: 256, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !708, file: !416, line: 1191)
!708 = !DISubprogram(name: "round", scope: !413, file: !413, line: 298, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !710, file: !416, line: 1192)
!710 = !DISubprogram(name: "roundf", scope: !413, file: !413, line: 298, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !712, file: !416, line: 1193)
!712 = !DISubprogram(name: "roundl", scope: !413, file: !413, line: 298, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !714, file: !416, line: 1195)
!714 = !DISubprogram(name: "scalbln", scope: !413, file: !413, line: 290, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!76, !76, !631}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !718, file: !416, line: 1196)
!718 = !DISubprogram(name: "scalblnf", scope: !413, file: !413, line: 290, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!55, !55, !631}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !722, file: !416, line: 1197)
!722 = !DISubprogram(name: "scalblnl", scope: !413, file: !413, line: 290, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!483, !483, !631}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !726, file: !416, line: 1199)
!726 = !DISubprogram(name: "scalbn", scope: !413, file: !413, line: 276, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !728, file: !416, line: 1200)
!728 = !DISubprogram(name: "scalbnf", scope: !413, file: !413, line: 276, type: !729, flags: DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{!55, !55, !13}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !732, file: !416, line: 1201)
!732 = !DISubprogram(name: "scalbnl", scope: !413, file: !413, line: 276, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!483, !483, !13}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !736, file: !416, line: 1203)
!736 = !DISubprogram(name: "tgamma", scope: !413, file: !413, line: 235, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !738, file: !416, line: 1204)
!738 = !DISubprogram(name: "tgammaf", scope: !413, file: !413, line: 235, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !740, file: !416, line: 1205)
!740 = !DISubprogram(name: "tgammal", scope: !413, file: !413, line: 235, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !742, file: !416, line: 1207)
!742 = !DISubprogram(name: "trunc", scope: !413, file: !413, line: 302, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !744, file: !416, line: 1208)
!744 = !DISubprogram(name: "truncf", scope: !413, file: !413, line: 302, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !746, file: !416, line: 1209)
!746 = !DISubprogram(name: "truncl", scope: !413, file: !413, line: 302, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !216, entity: !748, file: !752, line: 38)
!748 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !405, file: !410, line: 103, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !751}
!751 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!752 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !216, entity: !754, file: !752, line: 54)
!754 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !405, file: !416, line: 380, type: !755, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DISubroutineType(types: !756)
!756 = !{!483, !483, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !759, file: !761, line: 127)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !407, line: 62, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!761 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !763, file: !761, line: 128)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !407, line: 70, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !765, identifier: "_ZTS6ldiv_t")
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !764, file: !407, line: 68, baseType: !631, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !764, file: !407, line: 69, baseType: !631, size: 64, offset: 64)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !769, file: !761, line: 130)
!769 = !DISubprogram(name: "abort", scope: !407, file: !407, line: 591, type: !770, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{null}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !773, file: !761, line: 134)
!773 = !DISubprogram(name: "atexit", scope: !407, file: !407, line: 595, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!13, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !778, file: !761, line: 137)
!778 = !DISubprogram(name: "at_quick_exit", scope: !407, file: !407, line: 600, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !780, file: !761, line: 140)
!780 = !DISubprogram(name: "atof", scope: !407, file: !407, line: 101, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !782, file: !761, line: 141)
!782 = !DISubprogram(name: "atoi", scope: !407, file: !407, line: 104, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!13, !650}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !786, file: !761, line: 142)
!786 = !DISubprogram(name: "atol", scope: !407, file: !407, line: 107, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!631, !650}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !790, file: !761, line: 143)
!790 = !DISubprogram(name: "bsearch", scope: !407, file: !407, line: 820, type: !791, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{!167, !793, !793, !795, !795, !798}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !796, line: 46, baseType: !797)
!796 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!797 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !407, line: 808, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!13, !793, !793}
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !803, file: !761, line: 144)
!803 = !DISubprogram(name: "calloc", scope: !407, file: !407, line: 542, type: !804, flags: DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!167, !795, !795}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !807, file: !761, line: 145)
!807 = !DISubprogram(name: "div", scope: !407, file: !407, line: 852, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!759, !13, !13}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !811, file: !761, line: 146)
!811 = !DISubprogram(name: "exit", scope: !407, file: !407, line: 617, type: !812, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !13}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !815, file: !761, line: 147)
!815 = !DISubprogram(name: "free", scope: !407, file: !407, line: 565, type: !816, flags: DIFlagPrototyped, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !167}
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !819, file: !761, line: 148)
!819 = !DISubprogram(name: "getenv", scope: !407, file: !407, line: 634, type: !820, flags: DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!822, !650}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !824, file: !761, line: 149)
!824 = !DISubprogram(name: "labs", scope: !407, file: !407, line: 841, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!631, !631}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !828, file: !761, line: 150)
!828 = !DISubprogram(name: "ldiv", scope: !407, file: !407, line: 854, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!763, !631, !631}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !832, file: !761, line: 151)
!832 = !DISubprogram(name: "malloc", scope: !407, file: !407, line: 539, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!167, !795}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !836, file: !761, line: 153)
!836 = !DISubprogram(name: "mblen", scope: !407, file: !407, line: 922, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!13, !650, !795}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !840, file: !761, line: 154)
!840 = !DISubprogram(name: "mbstowcs", scope: !407, file: !407, line: 933, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!795, !843, !846, !795}
!843 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!846 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !650)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !848, file: !761, line: 155)
!848 = !DISubprogram(name: "mbtowc", scope: !407, file: !407, line: 925, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!13, !843, !846, !795}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !852, file: !761, line: 157)
!852 = !DISubprogram(name: "qsort", scope: !407, file: !407, line: 830, type: !853, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !167, !795, !795, !798}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !856, file: !761, line: 160)
!856 = !DISubprogram(name: "quick_exit", scope: !407, file: !407, line: 623, type: !812, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !858, file: !761, line: 163)
!858 = !DISubprogram(name: "rand", scope: !407, file: !407, line: 453, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{!13}
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !862, file: !761, line: 164)
!862 = !DISubprogram(name: "realloc", scope: !407, file: !407, line: 550, type: !863, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!167, !167, !795}
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !866, file: !761, line: 165)
!866 = !DISubprogram(name: "srand", scope: !407, file: !407, line: 455, type: !867, flags: DIFlagPrototyped, spFlags: 0)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !66}
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !870, file: !761, line: 166)
!870 = !DISubprogram(name: "strtod", scope: !407, file: !407, line: 117, type: !871, flags: DIFlagPrototyped, spFlags: 0)
!871 = !DISubroutineType(types: !872)
!872 = !{!76, !846, !873}
!873 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !876, file: !761, line: 167)
!876 = !DISubprogram(name: "strtol", scope: !407, file: !407, line: 176, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!631, !846, !873, !13}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !880, file: !761, line: 168)
!880 = !DISubprogram(name: "strtoul", scope: !407, file: !407, line: 180, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!797, !846, !873, !13}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !884, file: !761, line: 169)
!884 = !DISubprogram(name: "system", scope: !407, file: !407, line: 784, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !886, file: !761, line: 171)
!886 = !DISubprogram(name: "wcstombs", scope: !407, file: !407, line: 936, type: !887, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{!795, !889, !890, !795}
!889 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !822)
!890 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !894, file: !761, line: 172)
!894 = !DISubprogram(name: "wctomb", scope: !407, file: !407, line: 929, type: !895, flags: DIFlagPrototyped, spFlags: 0)
!895 = !DISubroutineType(types: !896)
!896 = !{!13, !822, !845}
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !899, file: !761, line: 200)
!898 = !DINamespace(name: "__gnu_cxx", scope: null)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !407, line: 80, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !901, identifier: "_ZTS7lldiv_t")
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !900, file: !407, line: 78, baseType: !594, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !900, file: !407, line: 79, baseType: !594, size: 64, offset: 64)
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !905, file: !761, line: 206)
!905 = !DISubprogram(name: "_Exit", scope: !407, file: !407, line: 629, type: !812, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !907, file: !761, line: 210)
!907 = !DISubprogram(name: "llabs", scope: !407, file: !407, line: 844, type: !908, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DISubroutineType(types: !909)
!909 = !{!594, !594}
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !911, file: !761, line: 216)
!911 = !DISubprogram(name: "lldiv", scope: !407, file: !407, line: 858, type: !912, flags: DIFlagPrototyped, spFlags: 0)
!912 = !DISubroutineType(types: !913)
!913 = !{!899, !594, !594}
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !915, file: !761, line: 227)
!915 = !DISubprogram(name: "atoll", scope: !407, file: !407, line: 112, type: !916, flags: DIFlagPrototyped, spFlags: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{!594, !650}
!918 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !919, file: !761, line: 228)
!919 = !DISubprogram(name: "strtoll", scope: !407, file: !407, line: 200, type: !920, flags: DIFlagPrototyped, spFlags: 0)
!920 = !DISubroutineType(types: !921)
!921 = !{!594, !846, !873, !13}
!922 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !923, file: !761, line: 229)
!923 = !DISubprogram(name: "strtoull", scope: !407, file: !407, line: 205, type: !924, flags: DIFlagPrototyped, spFlags: 0)
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !846, !873, !13}
!926 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !928, file: !761, line: 231)
!928 = !DISubprogram(name: "strtof", scope: !407, file: !407, line: 123, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!929 = !DISubroutineType(types: !930)
!930 = !{!55, !846, !873}
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !898, entity: !932, file: !761, line: 232)
!932 = !DISubprogram(name: "strtold", scope: !407, file: !407, line: 126, type: !933, flags: DIFlagPrototyped, spFlags: 0)
!933 = !DISubroutineType(types: !934)
!934 = !{!483, !846, !873}
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !899, file: !761, line: 240)
!936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !905, file: !761, line: 242)
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !907, file: !761, line: 244)
!938 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !939, file: !761, line: 245)
!939 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !898, file: !761, line: 213, type: !912, flags: DIFlagPrototyped, spFlags: 0)
!940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !911, file: !761, line: 246)
!941 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !915, file: !761, line: 248)
!942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !928, file: !761, line: 249)
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !919, file: !761, line: 250)
!944 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !923, file: !761, line: 251)
!945 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !405, entity: !932, file: !761, line: 252)
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !216, entity: !769, file: !947, line: 38)
!947 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
