; ModuleID = 'warps.cpp'
source_filename = "warps.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Turb_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, [3 x double], i32, float, float }
%"struct.pov::Trans_Warp" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, %"struct.pov::Transform_Struct" }
%"struct.pov::Transform_Struct" = type { [4 x [4 x double]], [4 x [4 x double]] }
%"struct.pov::Repeat_Warp" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, i32, float, [3 x double], [3 x double] }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !66, globals: !180, imports: !184, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "warps.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !59}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !4, line: 47, baseType: !6, size: 32, elements: !7, identifier: "_ZTSN3pov11PATTERN_IDSE")
!4 = !DIFile(filename: "./pattern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DINamespace(name: "pov", scope: null)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!8 = !DIEnumerator(name: "NO_PATTERN", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "WAVES_PATTERN", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7, isUnsigned: true)
!16 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8, isUnsigned: true)
!17 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "FACETS_PATTERN", value: 10, isUnsigned: true)
!19 = !DIEnumerator(name: "DENTS_PATTERN", value: 11, isUnsigned: true)
!20 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12, isUnsigned: true)
!21 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13, isUnsigned: true)
!22 = !DIEnumerator(name: "BRICK_PATTERN", value: 14, isUnsigned: true)
!23 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15, isUnsigned: true)
!24 = !DIEnumerator(name: "BOZO_PATTERN", value: 16, isUnsigned: true)
!25 = !DIEnumerator(name: "CELLS_PATTERN", value: 17, isUnsigned: true)
!26 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18, isUnsigned: true)
!27 = !DIEnumerator(name: "WOOD_PATTERN", value: 19, isUnsigned: true)
!28 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20, isUnsigned: true)
!29 = !DIEnumerator(name: "AGATE_PATTERN", value: 21, isUnsigned: true)
!30 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22, isUnsigned: true)
!31 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23, isUnsigned: true)
!32 = !DIEnumerator(name: "ONION_PATTERN", value: 24, isUnsigned: true)
!33 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25, isUnsigned: true)
!34 = !DIEnumerator(name: "JULIA_PATTERN", value: 26, isUnsigned: true)
!35 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27, isUnsigned: true)
!36 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28, isUnsigned: true)
!37 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29, isUnsigned: true)
!38 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30, isUnsigned: true)
!39 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31, isUnsigned: true)
!40 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32, isUnsigned: true)
!41 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33, isUnsigned: true)
!42 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34, isUnsigned: true)
!43 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35, isUnsigned: true)
!44 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36, isUnsigned: true)
!45 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37, isUnsigned: true)
!46 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38, isUnsigned: true)
!47 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39, isUnsigned: true)
!48 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40, isUnsigned: true)
!49 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41, isUnsigned: true)
!50 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42, isUnsigned: true)
!51 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43, isUnsigned: true)
!52 = !DIEnumerator(name: "BOXED_PATTERN", value: 44, isUnsigned: true)
!53 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45, isUnsigned: true)
!54 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46, isUnsigned: true)
!55 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47, isUnsigned: true)
!56 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48, isUnsigned: true)
!57 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49, isUnsigned: true)
!58 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 706, baseType: !6, size: 32, elements: !61)
!60 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!66 = !{!67, !93, !111, !91, !89, !122, !85, !142, !151, !160, !169, !74, !179}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "TURB", scope: !5, file: !60, line: 1039, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Turb_Struct", scope: !5, file: !60, line: 1392, size: 512, flags: DIFlagTypePassByValue, elements: !70, identifier: "_ZTSN3pov11Turb_StructE")
!70 = !{!71, !73, !81, !82, !88, !90, !92}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !69, file: !60, line: 1394, baseType: !72, size: 16)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !69, file: !60, line: 1394, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !60, line: 1040, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !60, line: 1387, size: 192, flags: DIFlagTypePassByValue, elements: !77, identifier: "_ZTSN3pov12Warps_StructE")
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !76, file: !60, line: 1389, baseType: !72, size: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !76, file: !60, line: 1389, baseType: !74, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !76, file: !60, line: 1389, baseType: !74, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !69, file: !60, line: 1394, baseType: !74, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Turbulence", scope: !69, file: !60, line: 1395, baseType: !83, size: 192, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !60, line: 691, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 192, elements: !86)
!85 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Octaves", scope: !69, file: !60, line: 1396, baseType: !89, size: 32, offset: 384)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Lambda", scope: !69, file: !60, line: 1397, baseType: !91, size: 32, offset: 416)
!91 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Omega", scope: !69, file: !60, line: 1397, baseType: !91, size: 32, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANS", scope: !5, file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "./warps.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Trans_Warp", scope: !5, file: !95, line: 106, size: 2240, flags: DIFlagTypePassByValue, elements: !97, identifier: "_ZTSN3pov10Trans_WarpE")
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !96, file: !95, line: 108, baseType: !72, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !96, file: !95, line: 108, baseType: !74, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !96, file: !95, line: 108, baseType: !74, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !96, file: !95, line: 109, baseType: !102, size: 2048, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !60, line: 1014, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !60, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !104, identifier: "_ZTSN3pov16Transform_StructE")
!104 = !{!105, !110}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !103, file: !60, line: 1018, baseType: !106, size: 1024)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !60, line: 693, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, elements: !108)
!108 = !{!109, !109}
!109 = !DISubrange(count: 4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !103, file: !60, line: 1019, baseType: !106, size: 1024, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "REPEAT", scope: !5, file: !95, line: 61, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repeat_Warp", scope: !5, file: !95, line: 98, size: 640, flags: DIFlagTypePassByValue, elements: !114, identifier: "_ZTSN3pov11Repeat_WarpE")
!114 = !{!115, !116, !117, !118, !119, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !113, file: !95, line: 100, baseType: !72, size: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !113, file: !95, line: 100, baseType: !74, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !113, file: !95, line: 100, baseType: !74, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Axis", scope: !113, file: !95, line: 101, baseType: !89, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !113, file: !95, line: 102, baseType: !91, size: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Flip", scope: !113, file: !95, line: 103, baseType: !83, size: 192, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !113, file: !95, line: 103, baseType: !83, size: 192, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLACK_HOLE", scope: !5, file: !95, line: 63, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Black_Hole_Warp", scope: !5, file: !95, line: 112, size: 1152, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTSN3pov15Black_Hole_WarpE")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !139, !140, !141}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !124, file: !95, line: 114, baseType: !72, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !124, file: !95, line: 114, baseType: !74, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !124, file: !95, line: 114, baseType: !74, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !124, file: !95, line: 115, baseType: !83, size: 192, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Repeat_Vector", scope: !124, file: !95, line: 116, baseType: !83, size: 192, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Uncertainty_Vector", scope: !124, file: !95, line: 117, baseType: !83, size: 192, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Strength", scope: !124, file: !95, line: 118, baseType: !85, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !124, file: !95, line: 119, baseType: !85, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Squared", scope: !124, file: !95, line: 120, baseType: !85, size: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Inverse_Radius", scope: !124, file: !95, line: 121, baseType: !85, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Power", scope: !124, file: !95, line: 122, baseType: !85, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Inverted", scope: !124, file: !95, line: 123, baseType: !138, size: 16, offset: 1088)
!138 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !124, file: !95, line: 124, baseType: !138, size: 16, offset: 1104)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Repeat", scope: !124, file: !95, line: 125, baseType: !138, size: 16, offset: 1120)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Uncertain", scope: !124, file: !95, line: 126, baseType: !138, size: 16, offset: 1136)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "CYLW", scope: !5, file: !95, line: 65, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cylindrical_Warp", scope: !5, file: !95, line: 77, size: 448, flags: DIFlagTypePassByValue, elements: !145, identifier: "_ZTSN3pov16Cylindrical_WarpE")
!145 = !{!146, !147, !148, !149, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !144, file: !95, line: 79, baseType: !72, size: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !144, file: !95, line: 79, baseType: !74, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !144, file: !95, line: 79, baseType: !74, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Orientation_Vector", scope: !144, file: !95, line: 80, baseType: !83, size: 192, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DistExp", scope: !144, file: !95, line: 81, baseType: !85, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLANARW", scope: !5, file: !95, line: 67, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Planar_Warp", scope: !5, file: !95, line: 84, size: 448, flags: DIFlagTypePassByValue, elements: !154, identifier: "_ZTSN3pov11Planar_WarpE")
!154 = !{!155, !156, !157, !158, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !153, file: !95, line: 86, baseType: !72, size: 16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !153, file: !95, line: 86, baseType: !74, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !153, file: !95, line: 86, baseType: !74, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Orientation_Vector", scope: !153, file: !95, line: 87, baseType: !83, size: 192, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "OffSet", scope: !153, file: !95, line: 88, baseType: !85, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPHEREW", scope: !5, file: !95, line: 64, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Spherical_Warp", scope: !5, file: !95, line: 91, size: 448, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTSN3pov14Spherical_WarpE")
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !162, file: !95, line: 93, baseType: !72, size: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !162, file: !95, line: 93, baseType: !74, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !162, file: !95, line: 93, baseType: !74, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Orientation_Vector", scope: !162, file: !95, line: 94, baseType: !83, size: 192, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "DistExp", scope: !162, file: !95, line: 95, baseType: !85, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOROIDAL", scope: !5, file: !95, line: 66, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Toroidal_Warp", scope: !5, file: !95, line: 69, size: 512, flags: DIFlagTypePassByValue, elements: !172, identifier: "_ZTSN3pov13Toroidal_WarpE")
!172 = !{!173, !174, !175, !176, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !171, file: !95, line: 71, baseType: !72, size: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !171, file: !95, line: 71, baseType: !74, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !171, file: !95, line: 71, baseType: !74, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Orientation_Vector", scope: !171, file: !95, line: 72, baseType: !83, size: 192, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "DistExp", scope: !171, file: !95, line: 73, baseType: !85, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "MajorRadius", scope: !171, file: !95, line: 74, baseType: !85, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!180 = !{!181}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression(DW_OP_constu, 4861130398305394688, DW_OP_stack_value))
!182 = distinct !DIGlobalVariable(name: "COORDINATE_LIMIT", scope: !5, file: !1, line: 47, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!184 = !{!185, !192, !198, !200, !202, !206, !208, !210, !212, !214, !216, !218, !220, !225, !229, !231, !233, !238, !240, !242, !244, !246, !248, !250, !253, !255, !257, !261, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !290, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !328, !332, !336, !338, !340, !342, !344, !346, !348, !350, !352, !354, !358, !362, !366, !368, !370, !372, !377, !381, !385, !387, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !414, !418, !422, !424, !426, !428, !435, !439, !443, !445, !447, !449, !451, !453, !455, !459, !463, !465, !467, !469, !471, !475, !479, !483, !485, !487, !489, !491, !493, !495, !499, !503, !507, !509, !513, !517, !519, !521, !523, !525, !527, !529, !535, !540, !544, !550, !554, !559, !561, !563, !567, !571, !584, !588, !592, !596, !600, !605, !609, !613, !617, !621, !629, !633, !637, !639, !643, !647, !651, !657, !661, !665, !667, !675, !679, !686, !688, !692, !696, !700, !704, !709, !713, !717, !718, !719, !720, !722, !723, !724, !725, !726, !727, !728, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !789, !791, !797, !801, !807, !811, !815, !819, !823, !825, !827, !831, !835, !839, !843, !847, !849, !851, !853, !857, !861, !865, !867, !869, !872, !874, !875, !877, !879, !881, !882, !883, !885}
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !187, file: !191, line: 52)
!186 = !DINamespace(name: "std", scope: null)
!187 = !DISubprogram(name: "abs", scope: !188, file: !188, line: 840, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!188 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!189 = !DISubroutineType(types: !190)
!190 = !{!89, !89}
!191 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !193, file: !197, line: 83)
!193 = !DISubprogram(name: "acos", scope: !194, file: !194, line: 53, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!195 = !DISubroutineType(types: !196)
!196 = !{!85, !85}
!197 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!198 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !199, file: !197, line: 102)
!199 = !DISubprogram(name: "asin", scope: !194, file: !194, line: 55, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !201, file: !197, line: 121)
!201 = !DISubprogram(name: "atan", scope: !194, file: !194, line: 57, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !203, file: !197, line: 140)
!203 = !DISubprogram(name: "atan2", scope: !194, file: !194, line: 59, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!204 = !DISubroutineType(types: !205)
!205 = !{!85, !85, !85}
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !207, file: !197, line: 161)
!207 = !DISubprogram(name: "ceil", scope: !194, file: !194, line: 159, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !209, file: !197, line: 180)
!209 = !DISubprogram(name: "cos", scope: !194, file: !194, line: 62, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !211, file: !197, line: 199)
!211 = !DISubprogram(name: "cosh", scope: !194, file: !194, line: 71, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !213, file: !197, line: 218)
!213 = !DISubprogram(name: "exp", scope: !194, file: !194, line: 95, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !215, file: !197, line: 237)
!215 = !DISubprogram(name: "fabs", scope: !194, file: !194, line: 162, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !217, file: !197, line: 256)
!217 = !DISubprogram(name: "floor", scope: !194, file: !194, line: 165, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !219, file: !197, line: 275)
!219 = !DISubprogram(name: "fmod", scope: !194, file: !194, line: 168, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !221, file: !197, line: 296)
!221 = !DISubprogram(name: "frexp", scope: !194, file: !194, line: 98, type: !222, flags: DIFlagPrototyped, spFlags: 0)
!222 = !DISubroutineType(types: !223)
!223 = !{!85, !85, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !226, file: !197, line: 315)
!226 = !DISubprogram(name: "ldexp", scope: !194, file: !194, line: 101, type: !227, flags: DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{!85, !85, !89}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !230, file: !197, line: 334)
!230 = !DISubprogram(name: "log", scope: !194, file: !194, line: 104, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !232, file: !197, line: 353)
!232 = !DISubprogram(name: "log10", scope: !194, file: !194, line: 107, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !234, file: !197, line: 372)
!234 = !DISubprogram(name: "modf", scope: !194, file: !194, line: 110, type: !235, flags: DIFlagPrototyped, spFlags: 0)
!235 = !DISubroutineType(types: !236)
!236 = !{!85, !85, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !239, file: !197, line: 384)
!239 = !DISubprogram(name: "pow", scope: !194, file: !194, line: 140, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !241, file: !197, line: 421)
!241 = !DISubprogram(name: "sin", scope: !194, file: !194, line: 64, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !243, file: !197, line: 440)
!243 = !DISubprogram(name: "sinh", scope: !194, file: !194, line: 73, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !245, file: !197, line: 459)
!245 = !DISubprogram(name: "sqrt", scope: !194, file: !194, line: 143, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !247, file: !197, line: 478)
!247 = !DISubprogram(name: "tan", scope: !194, file: !194, line: 66, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !249, file: !197, line: 497)
!249 = !DISubprogram(name: "tanh", scope: !194, file: !194, line: 75, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !251, file: !197, line: 1065)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !252, line: 150, baseType: !85)
!252 = !DIFile(filename: "/usr/include/math.h", directory: "")
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !254, file: !197, line: 1066)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !252, line: 149, baseType: !91)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !256, file: !197, line: 1069)
!256 = !DISubprogram(name: "acosh", scope: !194, file: !194, line: 85, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !258, file: !197, line: 1070)
!258 = !DISubprogram(name: "acoshf", scope: !194, file: !194, line: 85, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!259 = !DISubroutineType(types: !260)
!260 = !{!91, !91}
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !262, file: !197, line: 1071)
!262 = !DISubprogram(name: "acoshl", scope: !194, file: !194, line: 85, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !265}
!265 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !267, file: !197, line: 1073)
!267 = !DISubprogram(name: "asinh", scope: !194, file: !194, line: 87, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !269, file: !197, line: 1074)
!269 = !DISubprogram(name: "asinhf", scope: !194, file: !194, line: 87, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !271, file: !197, line: 1075)
!271 = !DISubprogram(name: "asinhl", scope: !194, file: !194, line: 87, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !273, file: !197, line: 1077)
!273 = !DISubprogram(name: "atanh", scope: !194, file: !194, line: 89, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !275, file: !197, line: 1078)
!275 = !DISubprogram(name: "atanhf", scope: !194, file: !194, line: 89, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !277, file: !197, line: 1079)
!277 = !DISubprogram(name: "atanhl", scope: !194, file: !194, line: 89, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !279, file: !197, line: 1081)
!279 = !DISubprogram(name: "cbrt", scope: !194, file: !194, line: 152, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !281, file: !197, line: 1082)
!281 = !DISubprogram(name: "cbrtf", scope: !194, file: !194, line: 152, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !283, file: !197, line: 1083)
!283 = !DISubprogram(name: "cbrtl", scope: !194, file: !194, line: 152, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !285, file: !197, line: 1085)
!285 = !DISubprogram(name: "copysign", scope: !194, file: !194, line: 196, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !287, file: !197, line: 1086)
!287 = !DISubprogram(name: "copysignf", scope: !194, file: !194, line: 196, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!288 = !DISubroutineType(types: !289)
!289 = !{!91, !91, !91}
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !291, file: !197, line: 1087)
!291 = !DISubprogram(name: "copysignl", scope: !194, file: !194, line: 196, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!292 = !DISubroutineType(types: !293)
!293 = !{!265, !265, !265}
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !295, file: !197, line: 1089)
!295 = !DISubprogram(name: "erf", scope: !194, file: !194, line: 228, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !297, file: !197, line: 1090)
!297 = !DISubprogram(name: "erff", scope: !194, file: !194, line: 228, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !299, file: !197, line: 1091)
!299 = !DISubprogram(name: "erfl", scope: !194, file: !194, line: 228, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !301, file: !197, line: 1093)
!301 = !DISubprogram(name: "erfc", scope: !194, file: !194, line: 229, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !303, file: !197, line: 1094)
!303 = !DISubprogram(name: "erfcf", scope: !194, file: !194, line: 229, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !305, file: !197, line: 1095)
!305 = !DISubprogram(name: "erfcl", scope: !194, file: !194, line: 229, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !307, file: !197, line: 1097)
!307 = !DISubprogram(name: "exp2", scope: !194, file: !194, line: 130, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !309, file: !197, line: 1098)
!309 = !DISubprogram(name: "exp2f", scope: !194, file: !194, line: 130, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !311, file: !197, line: 1099)
!311 = !DISubprogram(name: "exp2l", scope: !194, file: !194, line: 130, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !313, file: !197, line: 1101)
!313 = !DISubprogram(name: "expm1", scope: !194, file: !194, line: 119, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !315, file: !197, line: 1102)
!315 = !DISubprogram(name: "expm1f", scope: !194, file: !194, line: 119, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !317, file: !197, line: 1103)
!317 = !DISubprogram(name: "expm1l", scope: !194, file: !194, line: 119, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !319, file: !197, line: 1105)
!319 = !DISubprogram(name: "fdim", scope: !194, file: !194, line: 326, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !321, file: !197, line: 1106)
!321 = !DISubprogram(name: "fdimf", scope: !194, file: !194, line: 326, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !323, file: !197, line: 1107)
!323 = !DISubprogram(name: "fdiml", scope: !194, file: !194, line: 326, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !325, file: !197, line: 1109)
!325 = !DISubprogram(name: "fma", scope: !194, file: !194, line: 335, type: !326, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DISubroutineType(types: !327)
!327 = !{!85, !85, !85, !85}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !329, file: !197, line: 1110)
!329 = !DISubprogram(name: "fmaf", scope: !194, file: !194, line: 335, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{!91, !91, !91, !91}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !333, file: !197, line: 1111)
!333 = !DISubprogram(name: "fmal", scope: !194, file: !194, line: 335, type: !334, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DISubroutineType(types: !335)
!335 = !{!265, !265, !265, !265}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !337, file: !197, line: 1113)
!337 = !DISubprogram(name: "fmax", scope: !194, file: !194, line: 329, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !339, file: !197, line: 1114)
!339 = !DISubprogram(name: "fmaxf", scope: !194, file: !194, line: 329, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !341, file: !197, line: 1115)
!341 = !DISubprogram(name: "fmaxl", scope: !194, file: !194, line: 329, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !343, file: !197, line: 1117)
!343 = !DISubprogram(name: "fmin", scope: !194, file: !194, line: 332, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !345, file: !197, line: 1118)
!345 = !DISubprogram(name: "fminf", scope: !194, file: !194, line: 332, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !347, file: !197, line: 1119)
!347 = !DISubprogram(name: "fminl", scope: !194, file: !194, line: 332, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !349, file: !197, line: 1121)
!349 = !DISubprogram(name: "hypot", scope: !194, file: !194, line: 147, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !351, file: !197, line: 1122)
!351 = !DISubprogram(name: "hypotf", scope: !194, file: !194, line: 147, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !353, file: !197, line: 1123)
!353 = !DISubprogram(name: "hypotl", scope: !194, file: !194, line: 147, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !355, file: !197, line: 1125)
!355 = !DISubprogram(name: "ilogb", scope: !194, file: !194, line: 280, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DISubroutineType(types: !357)
!357 = !{!89, !85}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !359, file: !197, line: 1126)
!359 = !DISubprogram(name: "ilogbf", scope: !194, file: !194, line: 280, type: !360, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DISubroutineType(types: !361)
!361 = !{!89, !91}
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !363, file: !197, line: 1127)
!363 = !DISubprogram(name: "ilogbl", scope: !194, file: !194, line: 280, type: !364, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DISubroutineType(types: !365)
!365 = !{!89, !265}
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !367, file: !197, line: 1129)
!367 = !DISubprogram(name: "lgamma", scope: !194, file: !194, line: 230, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !369, file: !197, line: 1130)
!369 = !DISubprogram(name: "lgammaf", scope: !194, file: !194, line: 230, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !371, file: !197, line: 1131)
!371 = !DISubprogram(name: "lgammal", scope: !194, file: !194, line: 230, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !373, file: !197, line: 1134)
!373 = !DISubprogram(name: "llrint", scope: !194, file: !194, line: 316, type: !374, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !85}
!376 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !378, file: !197, line: 1135)
!378 = !DISubprogram(name: "llrintf", scope: !194, file: !194, line: 316, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!376, !91}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !382, file: !197, line: 1136)
!382 = !DISubprogram(name: "llrintl", scope: !194, file: !194, line: 316, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{!376, !265}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !386, file: !197, line: 1138)
!386 = !DISubprogram(name: "llround", scope: !194, file: !194, line: 322, type: !374, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !388, file: !197, line: 1139)
!388 = !DISubprogram(name: "llroundf", scope: !194, file: !194, line: 322, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !390, file: !197, line: 1140)
!390 = !DISubprogram(name: "llroundl", scope: !194, file: !194, line: 322, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !392, file: !197, line: 1143)
!392 = !DISubprogram(name: "log1p", scope: !194, file: !194, line: 122, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !394, file: !197, line: 1144)
!394 = !DISubprogram(name: "log1pf", scope: !194, file: !194, line: 122, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !396, file: !197, line: 1145)
!396 = !DISubprogram(name: "log1pl", scope: !194, file: !194, line: 122, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !398, file: !197, line: 1147)
!398 = !DISubprogram(name: "log2", scope: !194, file: !194, line: 133, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !400, file: !197, line: 1148)
!400 = !DISubprogram(name: "log2f", scope: !194, file: !194, line: 133, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !402, file: !197, line: 1149)
!402 = !DISubprogram(name: "log2l", scope: !194, file: !194, line: 133, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !404, file: !197, line: 1151)
!404 = !DISubprogram(name: "logb", scope: !194, file: !194, line: 125, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !406, file: !197, line: 1152)
!406 = !DISubprogram(name: "logbf", scope: !194, file: !194, line: 125, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !408, file: !197, line: 1153)
!408 = !DISubprogram(name: "logbl", scope: !194, file: !194, line: 125, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !410, file: !197, line: 1155)
!410 = !DISubprogram(name: "lrint", scope: !194, file: !194, line: 314, type: !411, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !85}
!413 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !415, file: !197, line: 1156)
!415 = !DISubprogram(name: "lrintf", scope: !194, file: !194, line: 314, type: !416, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DISubroutineType(types: !417)
!417 = !{!413, !91}
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !419, file: !197, line: 1157)
!419 = !DISubprogram(name: "lrintl", scope: !194, file: !194, line: 314, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{!413, !265}
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !423, file: !197, line: 1159)
!423 = !DISubprogram(name: "lround", scope: !194, file: !194, line: 320, type: !411, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !425, file: !197, line: 1160)
!425 = !DISubprogram(name: "lroundf", scope: !194, file: !194, line: 320, type: !416, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !427, file: !197, line: 1161)
!427 = !DISubprogram(name: "lroundl", scope: !194, file: !194, line: 320, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !429, file: !197, line: 1163)
!429 = !DISubprogram(name: "nan", scope: !194, file: !194, line: 201, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{!85, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !436, file: !197, line: 1164)
!436 = !DISubprogram(name: "nanf", scope: !194, file: !194, line: 201, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!91, !432}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !440, file: !197, line: 1165)
!440 = !DISubprogram(name: "nanl", scope: !194, file: !194, line: 201, type: !441, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!265, !432}
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !444, file: !197, line: 1167)
!444 = !DISubprogram(name: "nearbyint", scope: !194, file: !194, line: 294, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !446, file: !197, line: 1168)
!446 = !DISubprogram(name: "nearbyintf", scope: !194, file: !194, line: 294, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !448, file: !197, line: 1169)
!448 = !DISubprogram(name: "nearbyintl", scope: !194, file: !194, line: 294, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !450, file: !197, line: 1171)
!450 = !DISubprogram(name: "nextafter", scope: !194, file: !194, line: 259, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !452, file: !197, line: 1172)
!452 = !DISubprogram(name: "nextafterf", scope: !194, file: !194, line: 259, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !454, file: !197, line: 1173)
!454 = !DISubprogram(name: "nextafterl", scope: !194, file: !194, line: 259, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !456, file: !197, line: 1175)
!456 = !DISubprogram(name: "nexttoward", scope: !194, file: !194, line: 261, type: !457, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!85, !85, !265}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !460, file: !197, line: 1176)
!460 = !DISubprogram(name: "nexttowardf", scope: !194, file: !194, line: 261, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!91, !91, !265}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !464, file: !197, line: 1177)
!464 = !DISubprogram(name: "nexttowardl", scope: !194, file: !194, line: 261, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !466, file: !197, line: 1179)
!466 = !DISubprogram(name: "remainder", scope: !194, file: !194, line: 272, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !468, file: !197, line: 1180)
!468 = !DISubprogram(name: "remainderf", scope: !194, file: !194, line: 272, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !470, file: !197, line: 1181)
!470 = !DISubprogram(name: "remainderl", scope: !194, file: !194, line: 272, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !472, file: !197, line: 1183)
!472 = !DISubprogram(name: "remquo", scope: !194, file: !194, line: 307, type: !473, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!85, !85, !85, !224}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !476, file: !197, line: 1184)
!476 = !DISubprogram(name: "remquof", scope: !194, file: !194, line: 307, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!91, !91, !91, !224}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !480, file: !197, line: 1185)
!480 = !DISubprogram(name: "remquol", scope: !194, file: !194, line: 307, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!265, !265, !265, !224}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !484, file: !197, line: 1187)
!484 = !DISubprogram(name: "rint", scope: !194, file: !194, line: 256, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !486, file: !197, line: 1188)
!486 = !DISubprogram(name: "rintf", scope: !194, file: !194, line: 256, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !488, file: !197, line: 1189)
!488 = !DISubprogram(name: "rintl", scope: !194, file: !194, line: 256, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !490, file: !197, line: 1191)
!490 = !DISubprogram(name: "round", scope: !194, file: !194, line: 298, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !492, file: !197, line: 1192)
!492 = !DISubprogram(name: "roundf", scope: !194, file: !194, line: 298, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !494, file: !197, line: 1193)
!494 = !DISubprogram(name: "roundl", scope: !194, file: !194, line: 298, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !496, file: !197, line: 1195)
!496 = !DISubprogram(name: "scalbln", scope: !194, file: !194, line: 290, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!85, !85, !413}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !500, file: !197, line: 1196)
!500 = !DISubprogram(name: "scalblnf", scope: !194, file: !194, line: 290, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!91, !91, !413}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !504, file: !197, line: 1197)
!504 = !DISubprogram(name: "scalblnl", scope: !194, file: !194, line: 290, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!265, !265, !413}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !508, file: !197, line: 1199)
!508 = !DISubprogram(name: "scalbn", scope: !194, file: !194, line: 276, type: !227, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !510, file: !197, line: 1200)
!510 = !DISubprogram(name: "scalbnf", scope: !194, file: !194, line: 276, type: !511, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!91, !91, !89}
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !514, file: !197, line: 1201)
!514 = !DISubprogram(name: "scalbnl", scope: !194, file: !194, line: 276, type: !515, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{!265, !265, !89}
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !518, file: !197, line: 1203)
!518 = !DISubprogram(name: "tgamma", scope: !194, file: !194, line: 235, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !520, file: !197, line: 1204)
!520 = !DISubprogram(name: "tgammaf", scope: !194, file: !194, line: 235, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !522, file: !197, line: 1205)
!522 = !DISubprogram(name: "tgammal", scope: !194, file: !194, line: 235, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !524, file: !197, line: 1207)
!524 = !DISubprogram(name: "trunc", scope: !194, file: !194, line: 302, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !526, file: !197, line: 1208)
!526 = !DISubprogram(name: "truncf", scope: !194, file: !194, line: 302, type: !259, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !528, file: !197, line: 1209)
!528 = !DISubprogram(name: "truncl", scope: !194, file: !194, line: 302, type: !263, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !530, file: !534, line: 38)
!530 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !186, file: !191, line: 103, type: !531, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !533}
!533 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!534 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !536, file: !534, line: 54)
!536 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !186, file: !197, line: 380, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!265, !265, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !541, file: !543, line: 127)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !188, line: 62, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!543 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !545, file: !543, line: 128)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !188, line: 70, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !547, identifier: "_ZTS6ldiv_t")
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !546, file: !188, line: 68, baseType: !413, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !546, file: !188, line: 69, baseType: !413, size: 64, offset: 64)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !551, file: !543, line: 130)
!551 = !DISubprogram(name: "abort", scope: !188, file: !188, line: 591, type: !552, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{null}
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !555, file: !543, line: 134)
!555 = !DISubprogram(name: "atexit", scope: !188, file: !188, line: 595, type: !556, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{!89, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !560, file: !543, line: 137)
!560 = !DISubprogram(name: "at_quick_exit", scope: !188, file: !188, line: 600, type: !556, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !562, file: !543, line: 140)
!562 = !DISubprogram(name: "atof", scope: !188, file: !188, line: 101, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !564, file: !543, line: 141)
!564 = !DISubprogram(name: "atoi", scope: !188, file: !188, line: 104, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!89, !432}
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !568, file: !543, line: 142)
!568 = !DISubprogram(name: "atol", scope: !188, file: !188, line: 107, type: !569, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{!413, !432}
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !572, file: !543, line: 143)
!572 = !DISubprogram(name: "bsearch", scope: !188, file: !188, line: 820, type: !573, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!179, !575, !575, !577, !577, !580}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !578, line: 46, baseType: !579)
!578 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!579 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !188, line: 808, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!89, !575, !575}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !585, file: !543, line: 144)
!585 = !DISubprogram(name: "calloc", scope: !188, file: !188, line: 542, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!179, !577, !577}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !589, file: !543, line: 145)
!589 = !DISubprogram(name: "div", scope: !188, file: !188, line: 852, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!541, !89, !89}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !593, file: !543, line: 146)
!593 = !DISubprogram(name: "exit", scope: !188, file: !188, line: 617, type: !594, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !89}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !597, file: !543, line: 147)
!597 = !DISubprogram(name: "free", scope: !188, file: !188, line: 565, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !179}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !601, file: !543, line: 148)
!601 = !DISubprogram(name: "getenv", scope: !188, file: !188, line: 634, type: !602, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DISubroutineType(types: !603)
!603 = !{!604, !432}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !606, file: !543, line: 149)
!606 = !DISubprogram(name: "labs", scope: !188, file: !188, line: 841, type: !607, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DISubroutineType(types: !608)
!608 = !{!413, !413}
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !610, file: !543, line: 150)
!610 = !DISubprogram(name: "ldiv", scope: !188, file: !188, line: 854, type: !611, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!545, !413, !413}
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !614, file: !543, line: 151)
!614 = !DISubprogram(name: "malloc", scope: !188, file: !188, line: 539, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!179, !577}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !618, file: !543, line: 153)
!618 = !DISubprogram(name: "mblen", scope: !188, file: !188, line: 922, type: !619, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{!89, !432, !577}
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !622, file: !543, line: 154)
!622 = !DISubprogram(name: "mbstowcs", scope: !188, file: !188, line: 933, type: !623, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DISubroutineType(types: !624)
!624 = !{!577, !625, !628, !577}
!625 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !432)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !630, file: !543, line: 155)
!630 = !DISubprogram(name: "mbtowc", scope: !188, file: !188, line: 925, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!89, !625, !628, !577}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !634, file: !543, line: 157)
!634 = !DISubprogram(name: "qsort", scope: !188, file: !188, line: 830, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !179, !577, !577, !580}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !638, file: !543, line: 160)
!638 = !DISubprogram(name: "quick_exit", scope: !188, file: !188, line: 623, type: !594, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !640, file: !543, line: 163)
!640 = !DISubprogram(name: "rand", scope: !188, file: !188, line: 453, type: !641, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DISubroutineType(types: !642)
!642 = !{!89}
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !644, file: !543, line: 164)
!644 = !DISubprogram(name: "realloc", scope: !188, file: !188, line: 550, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!179, !179, !577}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !648, file: !543, line: 165)
!648 = !DISubprogram(name: "srand", scope: !188, file: !188, line: 455, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !6}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !652, file: !543, line: 166)
!652 = !DISubprogram(name: "strtod", scope: !188, file: !188, line: 117, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!85, !628, !655}
!655 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !658, file: !543, line: 167)
!658 = !DISubprogram(name: "strtol", scope: !188, file: !188, line: 176, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!413, !628, !655, !89}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !662, file: !543, line: 168)
!662 = !DISubprogram(name: "strtoul", scope: !188, file: !188, line: 180, type: !663, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{!579, !628, !655, !89}
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !666, file: !543, line: 169)
!666 = !DISubprogram(name: "system", scope: !188, file: !188, line: 784, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !668, file: !543, line: 171)
!668 = !DISubprogram(name: "wcstombs", scope: !188, file: !188, line: 936, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!577, !671, !672, !577}
!671 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !604)
!672 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !676, file: !543, line: 172)
!676 = !DISubprogram(name: "wctomb", scope: !188, file: !188, line: 929, type: !677, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{!89, !604, !627}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !681, file: !543, line: 200)
!680 = !DINamespace(name: "__gnu_cxx", scope: null)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !188, line: 80, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !683, identifier: "_ZTS7lldiv_t")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !682, file: !188, line: 78, baseType: !376, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !682, file: !188, line: 79, baseType: !376, size: 64, offset: 64)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !687, file: !543, line: 206)
!687 = !DISubprogram(name: "_Exit", scope: !188, file: !188, line: 629, type: !594, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !689, file: !543, line: 210)
!689 = !DISubprogram(name: "llabs", scope: !188, file: !188, line: 844, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!376, !376}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !693, file: !543, line: 216)
!693 = !DISubprogram(name: "lldiv", scope: !188, file: !188, line: 858, type: !694, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{!681, !376, !376}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !697, file: !543, line: 227)
!697 = !DISubprogram(name: "atoll", scope: !188, file: !188, line: 112, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!376, !432}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !701, file: !543, line: 228)
!701 = !DISubprogram(name: "strtoll", scope: !188, file: !188, line: 200, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!376, !628, !655, !89}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !705, file: !543, line: 229)
!705 = !DISubprogram(name: "strtoull", scope: !188, file: !188, line: 205, type: !706, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !628, !655, !89}
!708 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !710, file: !543, line: 231)
!710 = !DISubprogram(name: "strtof", scope: !188, file: !188, line: 123, type: !711, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{!91, !628, !655}
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !680, entity: !714, file: !543, line: 232)
!714 = !DISubprogram(name: "strtold", scope: !188, file: !188, line: 126, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!265, !628, !655}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !681, file: !543, line: 240)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !687, file: !543, line: 242)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !689, file: !543, line: 244)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !721, file: !543, line: 245)
!721 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !680, file: !543, line: 213, type: !694, flags: DIFlagPrototyped, spFlags: 0)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !693, file: !543, line: 246)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !697, file: !543, line: 248)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !710, file: !543, line: 249)
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !701, file: !543, line: 250)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !705, file: !543, line: 251)
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !714, file: !543, line: 252)
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !551, file: !729, line: 38)
!729 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !555, file: !729, line: 39)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !593, file: !729, line: 40)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !560, file: !729, line: 43)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !638, file: !729, line: 46)
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !541, file: !729, line: 51)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !545, file: !729, line: 52)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !530, file: !729, line: 54)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !562, file: !729, line: 55)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !564, file: !729, line: 56)
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !568, file: !729, line: 57)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !572, file: !729, line: 58)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !585, file: !729, line: 59)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !721, file: !729, line: 60)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !597, file: !729, line: 61)
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !601, file: !729, line: 62)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !606, file: !729, line: 63)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !610, file: !729, line: 64)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !614, file: !729, line: 65)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !618, file: !729, line: 67)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !622, file: !729, line: 68)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !630, file: !729, line: 69)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !634, file: !729, line: 71)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !640, file: !729, line: 72)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !644, file: !729, line: 73)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !648, file: !729, line: 74)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !652, file: !729, line: 75)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !658, file: !729, line: 76)
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !662, file: !729, line: 77)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !666, file: !729, line: 78)
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !668, file: !729, line: 80)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !676, file: !729, line: 81)
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !762, file: !764, line: 64)
!762 = !DISubprogram(name: "isalnum", scope: !763, file: !763, line: 108, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!764 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !766, file: !764, line: 65)
!766 = !DISubprogram(name: "isalpha", scope: !763, file: !763, line: 109, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !768, file: !764, line: 66)
!768 = !DISubprogram(name: "iscntrl", scope: !763, file: !763, line: 110, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !770, file: !764, line: 67)
!770 = !DISubprogram(name: "isdigit", scope: !763, file: !763, line: 111, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !772, file: !764, line: 68)
!772 = !DISubprogram(name: "isgraph", scope: !763, file: !763, line: 113, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !774, file: !764, line: 69)
!774 = !DISubprogram(name: "islower", scope: !763, file: !763, line: 112, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !776, file: !764, line: 70)
!776 = !DISubprogram(name: "isprint", scope: !763, file: !763, line: 114, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !778, file: !764, line: 71)
!778 = !DISubprogram(name: "ispunct", scope: !763, file: !763, line: 115, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !780, file: !764, line: 72)
!780 = !DISubprogram(name: "isspace", scope: !763, file: !763, line: 116, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !782, file: !764, line: 73)
!782 = !DISubprogram(name: "isupper", scope: !763, file: !763, line: 117, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !784, file: !764, line: 74)
!784 = !DISubprogram(name: "isxdigit", scope: !763, file: !763, line: 118, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !786, file: !764, line: 75)
!786 = !DISubprogram(name: "tolower", scope: !763, file: !763, line: 122, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !788, file: !764, line: 76)
!788 = !DISubprogram(name: "toupper", scope: !763, file: !763, line: 125, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !790, file: !764, line: 87)
!790 = !DISubprogram(name: "isblank", scope: !763, file: !763, line: 130, type: !189, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !792, file: !796, line: 77)
!792 = !DISubprogram(name: "memchr", scope: !793, file: !793, line: 73, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DIFile(filename: "/usr/include/string.h", directory: "")
!794 = !DISubroutineType(types: !795)
!795 = !{!575, !575, !89, !577}
!796 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstring", directory: "")
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !798, file: !796, line: 78)
!798 = !DISubprogram(name: "memcmp", scope: !793, file: !793, line: 64, type: !799, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DISubroutineType(types: !800)
!800 = !{!89, !575, !575, !577}
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !802, file: !796, line: 79)
!802 = !DISubprogram(name: "memcpy", scope: !793, file: !793, line: 43, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!179, !805, !806, !577}
!805 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !179)
!806 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !575)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !808, file: !796, line: 80)
!808 = !DISubprogram(name: "memmove", scope: !793, file: !793, line: 47, type: !809, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!179, !179, !575, !577}
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !812, file: !796, line: 81)
!812 = !DISubprogram(name: "memset", scope: !793, file: !793, line: 61, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!179, !179, !89, !577}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !816, file: !796, line: 82)
!816 = !DISubprogram(name: "strcat", scope: !793, file: !793, line: 130, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!604, !671, !628}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !820, file: !796, line: 83)
!820 = !DISubprogram(name: "strcmp", scope: !793, file: !793, line: 137, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!89, !432, !432}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !824, file: !796, line: 84)
!824 = !DISubprogram(name: "strcoll", scope: !793, file: !793, line: 144, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !826, file: !796, line: 85)
!826 = !DISubprogram(name: "strcpy", scope: !793, file: !793, line: 122, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !828, file: !796, line: 86)
!828 = !DISubprogram(name: "strcspn", scope: !793, file: !793, line: 273, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!577, !432, !432}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !832, file: !796, line: 87)
!832 = !DISubprogram(name: "strerror", scope: !793, file: !793, line: 397, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!604, !89}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !836, file: !796, line: 88)
!836 = !DISubprogram(name: "strlen", scope: !793, file: !793, line: 385, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!577, !432}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !840, file: !796, line: 89)
!840 = !DISubprogram(name: "strncat", scope: !793, file: !793, line: 133, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!604, !671, !628, !577}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !844, file: !796, line: 90)
!844 = !DISubprogram(name: "strncmp", scope: !793, file: !793, line: 140, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!89, !432, !432, !577}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !848, file: !796, line: 91)
!848 = !DISubprogram(name: "strncpy", scope: !793, file: !793, line: 125, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !850, file: !796, line: 92)
!850 = !DISubprogram(name: "strspn", scope: !793, file: !793, line: 277, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !852, file: !796, line: 93)
!852 = !DISubprogram(name: "strtok", scope: !793, file: !793, line: 336, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !854, file: !796, line: 94)
!854 = !DISubprogram(name: "strxfrm", scope: !793, file: !793, line: 147, type: !855, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DISubroutineType(types: !856)
!856 = !{!577, !671, !628, !577}
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !858, file: !796, line: 95)
!858 = !DISubprogram(name: "strchr", scope: !793, file: !793, line: 208, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{!432, !432, !89}
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !862, file: !796, line: 96)
!862 = !DISubprogram(name: "strpbrk", scope: !793, file: !793, line: 285, type: !863, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{!432, !432, !432}
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !866, file: !796, line: 97)
!866 = !DISubprogram(name: "strrchr", scope: !793, file: !793, line: 235, type: !859, flags: DIFlagPrototyped, spFlags: 0)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !186, entity: !868, file: !796, line: 98)
!868 = !DISubprogram(name: "strstr", scope: !793, file: !793, line: 312, type: !863, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !870, entity: !186, file: !871, line: 37)
!870 = !DINamespace(name: "pov_base", scope: null)
!871 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!872 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !873, line: 36)
!873 = !DIFile(filename: "./pov_mem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!874 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !60, line: 78)
!875 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !876, line: 36)
!876 = !DIFile(filename: "./userio.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!877 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !878, line: 37)
!878 = !DIFile(filename: "./vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!879 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !880, line: 36)
!880 = !DIFile(filename: "./matrices.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!881 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !95, line: 37)
!882 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !4, line: 37)
!883 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !884, line: 40)
!884 = !DIFile(filename: "./texture.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!885 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !186, file: !1, line: 41)
!886 = !{i32 7, !"Dwarf Version", i32 4}
!887 = !{i32 2, !"Debug Info Version", i32 3}
!888 = !{i32 1, !"wchar_size", i32 4}
!889 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!890 = distinct !DISubprogram(name: "Warp_EPoint", linkageName: "_ZN3pov11Warp_EPointEPdS0_PNS_14Pattern_StructE", scope: !5, file: !1, line: 89, type: !891, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !992)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !237, !237, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !60, line: 1034, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !60, line: 1337, size: 1280, flags: DIFlagTypePassByValue, elements: !896, identifier: "_ZTSN3pov14Pattern_StructE")
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !910}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !895, file: !60, line: 1339, baseType: !72, size: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !895, file: !60, line: 1339, baseType: !72, size: 16, offset: 16)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !895, file: !60, line: 1339, baseType: !72, size: 16, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !895, file: !60, line: 1339, baseType: !89, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !895, file: !60, line: 1339, baseType: !91, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !895, file: !60, line: 1339, baseType: !91, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !895, file: !60, line: 1339, baseType: !91, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !895, file: !60, line: 1339, baseType: !74, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !895, file: !60, line: 1339, baseType: !893, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !895, file: !60, line: 1339, baseType: !907, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !60, line: 1033, baseType: !909)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !60, line: 1059, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Blend_Map_StructE")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !895, file: !60, line: 1339, baseType: !911, size: 896, offset: 384)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !895, file: !60, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !912, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!912 = !{!913, !917, !921, !922, !923, !924, !925, !926, !931, !936, !942, !954, !969, !979, !984, !988}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !911, file: !60, line: 1339, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !60, line: 1280, baseType: !916)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !60, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !911, file: !60, line: 1339, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !60, line: 1232, baseType: !920)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !60, line: 1234, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Image_StructE")
!921 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !911, file: !60, line: 1339, baseType: !83, size: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !911, file: !60, line: 1339, baseType: !91, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !911, file: !60, line: 1339, baseType: !138, size: 16)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !911, file: !60, line: 1339, baseType: !138, size: 16)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !911, file: !60, line: 1339, baseType: !138, size: 16)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !911, file: !60, line: 1339, baseType: !927, size: 256)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 256, flags: DIFlagTypePassByValue, elements: !928, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !927, file: !60, line: 1339, baseType: !91, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !927, file: !60, line: 1339, baseType: !83, size: 192, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !911, file: !60, line: 1339, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 64, flags: DIFlagTypePassByValue, elements: !933, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !932, file: !60, line: 1339, baseType: !91, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !932, file: !60, line: 1339, baseType: !91, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !911, file: !60, line: 1339, baseType: !937, size: 320)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 320, flags: DIFlagTypePassByValue, elements: !938, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !937, file: !60, line: 1339, baseType: !85, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !937, file: !60, line: 1339, baseType: !85, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !937, file: !60, line: 1339, baseType: !83, size: 192, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !911, file: !60, line: 1339, baseType: !943, size: 896)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 896, flags: DIFlagTypePassByValue, elements: !944, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!944 = !{!945, !946, !947, !948, !949, !950, !952, !953}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !943, file: !60, line: 1339, baseType: !83, size: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !943, file: !60, line: 1339, baseType: !83, size: 192, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !943, file: !60, line: 1339, baseType: !85, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !943, file: !60, line: 1339, baseType: !85, size: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !943, file: !60, line: 1339, baseType: !138, size: 16, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !943, file: !60, line: 1339, baseType: !951, size: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !943, file: !60, line: 1339, baseType: !89, size: 32, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !943, file: !60, line: 1339, baseType: !83, size: 192, offset: 704)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !911, file: !60, line: 1339, baseType: !955, size: 832)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 832, flags: DIFlagTypePassByValue, elements: !956, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!956 = !{!957, !958, !959, !960, !961, !962, !963, !968}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !955, file: !60, line: 1339, baseType: !83, size: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !955, file: !60, line: 1339, baseType: !83, size: 192, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !955, file: !60, line: 1339, baseType: !138, size: 16, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !955, file: !60, line: 1339, baseType: !138, size: 16, offset: 400)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !955, file: !60, line: 1339, baseType: !85, size: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !955, file: !60, line: 1339, baseType: !85, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !955, file: !60, line: 1339, baseType: !964, size: 128, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !60, line: 690, baseType: !965)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 2)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !955, file: !60, line: 1339, baseType: !964, size: 128, offset: 704)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !911, file: !60, line: 1339, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 384, flags: DIFlagTypePassByValue, elements: !971, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!971 = !{!972, !973, !974, !975, !976, !977, !978}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !970, file: !60, line: 1339, baseType: !964, size: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !970, file: !60, line: 1339, baseType: !138, size: 16, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !970, file: !60, line: 1339, baseType: !138, size: 16, offset: 144)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !970, file: !60, line: 1339, baseType: !138, size: 16, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !970, file: !60, line: 1339, baseType: !85, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !970, file: !60, line: 1339, baseType: !85, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !970, file: !60, line: 1339, baseType: !89, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !911, file: !60, line: 1339, baseType: !980, size: 128)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !60, line: 1339, size: 128, flags: DIFlagTypePassByValue, elements: !981, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !980, file: !60, line: 1339, baseType: !179, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !980, file: !60, line: 1339, baseType: !179, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !911, file: !60, line: 1339, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !60, line: 1036, baseType: !987)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !60, line: 1342, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pigment_StructE")
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !911, file: !60, line: 1339, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !60, line: 678, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !60, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!992 = !{}
!993 = !DILocalVariable(name: "TPoint", arg: 1, scope: !890, file: !1, line: 89, type: !237)
!994 = !DILocation(line: 89, column: 26, scope: !890)
!995 = !DILocalVariable(name: "EPoint", arg: 2, scope: !890, file: !1, line: 89, type: !237)
!996 = !DILocation(line: 89, column: 41, scope: !890)
