; ModuleID = 'planes.cpp'
source_filename = "planes.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Plane_Methods", linkageName: "_ZN3pov13Plane_MethodsE", scope: !2, file: !3, line: 67, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "planes.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !284, globals: !306, imports: !310, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !278}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !152, line: 149, baseType: !56, size: 32, elements: !153, identifier: "_ZTSN3pov5STATSE")
!152 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!154 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!160 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!161 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!162 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!163 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!164 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!165 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!166 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!167 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!168 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!169 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!170 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!171 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!204 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!205 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!214 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!215 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!232 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!233 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!236 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!237 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!242 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!243 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!244 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!245 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!249 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!250 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!251 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!252 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!253 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!254 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!255 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!256 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!257 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!258 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!259 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!260 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!261 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!262 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!263 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!264 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!265 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!266 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!267 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!268 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!269 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!270 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!271 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!272 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!273 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!274 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!275 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!276 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!277 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!284 = !{!285, !44, !104}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PLANE", scope: !2, file: !287, line: 50, baseType: !288)
!287 = !DIFile(filename: "./planes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Plane_Struct", scope: !2, file: !287, line: 52, size: 1216, flags: DIFlagTypePassByValue, elements: !289, identifier: "_ZTSN3pov12Plane_StructE")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !288, file: !287, line: 54, baseType: !19, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !288, file: !287, line: 54, baseType: !13, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !288, file: !287, line: 54, baseType: !14, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !288, file: !287, line: 54, baseType: !23, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !288, file: !287, line: 54, baseType: !23, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !288, file: !287, line: 54, baseType: !28, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !288, file: !287, line: 54, baseType: !14, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !288, file: !287, line: 54, baseType: !14, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !288, file: !287, line: 54, baseType: !34, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !288, file: !287, line: 54, baseType: !38, size: 192, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !288, file: !287, line: 54, baseType: !50, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !288, file: !287, line: 54, baseType: !50, size: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !288, file: !287, line: 54, baseType: !45, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !288, file: !287, line: 54, baseType: !56, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vector", scope: !288, file: !287, line: 55, baseType: !62, size: 192, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !288, file: !287, line: 56, baseType: !64, size: 64, offset: 1152)
!306 = !{!0, !307}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!308 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 45, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!310 = !{!311, !318, !324, !326, !328, !332, !334, !336, !338, !340, !342, !344, !346, !351, !355, !357, !359, !363, !365, !367, !369, !371, !373, !375, !378, !380, !382, !386, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !415, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !453, !457, !461, !463, !465, !467, !469, !471, !473, !475, !477, !479, !483, !487, !491, !493, !495, !497, !502, !506, !510, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !539, !543, !547, !549, !551, !553, !560, !564, !568, !570, !572, !574, !576, !578, !580, !584, !588, !590, !592, !594, !596, !600, !604, !608, !610, !612, !614, !616, !618, !620, !624, !628, !632, !634, !638, !642, !644, !646, !648, !650, !652, !654, !660, !665, !669, !675, !679, !684, !686, !688, !692, !696, !709, !713, !717, !721, !725, !730, !734, !738, !742, !746, !754, !758, !762, !764, !768, !772, !776, !782, !786, !790, !792, !800, !804, !811, !813, !817, !821, !825, !829, !834, !838, !842, !843, !844, !845, !847, !848, !849, !850, !851, !852, !853, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !890, !892, !894, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !922, !926, !932, !936, !940, !944, !948, !950, !952, !956, !960, !964, !968, !972, !974, !976, !978, !982, !986, !990, !992, !994, !997, !999, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1021, !1022, !1023, !1025, !1027, !1029, !1030}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !313, file: !317, line: 52)
!312 = !DINamespace(name: "std", scope: null)
!313 = !DISubprogram(name: "abs", scope: !314, file: !314, line: 840, type: !315, flags: DIFlagPrototyped, spFlags: 0)
!314 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!315 = !DISubroutineType(types: !316)
!316 = !{!13, !13}
!317 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !319, file: !323, line: 83)
!319 = !DISubprogram(name: "acos", scope: !320, file: !320, line: 53, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!321 = !DISubroutineType(types: !322)
!322 = !{!64, !64}
!323 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !325, file: !323, line: 102)
!325 = !DISubprogram(name: "asin", scope: !320, file: !320, line: 55, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !327, file: !323, line: 121)
!327 = !DISubprogram(name: "atan", scope: !320, file: !320, line: 57, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !329, file: !323, line: 140)
!329 = !DISubprogram(name: "atan2", scope: !320, file: !320, line: 59, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{!64, !64, !64}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !333, file: !323, line: 161)
!333 = !DISubprogram(name: "ceil", scope: !320, file: !320, line: 159, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !335, file: !323, line: 180)
!335 = !DISubprogram(name: "cos", scope: !320, file: !320, line: 62, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !337, file: !323, line: 199)
!337 = !DISubprogram(name: "cosh", scope: !320, file: !320, line: 71, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !339, file: !323, line: 218)
!339 = !DISubprogram(name: "exp", scope: !320, file: !320, line: 95, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !341, file: !323, line: 237)
!341 = !DISubprogram(name: "fabs", scope: !320, file: !320, line: 162, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !343, file: !323, line: 256)
!343 = !DISubprogram(name: "floor", scope: !320, file: !320, line: 165, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !345, file: !323, line: 275)
!345 = !DISubprogram(name: "fmod", scope: !320, file: !320, line: 168, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !347, file: !323, line: 296)
!347 = !DISubprogram(name: "frexp", scope: !320, file: !320, line: 98, type: !348, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DISubroutineType(types: !349)
!349 = !{!64, !64, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !352, file: !323, line: 315)
!352 = !DISubprogram(name: "ldexp", scope: !320, file: !320, line: 101, type: !353, flags: DIFlagPrototyped, spFlags: 0)
!353 = !DISubroutineType(types: !354)
!354 = !{!64, !64, !13}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !356, file: !323, line: 334)
!356 = !DISubprogram(name: "log", scope: !320, file: !320, line: 104, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !358, file: !323, line: 353)
!358 = !DISubprogram(name: "log10", scope: !320, file: !320, line: 107, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !360, file: !323, line: 372)
!360 = !DISubprogram(name: "modf", scope: !320, file: !320, line: 110, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!361 = !DISubroutineType(types: !362)
!362 = !{!64, !64, !113}
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !364, file: !323, line: 384)
!364 = !DISubprogram(name: "pow", scope: !320, file: !320, line: 140, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !366, file: !323, line: 421)
!366 = !DISubprogram(name: "sin", scope: !320, file: !320, line: 64, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !368, file: !323, line: 440)
!368 = !DISubprogram(name: "sinh", scope: !320, file: !320, line: 73, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !370, file: !323, line: 459)
!370 = !DISubprogram(name: "sqrt", scope: !320, file: !320, line: 143, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !372, file: !323, line: 478)
!372 = !DISubprogram(name: "tan", scope: !320, file: !320, line: 66, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !374, file: !323, line: 497)
!374 = !DISubprogram(name: "tanh", scope: !320, file: !320, line: 75, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !376, file: !323, line: 1065)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !377, line: 150, baseType: !64)
!377 = !DIFile(filename: "/usr/include/math.h", directory: "")
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !379, file: !323, line: 1066)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !377, line: 149, baseType: !45)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !381, file: !323, line: 1069)
!381 = !DISubprogram(name: "acosh", scope: !320, file: !320, line: 85, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !383, file: !323, line: 1070)
!383 = !DISubprogram(name: "acoshf", scope: !320, file: !320, line: 85, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{!45, !45}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !387, file: !323, line: 1071)
!387 = !DISubprogram(name: "acoshl", scope: !320, file: !320, line: 85, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !390}
!390 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !392, file: !323, line: 1073)
!392 = !DISubprogram(name: "asinh", scope: !320, file: !320, line: 87, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !394, file: !323, line: 1074)
!394 = !DISubprogram(name: "asinhf", scope: !320, file: !320, line: 87, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !396, file: !323, line: 1075)
!396 = !DISubprogram(name: "asinhl", scope: !320, file: !320, line: 87, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !398, file: !323, line: 1077)
!398 = !DISubprogram(name: "atanh", scope: !320, file: !320, line: 89, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !400, file: !323, line: 1078)
!400 = !DISubprogram(name: "atanhf", scope: !320, file: !320, line: 89, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !402, file: !323, line: 1079)
!402 = !DISubprogram(name: "atanhl", scope: !320, file: !320, line: 89, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !404, file: !323, line: 1081)
!404 = !DISubprogram(name: "cbrt", scope: !320, file: !320, line: 152, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !406, file: !323, line: 1082)
!406 = !DISubprogram(name: "cbrtf", scope: !320, file: !320, line: 152, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !408, file: !323, line: 1083)
!408 = !DISubprogram(name: "cbrtl", scope: !320, file: !320, line: 152, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !410, file: !323, line: 1085)
!410 = !DISubprogram(name: "copysign", scope: !320, file: !320, line: 196, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !412, file: !323, line: 1086)
!412 = !DISubprogram(name: "copysignf", scope: !320, file: !320, line: 196, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!45, !45, !45}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !416, file: !323, line: 1087)
!416 = !DISubprogram(name: "copysignl", scope: !320, file: !320, line: 196, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!390, !390, !390}
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !420, file: !323, line: 1089)
!420 = !DISubprogram(name: "erf", scope: !320, file: !320, line: 228, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !422, file: !323, line: 1090)
!422 = !DISubprogram(name: "erff", scope: !320, file: !320, line: 228, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !424, file: !323, line: 1091)
!424 = !DISubprogram(name: "erfl", scope: !320, file: !320, line: 228, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !426, file: !323, line: 1093)
!426 = !DISubprogram(name: "erfc", scope: !320, file: !320, line: 229, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !428, file: !323, line: 1094)
!428 = !DISubprogram(name: "erfcf", scope: !320, file: !320, line: 229, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !430, file: !323, line: 1095)
!430 = !DISubprogram(name: "erfcl", scope: !320, file: !320, line: 229, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !432, file: !323, line: 1097)
!432 = !DISubprogram(name: "exp2", scope: !320, file: !320, line: 130, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !434, file: !323, line: 1098)
!434 = !DISubprogram(name: "exp2f", scope: !320, file: !320, line: 130, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !436, file: !323, line: 1099)
!436 = !DISubprogram(name: "exp2l", scope: !320, file: !320, line: 130, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !438, file: !323, line: 1101)
!438 = !DISubprogram(name: "expm1", scope: !320, file: !320, line: 119, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !440, file: !323, line: 1102)
!440 = !DISubprogram(name: "expm1f", scope: !320, file: !320, line: 119, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !442, file: !323, line: 1103)
!442 = !DISubprogram(name: "expm1l", scope: !320, file: !320, line: 119, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !444, file: !323, line: 1105)
!444 = !DISubprogram(name: "fdim", scope: !320, file: !320, line: 326, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !446, file: !323, line: 1106)
!446 = !DISubprogram(name: "fdimf", scope: !320, file: !320, line: 326, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !448, file: !323, line: 1107)
!448 = !DISubprogram(name: "fdiml", scope: !320, file: !320, line: 326, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !450, file: !323, line: 1109)
!450 = !DISubprogram(name: "fma", scope: !320, file: !320, line: 335, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!64, !64, !64, !64}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !454, file: !323, line: 1110)
!454 = !DISubprogram(name: "fmaf", scope: !320, file: !320, line: 335, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!45, !45, !45, !45}
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !458, file: !323, line: 1111)
!458 = !DISubprogram(name: "fmal", scope: !320, file: !320, line: 335, type: !459, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!390, !390, !390, !390}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !462, file: !323, line: 1113)
!462 = !DISubprogram(name: "fmax", scope: !320, file: !320, line: 329, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !464, file: !323, line: 1114)
!464 = !DISubprogram(name: "fmaxf", scope: !320, file: !320, line: 329, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !466, file: !323, line: 1115)
!466 = !DISubprogram(name: "fmaxl", scope: !320, file: !320, line: 329, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !468, file: !323, line: 1117)
!468 = !DISubprogram(name: "fmin", scope: !320, file: !320, line: 332, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !470, file: !323, line: 1118)
!470 = !DISubprogram(name: "fminf", scope: !320, file: !320, line: 332, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !472, file: !323, line: 1119)
!472 = !DISubprogram(name: "fminl", scope: !320, file: !320, line: 332, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !474, file: !323, line: 1121)
!474 = !DISubprogram(name: "hypot", scope: !320, file: !320, line: 147, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !476, file: !323, line: 1122)
!476 = !DISubprogram(name: "hypotf", scope: !320, file: !320, line: 147, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !478, file: !323, line: 1123)
!478 = !DISubprogram(name: "hypotl", scope: !320, file: !320, line: 147, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !480, file: !323, line: 1125)
!480 = !DISubprogram(name: "ilogb", scope: !320, file: !320, line: 280, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!13, !64}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !484, file: !323, line: 1126)
!484 = !DISubprogram(name: "ilogbf", scope: !320, file: !320, line: 280, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!13, !45}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !488, file: !323, line: 1127)
!488 = !DISubprogram(name: "ilogbl", scope: !320, file: !320, line: 280, type: !489, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!13, !390}
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !492, file: !323, line: 1129)
!492 = !DISubprogram(name: "lgamma", scope: !320, file: !320, line: 230, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !494, file: !323, line: 1130)
!494 = !DISubprogram(name: "lgammaf", scope: !320, file: !320, line: 230, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !496, file: !323, line: 1131)
!496 = !DISubprogram(name: "lgammal", scope: !320, file: !320, line: 230, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !498, file: !323, line: 1134)
!498 = !DISubprogram(name: "llrint", scope: !320, file: !320, line: 316, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !64}
!501 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !503, file: !323, line: 1135)
!503 = !DISubprogram(name: "llrintf", scope: !320, file: !320, line: 316, type: !504, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{!501, !45}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !507, file: !323, line: 1136)
!507 = !DISubprogram(name: "llrintl", scope: !320, file: !320, line: 316, type: !508, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DISubroutineType(types: !509)
!509 = !{!501, !390}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !511, file: !323, line: 1138)
!511 = !DISubprogram(name: "llround", scope: !320, file: !320, line: 322, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !513, file: !323, line: 1139)
!513 = !DISubprogram(name: "llroundf", scope: !320, file: !320, line: 322, type: !504, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !515, file: !323, line: 1140)
!515 = !DISubprogram(name: "llroundl", scope: !320, file: !320, line: 322, type: !508, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !517, file: !323, line: 1143)
!517 = !DISubprogram(name: "log1p", scope: !320, file: !320, line: 122, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !519, file: !323, line: 1144)
!519 = !DISubprogram(name: "log1pf", scope: !320, file: !320, line: 122, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !521, file: !323, line: 1145)
!521 = !DISubprogram(name: "log1pl", scope: !320, file: !320, line: 122, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !523, file: !323, line: 1147)
!523 = !DISubprogram(name: "log2", scope: !320, file: !320, line: 133, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !525, file: !323, line: 1148)
!525 = !DISubprogram(name: "log2f", scope: !320, file: !320, line: 133, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !527, file: !323, line: 1149)
!527 = !DISubprogram(name: "log2l", scope: !320, file: !320, line: 133, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !529, file: !323, line: 1151)
!529 = !DISubprogram(name: "logb", scope: !320, file: !320, line: 125, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !531, file: !323, line: 1152)
!531 = !DISubprogram(name: "logbf", scope: !320, file: !320, line: 125, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !533, file: !323, line: 1153)
!533 = !DISubprogram(name: "logbl", scope: !320, file: !320, line: 125, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !535, file: !323, line: 1155)
!535 = !DISubprogram(name: "lrint", scope: !320, file: !320, line: 314, type: !536, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !64}
!538 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !540, file: !323, line: 1156)
!540 = !DISubprogram(name: "lrintf", scope: !320, file: !320, line: 314, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!538, !45}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !544, file: !323, line: 1157)
!544 = !DISubprogram(name: "lrintl", scope: !320, file: !320, line: 314, type: !545, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{!538, !390}
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !548, file: !323, line: 1159)
!548 = !DISubprogram(name: "lround", scope: !320, file: !320, line: 320, type: !536, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !550, file: !323, line: 1160)
!550 = !DISubprogram(name: "lroundf", scope: !320, file: !320, line: 320, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !552, file: !323, line: 1161)
!552 = !DISubprogram(name: "lroundl", scope: !320, file: !320, line: 320, type: !545, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !554, file: !323, line: 1163)
!554 = !DISubprogram(name: "nan", scope: !320, file: !320, line: 201, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!64, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !561, file: !323, line: 1164)
!561 = !DISubprogram(name: "nanf", scope: !320, file: !320, line: 201, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!45, !557}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !565, file: !323, line: 1165)
!565 = !DISubprogram(name: "nanl", scope: !320, file: !320, line: 201, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DISubroutineType(types: !567)
!567 = !{!390, !557}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !569, file: !323, line: 1167)
!569 = !DISubprogram(name: "nearbyint", scope: !320, file: !320, line: 294, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !571, file: !323, line: 1168)
!571 = !DISubprogram(name: "nearbyintf", scope: !320, file: !320, line: 294, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !573, file: !323, line: 1169)
!573 = !DISubprogram(name: "nearbyintl", scope: !320, file: !320, line: 294, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !575, file: !323, line: 1171)
!575 = !DISubprogram(name: "nextafter", scope: !320, file: !320, line: 259, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !577, file: !323, line: 1172)
!577 = !DISubprogram(name: "nextafterf", scope: !320, file: !320, line: 259, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !579, file: !323, line: 1173)
!579 = !DISubprogram(name: "nextafterl", scope: !320, file: !320, line: 259, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !581, file: !323, line: 1175)
!581 = !DISubprogram(name: "nexttoward", scope: !320, file: !320, line: 261, type: !582, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DISubroutineType(types: !583)
!583 = !{!64, !64, !390}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !585, file: !323, line: 1176)
!585 = !DISubprogram(name: "nexttowardf", scope: !320, file: !320, line: 261, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!45, !45, !390}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !589, file: !323, line: 1177)
!589 = !DISubprogram(name: "nexttowardl", scope: !320, file: !320, line: 261, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !591, file: !323, line: 1179)
!591 = !DISubprogram(name: "remainder", scope: !320, file: !320, line: 272, type: !330, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !593, file: !323, line: 1180)
!593 = !DISubprogram(name: "remainderf", scope: !320, file: !320, line: 272, type: !413, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !595, file: !323, line: 1181)
!595 = !DISubprogram(name: "remainderl", scope: !320, file: !320, line: 272, type: !417, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !597, file: !323, line: 1183)
!597 = !DISubprogram(name: "remquo", scope: !320, file: !320, line: 307, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DISubroutineType(types: !599)
!599 = !{!64, !64, !64, !350}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !601, file: !323, line: 1184)
!601 = !DISubprogram(name: "remquof", scope: !320, file: !320, line: 307, type: !602, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DISubroutineType(types: !603)
!603 = !{!45, !45, !45, !350}
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !605, file: !323, line: 1185)
!605 = !DISubprogram(name: "remquol", scope: !320, file: !320, line: 307, type: !606, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DISubroutineType(types: !607)
!607 = !{!390, !390, !390, !350}
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !609, file: !323, line: 1187)
!609 = !DISubprogram(name: "rint", scope: !320, file: !320, line: 256, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !611, file: !323, line: 1188)
!611 = !DISubprogram(name: "rintf", scope: !320, file: !320, line: 256, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !613, file: !323, line: 1189)
!613 = !DISubprogram(name: "rintl", scope: !320, file: !320, line: 256, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !615, file: !323, line: 1191)
!615 = !DISubprogram(name: "round", scope: !320, file: !320, line: 298, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !617, file: !323, line: 1192)
!617 = !DISubprogram(name: "roundf", scope: !320, file: !320, line: 298, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !619, file: !323, line: 1193)
!619 = !DISubprogram(name: "roundl", scope: !320, file: !320, line: 298, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !621, file: !323, line: 1195)
!621 = !DISubprogram(name: "scalbln", scope: !320, file: !320, line: 290, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{!64, !64, !538}
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !625, file: !323, line: 1196)
!625 = !DISubprogram(name: "scalblnf", scope: !320, file: !320, line: 290, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DISubroutineType(types: !627)
!627 = !{!45, !45, !538}
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !629, file: !323, line: 1197)
!629 = !DISubprogram(name: "scalblnl", scope: !320, file: !320, line: 290, type: !630, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{!390, !390, !538}
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !633, file: !323, line: 1199)
!633 = !DISubprogram(name: "scalbn", scope: !320, file: !320, line: 276, type: !353, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !635, file: !323, line: 1200)
!635 = !DISubprogram(name: "scalbnf", scope: !320, file: !320, line: 276, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!45, !45, !13}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !639, file: !323, line: 1201)
!639 = !DISubprogram(name: "scalbnl", scope: !320, file: !320, line: 276, type: !640, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DISubroutineType(types: !641)
!641 = !{!390, !390, !13}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !643, file: !323, line: 1203)
!643 = !DISubprogram(name: "tgamma", scope: !320, file: !320, line: 235, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !645, file: !323, line: 1204)
!645 = !DISubprogram(name: "tgammaf", scope: !320, file: !320, line: 235, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !647, file: !323, line: 1205)
!647 = !DISubprogram(name: "tgammal", scope: !320, file: !320, line: 235, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !649, file: !323, line: 1207)
!649 = !DISubprogram(name: "trunc", scope: !320, file: !320, line: 302, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !651, file: !323, line: 1208)
!651 = !DISubprogram(name: "truncf", scope: !320, file: !320, line: 302, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !653, file: !323, line: 1209)
!653 = !DISubprogram(name: "truncl", scope: !320, file: !320, line: 302, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !655, file: !659, line: 38)
!655 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !312, file: !317, line: 103, type: !656, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{!658, !658}
!658 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!659 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !661, file: !659, line: 54)
!661 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !312, file: !323, line: 380, type: !662, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DISubroutineType(types: !663)
!663 = !{!390, !390, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !666, file: !668, line: 127)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !314, line: 62, baseType: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!668 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !670, file: !668, line: 128)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !314, line: 70, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !672, identifier: "_ZTS6ldiv_t")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !671, file: !314, line: 68, baseType: !538, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !671, file: !314, line: 69, baseType: !538, size: 64, offset: 64)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !676, file: !668, line: 130)
!676 = !DISubprogram(name: "abort", scope: !314, file: !314, line: 591, type: !677, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{null}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !680, file: !668, line: 134)
!680 = !DISubprogram(name: "atexit", scope: !314, file: !314, line: 595, type: !681, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DISubroutineType(types: !682)
!682 = !{!13, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !685, file: !668, line: 137)
!685 = !DISubprogram(name: "at_quick_exit", scope: !314, file: !314, line: 600, type: !681, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !687, file: !668, line: 140)
!687 = !DISubprogram(name: "atof", scope: !314, file: !314, line: 101, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !689, file: !668, line: 141)
!689 = !DISubprogram(name: "atoi", scope: !314, file: !314, line: 104, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!13, !557}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !693, file: !668, line: 142)
!693 = !DISubprogram(name: "atol", scope: !314, file: !314, line: 107, type: !694, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{!538, !557}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !697, file: !668, line: 143)
!697 = !DISubprogram(name: "bsearch", scope: !314, file: !314, line: 820, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!104, !700, !700, !702, !702, !705}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !703, line: 46, baseType: !704)
!703 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!704 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !314, line: 808, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!13, !700, !700}
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !710, file: !668, line: 144)
!710 = !DISubprogram(name: "calloc", scope: !314, file: !314, line: 542, type: !711, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{!104, !702, !702}
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !714, file: !668, line: 145)
!714 = !DISubprogram(name: "div", scope: !314, file: !314, line: 852, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!666, !13, !13}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !718, file: !668, line: 146)
!718 = !DISubprogram(name: "exit", scope: !314, file: !314, line: 617, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !13}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !722, file: !668, line: 147)
!722 = !DISubprogram(name: "free", scope: !314, file: !314, line: 565, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !104}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !726, file: !668, line: 148)
!726 = !DISubprogram(name: "getenv", scope: !314, file: !314, line: 634, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!729, !557}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !731, file: !668, line: 149)
!731 = !DISubprogram(name: "labs", scope: !314, file: !314, line: 841, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!538, !538}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !735, file: !668, line: 150)
!735 = !DISubprogram(name: "ldiv", scope: !314, file: !314, line: 854, type: !736, flags: DIFlagPrototyped, spFlags: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{!670, !538, !538}
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !739, file: !668, line: 151)
!739 = !DISubprogram(name: "malloc", scope: !314, file: !314, line: 539, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!104, !702}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !743, file: !668, line: 153)
!743 = !DISubprogram(name: "mblen", scope: !314, file: !314, line: 922, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!13, !557, !702}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !747, file: !668, line: 154)
!747 = !DISubprogram(name: "mbstowcs", scope: !314, file: !314, line: 933, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!702, !750, !753, !702}
!750 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!753 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !557)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !755, file: !668, line: 155)
!755 = !DISubprogram(name: "mbtowc", scope: !314, file: !314, line: 925, type: !756, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DISubroutineType(types: !757)
!757 = !{!13, !750, !753, !702}
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !759, file: !668, line: 157)
!759 = !DISubprogram(name: "qsort", scope: !314, file: !314, line: 830, type: !760, flags: DIFlagPrototyped, spFlags: 0)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !104, !702, !702, !705}
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !763, file: !668, line: 160)
!763 = !DISubprogram(name: "quick_exit", scope: !314, file: !314, line: 623, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !765, file: !668, line: 163)
!765 = !DISubprogram(name: "rand", scope: !314, file: !314, line: 453, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!13}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !769, file: !668, line: 164)
!769 = !DISubprogram(name: "realloc", scope: !314, file: !314, line: 550, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!104, !104, !702}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !773, file: !668, line: 165)
!773 = !DISubprogram(name: "srand", scope: !314, file: !314, line: 455, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !56}
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !777, file: !668, line: 166)
!777 = !DISubprogram(name: "strtod", scope: !314, file: !314, line: 117, type: !778, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!64, !753, !780}
!780 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !783, file: !668, line: 167)
!783 = !DISubprogram(name: "strtol", scope: !314, file: !314, line: 176, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!538, !753, !780, !13}
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !787, file: !668, line: 168)
!787 = !DISubprogram(name: "strtoul", scope: !314, file: !314, line: 180, type: !788, flags: DIFlagPrototyped, spFlags: 0)
!788 = !DISubroutineType(types: !789)
!789 = !{!704, !753, !780, !13}
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !791, file: !668, line: 169)
!791 = !DISubprogram(name: "system", scope: !314, file: !314, line: 784, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !793, file: !668, line: 171)
!793 = !DISubprogram(name: "wcstombs", scope: !314, file: !314, line: 936, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!702, !796, !797, !702}
!796 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !729)
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !801, file: !668, line: 172)
!801 = !DISubprogram(name: "wctomb", scope: !314, file: !314, line: 929, type: !802, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!13, !729, !752}
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !806, file: !668, line: 200)
!805 = !DINamespace(name: "__gnu_cxx", scope: null)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !314, line: 80, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !808, identifier: "_ZTS7lldiv_t")
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !807, file: !314, line: 78, baseType: !501, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !807, file: !314, line: 79, baseType: !501, size: 64, offset: 64)
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !812, file: !668, line: 206)
!812 = !DISubprogram(name: "_Exit", scope: !314, file: !314, line: 629, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !814, file: !668, line: 210)
!814 = !DISubprogram(name: "llabs", scope: !314, file: !314, line: 844, type: !815, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!501, !501}
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !818, file: !668, line: 216)
!818 = !DISubprogram(name: "lldiv", scope: !314, file: !314, line: 858, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!806, !501, !501}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !822, file: !668, line: 227)
!822 = !DISubprogram(name: "atoll", scope: !314, file: !314, line: 112, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!501, !557}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !826, file: !668, line: 228)
!826 = !DISubprogram(name: "strtoll", scope: !314, file: !314, line: 200, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!501, !753, !780, !13}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !830, file: !668, line: 229)
!830 = !DISubprogram(name: "strtoull", scope: !314, file: !314, line: 205, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !753, !780, !13}
!833 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !835, file: !668, line: 231)
!835 = !DISubprogram(name: "strtof", scope: !314, file: !314, line: 123, type: !836, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!45, !753, !780}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !805, entity: !839, file: !668, line: 232)
!839 = !DISubprogram(name: "strtold", scope: !314, file: !314, line: 126, type: !840, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!390, !753, !780}
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !806, file: !668, line: 240)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !812, file: !668, line: 242)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !814, file: !668, line: 244)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !846, file: !668, line: 245)
!846 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !805, file: !668, line: 213, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !818, file: !668, line: 246)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !822, file: !668, line: 248)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !835, file: !668, line: 249)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !826, file: !668, line: 250)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !830, file: !668, line: 251)
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !312, entity: !839, file: !668, line: 252)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !676, file: !854, line: 38)
!854 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
